{"title":"Monolith Blood Collection (Windows 7 Ready) Eqa5cro","uid":5325649,"size":374723934,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0025fc586394cf9b5a5cdb93edfdc8e55dab0f67&amp;dn=Monolith+Blood+Collection+%28Windows+7+Ready%29+Eqa5cro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Eqa5cro","files":-1,"time":1265012558,"description":".                  -----              ----\n                  |                  |\n                  |       ---   ---  |       ---   ---   ---\n                  |----  |   | |   |  ----  |     |   | |   |\n                  |      |   | |---|      | |     |---  |   |\n                  |      |   | |   |      | |     |  \\  |   |\n                   -----  ---\\        ----   ---         ---\n\n                       ....:::  p r e s e n t s  :::....\n\n\n                           Monolith Blood Collection\n                               (Windows 7 Ready)\n\n                           Release date: 2010/02/01\n\n\n-------------------------------------------------------------------------------\nGame Info\n-------------------------------------------------------------------------------\n\n&quot;Blood&quot; is a horror science-fiction first-person shooter video game developed\nby 3D Realms and Monolith Productions and distributed by GT Interactive. The\ngame contains excessive graphic violence and a crude style of humour. Year is\n1928, you start as Caleb, a gun-slinger from western Texas born in in 1847.\nHe was one of the four supreme commanders (Chosen) of a cult called the Cabal,\nworshippers of the forgotten god Tchernobog. After all four of the Chosen were\nbetrayed and killed by Tchernobog, Cabal raises back from dead seeking \nvengeance. Armed with a pitchfork, you begin your way from a hollow grave...\nIt was released on May 31, 1997.\n\n&quot;Blood: Cryptic Passage&quot; is the first expansion for Blood. It was published\nby Sunstorm Interactive and is the only officially authorized commercially\navailable ten-level add-on episode for Blood that was not made by Monolith.\nHaving heard news of an ancient scroll, Caleb sets out to retrieve it for his\nown dark needs. He arrives on the Boat Docks, which later open onto a large\ncave, a cabin and a lighthouse; structures overrun by the Cabal.\nIt was released on June 30, 1997.\n\n&quot;Blood: Plasma Pak&quot; is the second expansion for Blood. It adds a new episode,\nnew enemies and numerous bug fixes. The new creatures include two new Cabal\nloyalist types, Crysalid pods, the miniature Calebs and a new boss. There are\nno additions to Caleb's arsenal, however several innovations are introduced;\nthe Tesla cannon can now be wielded akimbo, while the Napalm cannon and the\nlife leech have new secondary attacks. The story is based on Caleb learning\nthat the Cabal is training replacements for the fallen Chosen. He sets out to\nstop the cult's plans. It was released on September 01, 1997.\n\n&quot;Blood II: The Chosen&quot; is a sequel to Blood. Unlike the first installment, \nwhich was set in 1928, Blood II takes place in the year 2028, so in addition\nto conventional weapons and magical items also incorporates science-fictional\ntechnology. After killing Tchernobog, Caleb has spent the last century\nsearching for a way to resurrect his comrades. In the meantime, Cabal has\nturned the cult into a global mega-corporation called CabalCo, which uses its\neconomic influence to control the world's populace. This is all thanks to\nGideon, the Cabal's current leader who has been raised to restore Tchernobog\nand destroy Caleb, who is now called the Great Betrayer.\nIt was released on October 31, 1998.\n\n&quot;Blood II: The Nightmare Levels&quot; is an expansion for Blood II. It provides\nbackground information on Caleb, Ophelia, Ishmael, and Gabriella, narrarated by\na deceased Gideon. As the Chosen continue to walk home to their world from the\ninvading reality, by telling scary stories they attract a beast known as the\nNightmare that captures Caleb. The player then has to relive some of the most\nhorrific moments of the Chosen's lives - Caleb fighting the Cabal in the frozen\nnorth, the Cabal attack on Ophelia's sorority which led her to join, Ishmael's\nescape from his life as a circus freak into the Cabal, and Gabriella's spooky\nnight in a haunted mansion. It was released on August 01, 1999.\n\n\n-------------------------------------------------------------------------------\nRelease Info\n-------------------------------------------------------------------------------\n\nBlood was one of my favorite games during the time of my youth.\n\nRecently I recalled of this game and wanted to play it again.\nSince Blood was made back in 1997 for good old DOS, it won't work on newer\nGUI operating systems like Windows XP and Windows 7 that easily.\n\nIf your operating system is 64-bit, then you won't even be able to install it\nsince installer, and the game itself, are 16-bit applications, and Microsoft\ndropped support for 16-bit applications in 64-bit operating systems.\n\nAfter I've done some adjustments and finally managed to make it work,\nI decided to share it with others as I believe there are people who might\nwant to try it out, or play it once again.\n\nI've packed the games in two self-extracting archives.\nThese are all the games form Blood series.\n\nBlood archive was made from installed game of One Unit Whole Blood,\nwhich is the latest official release of this game.\n\nThe only thing I removed are the intro videos, but everything else\nincluding ingame cutscenes have been left intact.\n\nAll you have to do is extract the archives to some folder and run batch\nfiles to create the shortcuts on your desktop.\n\nYou might want to play with video resolution of Blood,\nbut I don't recommend it unless you know what you are doing.\nFiles you might want to look at are dosbox.conf and blood.cfg.\n\nAs for Blood II, run any of the shortcuts, set up display and\nadvanced settings to your likeness and play.\n\nBoth Blood and Blood II support widescreen resolutions!\nActually, default resolution of Blood is in widescreen format.\n\nI can't assure you everything will work fine because these are very\nold games, but at least I made it easier for you to solve the errors\nif you encounter any.\n\nHave fun! :)\n\n\n-------------------------------------------------------------------------------\nInstallation Notes\n-------------------------------------------------------------------------------\n\nBlood and its expansions:\n\n- Run Blood.SFX-Eqa5cro.exe and extract the game\n  to some folder (e.g. C:\\Games\\Blood).\n\n- Go to the game folder and run _setup.bat\n  to create shortcuts on your desktop.\n\n- Play Blood by running one of the shortcuts you just created.\n\nBlood II and its expansions:\n\n- Run Blood.2.SFX-Eqa5cro.exe and extract the game\n  to some folder (e.g. C:\\Games\\Blood 2).\n\n- Go to the game folder and run _setup.bat\n  to create shortcuts on your desktop.\n\n- Play Blood II by running one of the shortcuts you just created.\n\n\n-------------------------------------------------------------------------------\nFinal Words\n-------------------------------------------------------------------------------\n\nIn case you have some questions regarding the Blood series,\nyou can drop by at The Postmortem forum: &lt;a href=&quot;\nhttp://forums.the-postmortem.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.the-postmortem.com&lt;/a&gt;\n\nThis forum is mainly meant for discussion about Monolith's Blood\ngames, but there is also a general board where you can discuss about\nanything you want (as long as it's legal). :P\n\nBy the way, this release isn't in any way affiliated with\nThe Postmortem forum, or any of its members.\n\nGreetings from Eqa5cro.\n","torrent":{"xt":"urn:btih:0025fc586394cf9b5a5cdb93edfdc8e55dab0f67","amp;dn":"Monolith+Blood+Collection+%28Windows+7+Ready%29+Eqa5cro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0025fc586394cf9b5a5cdb93edfdc8e55dab0f67","infoHashBuffer":{"type":"Buffer","data":[0,37,252,88,99,148,207,155,90,92,219,147,237,253,200,229,93,171,15,103]},"announce":[],"urlList":[]}}