{"title":"Mother Angelica's Answers, Not Promises (EPUB, MOBI, PDF)","uid":15687771,"size":1958290,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0047942ed89a593557067efb2573ee66cbc37918&amp;dn=Mother+Angelica%27s+Answers%2C+Not+Promises+%28EPUB%2C+MOBI%2C+PDF%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"catholicstuff","files":3,"time":1472361097,"description":"Mother Angelica's Answers, Not Promises (EPUB, MOBI, PDF)\r\n\r\nFrom the founder of EWTN Global Catholic Network comes this profoundly practical, humorous, and common-sense approach to answering life's most vexing questions. Mother Angelica gently confronts your real-life struggles, lifting your heart to God and leading your soul to heaven as she provides answers from a life dedicated to God not the promises of a world entrenched in vice.\r\n\r\nMother Angelica will become your trusted companion in the battle for virtue as you read through her advice and answer her call to grow closer to Christ. She'll help you conquer your most deeply rooted sins, and she'll lead you to overcome the fear of death, the pain of guilt, and the seemingly benign attachments you have to the things of this world.\r\n\r\nShe'll also lead you to a more profound understanding of the spiritual life, explaining why it's so hard to be good, why suffering must happen to even the best of us, and why God doesn't answer all your prayers. With Mother Angelica as your guide, you'll also learn:\r\n\r\nHow to pray even when God seems distant or silent.\r\nWays to overcome the difficulty in believing in God.\r\nThe five steps to discovering God's will for you.\r\nThe eight kinds of suffering and how each can shape and purify your life\r\nWays to avoid the most common mistakes in praying to God.\r\nWhat to ask for and what not to ask for in prayer\r\nWays to overcome lust and what God is trying to teach you with this affliction.\r\nHow to throw your guilt into the ocean of God's mercy.\r\nHow to forgive, even when your pain is justified.\r\nThe difference between good pride and bad pride.\r\nHow to listen as your guardian angel cautions and inspires you.\r\nHow Jesus gives meaning to your loneliness.\r\nWhy there is a heaven and what you'll do there.\r\n\r\n---\r\n\r\nIf you enjoy this media, please seed and purchase a physical copy to support the producers and share with family and friends. \r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.org/user/catholicstuff/","torrent":{"xt":"urn:btih:0047942ed89a593557067efb2573ee66cbc37918","amp;dn":"Mother+Angelica%27s+Answers%2C+Not+Promises+%28EPUB%2C+MOBI%2C+PDF%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0047942ed89a593557067efb2573ee66cbc37918","infoHashBuffer":{"type":"Buffer","data":[0,71,148,46,216,154,89,53,87,6,126,251,37,115,238,102,203,195,121,24]},"announce":[],"urlList":[]}}