{"title":"Wilson Phillips - California (2004)","uid":8649358,"size":284303226,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:007f280a4484a3efdc86570e18cbaf683c667fb8&amp;dn=Wilson+Phillips+-+California+%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":19,"time":1373063881,"description":"This is the same torrent that was uploaded to Demonoid in September 2011.\n\n\nWilson Phillips - California (2004)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51xe6NvFGBL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51xe6NvFGBL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com) DVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by Andrew Leahey):\n\nWilson Phillips first emerged in 1990, flaunting a harmony-rich sound that helped send three singles -- &quot;Hold On,&quot; &quot;Release Me,&quot; and &quot;You're in Love&quot; -- to the top of the Billboard charts. Carnie Wilson, Wendy Wilson, and Chynna Phillips comprised the female vocal trio, whose sudden success was matched by an equally impressive pedigree. The two Wilson sisters had grown up in California with their father, Beach Boy bandleader Brian Wilson, and often made appearances on his albums throughout their youth. Chynna's parents, meanwhile, were John and Michelle Phillips (of seminal folk-rock band the Mamas &amp; the Papas). Despite growing up alongside such icons, the girls initially pursued careers in acting and modeling, only turning to music when Chynna (having been influenced by Band Aid and Farm Aid) suggested they make a charity record with other children of famous musicians. The project fell through, but Wilson Phillips nevertheless took shape as the girls explored their musical connection.\n\nRead all of the bio at: &lt;a href=&quot;\nhttp://www.allmusic.com/artist/wilson-phillips-p114299/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/artist/wilson-phillips-p114299/biography&lt;/a&gt;\n\nAll Music Album Review (by Tim Sendra):\n\nThe members of Wilson Phillips have been through a lot in the 12 years since their last record came out: marriages, kids, solo albums, televised operations, and talk shows. Add to that the fact that the band pretty much broke up in 1993, and it is no surprise it took so long. California is a concept album of sorts. All the songs are about California, or were recorded by quintessential California bands. The girls' voices sound better than ever, full of verve and California soul. Carnie, Wendy, and Chynna each take two leads; the rest of the songs are group vocals. Part of the fun of California is hearing the girls tackle songs that their respective parents recorded 30-plus years earlier. Chynna turns &quot;Monday Monday&quot; into a charging rocker with none of the introspection of the original; it sounds like a Go-Go's song if they had ever recorded with a full orchestra. The two Beach Boys songs are handled in very different ways. &quot;Dance Dance Dance&quot; is a tight rocker with loads of energy and some excellent farfisa work by Roger Joseph Manning Jr.; &quot;In My Room&quot; features Brian Wilson on piano and vocals and, unsurprisingly, has the best harmony vocals on the album. It may even bring a lump to your throat at the end when Brian exclaims loudly, &quot;That sounds great! I love your sound!!&quot; and Carnie and Wendy Wilson sound truly moved in response. Knowing all they have been through, it kinda gets you right there. The song is very simple and moving, and points to a problem the rest of the record has, namely a bloodless, sterile feel that comes from the slick production and overly safe sound. The songs that work the best are the simplest, like &quot;Monday Monday,&quot; the driving &quot;Doctor My Eyes,&quot; and the very moody and restrained &quot;Go Your Own Way.&quot; Too often, however, the songs are sunk by overcooked arrangements. Producer Peter Asher goes for an ultramodern processed sound that makes it sound like the girls are merely singing updated karaoke versions of the old hits. ....\n\nSee the entire review at: &lt;a href=&quot;\nhttp://www.allmusic.com/album/california-r691698/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/california-r691698/review&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B00020SHHG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B00020SHHG&lt;/a&gt;\n\nCD Universe's page: \n\nTrack List:\n\n01. You're No Good\n02. Old Man\n03. California\n04. Already Gone\n05. Go Your Own Way\n06. Turn! Turn! Turn! (To Everything There Is a Season)\n07. Monday Monday\n08. Get Together\n09. Doctor My Eyes\n10. Dance Dance Dance\n11. In My Room\n","torrent":{"xt":"urn:btih:007f280a4484a3efdc86570e18cbaf683c667fb8","amp;dn":"Wilson+Phillips+-+California+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"007f280a4484a3efdc86570e18cbaf683c667fb8","infoHashBuffer":{"type":"Buffer","data":[0,127,40,10,68,132,163,239,220,134,87,14,24,203,175,104,60,102,127,184]},"announce":[],"urlList":[]}}