{"title":"The House Of Love - Best Of@320","uid":4202096,"size":158213038,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:00804d398b948a5bd7de58ef280876f83cbe6c0a&amp;dn=The+House+Of+Love+-+Best+Of%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"alekow1","files":22,"time":1211560231,"description":"With the House of Love\\&amp;#039;s albums getting increasingly difficult to obtain, it was a pleasant surprise to see Mercury U.S. release Best Of in 1998. A gorgeous package with a debatable track selection, the label released it without much in the way of promotion, so it really wasn\\&amp;#039;t treated any different from their proper albums in that respect. Unfortunately, the House of Love fell into a bit of a gray area with the music scenes in both the U.S. and their U.K. homeland. It would have been especially difficult for the band to break through in the States, with the late-\\&amp;#039;80s Billboard charts wanting nothing to do with gimmick-free songs with perfectionist craftsmanship. And once flannel, plaid, and distortion broke free in 1991, they were perfectly incapable of catering to the grunge scene\\&amp;#039;s rebellious catharsis. Stubborn and eccentric, Guy Chadwick and company soldiered on to produce mostly quiet and invitingly personal pop singles, most of which are collected here (\\&quot;Real Animal\\&quot; is the lone outcast). The non-single picks are kind of odd. B-sides \\&quot;Marble,\\&quot; \\&quot;Let\\&amp;#039;s Talk About You,\\&quot; and \\&quot;Loneliness Is a Gun\\&quot; are picked instead of early album highlights like \\&quot;Love in a Car\\&quot; and even better B-sides like \\&quot;Purple Killer Rose.\\&quot; Babe Rainbow closer \\&quot;Yer Eyes\\&quot; is also chosen over arguably better material from that album. Despite these gripes, Best Of does its deed in representing all that was great about one of England\\&amp;#039;s finest late-\\&amp;#039;80s/early-\\&amp;#039;90s bands. One can hope that this will usher in a makeover of the band\\&amp;#039;s catalog. With numerous labels and legal ramifications, it would be a tall order. Tougher still would be a much needed compilation of the band\\&amp;#039;s numerous B-sides (A Spy in the House of Love merely scratched the surface), but many close to the band probably worry about the mental state of those who were crazy enough to swallow up the band\\&amp;#039;s endless swarm of rarities. Those few lunatics have likely remained in the mental ward all these years, ninth format of the Beatles and the Stones single desperately clutched in hand. (AMG)\n\n\n01. I Don\\&amp;#039;t Know Why I Love You                                                                                    \n02. Crush Me                                                                                                       \n03. Destroy The Heart                                                                                              \n04. The Girl With The Loneliest Eyes                                                                               \n05. Christine                                                                                                      \n06. Beatles And The Stones                                                                                         \n07. Never                                                                                                          \n08. Shine On                                                                                                       \n09. Marble                                                                                                         \n10. Feel                                                                                                           \n11. Let\\&amp;#039;s Talk About You                                                                                           \n12. Safe                                                                                                           \n13. You Don\\&amp;#039;t Understand                                                                                           \n14. Yer Eyes                                                                                                       \n15. Loneliness Is A Gun                          \n\n\nLabel: Fontana  \nReleased: 1998\n\n\nBITRATE: 320\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n\n\nEnjoy,Seed and Share\t\n\n","torrent":{"xt":"urn:btih:00804d398b948a5bd7de58ef280876f83cbe6c0a","amp;dn":"The+House+Of+Love+-+Best+Of%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00804d398b948a5bd7de58ef280876f83cbe6c0a","infoHashBuffer":{"type":"Buffer","data":[0,128,77,57,139,148,138,91,215,222,88,239,40,8,118,248,60,190,108,10]},"announce":[],"urlList":[]}}