{"title":"Avengers Academy (01 - 39 &amp; Extras) (2010 - 2012) (- Nem -)","uid":9114977,"size":942776903,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:00bf3c439d77550513ea1490a1f0b99e3a7f64f2&amp;dn=Avengers+Academy+%2801+-+39+%26amp%3B+Extras%29+%282010+-+2012%29+%28-+Nem+-%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"nemesis43","files":42,"time":1383008145,"description":"The concept and some of the teachers are a continuation of the Avengers: The Initiative series. Reptil, Hazmat, Mettle, Striker, Veil &amp; Finesse have been brought together under the guidance of Hank Pym. Training these youngsters in their abilities along with Justice, Tigra, Quicksilver, Speedball &amp; Jocasta in the Infinite Mansion as the newly formed Avengers Academy he seeks to take these troubled youths and lead them down the path of good. All of these students have one thing in common; Norman Osborn only wanted to use them for their abilities to his own evil ends. Can Hank Pym and his fellow Avengers teach these youngsters and guide them in the right direction?\n\nFollowing the events of Fear Itself, Veil left the team followed shortly by Jocasta. The team also moved its base of operations to the former West Coast Avengers compound in California and added new members as White Bengal, Lightspeed (of the Power Pack), X-23 and a slew of B-list teenage super heroes. This represents the new era of Avengers Academy, beginning with issue #21. The series lasted until issue 39, making it, with the 14.point one issue counted in, 40 issues in total. Many of the students from Avengers Academy returned the next month in the new Avengers Arena series.","torrent":{"xt":"urn:btih:00bf3c439d77550513ea1490a1f0b99e3a7f64f2","amp;dn":"Avengers+Academy+%2801+-+39+%26amp%3B+Extras%29+%282010+-+2012%29+%28-+Nem+-%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00bf3c439d77550513ea1490a1f0b99e3a7f64f2","infoHashBuffer":{"type":"Buffer","data":[0,191,60,67,157,119,85,5,19,234,20,144,161,240,185,158,58,127,100,242]},"announce":[],"urlList":[]}}