{"title":"Liquid Phase Aerobic Oxidation Catalysis - Industrial Applicatio","uid":15975311,"size":14782458,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01536c74622ca76c8889330f1d321ebd4d608241&amp;dn=Liquid+Phase+Aerobic+Oxidation+Catalysis+-+Industrial+Applicatio&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1475826940,"description":"Liquid Phase Aerobic Oxidation Catalysis - Industrial Applications and Academic Perspectives - S.S. Stahl, P.L. Alsters (Wiley-VCH, 2016).pdf\r\n\r\nThe first book to place recent academic developments within the context of real life industrial applications, this is a timely overview of the field of aerobic oxidation reactions in the liquid phase that also illuminates the key challenges that lie ahead. \r\nAs such, it covers both homogeneous as well as heterogeneous chemocatalysis and biocatalysis, along with examples taken from various industries: bulk chemicals and monomers, specialty chemicals, flavors and fragrances, vitamins, and pharmaceuticals. One chapter is devoted to reactor concepts and engineering aspects of these methods, while another deals with the relevance of aerobic oxidation catalysis for the conversion of renewable feedstock. \r\nWith chapters written by a team of academic and industrial researchers, this is a valuable reference for synthetic and catalytic chemists at universities as well as those working in the pharmaceutical and fine chemical industries seeking a better understanding of these reactions and how to design large scale processes based on this technology","torrent":{"xt":"urn:btih:01536c74622ca76c8889330f1d321ebd4d608241","amp;dn":"Liquid+Phase+Aerobic+Oxidation+Catalysis+-+Industrial+Applicatio","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01536c74622ca76c8889330f1d321ebd4d608241","infoHashBuffer":{"type":"Buffer","data":[1,83,108,116,98,44,167,108,136,137,51,15,29,50,30,189,77,96,130,65]},"announce":[],"urlList":[]}}