{"title":"Lord of Illusions [1995] Clive Barker","uid":6213964,"size":838812464,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:01a7a4f8af836bfcb0545373ff17ced651d3d78e&amp;dn=Lord+of+Illusions+%5B1995%5D+Clive+Barker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1299089631,"description":"Lord of Illusions (1995) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0113690/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0113690/&lt;/a&gt;\n\n\nLord of Illusions is a 1995 American horror film, written and directed by the British author, filmmaker and artist Clive Barker. The film is based on his earlier short story, The Last Illusion (from Books of Blood Vol. 6), and it presents Barker's signature character Harry D'Amour onscreen for the first time. It stars Scott Bakula as D'Amour, alongside Kevin J. O'Connor, Famke Janssen and Daniel von Bargen.\n\n  Scott Bakula  ...  Harry D'Amour  \n  Kevin J. O'Connor  ...  Philip Swann  \n  Joseph Latimore  ...  Caspar Quaid  \n  Sheila Tousey  ...  Jennifer Desiderio  \n  Susan Traylor  ...  Maureen Pimm  \n  Ashley Tesoro  ...  Young Dorothea (as Ashley Lyn Cafagna)  \n  Michael Angelo Stuno  ...  Lead Male Cultist  \n  Barbara Patrick  ...  Lead Female Cultist  \n  J. Trevor Edmond  ...  Young Butterfield (as Trevor Edmond)  \n  Wayne Grace  ...  Loomis  \n  Mikey LeBeau  ...  Exorcised Boy  \n  Daniel von Bargen  ...  Nix  \n  Johnny Venocur  ...  Tapert (as Johnny Venokur)  \n  Jordan Marder  ...  Ray Miller  \n  Barry Del Sherman  ...  Butterfield  \n\nLord of Illusions is an eerie tale of a man treading the line between darkness and light, and what happens when he crosses paths with another man, who walks the line between illusion and terrifying reality.\n\nBakula is a fine actor who plays the world-weary but determined D'Amour well. He is joined by several other fine actors, particularly Kevin J. O'Connor (The Mummy), who has recently appeared as the comic relief in several movies, but plays the ex-cultist Swann with haunted eyes and only the slightest evidence of his usual hokiness. Famke Janssen (The House on Haunted Hill) plays Dorothea with the right mix of vulnerability and edge, and supporting actors Barry Del Sherman (American Beauty) as the cultist Butterfield and Joel Swetow as the Swanns' right-hand man Valentin are also effective. The ever-menacing Daniel Von Bargen (O Brother, Where Art Thou) is just right in his small but vital role as the cult leader Nix.\n\nPart noir-inspired mystery and part behind-the-curtain horror, Lord of Illusions sets its disconcerting tone early with the opening scenes involving a young Swann and his friends (including the man who will grow up to be the fortune teller) rescuing a young girl from their former companions at the desert cult. The casual nudity and sado-masochism of the cult leaps into high gear when the companions locate Nix and the girl, and bring about the apparent downfall of the cult in an event that will haunt them the rest of their lives.\n\nPresented in a director's cut version, the film clocks in at a shade over two hours, but uses its time effectively to flesh out characters and thus lend weight to their peril as they try to stop the man/monster who claims he was &quot;born to murder the world.&quot;\n\nBarker asserts that the director's cut of this film is his definitive version, as the theatrical release does not represent his true vision.\n\nWith this film, Barker attempted to resurrect the film noir style, while merging it with contemporary horror so as to make a film with a fresh feel to it. One of the elements used for this was the music; for example, the song played as the credits roll is a rendition of the classic Dancing in the Dark, performed by Diamanda GalÃƒÂ¡s.\n\nCult leader Nix is explicitly compared to cult leader Charles Manson in the film. Like Manson and his family, Nix and his followers believe he has the power to return from the dead. Both of them have followers who live in an unpleasant place out in the desert and cut off their hair at their leader's request.\n\n","torrent":{"xt":"urn:btih:01a7a4f8af836bfcb0545373ff17ced651d3d78e","amp;dn":"Lord+of+Illusions+%5B1995%5D+Clive+Barker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01a7a4f8af836bfcb0545373ff17ced651d3d78e","infoHashBuffer":{"type":"Buffer","data":[1,167,164,248,175,131,107,252,176,84,83,115,255,23,206,214,81,211,215,142]},"announce":[],"urlList":[]}}