{"title":"10 tips to becoming a prepper and survive doomsday","uid":8236172,"size":82018,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:027e4e6fd6ae60e3ae135d33cd29d2c1d4a2f01d&amp;dn=10+tips+to+becoming+a+prepper+and+survive+doomsday&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"DaRule762","files":-1,"time":1362846456,"description":"Are you prepared to be one of the few that will survive a doomsday event?\n\nAt some point in the future, sooner rather than later, a doomsday event will occur.\n\nWhat that event will be, no one knows; a worldwide flu pandemic, a massive solar flare, an asteroid strike, climate change, massive natural disaster or an alien invasion. After the event, many people will survive, but then social order will collapse. There will be no rules, people will fight and die for water, food and resources.\n\nHowever the &quot;preppers&quot; will be one step ahead. They will have prepared for this scenario. The will have the resources in place that they will need to survive in the new world. A world without electricity, telecommunications, internet, supermarkets and a water supply. The &quot;preppers&quot; and their families will be the ones that survive and prosper.\n\nYou may not think a doomsday event likely. Are we likely to be invaded by giant lizard people from Pluto? No probably not. Are we likely to be hit by a massive solar flare that will wipe out our entire electronic systems sending the world into a new dark age? Possibly. Are we likely to experience a worldwide flu pandemic that will wipe out over 70% of the world's population? Medical opinion is that we are long overdue such a pandemic; such an event is highly likely.\n\nIn this one hour lunch time read series book experienced preppers share their best tips about preparing for doomsday and more importantly life after doomsday.\n\nYou will learn which food to store, water purification, the most suitable shelters, what makes the perfect location, what vehicles you should have available, how to choose and obtain suitable fuels, how to prepare for a world without medical professionals, how to cope with the loss of modern communication systems, how to hunt and protect your family from the mob and what education is essential.\n\nMake no mistake, if you don't prepare now, when the time comes you will be fighting with the mob for your next meal. Don't put yourself in that position, take action now, learn the basics and prepare for life in the new world.","torrent":{"xt":"urn:btih:027e4e6fd6ae60e3ae135d33cd29d2c1d4a2f01d","amp;dn":"10+tips+to+becoming+a+prepper+and+survive+doomsday","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"027e4e6fd6ae60e3ae135d33cd29d2c1d4a2f01d","infoHashBuffer":{"type":"Buffer","data":[2,126,78,111,214,174,96,227,174,19,93,51,205,41,210,193,212,162,240,29]},"announce":[],"urlList":[]}}