{"title":"The Kenneth Grant Torrent","uid":4846161,"size":120749032,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:02e66de72944f7d5c1e18d1ceaf4927f6c0a3b60&amp;dn=The+Kenneth+Grant+Torrent&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"madziar","files":11,"time":1239694413,"description":"This torrent collects all the books by Kenneth Grant currently available in pdf format in one place. While some of these books are still available, or are coming back into print, many of them are very, very, rare and expensive. I encourage people to buy new copies of the books from Starfire when they are issued. \n\nKenneth Grant is widely regarded as the most insightful and prolific exponent of the magick and mysticism of Aleister Crowley. Grant has continued Crowley's work into nine books referred to as the Typhonian Trilogies, that were issued over the course of over thirty years. Unfortunately, because Grant claimed to be the OTO successor after Crowley, the U.S. OTO has done a lot to block the release of Grant's books in the United States, contributing to both their scarcity and to the group's monopoly on the interpretation of Crowley in the U.S. This information should be available to everyone; organizations that oppose freedom of speech enforce the cultural and religious status quo. \n\nIncluded are five of the volumes of the Typhonian Trilogies, two of Grant's fiction works, a collection of monographs written about the Golden Dawn and A .'. A .'. systems, and a work by Robert North on occultism and sex. While not directly having to do with Grant, people may find the ideas in North's book to be helpful in understanding Grant's philosophy. \n\nContents of the Torrent:\n\nThe Magickal Revival \n\nAleister Crowley and the Hidden God in pdf and doc\n\nCults of the Shadow \n\nNightside of Eden\n\nOutside the Circles of Time\n\n****\n\nFiction works\n\nAgainst the Light\n\nGamaliel\n\n****\n\nThe Carfax Monographs\n\nThe New Flesh Palladium\n\n\n","torrent":{"xt":"urn:btih:02e66de72944f7d5c1e18d1ceaf4927f6c0a3b60","amp;dn":"The+Kenneth+Grant+Torrent","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02e66de72944f7d5c1e18d1ceaf4927f6c0a3b60","infoHashBuffer":{"type":"Buffer","data":[2,230,109,231,41,68,247,213,193,225,141,28,234,244,146,127,108,10,59,96]},"announce":[],"urlList":[]}}