{"title":"Imagine Magazine Dungeons and Dragons Role Playing","uid":8964441,"size":610543937,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:02ed4860ff63b0bee95af1fe0808c384e097322b&amp;dn=Imagine+Magazine+Dungeons+and+Dragons+Role+Playing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1380183239,"description":"Sadly, after many, MANY years (decades, actually) of being a DM, I no longer have anyone to game with. Rather than leave the 60+ GB of files that will never be used on my external to take up space (which I could use for comic books), I'm going to burn them off to blu-ray data discs and file them away in hopes that they may be used at some point in the future.\n\nNo big descriptions or explanations with these - you either know what they are, and that you want them, or you don't.\n\nThese uploads are definitely an experiment; if there is interest, I'll seed them for a while, but if there isn't, I'll have them deleted and &quot;file&quot; this stuff away. \t\t\n\n\n----------------------------------------------------------------------------------------\n\n\nImagine was published between April 1983 and October 1985. The print run lasted for 31 issues (30 monthly issues and one special edition) before its cancellation.\n\nDon Turnbull was cited as Publisher and Paul Cockburn as Assistant Editor throughout the majority of the lifetime of the publication.\n\nImagine Magazine was responsible for several creative spin-offs, notably the Pelinore gaming world. The magazine also featured the classic adventure game comic &quot;The Sword of Alabron&quot; in issues 1 to 16. This was briefly revived as a second story arc titled &quot;Auchter's Axe&quot; in issues 29 to 30 prior to the magazine's cancellation.\n\nNeil Gaiman wrote film reviews for several issues of Imagine Magazine in the early part of his career, taking over from Colin Greenland, and had his first short story &quot;Featherquest&quot; published here in May 1984. Gaiman's &quot;How to Sell the Ponti Bridge&quot;, reprinted for the first time in M is for Magic was also first published here in March 1985.\n\nSome of the official AD&amp;D material originally published in Imagine was collected and used in Unearthed Arcana.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Imagine_%28AD%26D_magazine%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Imagine_%28AD%26D_magazine%29&lt;/a&gt;","torrent":{"xt":"urn:btih:02ed4860ff63b0bee95af1fe0808c384e097322b","amp;dn":"Imagine+Magazine+Dungeons+and+Dragons+Role+Playing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02ed4860ff63b0bee95af1fe0808c384e097322b","infoHashBuffer":{"type":"Buffer","data":[2,237,72,96,255,99,176,190,233,90,241,254,8,8,195,132,224,151,50,43]},"announce":[],"urlList":[]}}