{"title":"Unbroken (azw3, mobi, epub) by Laura Hillenbrand","uid":10488749,"size":8000380,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:02f48c09fbfc3159edcb8ca9d975994d73815a4e&amp;dn=Unbroken+%28azw3%2C+mobi%2C+epub%29+by+Laura+Hillenbrand&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dogmatist","files":-1,"time":1404518612,"description":"Unbroken: A World War II Story of Survival, Resilience, and Redemption\nBy Laura Hillenbrand\n\nFormats: azw3, mobi, &amp; epub\n\nAs always, if you like the work please consider purchasing it to support the artists. \n\nPublisher's Description:\n\nOn a May afternoon in 1943, an Army Air Forces bomber crashed into the Pacific Ocean and disappeared, leaving only a spray of debris and a slick of oil, gasoline, and blood.\n\nThen, on the ocean surface, a face appeared. It was that of a young lieutenant, the plane's bombardier, who was struggling to a life raft and pulling himself aboard. So began one of the most extraordinary odysseys of the Second World War.\nThe lieutenant's name was Louis Zamperini. In boyhood, he'd been a cunning and incorrigible delinquent, breaking into houses, brawling, and fleeing his home to ride the rails. As a teenager, he had channeled his defiance into running, discovering a prodigious talent that had carried him to the Berlin Olympics and within sight of the four-minute mile. But when war had come, the athlete had become an airman, embarking on a journey that led to his doomed flight, a tiny raft, and a drift into the unknown.\n\nAhead of Zamperini lay thousands of miles of open ocean, leaping sharks, a foundering raft, thirst and starvation, enemy aircraft, and, beyond, a trial even greater. Driven to the limits of endurance, Zamperini would answer desperation with ingenuity; suffering with hope, resolve, and humor; brutality with rebellion. His fate, whether triumph or tragedy, would be suspended on the fraying wire of his will.\n\nIn her long-awaited new book, Laura Hillenbrand writes with the same rich and vivid narrative voice she displayed in Seabiscuit. Telling an unforgettable story of a man's journey into extremity, Unbroken is a testament to the resilience of the human mind, body, and spirit.\n\nÂ©2010 Laura Hillenbrand; Â©2010 Random House Audio\n\nENJOY!!!","torrent":{"xt":"urn:btih:02f48c09fbfc3159edcb8ca9d975994d73815a4e","amp;dn":"Unbroken+%28azw3%2C+mobi%2C+epub%29+by+Laura+Hillenbrand","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02f48c09fbfc3159edcb8ca9d975994d73815a4e","infoHashBuffer":{"type":"Buffer","data":[2,244,140,9,251,252,49,89,237,203,140,169,217,117,153,77,115,129,90,78]},"announce":[],"urlList":[]}}