{"title":"Handbook of Applied Algorithms: Solving Scientific, Engineering,","uid":4888676,"size":33978343,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:034a4a69ccf0d191779ff9842f8a3d0a428bebff&amp;dn=Handbook+of+Applied+Algorithms%3A+Solving+Scientific%2C+Engineering%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"VasiaZozulia","files":-1,"time":1241861367,"description":"Discover the benefits of applying algorithms to solve scientific, engineering, and practical problems\n\nProviding a combination of theory, algorithms, and simulations, Handbook of Applied Algorithms presents an all-encompassing treatment of applying algorithms and discrete mathematics to practical problems in &quot;hot&quot; application areas, such as computational biology, computational chemistry, wireless networks, and computer vision.\n\nIn eighteen self-contained chapters, this timely book explores:\n\nLocalized algorithms that can be used in topology control for wireless ad-hoc or sensor networks\n\nBioinformatics algorithms for analyzing data\n\nClustering algorithms and identification of association rules in data mining\n\nApplications of combinatorial algorithms and graph theory in chemistry and molecular biology\n\nOptimizing the frequency planning of a GSM network using evolutionary algorithms\n\nAlgorithmic solutions and advances achieved through game theory\n\nComplete with exercises for readers to measure their comprehension of the material presented, Handbook of Applied Algorithms is a much-needed resource for researchers, practitioners, and students within computer science, life science, and engineering.\n\nAmiya Nayak, PhD, has over seventeen years of industrial experience and is Full Professor at the School of Information Technology and Engineering at the University of Ottawa, Canada. He is on the editorial board of several journals. Dr. Nayak's research interests are in the areas of fault tolerance, distributed systems/algorithms, and mobile ad-hoc networks. Ivan StojmenoviC?, PhD, is Professor at the University of Ottawa, Canada (www.site.uottawa.ca/~ivan), and Chair Professor of Applied Computing at the University of Birmingham, United Kingdom. Dr. Stojmenovic? received the Royal Society Wolfson Research Merit Award. His current research interests are mostly in the design and analysis of algorithms for wireless ad-hoc and sensor networks.","torrent":{"xt":"urn:btih:034a4a69ccf0d191779ff9842f8a3d0a428bebff","amp;dn":"Handbook+of+Applied+Algorithms%3A+Solving+Scientific%2C+Engineering%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"034a4a69ccf0d191779ff9842f8a3d0a428bebff","infoHashBuffer":{"type":"Buffer","data":[3,74,74,105,204,240,209,145,119,159,249,132,47,138,61,10,66,139,235,255]},"announce":[],"urlList":[]}}