{"title":"Joe Zawinul - Brown Street (2006) [FLAC]","uid":7020932,"size":595883940,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:035b8fc88ca67ebee7df1a62fdedf9832b35c6d5&amp;dn=Joe+Zawinul+-+Brown+Street+%282006%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"lfcom","files":-1,"time":1328836825,"description":"\n\nLike his friend and onetime collaborator Miles Davis, Joe Zawinul was not one to look back on his past and \n\nsavor the view. Yet as in the case of Miles (his parting concert in Montreux), Zawinul finally took the plunge \n\nin central Europe late in life by revisiting his old Weather Report repertoire -- live at his Vienna \n\nnightclub, Joe Zawinul's Birdland. The significant difference is that while Miles doubled back to a re-\n\ncreation of the original Gil Evans charts, Zawinul retrofitted his tunes with new big-band arrangements by \n\nVince Mendoza, read with gusto and heft by the crack visiting WDR Big Band of Cologne, Germany. To this, \n\nZawinul added his own synthesizer virtuosity and some overdubs from his Malibu studio, two distinguished WR \n\nalumni who still play with him off and on -- bassist Victor Bailey and percussionist Alex AcuÃƒÂ±a -- and drummer \n\nNathaniel Townsley. In just about every case, Mendoza's charts replicate and flesh out every twist and turn in \n\nthe Weather Report originals, paying off big-time with &quot;Brown Street,&quot; an overlooked swinger from the WR 8:30 \n\nalbum that gets the remake album off to a percolating start. Occasionally he piles on additional harmonic \n\ntissue, as in the Miles-period &quot;In a Silent Way.&quot; Some of the writing seems a bit redundant, yet things never \n\nbecome too overloaded thanks to the ceaseless drive of the rhythm section, and there is plenty of room for \n\nsolos. Only on &quot;Procession&quot; does Zawinul write his own big-band chart; though tied tightly to the original \n\nrecording, it sounds looser than most of the Mendoza charts as it works out over the drone. A few of the song \n\nchoices are unexpected: the frantic &quot;Fast City&quot; and the strutting title tune from the Night Passage album; the \n\nformer features some liquid synth solos by Zawinul and stimulating tenor sax by Paul Heller, and the latter \n\nsome relaxed flÃƒÂ¼gelhorn from Kenny Rampton. Others aren't from the WR catalog at all; &quot;Silent Way&quot; predates \n\nit, of course, though WR did play the tune in concert, and &quot;March of the Lost Children&quot; and the perennial \n\n&quot;Carnavalito&quot; are from the post-WR solo years. Unlike most jazz tribute projects -- including a fairly \n\nbloodless, multi-artist 1999 salute to Weather Report on Telarc -- this double-CD set isn't burdened with \n\nartificial nostalgia, and it benefits a lot from the presence of one of the two founding co-leaders (the other \n\nbeing the absent Wayne Shorter). And Zawinul is the crucial one, because the crusty Austrian keyboardist sees \n\nto it that the swing is the thing and that the groove is deep. \n\n\nCD1\n\n\n\t1 Brown Street \tShorter, Zawinul \t10:58\n\t2 In a Silent Way \tZawinul \t5:15\n\t3 Fast City \tZawinul \t9:04\n\t4 Badia/Boogie Woogie Waltz \tZawinul \t11:45\n\t5 Black Market \tZawinul\n\nCD2\n\n\t1 March of the Lost Children \tZawinul \t5:50\n\t2 A Remark You Made \tZawinul \t8:06\n\t3 Night Passage \tZawinul \t6:26\n\t4 Procession \tZawinul \t9:02\n\t5 Carnavalito \tZawinul \t10:41\n\n\n\nJoe Zawinul \tArranger, Composer, Keyboards, Producer, Vocoder\nJoachim Becker \tMixing, Producer\nRob Bruynen \tBand, Flugelhorn, Trumpet\nMattis Cederberg \tBand, Trombone (Bass), Tuba\nKlaus Genuit \tMixing\nAndy Haderer \tBand, Flugelhorn, Trumpet\nAnnette Hauber \tProduction Coordination\nDave Horler \tBand, Trombone\nInes Kaiser \tPhotography\nJohn Marshall \tBand, Flugelhorn, Trumpet\nVince Mendoza \tArranger\nJens Neufang \tBand, Clarinet (Bass), Sax (Baritone), Sax (Bass)\nLudwig Nuss \tBand, Trombone\nJoachim Oster \tDesign\nKlaus Osterloh \tBand, Flugelhorn, Trumpet\nOlivier Peters \tBand, Clarinet, Flute, Sax (Soprano), Sax (Tenor)\nKenny Rampton \tBand, Flugelhorn, Trumpet\nLucas Schmid \tExecutive Producer\nKoji Paul Shigihara \tBand, Guitar\nWayne Shorter \tComposer\nKarolina Strassmayer \tBand, Clarinet, Flute, Sax (Alto)\nNathaniel Townsley \tDrums\nHeiner Wiberny \tBand, Clarinet, Flute, Sax (Alto), Sax (Soprano)\nIvan Zawinul \tEngineer, Mixing, Sound Effects\n","torrent":{"xt":"urn:btih:035b8fc88ca67ebee7df1a62fdedf9832b35c6d5","amp;dn":"Joe+Zawinul+-+Brown+Street+%282006%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"035b8fc88ca67ebee7df1a62fdedf9832b35c6d5","infoHashBuffer":{"type":"Buffer","data":[3,91,143,200,140,166,126,190,231,223,26,98,253,237,249,131,43,53,198,213]},"announce":[],"urlList":[]}}