{"title":"A Practical Guide to the Wiring Regulations 4th ed.2009 - (Males","uid":4885084,"size":19493738,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:035c3cd254eb2dde8cc80bf66f9e22492eb2336a&amp;dn=A+Practical+Guide+to+the+Wiring+Regulations+4th+ed.2009+-+%28Males&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1241644076,"description":" &lt;a href=&quot;http://www.image-upload.net/images/lr4sc4olycovtdf7d0oa.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/lr4sc4olycovtdf7d0oa.jpeg&lt;/a&gt;\n\nA Practical Guide to the Wiring Regulations\nPublisher: Wiley | Pages: 648 | 2009-02 | ISBN 1405177012 | PDF\n\nThis best-selling text has been revised to reflect the requirements of the 17th edition of the &quot;IEEWiring Regulations (BS 7671: 2008)&quot;. It includes essential information on the new rules applied to special installations or locations, such as bathrooms, swimming pool locations, camping/caravan sites, marinas, exhibition and show locations, solar photovoltaic power supply systems, and floor and ceiling heating systems, amongst others. It presents clear explanations on inspection, testing, certification and reporting, test instruments and test methods, as well as covering: electricity, the law, standards and codes of practice; assessment of general characteristics; protection against electric shock, thermal effects, overcurrent, undervoltage and overvoltage; isolation and switching; the common rules of equipment selection; switchgear, protective devices and other equipment; wiring systems (including the external influences on them and cable installation methods); protective conductors, earthing and protective bonding; supplies for safety services; the smaller installation; and, specialised installations, such as outdoor lighting, installations in churches, multi-occupancy blocks of flats. These topics are addressed with pertinent regulation numbers, and a useful appendix lists the relevant Standards. Background guidance and worked examples are provided where appropriate. Like the earlier editions of this text, this new edition will be a useful aid for designers, installers and verifiers of electrical installations, students of the industry wishing to gain better understanding of the many facets of electrical safety, and 'duty holders' as defined by the Electricity at Work Regulations 1989.","torrent":{"xt":"urn:btih:035c3cd254eb2dde8cc80bf66f9e22492eb2336a","amp;dn":"A+Practical+Guide+to+the+Wiring+Regulations+4th+ed.2009+-+%28Males","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"035c3cd254eb2dde8cc80bf66f9e22492eb2336a","infoHashBuffer":{"type":"Buffer","data":[3,92,60,210,84,235,45,222,140,200,11,246,111,158,34,73,46,178,51,106]},"announce":[],"urlList":[]}}