{"title":"Driver Genius Professional 12.0.0.1211 Incl Crack [NepsterJay]","uid":7943258,"size":18447992,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:046474e5aa7d1ca36b6e8bc36bcf189db49200b2&amp;dn=Driver+Genius+Professional+12.0.0.1211+Incl+Crack+%5BNepsterJay%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"NepsterJay","files":1,"time":1356052590,"description":"Driver Genius Professional - Program for managing drivers (backup, restore corrupted versions, updates, and deletes unnecessary), which has also some opportunities for hardware diagnostics. Driver Genius can automatically find the drivers for all devices, using data embedded in the devices. It works with more than 30 thousand different motherboards, video cards, sound and network cards, modems, monitors, keyboards, mice, cameras, etc. Database software is constantly updated.\n\nYear: 2012\nOS: Windows XP/Vista/7/8\nLanguage: Ml / English \n\nNew features:\n1. Fully support for Windows 8 and Windows server 2012\nDriver Genius 12 now can fully support for official Windows 8 and Windows Server 2012. Driver Genius can offer the most recent version drivers for Windows 8 system.\n2. Enhanced hardware information inventory\nEnhanced Hardware Info can support for the newest Intel/AMD CPU and GPU including nVidia Quadro K1000M, K2000M, K3000M, K4000M, K5000M, GeForce GTX 650M ,GeForce GTX 680M, nVidia GeForce GTX 660 Ti, GeForce GTX 650 and Tesla K10, Quadro K2000, K2000D, K600, NVS 510, K5000, VGX K1, VGX K2 / AMD FirePro V3900, V4900, V5900, W600, W5000, W7000, W8000, W9000. It can support for more hardware sensors and offer more accurate hardware temperature. Optimized hardware detection speed---increase 40%.\n3. System health monitoring\nThe High temperature will reduce the stability and performance of hardware devices, even damaged.\nDriver Genius 12 can monitor the temperature of CPU, Video card, HDD est. in real time to prevent system damage from overheat in advance.","torrent":{"xt":"urn:btih:046474e5aa7d1ca36b6e8bc36bcf189db49200b2","amp;dn":"Driver+Genius+Professional+12.0.0.1211+Incl+Crack+%5BNepsterJay%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"046474e5aa7d1ca36b6e8bc36bcf189db49200b2","infoHashBuffer":{"type":"Buffer","data":[4,100,116,229,170,125,28,163,107,110,139,195,107,207,24,157,180,146,0,178]},"announce":[],"urlList":[]}}