{"title":"Dispatches: Undercover Mosque, The Return / 01-Sep-2008","uid":4385612,"size":364937216,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0472cff89a125f9b38b6c763f8a9ab239370393f&amp;dn=Dispatches%3A+Undercover+Mosque%2C+The+Return+%2F+01-Sep-2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"tommyzola","files":1,"time":1220903560,"description":"Broadcast: Monday 01 September 2008 08:00 PM\n\nA year-and-a-half after the critically acclaimed film Undercover Mosque was first screened, Dispatches goes undercover again to see whether extremist beliefs continue to be promoted in certain key British Muslim institutions.\nUndercover Mosque: The Return\n\nA year-and-a-half after the critically acclaimed film Undercover Mosque was first screened, Dispatches goes undercover again to see whether extremist beliefs continue to be promoted in certain key British Muslim institutions. The film also investigates the role of the Saudi Arabian religious establishment in spreading a hard-line, fundamentalist Islamic ideology in the UK - the very ideology the Government claims to be tackling.\n\nA female reporter attends prayer meetings at an important British mosque which claims to be dedicated to moderation and dialogue with other faiths. She secretly films shocking sermons given to the women-only congregation in which female preachers recite extremist and intolerant beliefs. As hundreds of women and some children come to pray, a preacher calls for adulterers, homosexuals, women who act like men and Muslim converts to other faiths to be killed, saying: &quot;Kill him, kill him. You have to kill him, you understand. This is Islam.&quot;\n\nWorshippers are repeatedly told they must lead separate lives from non-believers and not tolerate other religions. Christian teachings are described as &quot;vile and disgusting, an abomination.&quot; And at private, invite-only prayer meetings linked to the mosque, the reporter films the leading preacher from the women&amp;#039;s prayer circle issuing strict dictats on women&amp;#039;s personal freedoms - decreeing they must not travel far without a male member of the family to escort them, and instructing them not to integrate with British society or work in a non-Islamic environment.\n\nIn the same mosque, the reporter visits the bookshop and discovers books and DVDs still on sale, promoting extremist, anti-Semitic, misogynistic and intolerant messages. Unbelievers (&amp;#039;kuffaars&amp;#039;) are described in one DVD as: &quot;Evil, wicked, mischievous people - you can see the evil in their face&quot;. Whilst Jews, &quot;have abominated, filthy, disgusting gross belief - their time will come like every other evil person&amp;#039;s time will come.&quot; Moderate Muslims and Islamic academics tell Dispatches they reject and condemn these teachings. Dispatches traces the links between the teachings and materials at the mosque and the Saudi Arabian religious establishment, and examines the extent to which Saudi Arabia exports such teachings around the world through the funding of literature, schools, mosques and other organisations.\n\nDispatches also interviews a former teacher at a Saudi-run faith school who describes how the official Saudi educational curriculum was taught in the school. He shows Dispatches official Saudi textbooks from the school which featured anti-Semitic and anti-Christian teachings.\n\nAs part of the investigation, the undercover reporter also films inside a key Saudi-funded Muslim organisation which claims to promote tolerance and integration yet distributes literature which promotes intolerance for non-Muslims, an extreme version of Sharia law and teachings which support discrimination against women.\n\nThe Government claims Saudi Arabia is its partner in tackling extremism, but a former Foreign Office Minister tells Dispatches he believes the Government should take a stronger line. The film also features interviews with Islamic academics who condemn these messages of intolerance and segregation and warn of the impact this version of Islam is having on British society. One imam at a leading university accuses the Saudi religious establishment of the: &quot;distortion of Islam itself, the abuse and misuse of this great faith of mine and not only mine but of my children as well.&quot;\n","torrent":{"xt":"urn:btih:0472cff89a125f9b38b6c763f8a9ab239370393f","amp;dn":"Dispatches%3A+Undercover+Mosque%2C+The+Return+%2F+01-Sep-2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0472cff89a125f9b38b6c763f8a9ab239370393f","infoHashBuffer":{"type":"Buffer","data":[4,114,207,248,154,18,95,155,56,182,199,99,248,169,171,35,147,112,57,63]},"announce":[],"urlList":[]}}