{"title":"Robot Builder's Cookbook - Build and Design Your Own Robots (","uid":4681557,"size":12075342,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:04f4d0d72dce4052c1f83136b319a3d6e9e66a39&amp;dn=Robot+Builder%5C%27s+Cookbook+-+Build+and+Design+Your+Own+Robots+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1233088660,"description":" &lt;a href=&quot;http://www.image-upload.net/images/4x05y8r91arelli0tq7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/4x05y8r91arelli0tq7.jpg&lt;/a&gt;\n\nElsevier Ltd. | ISBN: 978-0-7506-6556-8 | Author: Owen Bishop |  English | PDF (RAR Compressed) | 373 Pages\n\n\nThis is a book of practical robotics written for beginners but also catering for those who have progressed a little further beyond that stage. It describes the mechanics of robot construction, how to build the electronic circuits, and finally goes into the details of programming robotic systems. The first half of the book is a cookbook of information, ideas, tips, and suggestions for the first-time roboticists and others. Much of the content will be of interest and practical use to students in Further and Higher Education who are working on a micro-controllerbased project (though not necessarily a robotic one). \n\nThe second half of the book describes the designing, building and programming of five robots of varying degrees of complexity. The specifications are flexible and essential features are emphasised so that the designs are readily adaptable to whatever materials and parts the reader can obtain. Each description points the way to more advanced development of the project, resulting in a wide range of fascinating and often unique robots. The programs are listed in the PICs MPASM assembler, which allows them to be modified, fine-tuned and extended. The listings are fully annotated and are accompanied by detailed flowcharts. These are intended to provide ample guidance for those who wish to program in one of the dialects of BASIC, or in the C language.","torrent":{"xt":"urn:btih:04f4d0d72dce4052c1f83136b319a3d6e9e66a39","amp;dn":"Robot+Builder%5C%27s+Cookbook+-+Build+and+Design+Your+Own+Robots+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04f4d0d72dce4052c1f83136b319a3d6e9e66a39","infoHashBuffer":{"type":"Buffer","data":[4,244,208,215,45,206,64,82,193,248,49,54,179,25,163,214,233,230,106,57]},"announce":[],"urlList":[]}}