{"title":"VeryPDF Advanced PDF Tools v2.0 with Key [TorDigger]","uid":8342592,"size":3193168,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:055e14d3e97908b2147a6a6e021d9c6ec75ec6d9&amp;dn=VeryPDF+Advanced+PDF+Tools+v2.0+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"TorDigger","files":9,"time":1365122619,"description":"Advanced PDF Tools\n\nAdvanced PDF Tools is developed for editing PDF property contents without opening PDF documents. It can edit PDF description, PDF custom description, PDF OpenAction options, PDF page view options, PDF metadata contents, and so on. It can recompress images of PDF or remove metadata contents for optimizing PDF. It is independent of any PDF editing software.\n\nKey features\n\nNo need for PDF editing software\nAdvanced PDF Tools can edit PDF documents without any PDF editing software installed in system. You need not open the PDF documents to edit their property and description contents. This may save your time and money observably.\n\nVarious contents\nAdvanced PDF Tools can edit various contents of PDF description and property. It can edit PDF descriptions, such as, tile, subject, author, keywords, created time, modified time, creator and producer. It can also edit PDF properties, like OpenAction, page view, image compression and metadata contents.\n\nBatch process\nAdvanced PDF Tools is powerful for editing almost all PDF property contents and it also supports batch process. You can deal with a mess of PDF documents with its batch process ability. Just add your PDF documents into the process queue, set up all options, and press a button, and then everything has been done.\n\nCommand line operation\nAdvanced PDF Tools has a command line version that is named Advanced PDF Tools Command Line which has the same functions of Advanced PDF Tools. The command line version is helpful for manually controlling operation or script including.\n\nSoftware Development Kit\nAdvanced PDF Tools offers a Software Development Kit, Advanced PDF Tools SDK, under a developer or server license. With this SDK, a developer or server operator can implement the same functions of Advanced PDF Tools in his/her software or on his/her server.\n\nFeatures of Advanced PDF Tools\n\nSupport PDF format of version up to 1.8.\nNo need for a third-party PDF editing application.\nEdit and append PDF descriptions including tile, subject, author, keywords, created time, modified time, creator and producer.\nAble to set and append custom PDF description.\nSet PDF OpenAction such as, which page to display, hide menu bar or not, initial page magnification, position of PDF viewer window on the screen, and so on.\nSet size of PDF page and page content.\nAble to rescale and rotate PDF page.\nOptimize PDF by removing metadata, Java script, thumbnails, etc.\nOption to enable PDF fast web view.\nRecompress images of PDF to color (Flate, JPEG or JPEG200), gray (Flate or JPEG) or monochrome (Flate or CCITT G4) images.\nExport source XML metadata from PDF.\nImport XML metadata to PDF.\nSupport batch process that can edit multiple PDF documents by one click.\nCommand line operation - Advanced PDF Tools has a command line version which is much useful for manual control and script calling.\n\nSystem Requirement:\n\nMemory: at least 64M.\nOperating System: Windows 98/ME/2000/XP/2003/Vista/7 of both 32 and 64-bit.\n\nHomepage: http://www.verypdf.com/app/advanced-pdf-tools/index.html\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:055e14d3e97908b2147a6a6e021d9c6ec75ec6d9","amp;dn":"VeryPDF+Advanced+PDF+Tools+v2.0+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"055e14d3e97908b2147a6a6e021d9c6ec75ec6d9","infoHashBuffer":{"type":"Buffer","data":[5,94,20,211,233,121,8,178,20,122,106,110,2,29,156,110,199,94,198,217]},"announce":[],"urlList":[]}}