{"title":"Forbidden - Discography (1988-1997) [mp3@192-320]","uid":5359513,"size":524947573,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:058863933deb95f77d1db29660f027962ae78a2b&amp;dn=Forbidden+-+Discography+%281988-1997%29+%5Bmp3%40192-320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"eifmspfjr","files":58,"time":1266060461,"description":"1988 - Forbidden Evil (320)\n1989 - Raw Evil Live At The Dynamo [EP] (192)\n1990 - Twisted Into Form (256)\n1994 - Distortion (320)\n1997 - Green (320)\n\n\n\n\nThrough-out the 1980's the thrash metal scene was bursting with talent and among the rhythmic collection a band that refused to be labelled in with the so called bay area sound. They were much more than just the next thrash band, they used odd signatures and melodies to create an original style all their own. Formed in March of 1985 in Hayward California Forbidden Evil forged an original style of metal that earned them praise by critics and bands alike. During this time they recorded the 1986 Demos &quot;Endless Slaughter&quot; and &quot;Egypt Has Fallen&quot;.\n\nIn July of 1987 Craig Locicero,Russ Anderson,Matt Camacho,Glen Alvelais, Paul Bostaph along with manager Debbie Abono head to Sunnyvail Studios and record a three song demo, and later sign to Combat Records. In 1988 the album Forbidden Evil was released under the new name of Forbidden . They played the Dynamo Open Air Festival in Eindhovan Holland and recorded the show for the mini album Raw Evil Live @ The Dynamo. Glen was ousted from the band and went on to form Bizzaro.\n\nIn 1990 the band toured Europe to promote Twisted Into Form with new guitarist Tim Calvert for one of the finest metal albums to date. Though this album set new standards their record label problems would start to take it's toll,with Paul leaving to play in Testament they are left to find a replacement in Steve Jacobs.\n\nIt wouldn't be until 1994 that they started to record new material and by 1995 the album Distortion was released by Massacre Records  . More label problems seem to haunt the band but they still manage to record and release 1997's Green on Gun Records and a  tour &quot;what the fuck am I alive for&quot; in support of Testament swept across America showing everone just what the bay area metal scene was all about .","torrent":{"xt":"urn:btih:058863933deb95f77d1db29660f027962ae78a2b","amp;dn":"Forbidden+-+Discography+%281988-1997%29+%5Bmp3%40192-320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"058863933deb95f77d1db29660f027962ae78a2b","infoHashBuffer":{"type":"Buffer","data":[5,136,99,147,61,235,149,247,125,29,178,150,96,240,39,150,42,231,138,43]},"announce":[],"urlList":[]}}