{"title":"Jackie Evancho - Songs from the Silver Screen (2012)","uid":7690564,"size":130371507,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:05abf40080643634f6497083e2dec47016a22834&amp;dn=Jackie+Evancho+-+Songs+from+the+Silver+Screen+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gmzorro","files":-1,"time":1349077757,"description":"Track Listings\n1. Pure Imagination\n2. The Music of the Night\n3. Can You Feel The Love Tonight\n4. Reflection\n5. The Summer Knows\n6. I See The Light\n7. What A Wonderful World\n8. Se Jackie Evancho with 2Cellos\n9. My Heart Will Go On\n10. Come What May\n11. Some Enchanted\n12. When I Fall In Love\n\nOn Songs From The Silver Screen, Jackie Evancho applies her brilliant voice and extraordinary artistry to an entirely new set of classics. On her first two full-length albums, Jackie explored musical classics from arias to holiday standards. For Silver Screen, she offers her interpretations of a whole new category of classic music the much-loved movie melodies that have become part of our cultural landscape. \n\n&quot;When I saw the movie version of The Phantom of the Opera when I was 7 years old, it made me want to become a singer 'The Music of the Night' is one of the most beautiful songs ever written and I've always wanted to perform it&quot;[in public] says Jackie. &quot;My enjoyment of the Phantom score is one of the things that gave us the idea to focus an entire album on songs that stayed in our minds for a long time after the movies were over.&quot;\n\nFor this album, Jackie collaborated with Grammy-winning producer/engineer Humberto Gatica, whose lengthy and impressive experience in the music industry has seen him work closely with Grammy award winning producer, David Foster, as well as with superstars like Michael Buble, Madonna, Michael Jackson, Mariah Carey and Barbra Streisand.\n\nJackie has some impressive company on some of the tracks. Famed violinist Joshua Bell accompanies her on one track (&quot;My Heart Will Go On&quot;from Titanic) as does trumpet player Chris Botti (&quot;The Summer Knows&quot; from The Summer of 42) and 2Cellos (&quot;Se&quot; from Cinema Paradiso). There are also very special duets, one with The Canadian Tenors (&quot;Come What May&quot; from Moulin Rouge) and one with her older brother, Jacob Evancho (&quot;I See the Light&quot; from Tangled). \n\nNo one can sing classical crossover music with the technical precision, emotion and intelligence that Jackie brings to it, says Gatica. With the songs we've selected for this album, we can show her fans how her talent has only deepened and matured since Dream With Me, which I think was one of the most outstanding albums of 2011.","torrent":{"xt":"urn:btih:05abf40080643634f6497083e2dec47016a22834","amp;dn":"Jackie+Evancho+-+Songs+from+the+Silver+Screen+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05abf40080643634f6497083e2dec47016a22834","infoHashBuffer":{"type":"Buffer","data":[5,171,244,0,128,100,54,52,246,73,112,131,226,222,196,112,22,162,40,52]},"announce":[],"urlList":[]}}