{"title":"Michael.Collins[1996]dvdrip","uid":5310308,"size":2498746134,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:05b148dbea800d628b1532548270677ab43e81ab&amp;dn=Michael.Collins%5B1996%5Ddvdrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"kfitz9","files":2,"time":1264537847,"description":"Neil Jordan's depiction of the controversial life and death of Michael Collins, the 'Lion of Ireland', who led the IRA against British rule and founded the Irish Free State (Eire) in 1921. Written by Dawn M. Barclift\n\nAfter the disastrous defeat of Irish rebels by superior British forces during the Easter Week rebellion of 1916, Michael Collins develops new strategies for the independence of Ireland. His tactics include what is now recognized as urban guerrilla tactics and organized assassinations of G-Men, those Irish who work as informers for the British, and later members of British intelligence. Although Collins is conflicted about the necessity of this violent course, by 1921 the British are willing to negotiate and Sinn Fein President Eamon de Valera sends a reluctant Collins to London to negotiate a settlement. When Collins returns with a compromise of a divided Ireland and an Irish Free State, not a Republic, he is vilified by de Valera and repudiated by lifelong friend Harry Boland after Boland learns that his girlfriend Kitty Kiernan is in love with Collins, not him. Collins is now faced with civil war as he struggles against those who insist on complete freedom for all of Ireland.\n\nNotes:\n*this is my first torrent\n**This movie is extremely biased towards Michael Collins and hostile towards Eamon De   Valera\n\n\n","torrent":{"xt":"urn:btih:05b148dbea800d628b1532548270677ab43e81ab","amp;dn":"Michael.Collins%5B1996%5Ddvdrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05b148dbea800d628b1532548270677ab43e81ab","infoHashBuffer":{"type":"Buffer","data":[5,177,72,219,234,128,13,98,139,21,50,84,130,112,103,122,180,62,129,171]},"announce":[],"urlList":[]}}