{"title":"Star Wars - Dark Times (000 - 017) (2006 - 2010)","uid":10453618,"size":382400427,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:05c1f0e79f68a05f1da3077e6cd7daf66802b040&amp;dn=Star+Wars+-+Dark+Times+%28000+-+017%29+%282006+-+2010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"nemesis43","files":18,"time":1404050595,"description":"Star Wars - Dark Times (000 - 017) (2006 - 2010)\n\n\nFor over a thousand generations the Jedi Knights were the guardians of peace and justice in the Old Republic. Before the dark times, before the Empire.&quot;\n\n-Ben Kenobi\n\nIn Star Wars Dark Times, the time period referenced in Ben Kenobi's immortal words is finally unlocked! The new series to be released this fall from Dark Horse Comics will move into the new, unexplored territory of the time period immediately following Revenge of the Sith, with references to the Del Rey novel Dark Lord.\n\nEven as the worlds of the former Republic are drawn into the iron grip of Palpatine's Empire, the galaxy seems adrift in a sea of chaos, lawlessness and despair.\n\nOn Coruscant, Darth Vader waits for his Master to reveal his vision for the future. But is there a plan beyond obtaining power? On New Plympto, Jedi Master Dass Jennir leads a Nosaurian army in a war they have already lost. Is this what it now means to be a Jedi?\n\nStar Wars: Dark Times is a continuation of Star Wars: Republic , that ended with issue 83. This series has a new number 1 and a new title, but the indica still states &quot;Star Wars Republic&quot; and continues to count on from issue 84 and on. The series lasted until issue 17 (or issue 100 of Star Wars: Republic), but recently continued in a mini-series named Star Wars: Dark Times - Out Of The Wilderness. That series, even though a mini-series, continues to count on as Star Wars: Republic in the indica.","torrent":{"xt":"urn:btih:05c1f0e79f68a05f1da3077e6cd7daf66802b040","amp;dn":"Star+Wars+-+Dark+Times+%28000+-+017%29+%282006+-+2010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05c1f0e79f68a05f1da3077e6cd7daf66802b040","infoHashBuffer":{"type":"Buffer","data":[5,193,240,231,159,104,160,95,29,163,7,126,108,215,218,246,104,2,176,64]},"announce":[],"urlList":[]}}