{"title":"Spitzer - Finding True Happiness: Satisfying Our Restless Hearts","uid":15623262,"size":3168680,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0632be69f52316591e62750c5e99ec3c6713b9a5&amp;dn=Spitzer+-+Finding+True+Happiness%3A+Satisfying+Our+Restless+Hearts&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"catholicstuff","files":4,"time":1471892223,"description":"Robert J. Spitzer - Finding True Happiness: Satisfying Our Restless Hearts (EPUB, MOBI, PDF)\r\n\r\nOne of the hottest topics in contemporary culture is happiness. The explanation for this current fixation seems to lie in the contrary phenomenon unhappiness. Despite the fact that we have tremendous access to every imaginable form of entertainment, we experience a pervading sense of insecurity, emptiness, and malaise amid sporadic peak experiences.\r\n\r\nFinding True Happiness attempts to provide a way out of this personal and cultural vacuum by helping people to identify and then reach for happiness. As Aristotle noted 2,400 years ago, happiness is the one thing we can choose for its own sake everything else is chosen for the sake of happiness.\r\n\r\nAfter an exhaustive investigation of philosophical, psychological, and theological systems of happiness, Fr. Spitzer developed the Four Levels of Happiness, which he based on the classical thinkers Plato, Aristotle, Augustine, and Aquinas; the contemporary philosophers Marcel, Scheler, Buber, Ricoeur, and Jaspers; and the modern psychologists Maslow, Frankl, Erikson, Seligman, Kohlberg, and Gilligan.\r\n\r\nFinding True Happiness is both a philosophical itinerary and a practical guidebook for life s most important journey from the mundane and the meaningless to transcendent fulfillment. No other book currently available combines such breadth of practical advice and such depth of philosophical, psychological, and spiritual wisdom.\r\n\r\nRobert J. Spitzer, S.J., Ph.D. is the former president of Gonzaga University and the founder of the Magis Institute, which educates the public about the relationship between physics, philosophy, reason, and faith. He is the chief education officer of the Ethics and Performance Institute, which delivers web-based ethics education to corporations and individuals, and President of the Spitzer Center of Ethical Leadership, which delivers similar curricula to non-profit organizations. He is the author of Healing the Culture, Five Pillars of the Spiritual Life, and Ten Universal Principles.\r\n\r\n---\r\n\r\nIf you enjoy this media, please seed and purchase a physical copy to support the producers and share with family and friends. \r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.org/user/catholicstuff/","torrent":{"xt":"urn:btih:0632be69f52316591e62750c5e99ec3c6713b9a5","amp;dn":"Spitzer+-+Finding+True+Happiness%3A+Satisfying+Our+Restless+Hearts","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0632be69f52316591e62750c5e99ec3c6713b9a5","infoHashBuffer":{"type":"Buffer","data":[6,50,190,105,245,35,22,89,30,98,117,12,94,153,236,60,103,19,185,165]},"announce":[],"urlList":[]}}