{"title":"Tai Chi for Beginners with Samuel Barnes x264 aac [MP4]","uid":11819125,"size":1067842013,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0642aad43fe26c5d1e81e6e936096f5ec292b6cc&amp;dn=Tai+Chi+for+Beginners+with+Samuel+Barnes+x264+aac+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"elessedilgirl","files":5,"time":1429219891,"description":"Tai Chi is well-known for bringing the mind, body, and spirit together to gain balance, prevent injury, and promote good health. Filmed on a tranquil location overlooking the Pacific Ocean, this program features two practices that offer personal one-on-one instruction and will allow you to experience the many layers of benefits this martial art has to offer. The first practice will revitalize and energize using the principles of Qi Gong. This Qi Gong series will focus on the breath and energy flow to prepare your mind and body for Tai Chi. In the second practice you will learn Tai Chi postures step-by-step, and then use these ancient flowing movements together in a moving meditation designed to increase the body?s natural energy. This powerful Tai Chi sequence will help clear your mind, reduce stress, enhance flexibility, and promote overall wellness.\n\nAbout the Instructor Samuel Barnes, founder of Tai Chi Works studio in Beverly Hills, is a master teacher with over 20 years of Tai Chi Chuan teaching experience. Samuel?s instruction easily and gracefully infuses the principles of Tai Chi into students? lifestyle allowing them to immediately experience the rejuvenating benefits of this peaceful art.\n\nIntroduction 2.00\nQi Gong 18.30\nTai Chi Postures 22.35\nTai Chi Flow 11.45\n\nVideo; x264; 720*576 (4:3); 1744 kbps; 25.000 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:0642aad43fe26c5d1e81e6e936096f5ec292b6cc","amp;dn":"Tai+Chi+for+Beginners+with+Samuel+Barnes+x264+aac+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0642aad43fe26c5d1e81e6e936096f5ec292b6cc","infoHashBuffer":{"type":"Buffer","data":[6,66,170,212,63,226,108,93,30,129,230,233,54,9,111,94,194,146,182,204]},"announce":[],"urlList":[]}}