{"title":"Platters - The Very Best of the Original.. (1987)  FLAC","uid":5947233,"size":248297876,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:064aa83803357bac387fe02b05b39d525f255ab3&amp;dn=Platters+-+The+Very+Best+of+the+Original..+%281987%29++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"keeybee","files":25,"time":1289412593,"description":"Please seed!\nA comment? Nice!\n\nThe Platters are a doo-wop vocal group which was formed in 1953 at the beginning of the early rock and roll era. Their distinctive sound created by Buck Ram was a bridge between the pre-rock Tin Pan Alley tradition, and the burgeoning new genre. The original group members were Alex Hodge, Cornell Gunther, David Lynch, Joe Jefferson, Gaynel Hodge and Herb Reed. In 1970, when all original members had left, the name of the group was changed to The Buck Ram Platters.\nAfter signing with Buck Ram, the act went through several personnel changes before hitting the charts, with the most successful incarnation comprising lead tenor Tony Williams, David Lynch, Paul Robi, Herb Reed, and Zola Taylor. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Platters&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Platters&lt;/a&gt;\n\n\nThe Platters - The Very Best of the Original Platters\nThis compilation 1987\n\n01  The Platters - The Very Best of the Original Platters - Only You\n02  The Platters - The Very Best of the Original Platters - The Great Pretender\n03  The Platters - The Very Best of the Original Platters - The Magic Touch\n04  The Platters - The Very Best of the Original Platters - My Prayer\n05  The Platters - The Very Best of the Original Platters - Heaven on Earth\n06  The Platters - The Very Best of the Original Platters - You'll Never Never Know\n07  The Platters - The Very Best of the Original Platters - I'm Sorry\n08  The Platters - The Very Best of the Original Platters - My Dream\n09  The Platters - The Very Best of the Original Platters - Twilight Time\n10  The Platters - The Very Best of the Original Platters - I Wish\n11  The Platters - The Very Best of the Original Platters - It's Raining Outside\n12  The Platters - The Very Best of the Original Platters - Smoke Gets In Your Eyes\n13  The Platters - The Very Best of the Original Platters - Remember When\n14  The Platters - The Very Best of the Original Platters - Harbor Lights\n15  The Platters - The Very Best of the Original Platters - Ebb Tide\n16  The Platters - The Very Best of the Original Platters - Sleepy Lagoon\n","torrent":{"xt":"urn:btih:064aa83803357bac387fe02b05b39d525f255ab3","amp;dn":"Platters+-+The+Very+Best+of+the+Original..+%281987%29++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"064aa83803357bac387fe02b05b39d525f255ab3","infoHashBuffer":{"type":"Buffer","data":[6,74,168,56,3,53,123,172,56,127,224,43,5,179,157,82,95,37,90,179]},"announce":[],"urlList":[]}}