{"title":"Mixed Wrestling Videos","uid":9050265,"size":3398621345,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0659e6b9baffdd53210180fd787bf67295cef15d&amp;dn=Mixed+Wrestling+Videos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"EdgarS789","files":41,"time":1381852916,"description":"Mixed (Man vs. Woman) wrestling. Originally from various websites specializing in this genre. This is a large torrent of small files. You may find most of the files not very erotic. I have renamed some of the files to give you a better description of the contests. Most of these have no nudity. Not all of the women are attractive. Some of the files show the woman topless. Unlike many woman-woman matches, there is no explicit sexual activity, not even any full frontal nudity.\n\nThe women win all of their matches. In most of the videos, the man doesn't even put up much of a fight. For example, you almost never see a man hitting a woman, especially in the abdomen. I think if he did, he would win quickly. But the women can hit the men, even in the groin sometimes. I doubt if most of these are real matches, or are staged, much like WWE matches are.\n\nYou might want to try downloading the files a few at a time, something easy to do with Vuze and perhaps other clients. If people do this, some but not all of the files may get seeded. I will seed for a few days, possibly longer depending on interest.","torrent":{"xt":"urn:btih:0659e6b9baffdd53210180fd787bf67295cef15d","amp;dn":"Mixed+Wrestling+Videos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0659e6b9baffdd53210180fd787bf67295cef15d","infoHashBuffer":{"type":"Buffer","data":[6,89,230,185,186,255,221,83,33,1,128,253,120,123,246,114,149,206,241,93]},"announce":[],"urlList":[]}}