{"title":"Vegas Trilogy by Fern Michaels  (Epub)","uid":10753874,"size":3245204,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:065ce2b9e365be2a0e61a669ec15e4c698ca8b7c&amp;dn=Vegas+Trilogy+by+Fern+Michaels++%28Epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gratefuldawg77","files":3,"time":1407909366,"description":"Vegas Rich\nSallie Coleman follows her dreams from Texas to Las Vegas, where a twist of fate makes her the richest and most powerful businesswoman in Nevada. Spanning more than half a century, this story of Sallie and her family begins Michaels's powerful Vegas trilogy that marked the return of the Coleman family of Texas.\n\nVegas Heat\nFern Michaels continues her magnificent new trilogy about the Coleman and the Thornton dynasties that she began in Vegas Rich. This is the story of the Thornton clan, more specifically Fanny Thornton, who takes over Babylon, the family's magnificent Las Vegas casino, when her ex-husband, Ash, falls desperately ill. It is also the story of Fanny's search for her own roots, her relationship with Ash's brother, Simon Thornton, the mysterious Marcus Reed, and her four grown children, each with their own successes and failures\n\nVegas Sunrise\nWhen Thornton dynasty matriarch Fanny Thornton Reed chooses her first husband's illegitimate son to run the family's successful Vegas casino, it is a decision she will live to regret--one that turns her children against each other and threatens to destroy the Thornton family once and for all.\n","torrent":{"xt":"urn:btih:065ce2b9e365be2a0e61a669ec15e4c698ca8b7c","amp;dn":"Vegas+Trilogy+by+Fern+Michaels++%28Epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"065ce2b9e365be2a0e61a669ec15e4c698ca8b7c","infoHashBuffer":{"type":"Buffer","data":[6,92,226,185,227,101,190,42,14,97,166,105,236,21,228,198,152,202,139,124]},"announce":[],"urlList":[]}}