{"title":"MKVtools 3.4.5 [Mac Os X] [Coque599]","uid":11679351,"size":54131492,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:068bb273f02940a1e7a4e4c913212c16e8704a02&amp;dn=MKVtools+3.4.5+%5BMac+Os+X%5D+%5BCoque599%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"coque599","files":1,"time":1423010359,"description":"Features:\n\nConvert from a variety of video file formats like MKV, MP4, OGM and AVI into MKV videos..\nCan convert most videos without having to re-encode the video track and/or the audio track, so processing takes minutes instead of hours and no quality is lost.\nSimplified, intuitive user interface that takes the guess work out of processing MKV videos.\nAbility to convert various surround sound audio to 5.1 AC3 or 5.1 AAC.\nIntuitively select desired video, audio and/or subtitle tracks to process, with the ability to verify the selections using video preview.\nDefine presets for one step automated encoding and track selections settings.\nBurn (i.e., hard code) subtitle tracks into the video, or mux (soft subtitles) from internal tracks or from external subtitle files commonly found on the internet.\nControl the font, size and positioning of the embedded subtitles.\nSplit MKV videos into segments of a specified file size or by start/end time.\nTurn off an MKV video's header removal compression to allow more compatibility with playback and editing.\nJoin MKV videos.\nExtract the selected tracks from MKV videos as individual video and/or audio files.\nAdd jobs to a queue either individually or in batches via drag and drop so you can process multiple files overnight (registered copies only).\nApply one setting to a group of files for easy batch creations (registered copies only).\nEnter a &quot;Watch Mode&quot; for which MKVtools will process all videos placed in a defined folder (registered copies only).\nSystem Requirements\nMKVtools is Intel-only (64-bit) and requires Mac OS X 10.7.x or later. It has been tested on a MacBook Pro and a Mac Pro with no known issues","torrent":{"xt":"urn:btih:068bb273f02940a1e7a4e4c913212c16e8704a02","amp;dn":"MKVtools+3.4.5+%5BMac+Os+X%5D+%5BCoque599%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"068bb273f02940a1e7a4e4c913212c16e8704a02","infoHashBuffer":{"type":"Buffer","data":[6,139,178,115,240,41,64,161,231,164,228,201,19,33,44,22,232,112,74,2]},"announce":[],"urlList":[]}}