{"title":"American Experience - PBS - The Rockefellers [2000]","uid":10162068,"size":1689101312,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:071eb1394f102a5a4cba19bb53940e007e2c8b9f&amp;dn=American+Experience+-+PBS+-+The+Rockefellers+%5B2000%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rambam1776","files":-1,"time":1400309988,"description":"American Experience - PBS - The Rockefellers\n\nFormat                                   : Matroska\nFormat version                           : Version 2\nFile size                                : 1.57 GB\nDuration                                 : 1h 23mn\nNominal bit rate                         : 1 000 Kbps\nWidth                                    : 708 pixels\nHeight                                   : 480 pixels\nDisplay aspect ratio                     : 4:3\nFrame rate mode                          : Constant\nFrame rate                               : 29.970 fps\nColor space                              : YUV\nChroma subsampling                       : 4:2:0\nBit depth                                : 8 bits\nScan type                                : Progressive\nBits/(Pixel*Frame)                       : 0.098\nWriting library                          : x264 core 120\n &lt;a href=&quot;\nhttp://image.bayimg.com/c7aef7c5244725fbb7f3884dd2c83b0c0d1c853e.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/c7aef7c5244725fbb7f3884dd2c83b0c0d1c853e.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0854407/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0854407/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.pbs.org/wgbh/americanexperience/films/rockefellers/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/wgbh/americanexperience/films/rockefellers/&lt;/a&gt;\n\nThey feared the temptations of wealth, yet their estate was once described as the kind of place God would have built--if only he had the money. They amassed a fortune that outraged a democratic nation, then gave much of it away. They were the closest thing this country had to a royal family, but they shunned the public eye, retreating behind the walls of their palatial home at Pocantico Hills, New York.\n\n&quot;The Rockefellers&quot; is the saga of four generations of a legendary American family whose name is synonymous with great wealth.\n\nThe story begins in the Christian revivalist fervor of the 1830s with a marriage of opposites: Eliza Davison, a pious young woman, and &quot;Devil Bill&quot; Rockefeller, swindler, snake-oil salesman, and eventually, bigamist. Their son, John D. Rockefeller, created an industrial empire -- and a personal fortune -- on a scale the world had never known. He ruthlessly crushed his competitors in the process, alienating the public and leaving a stain on the family name. His dutiful son, John D. Jr., was a self-sacrificing young man who devoted his life to redeeming his family's reputation. Junior's five sons scaled the heights of the American century. One, Nelson, reached highest, exposing the very private Rockefellers once again to the harsh judgment of public opinion. In the 1960s, a fourth generation of Rockefellers -- &quot;the Cousins&quot; -- rebelled against their family, which had come to personify what was then known as &quot;the establishment.&quot;\n\nThe world's first billionaire, John D. Rockefeller Sr. held 90 percent of the world's oil refineries, 90 percent of the marketing of oil, and a third of all the oil wells. Working methodically and secretly, he did more than transform a single industry. When he formed his feared monopoly, Standard Oil, in 1870 he changed forever the way America did business.\n\nWith unprecedented access to the Rockefeller family and their archives, producers Elizabeth Deane (&quot;The Kennedys&quot;) and Adriana Bosch (&quot;Reagan&quot;) have created a complete documentary portrait of this renowned dynasty. &quot;The Rockefellers&quot; features on-camera interviews with Junior's two surviving sons, Laurance and David, and six of the Cousins generation: Steven Rockefeller, Rodman Rockefeller (who died in May 2000), Abby O'Neill, David Rockefeller Jr., Peggy Dulany, and the Honorable John D. Rockefeller IV; revealing home movies; and interviews with historians, biographers, and others close to the family. David Ogden Stiers narrates.","torrent":{"xt":"urn:btih:071eb1394f102a5a4cba19bb53940e007e2c8b9f","amp;dn":"American+Experience+-+PBS+-+The+Rockefellers+%5B2000%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"071eb1394f102a5a4cba19bb53940e007e2c8b9f","infoHashBuffer":{"type":"Buffer","data":[7,30,177,57,79,16,42,90,76,186,25,187,83,148,14,0,126,44,139,159]},"announce":[],"urlList":[]}}