{"title":"Leslie West - The Great Fatsby (1975) @320","uid":5503116,"size":88229296,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:074e1f396551c8074642ba9c176c305c1ce765a2&amp;dn=Leslie+West+-+The+Great+Fatsby+%281975%29+%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"artpepper","files":-1,"time":1271652712,"description":"Leslie West - The Great Fatsby (1975)\n\nMp3 @320 kbps\n\n\n\n\n\n\n\nReleased on Foreigner manager Bud Prager's RCA imprint -- Phantom records, it is one of two albums released by Leslie West on that label in 1975, the other being titled simply The Leslie West Band. The Great Fatsby's album cover has the rock &amp; roll guitarist in front of a mansion surrounded by babes ÃƒÂ  la the F. Scott Fitzgerald character. \n\n\nIt opens with a nice and bluesy Paul Kelly tune, &quot;Don't Burn Me,&quot; and for the post-Mountain work here, that direction works best. &quot;The House of the Rising Sun&quot; features a duet with Dana Valery and is an interesting read on the traditional tune made famous by the Animals. \n\n\nMick Jagger plays some guitar on a tune credited to himself, Keith Richards, West, Corky Laing, and Sandra Palmer. &quot;High Roller&quot; is a second cousin to &quot;Brown Sugar,&quot; and for Rolling Stones fans, it's a must have, a rare '70s co-write and collaboration with another artist. For Leslie West fans, the album is a departure from the Mountain onslaught and a treat. &quot;I'm Gonna Love You Thru the Night&quot; has an elegant guitar riff and brings West back to the blues. Though it's an original from Corky Laing and his guitarist, the influence of the band Free is obvious. \n\n\nWest does an admirable job on Andy Fraser's &quot;Doctor Love&quot; on side two, as well as the Free song &quot;Little Bit of Love.&quot; Tim Hardin's &quot;If I Were a Carpenter&quot; is a total diversion for the hard rock guitar slinger, and it comes off very nicely. At five minutes and 20 seconds, &quot;Carpenter&quot; is the album's longest track. The instrumental &quot;E.S.P.&quot; might be the strongest statement here (isn't that the name of label owner Bud Prager's management firm, E.S.P.?). \n\n\nWith 12-string guitars and superb musicianship, it's the best of West on display. Gary Wright makes an appearance on this album on piano, and The Great Fatsby emerges as a unique look at an important rock &amp; roll artist with some surprises tucked inside.\n\n\n\n\n\nBand Members and Musicians:\n\n    * Leslie West\n    * Mick Jagger\n    * Howie Wyeth\n    * Gary Wright\n    * Marty Simon\n    * Corky Laing\n    * Nick Ferrantella\n    * Frank Vicari\n    * Joel Tepp\n    * Sredni Vollmer\n    * Dana Valery\n    * Jay Traynor \n\n\n\n\nTrack Listing:\n\n\n\n   1. Side One: Dont Burn Me\n   2. House of the Rising Sun\n   3. High Roller\n   4. I'm Gonna Love You Through the Night\n   5. E.S.P. \n\n   1. Side Two: Honky Tonk Women\n   2. If I Still Had You\n   3. Doctor Love\n   4. If I Were A Carpenter\n   5. Little Bit of Love \n\n\n\n","torrent":{"xt":"urn:btih:074e1f396551c8074642ba9c176c305c1ce765a2","amp;dn":"Leslie+West+-+The+Great+Fatsby+%281975%29+%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"074e1f396551c8074642ba9c176c305c1ce765a2","infoHashBuffer":{"type":"Buffer","data":[7,78,31,57,101,81,200,7,70,66,186,156,23,108,48,92,28,231,101,162]},"announce":[],"urlList":[]}}