{"title":"Advanced Lighting and Materials with Shaders","uid":5359971,"size":7391481,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:077b21ded5636749e3da0cbfa50aa2538abf5d51&amp;dn=Advanced+Lighting+and+Materials+with+Shaders&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZADThe","files":1,"time":1266070653,"description":"This book explains the underlying principles of lighting more\ndeeply than most game development books. However, unlike\nother theoretical books, this book takes a holistic approach\nthat couples theory with practical implementations that\naddress the features and limitations of modern hardware.\n\nThe first chapters of the book deal with theory. They lay\nthe conceptual foundations for the remaining chapters. The\nbulk of the book is comprised of chapters that each focus on a\nspecific technique. Each chapter will explain the theory as\nwell as give a sample implementation. Some readers look for\nbooks that give them a fully built out gaming engine. That is\nnot our intention here. In fact, we have tried to strip each\nsample down to its bare essentials in order to highlight a\ngiven technique. This should make it easier to put the technique\ninto any engine you need.\n\nThis book can be read nonlinearly. Advanced readers\nmight want to jump to specific chapters. Beginning readers might\nwant to start with the theory before they jump through\nsets of theory/approach/implementation to see how everything\nfits together. Regardless of how they are read, the\nchapters provide a solid theoretical and practical foundation\non which additional techniques and further optimizations can\nbe based.","torrent":{"xt":"urn:btih:077b21ded5636749e3da0cbfa50aa2538abf5d51","amp;dn":"Advanced+Lighting+and+Materials+with+Shaders","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"077b21ded5636749e3da0cbfa50aa2538abf5d51","infoHashBuffer":{"type":"Buffer","data":[7,123,33,222,213,99,103,73,227,218,12,191,165,10,162,83,138,191,93,81]},"announce":[],"urlList":[]}}