{"title":"The Medieval Romantics, 1340-1440 - Gothic Voices [Philidor]","uid":15391638,"size":258087875,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0780c80792a80f209c47925cc9c9900b708ce125&amp;dn=The+Medieval+Romantics%2C+1340-1440+-+Gothic+Voices+%5BPhilidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Philidor","files":21,"time":1469352038,"description":"From the liner notes:\r\n\r\n&quot;There is a famous book which interprets the fourteenth century as the time when the Middle Ages finally went to seed like the crops in Autumn. Another describes it as ‘the calamitous fourteenth century’. Small wonder, therefore, if the music composed in France during the century of Guillaume de Machaut (d1377) has often been described as ‘mannerist’ and ‘precious’: terms that suggest decadence and escapism.\r\n\r\n&quot;The performances recorded here spring from a different view of French music during the fourteenth century, for we believe that French song of the later Ars Nova can be described by a term that is both positive and evocative: Romantic. To be sure, these songs have been called Romantic before, but it may still seem rash to speak of ‘The Medieval Romantics’. Devotees of nineteenth-century music will object that there was no cult of genius in the fourteenth century, no passion for the wildness of Nature and no such nationalism as we associate with the 1800s. And yet if Romanticism implies a taste for beauty touched by strangeness, and if it is associated with a desire to expand the resources of musical language (and especially of harmony) with sheer profligacy of invention, then the second half of the fourteenth century in France was truly a period of Romantic composition.\r\n\r\n&quot;This is not to say that every composer of the period was a Romantic artist. Most of the polyphonic songs produced in France between c1340 and c1400 are light and melodious, being neither ‘wayward’ (a term often used of this repertory) nor Romantic. The virelai Mais qu’il vous viengne a plaisance is a representative example of this style at its best. Nonetheless, in addition to these plainer songs we find others, many of them attributed to named composers, which reveal different priorities...&quot;\r\n\r\nTransfers are made at 768 kBits/s, directly from the disc.\r\n\r\nEssay, text and translations enclosed. You can find all my classical uploads by searching on Philidor, or in this thread:\r\n  \nhttps://pirates-forum.org/Thread-Philidor-s-uploads--63895","torrent":{"xt":"urn:btih:0780c80792a80f209c47925cc9c9900b708ce125","amp;dn":"The+Medieval+Romantics%2C+1340-1440+-+Gothic+Voices+%5BPhilidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0780c80792a80f209c47925cc9c9900b708ce125","infoHashBuffer":{"type":"Buffer","data":[7,128,200,7,146,168,15,32,156,71,146,92,201,201,144,11,112,140,225,37]},"announce":[],"urlList":[]}}