{"title":"The English Beat - Special Beat Service (1999) 320 vtwin88cube","uid":6585738,"size":101198197,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:078b822f1f9e406326e9386013b72e09bb3dad5f&amp;dn=The+English+Beat+-+Special+Beat+Service+%281999%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1312602300,"description":"The English Beat\nSpecial Beat Service (1999)\n\n\n\n\nOne of the earliest and most important ska revivalist groups, Birmingham's the Beat formed in 1978 (the band had to change its name to the English Beat in the U.S. to avoid confusion with Paul Collins' band of the same name). The multiracial band carved a distinct sound through the use of alternating lead vocals by guitarist Dave Wakeling and punk toaster/rapper Ranking Roger, supported by a tight band consisting of Andy Cox (guitar), David Steele (bass), and Everett Moreton (drums). The addition of 50-year-old saxophonist Saxa, who originally played with Prince Buster and Desmond Dekker, gave the band credibility and fleshed out its sound. An opening spot for the Selecter led to the band's signing to 2-Tone, where they released the hit single &quot;Tears of a Clown,&quot; a wonderful version of the Smokey Robinson classic. In 1980, the band decided to form its own 2-Tone-inspired label, Go-Feet (distributed by Arista). A string of hit singles followed in the U.K., including &quot;Mirror in the Bathroom.&quot; Their debut LP, I Just Can't Stop It, combined the early hits with other pop/ska-oriented material. &quot;Stand Down Margaret,&quot; with its anti-Thatcher stance, found the band moving in a more political direction, leading to several benefit gigs for &quot;radical&quot; causes. Musically, the Beat slowed down the tempo for a more traditional reggae sound showcased on 1981's Wha'ppen. This direction failed to bring the chart success of its predecessor. Featuring a more pop-oriented approach, 1982's Special Beat Service helped the band increase its U.S. fan base through MTV exposure of &quot;Save It for Later&quot; and &quot;I Confess,&quot; but the bandmembers decided to call it quits early the following year. Wakeling and Ranking Roger went on to form General Public, and Cox and Steele formed Fine Young Cannibals. \n\n\n\n\nFormat:\t\t\tMp3\nBitrate:\t\t320 CBR\nContains:\t\tAlbum Art &amp; ID Tags\n\n\n\n\nAudio-Info:\n\n\n01. I Confess\n02. Jeanette\n03. Sorry\n04. Sole Salvation\n05. Spar Wid Me\n06. Rotating Heads\n07. Save It For Later\n08. She's Going\n09. Pato And Roger A Go Talk\n10. Sugar And Stress\n11. End Of The Party\n12. Ackee 1-2-3\n\n\n\n\n\nCheers!","torrent":{"xt":"urn:btih:078b822f1f9e406326e9386013b72e09bb3dad5f","amp;dn":"The+English+Beat+-+Special+Beat+Service+%281999%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"078b822f1f9e406326e9386013b72e09bb3dad5f","infoHashBuffer":{"type":"Buffer","data":[7,139,130,47,31,158,64,99,38,233,56,96,19,183,46,9,187,61,173,95]},"announce":[],"urlList":[]}}