{"title":"Lee Konitz Another Shade of Blue(jazz)(mp3@320)[rogercc]","uid":6830917,"size":162451285,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:079011c0f330bd31e2aab22d07716829b4c3c4bc&amp;dn=Lee+Konitz+Another+Shade+of+Blue%28jazz%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rogercc1","files":6,"time":1321873670,"description":"LEE KONITZ ANOTHER SHADE OF BLUE\nRecorded live at the Jazz Bakery, Culver City, California on December 21 &amp; 22, 1997\nReleased: 1999\nLabel: Blue Note\nFormat:Mp3@320\n\nThe blues can be either the most difficult or simplest of forms for a jazz musician to master. Put simply: if one has nothing compelling to say, the blues can be hard time in solitary confinement. If, on the other hand, one has something of moment to communicate, playing the blues can be as effortless and free as taking a breath. Lee Konitz isn't usually thought of as a particularly bluesy player, but the simple form is as appropriate to his melodic style as a beautiful woman on the arm of Cary Grant.\n\n&quot;Another Shade of Blue&quot; is a medium-tempo blues in Db. Not many sax players have a ready supply of licks in that key, which might well be why Konitz chooses it as a guarantee that he won't fall back on what is comfortable. Of course, no jazz musician is less lick-oriented than Konitz, so it might not be an issue. Regardless, his performance is characteristically incisive and devoid of clich. He makes especially good use of long, sustained tones and tonal shading. Pianist Brad Mehldau drinks Konitz's Cool-Aid, on this track at least. Relying largely on well-articulated single lines in his right hand with slight punctuations from his left, Mehldau is clean and direct. There's none of the baroque clutter that occasionally mars his work in other contexts. Bassist Charlie Haden was born to play music like this. The relaxed tempo suits him well. Like Konitz, he's a natural melodist. The more space between the notes, the better he tends to be. His sound is a thing of beauty. Both he and Konitz benefit greatly from the absence of drums, which allows the luster of their tones to shine.\n\nThe blues doesn't have to be Robert Johnson or even Count Basie. There's room for every sensibility, as Konitz &amp; Co. demonstrate. &quot;Another Shade of Blue,&quot; indeed.\n[size=4][color=red][b]Tracklist[/b][/color]\n01. Another Shade Of Blue (10:50)\n02. Everything Happens To Me (12:17)\n03. What's New (15:50)\n04. Body and Soul (17:30)\n05. All Of Us (11:25)\n\nPersonnel:Lee Konitz (alto saxophone); Brad Mehldau (piano); Charlie Haden (bass).\n\n\n\n","torrent":{"xt":"urn:btih:079011c0f330bd31e2aab22d07716829b4c3c4bc","amp;dn":"Lee+Konitz+Another+Shade+of+Blue%28jazz%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"079011c0f330bd31e2aab22d07716829b4c3c4bc","infoHashBuffer":{"type":"Buffer","data":[7,144,17,192,243,48,189,49,226,170,178,45,7,113,104,41,180,195,196,188]},"announce":[],"urlList":[]}}