{"title":"Indian Food Made Easy - Anjum Anand (BBC Series ) (mAnaV)","uid":4736404,"size":1898654,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07acfb95b90f6299d7e25778226a09478945ea71&amp;dn=Indian+Food+Made+Easy+-+Anjum+Anand+%28BBC+Series+%29+%28mAnaV%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"msbisht","files":32,"time":1235310289,"description":"Anjum's six-part primetime BBC Two television series on Indian cookery, Indian Food Made Easy, aired in summer 2007. A book accompanied the series.\n\nAnjum Anand grew up in London but has also lived and studied in Geneva, Paris and Madrid. After gaining a European business degree she decided to develop her interest in Indian cookery and, in particular, to make her native food fresher, lighter and simpler to cook.\nAnjum has worked across the world in innovative restaurants such as CafÃƒÂ© Spice in New York, the Mondrian Hotel in Los Angeles, and the Park Royal Hotel's Indian restaurant in New Delhi, but her real love is delicious and stylish food that is simple enough to cook at home. She challenges fiercely the assertion that Indian food is heavy and difficult to cook and is determined to make 'cooking an Indian' as common as rustling up a stir-fry.\nShe was one of the first writers to create and write Indian recipes catering for the health-conscious cook and her first book, Indian Every Day: Light, Healthy Indian Food, was published in 2003 and has sold more than 25,000 copies. \nAnjum has family homes in Delhi and Calcutta and loves the regional and cultural traditions of Indian food with the passion of a real insider. Anjum was a regular guest on UKTV Food's Great Food Live from 2004 to 2007.\n\n\nImages with Recipes in a Doc File\n\nimage : &lt;a href=&quot;\nhttp://www.image-upload.net/images/3vi6az00lbfi6i066tc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.image-upload.net/images/3vi6az00lbfi6i066tc.jpg&lt;/a&gt;\n\nPlzzz Seed...\n\nThnXX...\n\nmAnaV...","torrent":{"xt":"urn:btih:07acfb95b90f6299d7e25778226a09478945ea71","amp;dn":"Indian+Food+Made+Easy+-+Anjum+Anand+%28BBC+Series+%29+%28mAnaV%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07acfb95b90f6299d7e25778226a09478945ea71","infoHashBuffer":{"type":"Buffer","data":[7,172,251,149,185,15,98,153,215,226,87,120,34,106,9,71,137,69,234,113]},"announce":[],"urlList":[]}}