{"title":"Claire Keegan - Walk the Blue Fields: Short Stories (pdf)","uid":8481169,"size":2195870,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07d877be0d74ccf9655f30cf69d7caa8a64ba0be&amp;dn=Claire+Keegan+-+Walk+the+Blue+Fields%3A+Short+Stories+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pharmakate","files":-1,"time":1368739521,"description":"Claire Keegan - Walk the Blue Fields (Faber and Faber, 2007). 161 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nA small collection of brilliant short stories.\n\ndescription:\n\nClaire Keegan's brilliant debut collection, Antarctica, was a Los Angeles Times Book of the Year, and earned her resounding accolades on both sides of the Atlantic. Now she has delivered her next, much-anticipated book, Walk the Blue Fields, an unforgettable array of quietly wrenching stories about despair and desire in the timeless world of modern-day Ireland. In the never-before-published story &quot;The Long and Painful Death,&quot; a writer awarded a stay to work in Heinrich Boll's old cottage has her peace interrupted by an unwelcome intruder, whose ulterior motives only emerge as the night progresses. In the title story, a priest waits at the altar to perform a marriage and, during the ceremony and the festivities that follow, battles his memories of a love affair with the bride that led him to question all to which he has dedicated his life; later that night, he finds an unlikely answer in the magical healing powers of a seer.\n\nA masterful portrait of a country wrestling with its past and of individuals eking out their futures, Walk the Blue Fields is a breathtaking collection from one of Ireland's greatest talents, and a resounding articulation of all the yearnings of the human heart.","torrent":{"xt":"urn:btih:07d877be0d74ccf9655f30cf69d7caa8a64ba0be","amp;dn":"Claire+Keegan+-+Walk+the+Blue+Fields%3A+Short+Stories+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07d877be0d74ccf9655f30cf69d7caa8a64ba0be","infoHashBuffer":{"type":"Buffer","data":[7,216,119,190,13,116,204,249,101,95,48,207,105,215,202,168,166,75,160,190]},"announce":[],"urlList":[]}}