{"title":"Giovannona Coscialunga Disonorata Con Onore [XviD - Ita Ac3]","uid":4136321,"size":1360988160,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:07dd3616fc1998d5463e21fff55d598bbf8045cb&amp;dn=Giovannona+Coscialunga+Disonorata+Con+Onore+%5BXviD+-+Ita+Ac3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"circlensess","files":1,"time":1208284186,"description":" &lt;a href=&quot;http://img170.imageshack.us/img170/6434/giovannonacoscialungadild5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img170.imageshack.us/img170/6434/giovannonacoscialungadild5.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0070111/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0070111/&lt;/a&gt;\n\n\nData: 4/04/2008 12:14:42\nDimensione: 1,360,988,160 bytes (1297.939 MB)\nDurata: 01:30:02 (5402.2 s)\n\n\n\nClever and funny Italian sex comedy, 4 March 2008\nAuthor: lazarillo \n\nThe owner of a cheese factory is trying to get an Italian government official to look the other way at the industrial pollution his factory is creating. He finds out the &quot;honorable&quot; official has a thing for other men&amp;#039;s sexy wives. Unfortunately, his own wife is a devout Catholic and pretty unattractive to boot, so he entrusts his dimwitted assistant to procure him a fake wife. After the first potential &quot;wife&quot; turns out to be a transvestite, the desperate assistant picks up a very sexy streetwalker (Edwige Fenech), who unfortunately also turns out to be hilariously profane and uncouth. The movie than turns into a kind &quot;The Pygmalion&quot;/&quot;My Fair Lady&quot; on the fly as they try to pass her off as a more respectable lady, and the zaniness increases when the industrialist starts to fall for the official&amp;#039;s own very large wife, while the official&amp;#039;s puritanical battle-axe of a secretary tries to sabotage the whole thing, and the bumbling assistant continues to mess things up further.\n\nThis sex comedy has the usual nude scenes from Edwige Fenech, but it&amp;#039;s a lot more enjoyable than the vast majority of Italian sex comedies because it&amp;#039;s a lot more satirical and clever, not to mention genuinely funny in places. Obviously, Edwige Fenech is gorgeous, but there was certainly no shortage of gorgeous women in 1970&amp;#039;s Italian sex comedies. Fenech, however, shows some genuine comic talent that puts her above the likes of Gloria Guida or Nadia Cassini, who were equally ubiquitous in these kind of films, but were more just eye candy. And it helps that this film was directed by the talented Sergio Martino, a regular collaborator with Fenech (his producer brother, Luciano Martino, was a one-time paramour of Fenech, but it was their professional collaboration that proved the most fruitful).\n\nI actually rented this thinking it was a &quot;decamerotici&quot; or other period sex comedy like &quot;Ubalda--All Naked Warm&quot; which Fenech was known for. It is actually more a political satire, like Fulci&amp;#039;s &quot;The Eroticist&quot; (albeit with more &quot;Benny Hill&quot;-style high-speed antics and other &quot;physical humor&quot;). Like that one it may be &quot;too Italian&quot; for some people, but also its pretty clever for an Italian sex comedy, hell, for ANY sex comedy.\n","torrent":{"xt":"urn:btih:07dd3616fc1998d5463e21fff55d598bbf8045cb","amp;dn":"Giovannona+Coscialunga+Disonorata+Con+Onore+%5BXviD+-+Ita+Ac3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07dd3616fc1998d5463e21fff55d598bbf8045cb","infoHashBuffer":{"type":"Buffer","data":[7,221,54,22,252,25,152,213,70,62,33,255,245,93,89,139,191,128,69,203]},"announce":[],"urlList":[]}}