{"title":"Principals Who Learn - Asking the Right Questions + The Six Disc","uid":9365850,"size":3361955,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0811ab57f4707df3d828d2ef586ca138ec74aa1e&amp;dn=Principals+Who+Learn+-+Asking+the+Right+Questions+%2B+The+Six+Disc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MANTESH","files":2,"time":1387412079,"description":"\n\n\n\nPrincipals Who Learn: Asking the Right Questions, Seeking the Best Solutions\n\n\nASCD  \nBarbara Kohm,Beverly Nance\n2007 \nLanguage: English\nISBN-10: 1416605401\nISBN-13: 978-1416605409 \n288 pages  \nPDF \n2.03 MB\n\nAs a principal, you know how challenging it is to build a dedicated staff, encourage parental support, help students get excited about learning, and create a working school culture. You know that it takes a more than a few years (and surviving a few school events gone awry) to gain the trust of staff, students, and community. And you probably think that once these elements are in place, you'll be able to relax and let your school run like a well-oiled machine, right? Wrong. Even the most successful principals can become stuck in tired routines that inhibit collaboration and shut down opportunities for learning and change. \n In Principals Who Learn: Asking the Right Questions, Seeking the Best Solutions, former principals Barbara Kohm and Beverly Nance encourage principals to step out of their comfort zone and pursue learning with their staff. Kohm and Nance give principals the tools to shift from being top-down, authoritarian leaders to becoming open collaborators and continual learners. The authors show principals how to\n Learn to listen to all voices.\n Turn bad guys into allies.\n Develop an open and collaborative culture.\n Redesign staff meetings for more effectiveness.\n Resolve conflicts and solve problems. \n Turn mistakes into learning opportunities.\n\nEngaging scenarios and reflection questions further help principals re-examine their leadership practices and look at their school from new vantage points. Whether you are a new principal seeking guidance or a seasoned veteran looking to make a change, Principals Who Learn will reinvigorate your work and help you develop and adapt your skills to meet the ever-changing needs of your school. \n\nBarbara Kohm worked for 14 years as an elementary school principal and for 10 years as an early childhood program director. She now works as a consultant to principals in a variety of school districts. Beverly Nance worked as a high school assistant principal and a middle school principal. She is now the co-director of the St. Louis Principals Academy and a leadership consultant and mentor for principals in a variety of school districts.\n\n==================================\n\nThe Six Disciplines of Breakthrough Learning\n\n\nPfeiffer \nCalhoun W. Wick,Roy V. H. Pollock ,Andy Jefferson \n2006\nLanguage: English\nISBN-10: 0470526521\nISBN-13: 978-0470526521\n256 pages \nPDF \n1.16 MB\n\nThe Six Disciplines of Breakthrough Learning presents an innovative approach that accelerates the transfer and application of corporate learning. The Six Disciplines provides the definitive road map and tools for optimizing the business impact of leadership and management training, sales, quality, performance improvement, and individual development programs.\n\n\n","torrent":{"xt":"urn:btih:0811ab57f4707df3d828d2ef586ca138ec74aa1e","amp;dn":"Principals+Who+Learn+-+Asking+the+Right+Questions+%2B+The+Six+Disc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0811ab57f4707df3d828d2ef586ca138ec74aa1e","infoHashBuffer":{"type":"Buffer","data":[8,17,171,87,244,112,125,243,216,40,210,239,88,108,161,56,236,116,170,30]},"announce":[],"urlList":[]}}