{"title":"Children of the Red King Series by Jenny Nimmo RELOADED","uid":8249170,"size":2297169,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:08738f930ee92a589e99844c2b83683ed3b47f31&amp;dn=Children+of+the+Red+King+Series+by+Jenny+Nimmo+RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"NewSky000","files":9,"time":1363125348,"description":"Title: Children of the Red King (Charlie Bone) Series\n\nAuthor: Jenny Nimmo\n\nBook(s): 8\n\nFormat: eBook (.epub)\n\nAdditional Info: Readme File\n\n*Calibre is a great free tool for managing ebooks. Link: http://www.calibre-ebook.com/\n\nGenres: Sci-Fi, Fantasy, Mystery, Adventure\n\nSummary:\n\nA magical fantasy that is fast-paced and easy-to-read. Charlie Bone has a special gift- he can hear people in photographs talking.\n\nThe fabulous powers of the Red King were passed down through his descendants, after turning up quite unexpectedly, in someone who had no idea where they came from. This is what happened to Charlie Bone, and to some of the children he met behind the grim, gray walls of Bloor's Academy.\n\nCharlie Bone has discovered an unusual gift-he can hear people in photographs talking! His scheming aunts decide to send him to Bloor Academy, a school for genius's where he uses his gifts to discover the truth despite all the dangers that lie ahead. - Goodreads Summary of Midnight for Charlie Bone (The Children of the Red King #1)\n\nNote: Recommendable for a younger and young adult audience. Similar to J.K. Rowling's &quot;Harry Potter&quot; series, and is advisable for those who like the idea of magic and a school for gifted individuals. The titles are a cross between the European and the American ones, so that they're equally distributable. Happy Reading!\n\nCompatibility: Most eReaders\n\nCovers: Yes\n\nMetadata: Yes\n\nRELOADED: This torrent is a reload of the original for the purpose that it had belonged to the first generation of torrents MastermindTTA had uploaded. It lacked quality, and this torrent is improved with fresher covers, included good metadata and a [helpful] readme file. Enjoy!\n\nAny requests? Concerns? Comments? Anything of the sort? Then plz view readme for support link.\n\n\nPlease seed and thanks for downloading!\n\n\n\nBy: MastermindTTA ~ Thanks for the support!","torrent":{"xt":"urn:btih:08738f930ee92a589e99844c2b83683ed3b47f31","amp;dn":"Children+of+the+Red+King+Series+by+Jenny+Nimmo+RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08738f930ee92a589e99844c2b83683ed3b47f31","infoHashBuffer":{"type":"Buffer","data":[8,115,143,147,14,233,42,88,158,153,132,76,43,131,104,62,211,180,127,49]},"announce":[],"urlList":[]}}