{"title":"MILVIZ - F-15E STRIKE EAGLE 'CRACKED'","uid":7268268,"size":548305434,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:08a4bcd11fa3d9aa841bbfaebc26e691b8793301&amp;dn=MILVIZ+-+F-15E+STRIKE+EAGLE+%27CRACKED%27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"alef1995","files":4,"time":1336973321,"description":"High Performance and Packed with Features!\n\nThe F-15E Strike Eagle model depicted in this package is a highly detailed replica of its real-life counterpart. The model was created by using high quality digital photos and many, many countless hours of testing, revising and testing again! This is, bar none, as close as most of us will ever get to the real thing!\n\nThe aircraft has a max range of 2100 nautical miles, and a top speed of Mach 2.4 so you can travel far and fast with ease. Other outstanding features of this aircraft are:\n\n    Realistic startup and shutdowns\n    Quick start (two clicks, wait for spool up and you're off)\n    Realistic weapons, radar and targeting procedures\n    Realistice weapons release and hits with destruction of targets and all that entails\n    Realistic systems and avionics\n    High quality VC using normal and specular maps\n    High quality external model using normal and specular maps\n    9 HD different liveries created by Gunnar Meeren\n    High resolution paint kit\n    Highly detailed Pilots Operating Handbook: includes all performance charts and figures. If you choose to, you can fly by the numbers, or fly as casual as you wish!\n    High quality sound set recorded from a real F-15E.\n    Realistic night lighting, landing lights and custom effects.\n    Flight dynamics tested and tuned by a real pilots. The aircraft flies just like its real world counterpart!\n    Aircraft features an exterior model manager that enables you to load different weapons and fuel tanks. Weight distribution and fuel will be added or subtracted as you add or remove items.\n    Many different weapons including but not limited too, Aim-9's, Amraam's, CBU-87's, Mk 82's and GBU-12's\n    All weapons can be fired and or dropped\n    All weapons and tanks can be jettisioned\n    Weapons add weight to your plane\n    Ability to hide the stick in 3D VC enabling the pilot to access certain switches normally obscured from view by the yoke.\n    Multiplayer capable so you can fight and shoot each other down\n    Operating hook\n    AI pack with enhanced airbases!\n\nThis product has certain limitations. These are included in the manual. It is highly recommended that you read this before purchasing. (click here to download the manual) \n\n\n\n\n\n\n\n   ********************************Alef1995*******************************\n\nREQ A beer and VRS SUPERBUG X :) ","torrent":{"xt":"urn:btih:08a4bcd11fa3d9aa841bbfaebc26e691b8793301","amp;dn":"MILVIZ+-+F-15E+STRIKE+EAGLE+%27CRACKED%27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08a4bcd11fa3d9aa841bbfaebc26e691b8793301","infoHashBuffer":{"type":"Buffer","data":[8,164,188,209,31,163,217,170,132,27,191,174,188,38,230,145,184,121,51,1]},"announce":[],"urlList":[]}}