{"title":"The.Nick.s01e01.EN.SUB.WEBRIP.[MPup]","uid":12352161,"size":538134920,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:08b23bdde2290704955ba601f982c4614c14e1b5&amp;dn=The.Nick.s01e01.EN.SUB.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1441439765,"description":"The.Nick.s01e01.EN.SUB.WEBRIP.[MPup]\n\nFormat: MPEG-4\nSize: 704x396\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\n[b]1 of 3[/b]\n\nThree-part documentary series about life at Brighton police station - one of the country's largest - from initial call outs to arrests and from briefings to raids.\n\n[img]http://extraimago.com/images/2015/09/05/8fc1abbe764047c890e61a1bf23528fd.jpg[/img]\n\nIn the first programme officers are seen dealing with a dangerous prowler preying on lone women, a raid on a drugs den and the aftermath of a bloody glassing after a Friday night fracas.\n \nAt the daily CID briefing Detective Sergeant Julie Greenwood briefs her team on an incident where a woman alone at home at night found a man standing in her front room. When the woman challenged him, he fled from the property. Officers believe the prowler is linked to an incident the previous week when a young woman awoke to find a man sexually touching her in bed.\n \nA potential suspect is raised who fits the description given at both incidents. He's a rapist recently released from prison, and is living close to one of the victims. The officers need to arrest him and put him on an ID parade.\n \n While Julie's team are handling the investigation into the prowler, the cameras follow other officers as they plan a major operation to carry out a night time raid on a drugs den to catch a drug dealer. Intelligence has indicated more than 200 bags of heroin are in the property.\n \nAfter securing a warrant to enter the property, the officers have to carry out a comprehensive risk assessment to ensure their own safety. Detective Sergeant Dee Wells says two of the main reasons officers want to do the job is to &quot;nick burglars and drug dealers, to get people off the streets and catch them in the act&quot;. \n \nThe officers' investigations reveal a previous firearm incident at the address. The raid on the drugs den has to be postponed until the following morning because it is considered too dangerous without the help of specially trained officers.\n \nWith specially trained officers the raid on the drugs den can go ahead. The cameras follow the officers as they break into the flat. Once the three occupants have been removed, the team conduct a thorough search of the property. They don't find the heroin they expected, however they do uncover a large quantity of other drugs, enough to charge the occupants with possession with intent to supply.\n \nThe officers are also called to raid a flat connected to a gang of money launderers. The flat is empty but their search reveals a huge haul of cocaine with a potential value of Â£60,000.\n \nOut on the busy streets of Brighton on a Saturday night officers are trying to keep control of the revellers. \n \nOne man has had a glass smashed on his head, and has to go to hospital. At first he tells police he has no idea of who attacked him, or why. As the investigation continues it appears there's a previous fracas that the man is involved in that evening. However an extensive trawl through CCTV fails to reveal any evidence of the incident. With no forensic evidence either it is one crime which has to be filed undetected","torrent":{"xt":"urn:btih:08b23bdde2290704955ba601f982c4614c14e1b5","amp;dn":"The.Nick.s01e01.EN.SUB.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08b23bdde2290704955ba601f982c4614c14e1b5","infoHashBuffer":{"type":"Buffer","data":[8,178,59,221,226,41,7,4,149,91,166,1,249,130,196,97,76,20,225,181]},"announce":[],"urlList":[]}}