{"title":"Fluid Catalytic Cracking - Science and Technology","uid":12080209,"size":28084229,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:08fd0bec2ebd261f3fe6b2520cda835c80506769&amp;dn=Fluid+Catalytic+Cracking+-+Science+and+Technology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"clouderone","files":1,"time":1435743311,"description":"Fluid Catalytic Cracking - Science and Technology (Studies in Surface Science and Catalysis 76)(Elsevier, 1993).pdf\n\nISBN: 0-444-89037-8\n\nThe primary focus of this book as a whole is on performance - performance of the catalyst, of its surface, of the FCC unit, of the feedstocks employed, of the analytical methods used to characterize the catalysts, and of environmentally directed regulations that govern the production of transportation fuels from petroleum. The emphasis on catalyst performance, particularly commercial performance, essentially dictated that the chapter authors be experienced industrial catalytic chemists and engineers. However, each author approached the task with a clear-cut obligation to connect the roots of the science of FCC catalysis with the technology.\nFluid Catalytic Cracking: Science and Technology has been written for workers in industrial catalysis and academia, including graduate students in chemistry or chemical engineering who are interested in acquiring an overall knowledge of one of the world's most important areas of catalysis. The book is concise, each topic is treated briefly; complete, all aspects of FCC catalysis are covered; and clear, anyone involved in this field will find topics of interest","torrent":{"xt":"urn:btih:08fd0bec2ebd261f3fe6b2520cda835c80506769","amp;dn":"Fluid+Catalytic+Cracking+-+Science+and+Technology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08fd0bec2ebd261f3fe6b2520cda835c80506769","infoHashBuffer":{"type":"Buffer","data":[8,253,11,236,46,189,38,31,63,230,178,82,12,218,131,92,128,80,103,105]},"announce":[],"urlList":[]}}