{"title":"Esparta -Codigo De Honor  [dvdrip](Documental)[spanish]","uid":5731464,"size":711249868,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:091ef26220eb092a85dfe96df66375592a2b6270&amp;dn=Esparta+-Codigo+De+Honor++%5Bdvdrip%5D%28Documental%29%5Bspanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":1,"time":1280622367,"description":"Capitulo 1: CÃƒÂ³digo de Honor\n\nCorrÃƒÂ­a el aÃƒÂ±o 480 a. C.. En la estrecha confluencia de la ciudad de Salamina, una falange de 7.000 guerreros griegos y unos 300 espartanos avanzan contra las fuerzas de cientos de persas invasores. Durante tres dÃƒÂ­as de duros combates, las diezmadas filas de espartanos soportan la arremetida del voraz ataque persa en una resistencia sin igual que minÃƒÂ³ gravemente la moral del enemigo invasor. Fue uno de los momentos decisivos en la historia de Occidente. Ã‚Â¿Quienes lucharon en una batalla perdida de antemano para defender su virtud y a su paÃƒÂ­s? Ã‚Â¿QuÃƒÂ© tipo de hombres combatieron metÃƒÂ³dicamente para escapar de la muerte?\n\nPara dar respuesta a estas preguntas, en CÃƒÂ³digo de honor, se analiza la estructura social y de gobierno de Esparta. Su estricto sentido de la moral y su estoica manera de vivir, sin lujos superfluos y atentos siempre a las necesidades del Gobierno, los convirtieron en un pueblo prÃƒÂ³spero que buscaba la igualdad entre sus ciudadanos. El arte de la guerra, en el que no fueron demasiado innovadores, a pesar de haber forjado una leyenda, supeditÃƒÂ³ el resto de las facetas de la vida social. AsÃƒÂ­, las artes tales como la arquitectura, la poesÃƒÂ­a o el teatro no tuvieron cabida dentro del modelo espartano, al contrario de lo que ocurrÃƒÂ­a en la floreciente Atenas. La violencia y la conquista se convirtieron en la ÃƒÂºnica forma de vida aceptada, para lo cual el gobierno debÃƒÂ­a inmiscuirse en todos los aspectos de la vida social. AsÃƒÂ­ pues, el espacio explica cÃƒÂ³mo nada mÃƒÂ¡s dar a luz se llevaba a cabo la primera selecciÃƒÂ³n: aquellos niÃƒÂ±os que nacÃƒÂ­an con algÃƒÂºn defecto o que no iban a ser aptos para la guerra eran abandonados por sus padres. Este singular mÃƒÂ©todo aseguraba la posibilidad de tener una raza fuerte de guerreros que perpetuaran el modelo espartano. El fÃƒÂ©rreo entrenamiento militar al que se sometÃƒÂ­a desde los siete aÃƒÂ±os a los niÃƒÂ±os y la dedicaciÃƒÂ³n plena y absoluta de las mujeres a la tarea de traer al mundo hijos se convirtiÃƒÂ³ en uno de los pilares fundamentales sobre los que se sustentaba la civilizaciÃƒÂ³n espartana. CÃƒÂ³digo de honor profundiza, asimismo, en la marcada divisiÃƒÂ³n social que perseguÃƒÂ­a conseguir la estabilidad, el orden y, sobre todo, la obediencia.","torrent":{"xt":"urn:btih:091ef26220eb092a85dfe96df66375592a2b6270","amp;dn":"Esparta+-Codigo+De+Honor++%5Bdvdrip%5D%28Documental%29%5Bspanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"091ef26220eb092a85dfe96df66375592a2b6270","infoHashBuffer":{"type":"Buffer","data":[9,30,242,98,32,235,9,42,133,223,233,109,246,99,117,89,42,43,98,112]},"announce":[],"urlList":[]}}