{"title":"G.S. Jennsen - Sidespace (Aurora Rhapsody #4)","uid":13573807,"size":163196177,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0933c583f7e946a2e6de509f6dd85b3665c6b255&amp;dn=G.S.+Jennsen+-+Sidespace+%28Aurora+Rhapsody+%234%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Cybotage","files":1,"time":1455690725,"description":"\nHumanity is saved. But its troubles are just beginning.\r\n\r\nTo achieve their extraordinary triumph over the invading Metigen armada, humanity put aside its myriad of political and social conflicts and united against a common foe intent on annihilating civilization. In victory, unparalleled peace and prosperity are theirs for the taking - if they can keep hold of them.\r\n\r\nWhen the secrets behind the daring plan that defeated the Metigens begin to escape the shadows, the very people who won the war find their lives in danger. Facing antisynthetic terrorists who want them dead, power-hungry politicians who want them chained, and a rapidly dwindling number of people they can trust, the Prevos - human/synthetic meldings who shouldn't exist - must take their fate into their own hands - and, with it, the fates of everyone.\r\n\r\nFifty-one Portals. Fifty-one Universes. One mysterious gateway connecting them all.\r\n\r\nIn Aurora Rising, humanity discovered it was not alone - but few grasp the true magnitude of the discovery. Intent on learning the purpose behind the Metigens' elaborate multiverse network, Alex Solovy, Caleb Marano, and Valkyrie embark on a gripping journey through the network's portals, each one leading to a universe not their own. In a mosaic of spaces inhabited by fantastical aliens and worlds both beautiful and deadly, they will be forced to question everything they thought they knew, including the nature of life itself.\r\n\r\nIt is a time of accelerating technological change and shifting allegiances as the old rules fall away and the old balance of power is upended. A new world rises - one of unshackled AIs, indestructible starships, ethereal quantum spaces, and potent new weapons - and the race is on to determine who will control its future. \r\n\r\n\r\nNarrated by: Pyper Down\r\nLength: 11 hrs and 17 mins \r\nFormat: M4A\r\nBitrate: 32 Kbps\r\nUnabridged Audiobook\r\nRelease Date:02-05-16\r\nPublisher: Hypernova Publishing","torrent":{"xt":"urn:btih:0933c583f7e946a2e6de509f6dd85b3665c6b255","amp;dn":"G.S.+Jennsen+-+Sidespace+%28Aurora+Rhapsody+%234%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0933c583f7e946a2e6de509f6dd85b3665c6b255","infoHashBuffer":{"type":"Buffer","data":[9,51,197,131,247,233,70,162,230,222,80,159,109,216,91,54,101,198,178,85]},"announce":[],"urlList":[]}}