{"title":"Renzo Gracie Legacy","uid":4511600,"size":1860683365,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:09473388e7dc1a4fa2701688259c4b8039acd16e&amp;dn=Renzo+Gracie+Legacy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Midnighter_Tribe","files":16,"time":1226795796,"description":"The name &quot;Gracie&quot; is synonymous with jiu-jitsu and Mixed Martial Arts, one of the world's fastest rising cultural phenomenon. While the stories of some of the original Gracie jiu-jitsu masters'Ã‚Â¦Royce, Rorion'Ã‚Â¦have been told, this new film will look at the man who is responsible for the sports unprecedented growth in the United States today'Ã‚Â¦Brazilian Renzo Gracie. The film follows Gracie from his early days learning the sport in his native Brazil to his time coming to New York and becoming first a world champion, and then a master instructor from the streets of Sao Paulo to Japan and even Abu Dhabi. Renzo Gracie: Legacy provides a rare look into the making of an MMA champion and coach, through the eyes of one of the most respected stars of the sport.\n\nThis 78 min. long documentary was filmed over a 10 year period from the days when Renzo fought bare knuckle in a cage where there were little or no rules. After the fights are banned from US television he follows the fight scene to Japan where his skill, honor, and refusal to give up, even when suffering brutal injuries, make him a huge star.\n\nWhile others fight for fame and glory, Renzo is driven by a will to honor the family legacy. Although he continues to test himself in competition against the best on the planet, his passion for his art is equalled by a need to pass on his skills and experience. As another generation rises under his tuition, Renzo fights on into his late 30's when injuries and a downturn in his fight record signal an end to his career. He returns to his roots and mentors in Brazil to consider his future and reaches the only decision he can live with.\n\nReturning to the US, his comeback catches a new wave of national interest. After being profiled on 60 minutes, the fight attracted 17 million American viewers and became the highest viewed in MMA history.\n\nI ripped the entire DVD with the extras also.\n\nHelp me seed this, please, I have so many uploads I have to turn off some other torrents in order to get this out.","torrent":{"xt":"urn:btih:09473388e7dc1a4fa2701688259c4b8039acd16e","amp;dn":"Renzo+Gracie+Legacy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09473388e7dc1a4fa2701688259c4b8039acd16e","infoHashBuffer":{"type":"Buffer","data":[9,71,51,136,231,220,26,79,162,112,22,136,37,156,75,128,57,172,209,110]},"announce":[],"urlList":[]}}