{"title":"Personal Finances Pro v5.4 Incl Crack [TorDigger]","uid":8977982,"size":32547543,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:094f221f910ac9df40be6c0d38e7174b9296cae4&amp;dn=Personal+Finances+Pro+v5.4+Incl+Crack+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TorDigger","files":12,"time":1380489562,"description":"Personal Finances Pro\n\nIt is a home accounting software. It tracks all your expenses, logging the regular ones automatically. You can easily compare family gains and losses and estimate the efficiency of using home budget resources. The features which make Personal Finances unique in its category are total simplicity and clearness. You can see at once from the summary view the way your money was spent, total sum and percentage structure for categories, balance on accounts, as well as overall balance. There is no need to scrutinize the reports in order to analyze your financial condition. The program is supplied with ability of logging regular transactions automatically. You may also install and run the application from the USB flash drive; consequently, your &quot;personal accountant&quot; will be portable and always at hand!\n\nMain resources:\n\n- Unlimited number of accounts, currencies, categories and sub-categories.\n- Logging the regular transactions automatically using scheduler. Calendar view\n- Summary view, graphs and reports, printing, export and import data.\n- Customizable user fields, sorting by any field, search, grouping transactions by names.\n- Password protection, categories, tags and family members.\n\nSome handy features:\n\n- The QExpense feature will help the user enter frequently repeated transactions, without the need to fill in all transaction details into the form again\n- Create a copy. Any transaction can be copied and edited (if necessary).\n- AutoFill. With this handy feature, one can get a transaction name filled in automatically.\n- Save date of the last entered transaction. This feature allows the user to easily create several transactions &quot;post factum&quot;, without the need to specify the date of every new transaction again and again.\n\nKey features:\n\nThe concept behind the program lies in grouping expenses and income into categories. This is useful because one can see where money is going and how much is spent at a single glance, without the need to examine the reports. The system of categories is designed as a tree that may have the unlimited number of sub categories. Each category may fall into sub categories, each of which may further fall into more sub categories. Additionally, expenses and income can be grouped by family members and assigned special tags. This allows the user to see the flow of money in general and then drill down into details.\n\nTransactions\nThe key notion of the program is a transaction, which stands for any expense, income or transfer of money from one account to another.\n- Sort by any field, grouping by categories, tags and family members.\n- Three additional user customizable fields for each transaction.\n- Search, any time range and printing.\n\nScheduler\nThe scheduler allows the user to create recurring transactions automatically. Such transactions will be entered by the program automatically at a preset time, without any user interference.\n- Flexible schedule: each week, two weeks, month, year, weekdays and more.\n- Planned transaction state and nearest response time.\n- Search, groups, sorting and printing - all featutes available.\n\nCalendar\nCalendar is very useful tool to view transactions grouped by days and accounts totals on each day in past and future including scheduled transactions.\n- Any time range: week, two weeks, month, two months and so on.\n- Account state, balance, transactions and scheduler on any date in past and future.\n- Printing.\n\nReports\n\nGraphs and reports. Income/Expense, categories, tags and family members summary.\n- Pie charts, donuts and bars.\n- Printing, export to html\n\nChanges:\n\nVersion 5.4\n\nRealeased: 28.08.2013\n\n-Budget entries grouping (by categories, family members, etc)\n-Budget activity interval (begin and end dates)\n-Few minor bugs fixed\n\nSystem requirements:\n\nWindows NT/2000/XP/Vista/7/8 (32/64bit)\n40Mb of free disk space\n\nHomepage: http://www.financessoftware.com/\n\nInstallation Instructions:\n\n- Install program.\n- Copy content from crack folder and paste into default installation directory.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:094f221f910ac9df40be6c0d38e7174b9296cae4","amp;dn":"Personal+Finances+Pro+v5.4+Incl+Crack+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"094f221f910ac9df40be6c0d38e7174b9296cae4","infoHashBuffer":{"type":"Buffer","data":[9,79,34,31,145,10,201,223,64,190,108,13,56,231,23,75,146,150,202,228]},"announce":[],"urlList":[]}}