{"title":"Star Trek Voyager - Elite Force 1 (PC)","uid":4037545,"size":992524189,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0958ebff82bb99bef65e4671e2444c922be963e9&amp;dn=Star+Trek+Voyager+-+Elite+Force+1+%28PC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Sanicle","files":4,"time":1203515693,"description":"-=STAR TREK VOYAGER - ELITE FORCE 1=-\nI have been frustrated at how many copies of Elite Force II are freely available for torrenting, yet there are no copies of Elite force 1. Eventually I downloaded this from Rapidshare and have decided to upload it here, along with its expansion pack. Cracks, disk images, contained files and files created by installing the game have all been tested clean using Nod32 AntiVirus. Both single Player and Holomatch (Multiplayer) game modes have also been tested as working, although holomatch doesn&amp;#039;t like downloading new maps from servers.\n\n-=FILE DETAILS=-\nDISC IMAGES\nStar_Trek_Elite_Force.iso (676,198,400 bytes)\nExpansion_Pack.iso (315,594,752 bytes)\n\nDOCUMENTS\nReadme.nfo (2,591 bytes)\n\nCRACKS\nCracks.zip (728,446 bytes)\n\nContents of Zip Archive\nstvoy.exe (675,840 bytes)\nstvoyHM.exe (925,696 bytes)\n\n-=INSTRUCTIONS FOR USE=-\nDownload with any bit torrent client, uTorrent recommended. Mount Star_Trek_Elite_Force.iso using Daemon Tools and follow the installation instructions. Once done, mount Expansion_Pack.iso and follow the installation instructions for it. Use the following key when prompted C5-QCLS-0FLT 00RA-0001. You are done with the standard installation procedure now. To crack the game, you now need to extract both files from cracks.zip to the game directory. On a default installation this will be &quot;C:Program FilesRavenStar Trek Voyager Elite Force&quot;. Lastly, the first time you play Holomatch (multiplayer mode) you will be prompted for another key. WRITE THIS KEY DOWN before launching holomatch as it does not support Alt-Tabbing! The Key for Holomatch is c33r-rx69-ftcy-nbhp-75. If you forget to write down the key you can type it in later, by using Holmatch&amp;#039;s in game configuration screen. Enjoy!\n\nAs an alternative to mounting images in Daemon Tools you may wish to burn them to CD using your favorite CD/DVD writing software. The game should still run fine using physical discs instead of image files, but do please test them before deleting the files.\n\nThis game requires no patching as the expansion pack comes with the last released patch for Elite Force.\n\n-=DISCLAIMER=-\nI am uploading this purely because it is an old game and no longer in production, therefore it is hard to find. If you like the game and do happen to find a copy then please buy it.\n\n-=MISC=-\nPlease ensure that you seed up to at least a 1/1 ratio. Most torrent programs will do this automatically once download is complete up to a 1.5/1 ratio or until you stop them, and it helps keep the torrent scene alive. Thank you.","torrent":{"xt":"urn:btih:0958ebff82bb99bef65e4671e2444c922be963e9","amp;dn":"Star+Trek+Voyager+-+Elite+Force+1+%28PC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0958ebff82bb99bef65e4671e2444c922be963e9","infoHashBuffer":{"type":"Buffer","data":[9,88,235,255,130,187,153,190,246,94,70,113,226,68,76,146,43,233,99,233]},"announce":[],"urlList":[]}}