{"title":"Suk: Symphony in E / Ostrcil: Calvary - CzPO, Neumann (1994)","uid":15604571,"size":403271045,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0966deae3466a5ad76661962ead4e7828314d31b&amp;dn=Suk%3A+Symphony+in+E+%2F+Ostrcil%3A+Calvary+-+CzPO%2C+Neumann+%281994%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"Scheheraz","files":35,"time":1471701566,"description":"http://cps-static.rovicorp.com/3/JPG_500/MI0000/996/MI0000996211.jpg\r\n\r\nMusicWeb(UK) [August 2001\r\n&quot;The Suk Symphony had its genesis during the Czech Quartet's English tour in 1897. The work-in-progress was shelved when the composer was commissioned to write the music for Julius Zeyer's Raduz and Mahulena. This is early Suk and is in an unsurprisingly Dvorakian track. As yet it is free from the darkening that changes charming invention into the gripping equivocality of Epilogue and Asrael. Dvorak's Ninth would go well with this work. In the allegro vivace the first gripings of Suk's eldritch side shudder into the spotlight. The Allegro is smooth and takes us towards Schubert's Great C major but with the snap and zest of the scherzo from Dvorak 5 and 6.\r\nOstrcil's Calvary Variations are no soft touch - having more in common with the Sinfonietta of seven years earlier than with his Symphony of the 1900s. There is a shiver and a howl in these pages that is quite remarkable for the 1920s and especially for Czech art of that era. Intriguing to think that while in England the 1920s signalled the rise of music concerned with frivolity and popular culture, works of this grim jaw-set were being written in Prague. I am not familiar enough with Ostrcil's music to know what he sounded like before the Great War. What brought about this change? The notes tell us that he was a committed Christian so clearly this work must have had special significance. Was he racked with doubts? At surface level there is little here of obvious affirmative value, of exaltation or of spiritual uplift. This work seems to take up where the nightmare episodes in Suk's Asrael left off. In the Allegro the caco-daemons stoke the fires and the bass drum thuds provide us with clear reminders of Asrael. This is no obvious lyrical prayer but a far from facile, far from predictable dissection of the cry - Eloi, Eloi Sabachtoni'. In its own early twentieth century way it is an even bleaker and more courageous work than the despair and tender cradling of Allan Pettersson's Seventh Symphony. The Ostrcil is a work that impresses through its unwavering consistency and valour; not, however, the most loveable of pieces. Ostrcil conducted the premiere on 12 March 1929.\r\nGood notes, decent recording quality and generous playing time. Commended to the adventurous though the styles of the two works are perhaps unlikely to appeal to the same person.&quot; --Rob Barnett\r\n\r\nJosef Suk (1874-1935)\r\nSymphony in E major, Op. 14\r\n01. I. Allegro, ma non troppo 13:18\r\n02. II. Adagio 11:50\r\n03. III. Allegro vivace 6:49\r\n04. IV. Allegro 14:21\r\nOtakar Ostrcil (1879-1935)\r\nVariations for Large Orchestra, Op. 24\r\n&quot;Calvary&quot;\r\n05. I. Grave 1:34\r\n06. II. Poco andante, quasi marcia funèbre att. 2:56\r\n    III.\r\n07. IV. Molto adagio — Poco più mosso 2:33\r\n08. V. Poco con moto 1:32\r\n09. VI. Adagio 1:46\r\n10. VII. Allegro non troppo 1:50\r\n11. VIII. Moderato assai 2:30\r\n12. IX. Allegro 2:19\r\n13. X. Molto lento att. 2:49\r\n    XI. A tempo sostenuto\r\n14. XII. Lento — Agitato 4:54\r\n15. XIII. Lento 3:46\r\n16. XIV. Largo 2:04\r\n\r\nCzech Philharmonic Orchestra\r\nVáclav Neumann\r\n\r\nRecorded at the Dvořák Hall of Rudolfinum, Prague, on 10 March, 1982 (1-4), and on 27 February and 2 March, 1979 (5-16)\r\nRecording directors: Zdeněk Zahradník (1-4), Milan Slavický (5-16)\r\nRecording engineers: Stanislav Sýkora (1-4), Václav Roubal (5-16)\r\nEditor: Milan Novotný\r\nMade in the Czech Republic\r\n® 1984, 1979 Supraphon a.s. / This Compilation © 1994 Supraphon a.s.\r\n11 1964-2 031","torrent":{"xt":"urn:btih:0966deae3466a5ad76661962ead4e7828314d31b","amp;dn":"Suk%3A+Symphony+in+E+%2F+Ostrcil%3A+Calvary+-+CzPO%2C+Neumann+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0966deae3466a5ad76661962ead4e7828314d31b","infoHashBuffer":{"type":"Buffer","data":[9,102,222,174,52,102,165,173,118,102,25,98,234,212,231,130,131,20,211,27]},"announce":[],"urlList":[]}}