{"title":"Bertie.and.Elizabeth.2002.EN.SUB.WEBRIP.[MPup]","uid":12360299,"size":1085069593,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:09ec5f7c47569fe27e972e2191ba79a565d43d14&amp;dn=Bertie.and.Elizabeth.2002.EN.SUB.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"makinapufterpup","files":2,"time":1441525968,"description":"Bertie.and.Elizabeth.2002.EN.SUB.WEBRIP.[MPup]\nThe Story of King George VI &amp; Queen Elizabeth\n\nFormat: MPEG-4\nSize: 896x504\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nJuliet Aubrey and James Wilby star in this enchanting feature-length portrayal of the life of Queen Elizabeth, the Queen Mother, focusing on her courtship by the shy, future George VI.\n\n[img]http://extraimago.com/images/2015/09/06/8b02767c50ffd41814bbd5c89e5f0438.jpg[/img]\n\nA chronicle of the life of George VI, who was forced to become King following the abdication of his brother Edward VIII, and his relationship with his wife, Elizabeth.\n\nWars, kings, and politicians come and go, but love endures. Bertie &amp; Elizabeth charts one of the greatest love stories of the century: the love affair between Elizabeth Bowes-Lyon, a beautiful fun-loving young woman from an aristocratic Scottish family and the Duke of York, a shy young man second in line to the throne. Married in 1923, they are thrust into the limelight in 1936 when Bertie's older brother, Edward VIII, abdicates to marry the twice-divorced American socialite Wallis Simpson. As George VI and Queen Elizabeth, they inspire a nation. A superb British cast brings this memorable story to life.\n\nThe film opens in 1920, when the dashing but diffident Bertie steals a dance with the radiant 19-year-old Elizabeth. Their happy family life with daughters Elizabeth and Margaret contrasts sharply with the playboy lifestyle of the heir to the throne, Edward VIII, known as David. Charming and headstrong, he forces a constitutional crisis in his first months as king when he insists on marrying Wallis Simpson, whom his ministers find detestable.\n\nUnexpectedly thrust upon the throne, Bertie's natural dignity and Elizabeth's engaging warmth make them a perfect royal pair. They come into their own during the darkest days of World War II. During the Blitz, they cheer their subjects by touring bombed-out neighborhoods. Aware of the couple's importance to British morale, the Nazis bomb Buckingham Palace but narrowly miss their intended victims.\n\nA heavy smoker all his life, Bertie succumbed to cancer in 1952. His daughter Elizabeth assumed the throne and his widow became the Queen Mother, the most enduringly popular member of the royal family. The &quot;Queen Mum&quot; died in March of 2002 at 101","torrent":{"xt":"urn:btih:09ec5f7c47569fe27e972e2191ba79a565d43d14","amp;dn":"Bertie.and.Elizabeth.2002.EN.SUB.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09ec5f7c47569fe27e972e2191ba79a565d43d14","infoHashBuffer":{"type":"Buffer","data":[9,236,95,124,71,86,159,226,126,151,46,33,145,186,121,165,101,212,61,20]},"announce":[],"urlList":[]}}