{"title":"Textbook of Hysteroscopy (Jaypee) [PDF] [StormRG]","uid":11149421,"size":14739160,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a0017004f387c6bd6e7812b95c2246a04b225dd&amp;dn=Textbook+of+Hysteroscopy+%28Jaypee%29+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"0xmovva","files":2,"time":1412308982,"description":"Author: Nandita Palshetkar (Author), Rishma Dhillon Pai (Author), Hrishikesh D. Pai (Author)\nPaperback: 296 pages\nPublisher: Jaypee Brothers Medical Pub; 1 edition (October 2012)\nLanguage: English\nISBN-10: 9350257815\nISBN-13: 978-9350257814\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds forthe seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nKey Features\nExcellent hysteroscopy text that aims to meticulously cover the role of hysteroscopy, both diagnostic and therapeutic in clinical gynecology and infertility practice\nSection that offers crucial, practical information on the hysteroscope and other related additional equipment\nChapters are relevant, complete, and easy-to-understand procedures are described in detail and fully illustrated with color photographs\nStep-by-step descriptions of common operative surgical techniques and practical hints on hysteroscopy procedures\nComplications are highlighted with authoritative guidance on how to avoid and manage them\nTechnical edge over other texts on this subject, written by internationally respected professionals Provides solid grounding in the art and science of hysteroscopy\nStrongly recommended for all gynecologists in training and also to those in practice.","torrent":{"xt":"urn:btih:0a0017004f387c6bd6e7812b95c2246a04b225dd","amp;dn":"Textbook+of+Hysteroscopy+%28Jaypee%29+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a0017004f387c6bd6e7812b95c2246a04b225dd","infoHashBuffer":{"type":"Buffer","data":[10,0,23,0,79,56,124,107,214,231,129,43,149,194,36,106,4,178,37,221]},"announce":[],"urlList":[]}}