{"title":"Disney - MMC - Micky Mouse Club - Video Clips","uid":4965445,"size":18158436352,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0a384a768a99bf38ed3177f03132bdb1335d3ad4&amp;dn=Disney+-+MMC+-+Micky+Mouse+Club+-+Video+Clips&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Mayweed2000","files":261,"time":1245512204,"description":"Here are a whole lot of MMC (Mickey Mouse Club) clips from Seasons 1-5.\n\nI looked around, and you cannot find these ANYWHERE.  Will the Disney Company release them on video?  I doubt it.  Are there DVD copies of these clips?  Only in the Disney vaults, never to be opened again.\n\nSo, please be aware that these are NOT DVD copies.  They are ripped from VCR tapes I had stashed away in a closet in the attic for 15+ years.  Given the fact that they are not DVD rips, I would give the Video a 7 and the Audio an 8.  Sometimes the audio trips out, but it only happens a couple of times, and it's brief.\n\nAre they watchable?  Absolutely.  Some of them are suprisingly pretty good quality.  I'm sure there are a lot of people out there in their 20's or maybe even in their 30's who have been wishing to see some of these again....well here's your chance.\n\nAgain, as with my other Disney torrents, my upload speed is not that great, so please be patient.  I'm hoping this will bring back some great memories for people out there.\n\nOh....also, this is only seasons 1-5....if you're looking for Britney, Christina or Justin, you won't find them here.  I lost interest in the show after the 5th season....I felt that whoever was in charge of the show went from cute to sexy.  The show USED to be cute, but the last two years were a bit too adult-ish.\n\nEnjoy, and please seed!\n\nMayweed2000","torrent":{"xt":"urn:btih:0a384a768a99bf38ed3177f03132bdb1335d3ad4","amp;dn":"Disney+-+MMC+-+Micky+Mouse+Club+-+Video+Clips","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a384a768a99bf38ed3177f03132bdb1335d3ad4","infoHashBuffer":{"type":"Buffer","data":[10,56,74,118,138,153,191,56,237,49,119,240,49,50,189,177,51,93,58,212]},"announce":[],"urlList":[]}}