{"title":"Bulldog Drummond (16 films)[1929-1969)","uid":6411329,"size":11505456089,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0a391fdd72d13804d759522d4ae27ee85d992afe&amp;dn=Bulldog+Drummond+%2816+films%29%5B1929-1969%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":null,"files":49,"time":1305984920,"description":"Movies : Mystery : DVD Rip : English\nNMR\n\n\n\n\n\n(1929)\nBulldog Drummond\nDirected By: F. Richard Jones\nWritten By: Herman C. McNeile, Sidney Howard\nGenre: Drama, Mystery, Thriller\nRating: 6.7 Country: USA\nSeen: No Language: English\nPlot\nHugh 'Bulldog' Drummond is a British WWI veteran who longs for some excitement after he returns to the humdrum existence of civilian life. He gets what he's looking for when a girl requests his help in freeing her uncle from a nursing home. She believes the home is just a front and that her uncle is really being held captive while the culprits try to extort his fortune from him.\n\nCast\nRonald Colman (Hugh Drummond), Claud Allister (Algy Longworth (as Claude Allister)), Lawrence Grant (Dr. Lakington), Montagu Love (Peterson), Wilson Benge (Danny), Joan Bennett (Phyllis), Lilyan Tashman (Irma), Charles Sellon (Travers), Adolph Milar (Marcovitch), Tetsu Komai (Chong), Gertrude Short (Barmaid), Donald Novis (Country Boy), Tom Ricketts (Colonel (uncredited))\n\n\n\n\n\n(1937)\nBulldog Drummond at Bay\nDirected By: Norman Lee\nWritten By: Patrick Kirwan, Herman C. McNeile\nGenre: Mystery\nRating: 6.1 Country: UK\nSeen: No Language: English\nPlot\nBulldog Drummond goes up against foreign agents trying to steal plans for a top-secret aircraft.,\n\nCast\nJohn Lodge (Hugh Drummond), Dorothy Mackaill (Doris Thompson), Victor Jory (Gregoroff), Claud Allister (Algy Longworth), Hugh Miller (Ivan Kalinsky), Leslie Perrins (Maj. Grayson), Richard Bird (Caldwell), Brian Buchel (Meredith), Jim GÃƒÂ©rald (Veight), Maire O'Neill (Norah, the Housekeeper), William Dewhurst (Reginald Portside), Frank Cochrane (Dr. Belfrus), Annie Esmond (Mrs. Caldwell (uncredited)), Wilfrid Hyde-White (Conrad (uncredited))\n\n\n\n\n\n(1937)\nBulldog Drummond Comes Back\nDirected By: Louis King\nWritten By: Edward T. Lowe Jr., Herman C. McNeile\nGenre: Adventure, Mystery, Thriller\nRating: 5.7 Country: USA\nSeen: No Language: English\nPlot\nThe girlfriend of Captain Drummond has been kidnapped by an enemy of Drummond who seeks revenge. But Drummond and his friend Colonel Nielsen at once follow his trail...\n\nCast\nJohn Barrymore (Colonel Neilson), John Howard (Captain Hugh 'Bulldog' Drummond), Louise Campbell (Phyllis Clavering), Reginald Denny (Algy Longworth), E.E. Clive (Tenny), J. Carrol Naish (Mikhail Valdin), Helen Freeman (Irena Soldanis), Zeffie Tilbury (Zeffie), John Sutton (Sanger), Rita Page (Barmaid), Frank Baker (Bobby (uncredited)), Phyllis Barry (Hortense (uncredited)), Otto Fries (Sanghil Wun (uncredited)), Forrester Harvey (Barman / Landlord (uncredited)), Ivo Henderson (Morris (uncredited)), Colin Kenny (Policeman (uncredited)), John Rogers (Blanton (uncredited)), C.L. Sherwood (Bartender (uncredited)), John Ward (Griswold (uncredited))\n\n\n\n\n\n(1937)\nBulldog Drummond Escapes\nDirected By: James P. Hogan\nWritten By: Edward T. Lowe Jr., Herman C. McNeile\nGenre: Adventure, Mystery, Thriller\nRating: 5.8 Country: USA\nSeen: No Language: English\nPlot\nCaptain High 'Bulldog' Drummond has just returned to England. As he is driving home in the dark, a young woman jumps out in front of his car. He misses her, but she falls to the ground. As he tries to revive her, he hears a shout for help, then gunshots. As he goes to investigate, the woman drives away with Drummond's car. He is soon able to trace her to nearby Greystone Manor, and when he goes there to meet her, she urges him to help her get out of a desperate situation.\n\nCast\nRay Milland (Capt. Hugh 'Bulldog Drummond'), Guy Standing (Inspector Nielson (as Sir Guy Standing)), Heather Angel (Phyllis Clavering), Reginald Denny (Algy Langworth), Porter Hall (Merridew), Fay Holden (Natalie), E.E. Clive (Tenny), Walter Kingsford (Stanton), P.J. Kelly (Stiles (as Patrick Kelly)), Charles McNaughton (Constable Higgins), Clyde Cook (Alf), Frank Elliott (Bailey), David Clyde (Gower), Doris Lloyd (Nurse), Robert Adair (Woolsey (uncredited)), J. Gunnis Davis (Attendant (uncredited)), Bobby Hale (Attendant (uncredited)), Barry Macollum (Blodgson (uncredited)), Henry Mowbray (Bobby (uncredited)), John Power (Customs Officer (uncredited)), Pat Somerset (Reporter (uncredited)), Ernie Stanton (Reporter (uncredited)), Colin Tapley (Dixon (uncredited)), Zeffie Tilbury (Jail Cell Background Extra (Drunk) (uncredited))\n\n\n\n\n\n(1938)\nBulldog Drummond in Africa\nDirected By: Louis King\nWritten By: Herman C. McNeile, Garnett Weston\nGenre: Adventure, Mystery\nRating: 5.9 Country: USA\nSeen: No Language: English\nPlot\nOn the eve of his wedding Captain Hugh Drummond is off to Morocco when Scotland Yard's Colonel J.A. Nielson is kidnapped by international criminal Richard Lane. With his fiancÃƒÂ©e Phyllis Clavering, friend 'Algy' Longworth and his trusty valet 'Tenny' Tennyson, Bulldog flies his own plane 1200 miles only to find the local British Consul ordering him home without delay. Drummond isn't an easy man to get rid of however and they soon mount their rescue plan.\n\nCast\nJohn Howard (Capt. Hugh Chesterton 'Bulldog' Drummond), Heather Angel (Phyllis Clavering), H.B. Warner (Col. J.A. Nielsen), J. Carrol Naish (Richard Lane), Reginald Denny (Algernon 'Algy' Longworth), E.E. Clive ('Tenny' Tennison), Anthony Quinn (Fordine (henchman)), Michael Brooke (Baron Nevsky), Matthew Boulton (Maj. Grey), Neil Fitzgerald (McTurk (British spy)), Fortunio Bonanova (African police corporal), Leonard Carey (Phillips (butler)), Forrester Harvey (Const. Jenkins), Rudolf Myzet (Plane saboteur), Paul Porcasi (Tuxedoed man in hotel room), Konstantin Shayne (Plane saboteur), Michael Vallon (Mr. Acris), Wilhelm von Brincken (Dr. Stern), Jean De Briac (Walter (uncredited)), Gerald Rogers (Tailor (uncredited)), Rafael Storm (Policeman Outside Hotel Room (uncredited)), Evan Thomas (Sergeant (uncredited))\n\n\n\n\n\n(1934)\nBulldog Drummond Strikes Back\nDirected By: Roy Del Ruth\nWritten By: Nunnally Johnson, Henry Lehrman\nGenre: Comedy, Mystery\nRating: 7.1 Country: USA\nSeen: No Language: English\nPlot\nAlgy, Bulldog Drummond's right-hand-man, is getting married. Bulldog attends; on the way home, in the fog, he enters the (apparently deserted) mansion of Prince Achmed in search of a phone. He finds none, but he does find a body - which disappears when he summons a bobby. Bodies keep disappearing as Drummond keeps summoning the authorities, particularly his long-suffering upstairs neighbor, Captain Nielsen; the ever faithful Algy also finds his wedding night disrupted by, among other things, some emergency code-breaking. And of course, there's a beautiful woman there's always a beautiful woman in this case, Gwen, who turns out to be the daughter of the dead man who started all this.\n\nCast\nRonald Colman (Capt. Hugh 'Bulldog' Drummond), Loretta Young (Lola Field), C. Aubrey Smith (Capt. Reginald Neilsen / Colonel), Charles Butterworth (Algy Longworth / Mousey), Una Merkel (Gwen), Warner Oland (Prince Achmed), E.E. Clive (London Bobbie), Mischa Auer (Hassan), Douglas Gerrard (Parker, Drummond's Valet), Ethel Griffies (Mrs. Field), Halliwell Hobbes (Bobby), Arthur Hohl (Dr. Sothern), George Regas (Singh), Lucille Ball (Girl (uncredited)), Wilson Benge (Watkins, Neilsen's Valet (uncredited)), Billy Bevan (Man in Hotel Room (uncredited)), Kathleen Burke (Jane Sothern (uncredited)), H.N. Clugston (Mr. Field (uncredited)), J. Gunnis Davis (Harsh Voiced Man (uncredited)), Creighton Hale (Wedding Guest (uncredited)), Pat Harmon (Stoker (uncredited)), Olaf Hytten (Hotel Clerk (uncredited)), Charles Irwin (Cockney Drunk (uncredited)), Bob Kortman (Sailor (uncredited)), Charles McNaughton (Hotel Manager (uncredited)), Edmund Mortimer (Wedding Guest (uncredited)), Doreen Munroe (Woman in Hotel Room (uncredited)), William H. O'Brien (Banquet Servant (uncredited)), Yorke Sherwood (Bobby (uncredited)), Pat Somerset (Wedding Guest (uncredited)), Vernon Steele (Wedding Guest (uncredited))\n\n\n\n\n\n(1939)\nBulldog Drummond's Bride\nDirected By: James P. Hogan\nWritten By: Stuart Palmer, Garnett Weston\nGenre: Action, Adventure, Comedy, Crime, Mystery, Romance\nRating: 6.3 Country: USA\nSeen: No Language: English\nPlot\nA bank-robbery in London prevents - again - the marriage of Bulldog Drummond with his girlfriend. But this time when the delinquents are caught it will be celebrated at last.\n\nCast\nJohn Howard (Capt. Hugh C. Drummond), Heather Angel (Phyllis Clavering), H.B. Warner (Colonel Nielson), Reginald Denny (Algy Longworth), E.E. Clive (Tenny), Elizabeth Patterson (Aunt Blanche), Eduardo Ciannelli (Henri Armides), Gerald Hamer (Garvey), John Sutton (Inspector Tredennis), Neil Fitzgerald (Evan Barrows), Louis Mercier (Mayor Dupres), Adia Kuznetzoff (Gaston), Adrienne D'Ambricourt (Therese (as Adrienne d'Ambricourt)), Clyde Cook (Traffic Control Constable (uncredited)), George Davis (Gaoler (uncredited)), Jacques Lory (Clerk of the Court (uncredited)), John Power (Omnibus Driver (uncredited)), Wyndham Standing (Ambulance Doctor (uncredited)), David Torrence (Bank Official (uncredited))\n\n\n\n\n\n(1938)\nBulldog Drummond's Peril\nDirected By: James P. Hogan\nWritten By: Herman C. McNeile, Stuart Palmer\nGenre: Action, Adventure, Crime, Mystery, Romance, Thriller\nRating: 5.9 Country: USA\nSeen: No Language: English\nPlot\nIn this episode captain Drummond tries to find the killer of various people. All assassinations were provoked by a diamond of great value, but Drummond will face the danger.\n\nCast\nJohn Barrymore (Col. Neilson), John Howard (Capt. Hugh 'Bulldog' Drummond), Louise Campbell (Phyllis Clavering), Reginald Denny (Algy Longworth), E.E. Clive (Tenny), Porter Hall (Dr. Botulian), Elizabeth Patterson (Aunt Blanche), Nydia Westman (Gwen Longworth), Michael Brooke (Anthony Greer), Halliwell Hobbes (Prof. Bernard Goodman), Matthew Boulton (Sir Raymond Blantyre), Zeffie Tilbury (Mrs. Weevens), David Clyde (Constable McThane), Clyde Cook (Constable Sacker), Austin Fairman (Roberts), Gregory Gaye (Raoul), Pat X. Kerry (1st Expressman), David Thursby (2nd Expressman (as Dave Thursby)), Torben Meyer (Hoffman), Jimmy Aubrey (uncredited), Frank Baker (uncredited), Frank Benson (uncredited), Peter Bronte (uncredited), James P. Burtis (uncredited), Ethel Clayton (uncredited), Charles De Ravenne (uncredited), David Dunbar (uncredited), Margaret Fealy (uncredited), Maude Fealy (uncredited), Douglas Gordon (uncredited), William Haade (uncredited), Andre Marsaudon (uncredited), Albert Petit (uncredited), Albert Pollet (uncredited), Georgette Rhodes (uncredited), John Sutton (Insp. Tredennie (uncredited)), Evan Thomas (uncredited)\n\n\n\n\n\n(1937)\nBulldog Drummond's Revenge\nDirected By: Louis King\nWritten By: Edward T. Lowe Jr., Herman C. McNeile\nGenre: Adventure, Mystery\nRating: 5.7 Country: USA\nSeen: No Language: English\nPlot\nCaptain Drummond travels to Switzerland in order to marry his girlfriend but the disappearance of a dangerous cargo of explosives makes him delay his plans.\n\nCast\nJohn Barrymore (Col. J.A. Nielson), John Howard (Capt. Hugh Chesterton 'Bulldog' Drummond), Louise Campbell (Phyllis Clavering), Reginald Denny (Algy Longworth), E.E. Clive ('Tenny' Tennison), Frank Puglia (Draven Nogais), Nydia Westman (Gwen Longworth), Robert Gleckler (Hardcastle), Lucien Littlefield (Mr. Smith), John Sutton (Jennings, Nielson's Secretary), Miki Morita (Sumio Kanda), Benny Bartlett (Cabin Boy), Jimmy Aubrey (Railroad Porter (uncredited)), Brooks Benedict (Smith Tredgold (uncredited)), Matthew Boulton (Sir John Haxton (uncredited)), Sidney Bracey (Steward (uncredited)), Marie Burton (Bit Part (uncredited)), Ethel Clayton (Bit Part (uncredited)), Elsa Connor (Bit Part (uncredited)), Paula DeCardo (Bit Part (uncredited)), Harold Entwistle (Older Railroad Conductor (uncredited)), Harriette Haddon (Bit Part (uncredited)), Winter Hall (Ferry Captain (uncredited)), Arthur Stuart Hull (Englishman (uncredited)), Lola Jensen (Bit Part (uncredited)), Gwen Kenyon (Bit Part (uncredited)), Joyce Mathews (Bit Part (uncredited)), Gerald Rogers (Younger Railroad Conductor (uncredited)), Phillips Smalley (Englishman (uncredited)), Dorothy White (Bit Part (uncredited)), Gloria Williams (Bit Part (uncredited))\n\n\n\n\n\n(1939)\nBulldog Drummond's Secret Police\nDirected By: James P. Hogan\nWritten By: Herman C. McNeile, Garnett Weston\nGenre: Mystery, Thriller\nRating: 6.3 Country: USA\nSeen: No Language: English\nPlot\nCaptain Drummond and his girlfriend want to marry but a hidden treasure in the house in which they want to celebrate their marriage is complicating the situation.\n\nCast\nJohn Howard (Capt. Hugh C. 'Bulldog' Drummond), Heather Angel (Phyllis Clavering), H.B. Warner (Col. Nielson), Reginald Denny ('Algy' Longworth), E.E. Clive ('Tenny' Tennison), Elizabeth Patterson (Aunt Blanche), Leo G. Carroll (Henry Seaton, alias Albert Boulton (as Leo Carroll)), Forrester Harvey (Prof. Downie), Clyde Cook (Constable Hawkins), David Clyde (Constable Jenkins), Neil Fitzgerald (Rockingham Stationmaster), Elspeth Dudgeon (Mrs. Thomas, Housekeeper), Jimmy Aubrey (Passage Workman (uncredited)), Oscar 'Dutch' Hendrian (Moving Man (uncredited)), J. Carrol Naish(in stock footage from 'Bulldog Drummond in Africa') (archive footage) (uncredited), Gerald Rogers (Police Sgt. Peters (uncredited)), Dick Rush (Moving Man (uncredited)), Wyndham Standing (Wedding Master of Ceremonies (uncredited)), David Thursby (Passage Workman (uncredited)), Harry Wilson (Moving Man (uncredited))\n\n\n\n\n\n(1939)\nBulldog Drummond: Arrest Bulldog Drummond\nDirected By: James P. Hogan\nWritten By: Stuart Palmer, Herman C. McNeile\nGenre: Adventure, Sci-Fi\nRating: 6.0 Country: USA\nSeen: No Language: English\nPlot\nThe invention of a war machine, that brings to explosion everything one wants to, puts Scotland Yard and Captain Drummond into alarm.,\n\nCast\nJohn Howard (Captain Hugh C. Drummond), Heather Angel (Phyllis Clavering), H.B. Warner (Colonel Nielsen), Reginald Denny (Algy Longworth), E.E. Clive (Tenny), Jean Fenwick (Lady Beryl Ledyard), Zeffie Tilbury (Aunt Meg), George Zucco (Rolf Alferson), Leonard Mudie (Richard Gannett), Evan Thomas (Smith), Clyde Cook (Constable Sacker), David Clyde (Constable McThane), George Regas (Soongh), Neil Fitzgerald (Sir Malcolm McLeonard), Claud Allister (Sir Basil Leghorne), Jimmy Aubrey (Steward (uncredited)), Frank Baker (Cop (uncredited)), Kathryn Bates (Tourist (uncredited)), Billy Bevan (Aquarium Guard (uncredited)), Dolores Casey (uncredited), Steve Clemente (Native Buying Rifle (uncredited)), Neil Craig (Tourist (uncredited)), Sheila Darcy (uncredited), John Davidson (Gumba - Bird Seller (uncredited)), Harold Garrison (Native Boy with Message (uncredited)), Forrester Harvey (Constable at Gannett House (uncredited)), Grace Hayle (Tourist (uncredited)), Olaf Hytten (Island Police Arresting Sergeant (uncredited)), Eugene Jackson (Hotel Page Boy (uncredited)), Frank Lackteen (Native Selling Rifle (uncredited)), Joyce Mathews (uncredited), Hercules Mendez (Foreign Agent (uncredited)), Ferdinand Munier (Old Maj. Trumleigh (uncredited)), Gerald Rogers (Island Police Desk Sergeant (uncredited)), John Rogers (Guggins - Scrawny Henchman (uncredited)), Ruth Rogers (Maid (uncredited)), Sam Savitsky (Foreign Agent (uncredited)), John Sutton (Inspector Tredennis (uncredited)), Chief Tahachee (Tourist (uncredited))\n\n\n\n\n\n(1935)\nBulldog Drummond: Bulldog Jack\nDirected By: Walter Forde\nWritten By: Gerard Fairlie, Sidney Gilliat\nGenre: Comedy, Crime, Mystery\nRating: 6.0 Country: UK\nSeen: No Language: English\nPlot\nBulldog Drummond is injured when his sabotaged car crashes and Jack Pennington agrees to masquerade as the sleuth. He is enlisted to help Ann Manders find her jeweler grandfather who has been kidnapped by a gang of crooks who want him to copy a valuable necklace they want to steal. Their plan backfires in the British Museum and the film climaxes in an exciting chase on a runaway train in the London Underground.\n\nCast\nJack Hulbert (Jack Pennington), Fay Wray (Ann Manders), Ralph Richardson (Morelle), Claude Hulbert (Algy Longworth), Gibb McLaughlin (Denny), Atholl Fleming (Bulldog Drummond), Paul Graetz (Salvini), Harvey Braban (Sgt. Robinson (uncredited)), Henry B. Longhurst (Melvor (uncredited)), Cyril Smith (Duke (uncredited))\n\n\n\n\n\n(1951)\nBulldog Drummond: Calling Bulldog Drummond\nDirected By: Victor Saville\nWritten By: Gerard Fairlie, Howard Emmett Rogers\nGenre: Crime, Mystery\nRating: 5.8 Country: UK\nSeen: No Language: English\nPlot\nWith a ruthless gang terrorizing London, Scotland Yard calls Hugh &quot;Bulldog&quot; Drummond out of retirement. With the help of detective Helen Smith, Drummond infiltrates the gang under an assumed name. He and Smith become trusted gang-members until the gang's overlord discovers their true identities, and they are taken as prisoners.\n\nCast\nWalter Pidgeon (Maj. Hugh 'Bulldog' Drummond), Margaret Leighton (Sgt. Helen Smith), Robert Beatty (Arthur Gunns), David Tomlinson (Algernon 'Algy' Longworth), Peggy Evans (Molly), Charles Victor (Insp. McIver), Bernard Lee (Col. Webson), James Hayter (Bill), Patric Doonan (Alec), Michael Allan (Bert (uncredited)), Arthur Hewlett (Department Store manager who raises the alarm (uncredited)), Richard Johnson (Control Tower Operator (uncredited)), Harold Lang (Stan (uncredited)), Laurence Naismith (Hardcastle, Card player (uncredited)), Michael Ward (uncredited)\n\n\n\n\n\n(1967)\nBulldog Drummond: Deadlier Than the Male\nDirected By: Ralph Thomas\nWritten By: Liz Charles-Williams, Herman C. McNeile\nGenre: Crime, Thriller, Adventure, Drama\nRating: 6.4 Country: UK\nSeen: No Language: English\nPlot\nBritish agent Bulldog Drummond is assigned to stop a master criminal who uses beautiful women to do his killings.,\n\nCast\nRichard Johnson (Hugh 'Bulldog' Drummond), Elke Sommer (Irma Eckman), Sylva Koscina (Penelope), Nigel Green (Carl Petersen), Suzanna Leigh (Grace), Steve Carlson (Robert Drummond), Virginia North (Brenda), Justine Lord (Miss Peggy Ashenden), Leonard Rossiter (Henry Bridgenorth), Laurence Naismith (Sir John Bledlow), Zia Mohyeddin (King Fedra), Lee Montague (Boxer), Milton Reid (Chang), Yasuko Nagazumi (Mitsouko), Didi Sydow (Anna), George Pastell (Carloggio), Dervis Ward (Henry Keller), John Stone (David Wyngarde), William Mervyn (Chairman of the Phoenician Board), Jill Banner (Pam (uncredited)), Sylvana Henriques (Masseuse (uncredited)), James Payne (Taxi Driver (uncredited)), George Sewell (Car Park Assassin (uncredited)), Kitty Swan (Fourth Assassin (uncredited)), Loretta White (Girl on King's Yacht (uncredited))\n\n\n\n\n\n(1969)\nBulldog Drummond: Some Girls Do\nDirected By: Ralph Thomas\nWritten By: Liz Charles-Williams, Herman C. McNeile\nGenre: Action, Adventure, Comedy\nRating: 5.7 Country: UK\nSeen: No Language: English\nPlot\nA series of unexplainable accidents befall the people and companies responsible for developing the world's first supersonic airliner (SST1). A British agent is sent to investigate and with the help of another agent uncovers a plot masterminded by Carl Petersen who stands to gain eight million pounds if the aircraft is not ready by a certain date. The evil Petersen has developed a number of &quot;robots&quot; (actually rather beautiful girls with &quot;electronic brains&quot;) to help him sabotage the SST1 project by means of &quot;infrasound&quot; (extreme low frequency sound waves) which can be directed at people or objects with devastating results.\n\nCast\nRichard Johnson (Hugh Drummond), Daliah Lavi (Baroness Helga Hagen), Beba Loncar (Pandora), James Villiers (Carl Petersen), Vanessa Howard (Robot Number Seven), Maurice Denham (Mr. Dudley Mortimer), Robert Morley (Miss Mary), Sydne Rome (Flicky), Adrienne Posta (Angela, Drummond's daily), Florence Desmond (Lady Manderville), Ronnie Stevens (Peregrine Carruthers), Virginia North (Robot Number Nine), Nicholas Phipps (Lord Dunnberry, Air Minister), George Belbin (Maj. Newman), Yutte Stensgaard (Robot Number One), Richard Hurndall (President of Aircraft Company), Marga Roche (Birgit), Douglas Sheldon (Kruger), Joanna Lumley (Robot on Suicide Mission (uncredited)), John Paul (Test Jet Pilot (uncredited))\n\n\n\n\n\n(1934)\nBulldog Drummond: The Return of Bulldog Drummond\nDirected By: Walter Summers\nWritten By: Walter Summers\nGenre: Mystery\nRating: 6.6 Country: UK\nSeen: No Language: English\nPlot\n\n\nCast\nRalph Richardson (Major Hugh 'Bulldog' Drummond), Ann Todd (Phyllis Drummond), Joyce Kennedy (Irma Peterson), Francis L. Sullivan (Carl Peterson), Claud Allister (Algy Longworth), H. Saxon-Snell (Zadowa), Spencer Trevor (Sir Bryan Johnstone), Charles Mortimer (Inspector McIver), Wallace Geoffrey (Charles Latter), Patrick Aherne (Jerry Seymour)\n\n\n\n\n\n(1935)\nBulldog Jack\nDirected By: Walter Forde\nWritten By: Gerard Fairlie, Sidney Gilliat\nGenre: Comedy, Crime, Mystery\nRating: 6.0 Country: UK\nSeen: No Language: English\nPlot\nBulldog Drummond is injured when his sabotaged car crashes and Jack Pennington agrees to masquerade as the sleuth. He is enlisted to help Ann Manders find her jeweler grandfather who has been kidnapped by a gang of crooks who want him to copy a valuable necklace they want to steal. Their plan backfires in the British Museum and the film climaxes in an exciting chase on a runaway train in the London Underground.\n\nCast\nJack Hulbert (Jack Pennington), Fay Wray (Ann Manders), Ralph Richardson (Morelle), Claude Hulbert (Algy Longworth), Gibb McLaughlin (Denny), Atholl Fleming (Bulldog Drummond), Paul Graetz (Salvini), Harvey Braban (Sgt. Robinson (uncredited)), Henry B. Longhurst (Melvor (uncredited)), Cyril Smith (Duke (uncredited))\n\n\n","torrent":{"xt":"urn:btih:0a391fdd72d13804d759522d4ae27ee85d992afe","amp;dn":"Bulldog+Drummond+%2816+films%29%5B1929-1969%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a391fdd72d13804d759522d4ae27ee85d992afe","infoHashBuffer":{"type":"Buffer","data":[10,57,31,221,114,209,56,4,215,89,82,45,74,226,126,232,93,153,42,254]},"announce":[],"urlList":[]}}