{"title":"Million Dollar Listing Complete Seasons 1, 2, 3","uid":6235730,"size":7708205412,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0ab3dda1e672eb65d0445895f3f05f2a8b3e2f9f&amp;dn=Million+Dollar+Listing+Complete+Seasons+1%2C+2%2C+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":4,"uploader":"mrpro2","files":21,"time":1299864180,"description":"This is complete set of Million Dollar Listing Seasons 1-3\n \nMillion Dollar Listing is an American show that follows three real estate agents based in Hollywood and Malibu, California selling high-end properties.\n\nSeason one\n\nThe first season premiered on August 29, 2006. The show takes a look at the high-end real estate market in California. The show followed two real estate companies, one in Hollywood and one in Malibu, and the selling of a listing each week. Episodes showcase a real estate listing from Hollywood and a listing from Malibu, starting from the beginning of the selling process and hopefully to close. The story lines range from a woman who is a hysterical divorcee forced to sell her multi-million dollar home, to an agent whose personal ties to the seller (her ex-fiance) get in the way of a potential sale.\n\n\nSeason two\n\nSeason two premiered on August 7, 2008, almost two years after the prior season, and focused on the agents as opposed to companies in season one. Documenting the lives of three young Los Angeles real estate estate agents, Josh Flagg, Madison Hildebrand and Chad Rogers, working in some of the most exclusive neighborhoods - Hollywood, Malibu and Beverly Hills - over the course of nine months as their paths cross.\n\nSeason three\n\nSeason 3 of Million Dollar Listing premiered Monday October 12, 2009 on Bravo. Season 3 examines a falling real estate market and the three agents' tactics in staying afloat. Edith Flagg returns with Josh, in season 3, as they travel to Europe, to re visit the places she lived during the Holocaust. Season 3 has been the most popular season yet.","torrent":{"xt":"urn:btih:0ab3dda1e672eb65d0445895f3f05f2a8b3e2f9f","amp;dn":"Million+Dollar+Listing+Complete+Seasons+1%2C+2%2C+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ab3dda1e672eb65d0445895f3f05f2a8b3e2f9f","infoHashBuffer":{"type":"Buffer","data":[10,179,221,161,230,114,235,101,208,68,88,149,243,240,95,42,139,62,47,159]},"announce":[],"urlList":[]}}