{"title":"Alex Jones - Martial Law 911 - Rise of the Police State (VOB)","uid":3877217,"size":4681913929,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0bc9ff82cb030c0dcd809ad0fdf126f1b846e6b9&amp;dn=Alex+Jones+-+Martial+Law+911+-+Rise+of+the+Police+State+%28VOB%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"RedDelPaPa","files":13,"time":1194464554,"description":"Alex Jones - Martial Law 911 - Rise of the Police State - Complete DVD - Including original menus, chapters, and extras - VOB - 4.35GB\n\nMartial Law: 9/11 Rise of the Police State was filmed primarily during the Republican Party&amp;#039;s 2004 national convention in New York City.  The Republican Party&amp;#039;s choice to hold the event there drew both strong praise and strong criticism. Alex Jones&amp;#039; clear intent was that the people who were truly guilty of planning and carrying out the events of September 11, 2001 were coming back to the scene of the crime. In the film, Jones shows what he believes are signs of a growing police state: constant surveillance, a defined military presence, a militarized civilian police force, mass roundups and arrests of protesters, detention in a makeshift facility laden with asbestos which one interviewee called a &quot;concentration camp&quot;, and threats of arrest for constitutionally legal activities. Many different views are presented, including one semi-humorous confrontation with a group of American communists.\n\nThis film has been authorized for non profit redistribution by its producer, Alex Jones.  If you have the money, and would like to support Mr. Jones and all his hard work, please purchase an authentic copy of this film by going\n\nIf you received your copy of this film via torrent download, please continue to seed this torrent as much as possible.  It is imperative this information reach as many people as possible.  Thank you.\n","torrent":{"xt":"urn:btih:0bc9ff82cb030c0dcd809ad0fdf126f1b846e6b9","amp;dn":"Alex+Jones+-+Martial+Law+911+-+Rise+of+the+Police+State+%28VOB%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bc9ff82cb030c0dcd809ad0fdf126f1b846e6b9","infoHashBuffer":{"type":"Buffer","data":[11,201,255,130,203,3,12,13,205,128,154,208,253,241,38,241,184,70,230,185]},"announce":[],"urlList":[]}}