{"title":"CITY PRIMEVAL - Elmore Leonard. Read by Frank Muller {FerraBit}","uid":4887207,"size":256251736,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0c7593bb05aee517b625cae20e6f164448355fec&amp;dn=CITY+PRIMEVAL+-+Elmore+Leonard.+Read+by+Frank+Muller+%7BFerraBit%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"FerraBit","files":-1,"time":1241782877,"description":"CITY PRIMEVAL: High Noon in Detroit by Elmore Leonard (1980)\n\nRead by Frank Muller\n\nPublisher . : Recorded Books &amp; Borders (1993)\nISBN-10 . . : 1402578245\nFormat . . .: MP3. From 6 CD's (6.75 hours), 113 tracks, 243 MB.\nBitrate . . : ~85 kbps (iTunes 8, VBR, mono, 44kHz)\nUnabridged .: Always\nGenre . . . : Crime Suspense Thriller, Fiction (USA)\n\nLeonard has written many well known books, with several made into film/tv:\nGold Coast, The Big Bounce, Fifty-two Pickup, Killshot, Get Shorty, Out of Sight, Be Cool, 3:10 to Yuma, etc.\n\nScanned the covers, edited the file names and MP3 tags - just for you.\n\nCheers, FerraBit\nMay 2009\n\nLinks: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Elmore_Leonard&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Elmore_Leonard&lt;/a&gt;\nhttp://www.elmoreleonard.com\n\nOriginally posted: TPB, Demoniod, Mininova\nDownloading it? Leave me a happy note of encouragement.\n____________________________________________________\n \n\n From back cover:\nClement Mansell figures his luck has held out so far. He's beaten every murder rap he's ever been charged with. Why should this one be different? He had no idea it was Judge Guy in the Mark VI he blew away until he read it in the papers. Besides, half the city was gunning for the abusive magistrate anyway -- Clement Mansell just saved them the trouble. What Clement didn't count on was a cop like Raymond Cruz taking the case. Despite his personal sense of satisfaction at Guy's demise, Cruz has pretty old-fashioned notions about justice and isn't going to let Clement walk again.\n\n Clement Mansell knows how easy it is to get away with murder. The seriously crazed killer is already back on the Detroit streets -- thanks to some nifty courtroom moves by his crafty looker of a lawyer -- and he's feeling invincible enough to execute a crooked Motown judge on a whim. Homicide Detective Raymond Cruz thinks the &quot;Oklahoma Wildman&quot; crossed the line long before this latest outrage, and he's determined to see that the hayseed psycho does not slip through the legal system's loopholes a second time. But that means a good cop is going to have to play somewhat fast and loose with the rules -- in order to maneuver Mansell into a wild Midwest showdown that he won't be walking away from.\n\n About the Author\nElmore Leonard has written more than three dozen books including Cuba Libre, Rum Punch, and Get Shorty, and numerous screenplays. He has an unparalleled reputation among lovers of mayhem, suspense, and just plain wonderful writing. A Grand Master Award winner of the Mystery Writers of America, he has been likened to everyone from Balzac to Dostoevsky to Dickens to Dashiell Hammett -- but he is, in fact, entirely and entertainingly sui generis.","torrent":{"xt":"urn:btih:0c7593bb05aee517b625cae20e6f164448355fec","amp;dn":"CITY+PRIMEVAL+-+Elmore+Leonard.+Read+by+Frank+Muller+%7BFerraBit%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c7593bb05aee517b625cae20e6f164448355fec","infoHashBuffer":{"type":"Buffer","data":[12,117,147,187,5,174,229,23,182,37,202,226,14,111,22,68,72,53,95,236]},"announce":[],"urlList":[]}}