{"title":"Doctor Who - Season 22 - (1985) - 13 45-Minute Episodes","uid":9200545,"size":4921448850,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0cb0f24d6a836ff254768f350dea67aa368d88b1&amp;dn=Doctor+Who+-+Season+22+-+%281985%29+-+13+45-Minute+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"bnaron","files":13,"time":1384585050,"description":"The twenty-second season of British science fiction television series Doctor Who began on 5 January 1985 with the serial 'Attack of the Cybermen', and ended with 'Revelation of the Daleks'. Colin Baker and Nicola Bryant continue their roles as the Sixth Doctor and Peri Brown.\n\nMaurice Colbourne returned as Lytton from the story 'Resurrection of the Daleks' in 'Attack of the Cybermen'. Terry Molloy returns to play Davros in 'Revelation of the Daleks' and also played Russell in 'Attack of the Cybermen'. Anthony Ainley returns in 'The Mark of the Rani' as The Master. Patrick Troughton and Frazer Hines return to play the Second Doctor and his companion Jamie McCrimmon in 'The Two Doctors'. Their last on-screen appearance was (briefly) 'The Five Doctors' in 1983. Kate O'Mara makes her first appearance as The Rani in 'The Mark of the Rani'.\n\nThe season mostly focused on Peri trying to adjust to the Sixth Doctor, who is still having trouble 'getting his head on straight' while they're on adventures.\n\nThe series moved back to once-weekly Saturday broadcasts. All episodes were 45 minutes long, though they also exist in 25-minute versions. Although there were now only 13 episodes in the season, the total running time remained approximately the same as in previous seasons since the episodes were almost twice as long.\n\nTotal Episodes: 13\n\n01 - 'Attack of the Cybermen' - 2 Episodes\n\n    Synopsis: The Cybermen plot to hijack Halley's comet.\n\n02 - 'Vengeance on Varos' - 2 Episodes\n\n     Synopsis: The Doctor and Peri arrive on Varos, when they are pulled into a\n     live torture show.\n\n03 - 'The Mark of the Rani' - 2 Episodes\n\n     Synopsis: The Master works with the Rani, who plans to take away a chemical\n     that causes people to sleep.\n\n04 - 'The Two Doctors' - 3 Episodes\n\n     Synopsis: A Sontaran plot for mastery of time leads two Doctors into a savage\n     experiment.\n\n05 - 'Timelash' - 2 Episodes\n\n     Synopsis: The people of Karfel are terrorized by the sinister Borad.\n\n06 - 'Revelation of the Daleks' - 2 Episodes\n\n     Synopsis: The Great Healer (Davros) has come up with a solution for famine.\n     It involves dead bodies and Daleks.\n\n","torrent":{"xt":"urn:btih:0cb0f24d6a836ff254768f350dea67aa368d88b1","amp;dn":"Doctor+Who+-+Season+22+-+%281985%29+-+13+45-Minute+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cb0f24d6a836ff254768f350dea67aa368d88b1","infoHashBuffer":{"type":"Buffer","data":[12,176,242,77,106,131,111,242,84,118,143,53,13,234,103,170,54,141,136,177]},"announce":[],"urlList":[]}}