{"title":"Penetration Testing with the Bash Shell (2014)","uid":10294626,"size":26405848,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0cbe49921c6ea256138cc44ff57c64d7f081ab35&amp;dn=Penetration+Testing+with+the+Bash+Shell+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":1,"time":1401905610,"description":"\n\n\n\nPenetration Testing with the Bash Shell (2014)\n\n\n\nDescription:\n\n\n\nMake the most of the Bash shell and Kali Linux's command-line-based security assessment tools\n\nOverview\n\nUtilize the command line to create, run, and execute tests\nLearn useful command line based information processing utilities and unlock the problem solving power of a Linux terminal\nPractical demonstrations using in-depth explanations and screenshots to help you use the Linux Bash terminal to tackle a collection of common security-related problems.\nIn Detail\n\nThis book teaches you to take your problem solving capabilities to the next level with the Bash shell, to assess network and application level security by leveraging the power of the command-line tools available with Kali Linux.\n\nThe book begins by introducing some of the fundamental bash scripting and information processing tools. Building on this, the next few chapters focus on detailing ways to customize your Bash shell using functionalities such as tab completion and rich text formatting. After the fundamental customization techniques and general purpose tools have been discussed, the book breaks into topics such as the command-line-based security tools in the Kali Linux operating system. The general approach in discussing these tools is to involve general purpose tools discussed in previous chapters to integrate security assessment tools. This is a one stop solution to learn Bash and solve information security problems.\n\nWhat you will learn from this book\n\nPerform network enumeration techniques with Dig, whois, dnsenum, dnsmap, and others\nLearn how to fuzz and reverse engineer using the Kali Linux command line tools\nExploit common web application vulnerabilities using skipfish, arcachi, and sqlmap\nAccomplish man-in-the-middle attacks straight from your command line\nAssess SSL security using sslyze and openssl\nCarry out network traffic analysis using tcpdump\nApproach\n\nAn easy-to-understand, step-by-step practical guide that shows you how to use the Linux Bash terminal tools to solve information security problems.\n\nWho this book is written for\n\nIf you are a penetration tester, system administrator, or developer who would like an enriching and practical introduction to the Bash shell and Kali Linux command-line-based tools, this is the book for you.\n\n\n\nNote(s):\n\n\n1. This is not the official PDF from PACKT Pub.: the pages were downloaded then merged together. Of course this is better than nothing, right?\n\n\n\n\n\n","torrent":{"xt":"urn:btih:0cbe49921c6ea256138cc44ff57c64d7f081ab35","amp;dn":"Penetration+Testing+with+the+Bash+Shell+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cbe49921c6ea256138cc44ff57c64d7f081ab35","infoHashBuffer":{"type":"Buffer","data":[12,190,73,146,28,110,162,86,19,140,196,79,245,124,100,215,240,129,171,53]},"announce":[],"urlList":[]}}