{"title":"National Archaeological Museum, Athens (Art Ebook)","uid":11776429,"size":40777997,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0cc772afc67cfd27e5e1bb7050fe2378cca8d486&amp;dn=National+Archaeological+Museum%2C+Athens+%28Art+Ebook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":1,"time":1427314261,"description":"Pdf / English / 1979 Newsweek / 171 pages / 38.8 MB\n\nTime-Life Great Museums of the World series, pub. 1979\n\nIn 130 superb color photographs, masterpieces from the National Archaeological Museum of Athens range over 3000 years of Ancient Greek art. The liberation of Greece a century and a half ago was synonymous with the national movement to save and protect its fabulous heritage of ancient monuments. With this express purpose the Athens Museum was founded, to collect and preserve all antiquities found on Greek soil. The museum thus possesses unparalleled masterpieces of Greek art from its genesis in the Neolithic period in Thessaly through the early civilizations of the Aegean and the Greek mainland, to the classic age of Pericles and the magnificent productions of the Helenistic era. Culled from these riches, 130 works have been chosen for this volume to display the heights of creative achievement. Among the earliest are the goldwork and ivory carvings of the aristocratic Mycenaean civlization. No less revealing are the varied productions of the Minoan cultures in the Aegean, notably the astonishingly well preserved mural paintings dating from 1500 B.C. discovered in recent years on the island of Thera. Many other wondrous finds from this period and arlier include the mysterious marble idols from the Cycladic islands, the celebrated gold cups from Vapheio in the Peloponnesus, the gold signet rings from Tiryns. As we enter the fifth century and the age of Pericls, numerous masterpieces reflect the pervasive hand of Pheidias, nowhere more convincingly than in the Demeter relief. The celebrated masters of the fourth century are also superbly represented by such masterpieces as the life-size bronze Youth reclaimed from the sea off Antikythera, and the Boy from Marathon - the latter attributed by some to Praxiteles. From the Hellenistic period, another unforgettable bronze is the Boy Jockey on Horseback","torrent":{"xt":"urn:btih:0cc772afc67cfd27e5e1bb7050fe2378cca8d486","amp;dn":"National+Archaeological+Museum%2C+Athens+%28Art+Ebook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cc772afc67cfd27e5e1bb7050fe2378cca8d486","infoHashBuffer":{"type":"Buffer","data":[12,199,114,175,198,124,253,39,229,225,187,112,80,254,35,120,204,168,212,134]},"announce":[],"urlList":[]}}