{"title":"The B52's - Wild Planet .flac files","uid":6304407,"size":245742047,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0ce59d28bb6f8c2011b7f83a463f7792cea089f0&amp;dn=The+B52%5C%27s+-+Wild+Planet+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ulikes","files":14,"time":1302273694,"description":"Well, chalk up another planet in Star System B-52 (the first one was Planet Claire). The second planet after Claire is Wild Planet, and also the second album by the Athens, GA (then) quintet. On their second go-around, the B-52's still have the punchy, kitschy/positive/optimistic surf guitar sound and attitude that made their debut an unqualified hit.\n\nHere's my piece in describing Wild Planet's nine satellites. Fred Schneider's &quot;Surprise!&quot; is the first word of &quot;Party Out Of Bounds.&quot; Kate and Cindy then ask for the ice box and punch, and there's the party started, right there. &quot;Private Idaho&quot; is Wild Planet's &quot;Rock Lobster,&quot; being Wild Planet's most well-known track. Ricky Wilson's guitar keeps the pace. &quot;You're living in your own private Idaho/On a ground like a wild potato.&quot; This is another on the short list for a party mix-tape should &quot;Rock Lobster&quot; not be available for any reason.\n\nFor sheer jamming, nothing beats &quot;Devil In My Car&quot; and &quot;Strobe Light.&quot; The first is a funny song on a car possessed by the devil. The saying &quot;Drive like hell and you will get there&quot; comes to mind. Anyway, the hapless narrator can't lock the door, or put on my safety belt and is going 90 mph. He thus cries out &quot;Help! The devil's in my car!&quot; The humor's very kitschy, with devilish motifs such as &quot;I don't wanna go to hell&quot; and &quot;I don't need no batteries/I've got the devil in my car.&quot;\n\n&quot;Strobe Light&quot; is a seduction number, focusing on making love under the title appliance. No one sings about kissing body parts and responding to the same as Fred and the girls, respectively. When he gets to a very personal part of his date's body, he uses a euphemism that's the same as a certain large fruit. A shrill synthesizer blasts in response.\n\n&quot;Quiche Lorraine&quot; deserves mention here, about a man and his dog, Quiche the poodle. The dog runs away after a German Shepherd, leaving the man broken-hearted and vindictive for being abandoned. In addition to backing vocals, Kate or Cindy provides Quiche's sharp barks. Given the description of Quiche, whose body is dyed dark green, who is two inches tall with a strawberry blonde ball, sunglasses and a bonnet, and designer jeans with appliques on, I wonder, isn't that dog somewhat overdressed? Sounds like an SPCA case to me, but at least the song's funny.\n\n&quot;53 Miles West Of Venus&quot; is another one of their space songs. The lyrics are very simple--you figure it out. Hmm, I wonder if that's the hyperspatial wormhole distance between Wild Planet and Venus.\n\nWith the exception of the mid-paced &quot;Dirty Back Road,&quot; the pace doesn't let up. \n\nEnjoy and please seed!!!","torrent":{"xt":"urn:btih:0ce59d28bb6f8c2011b7f83a463f7792cea089f0","amp;dn":"The+B52%5C%27s+-+Wild+Planet+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ce59d28bb6f8c2011b7f83a463f7792cea089f0","infoHashBuffer":{"type":"Buffer","data":[12,229,157,40,187,111,140,32,17,183,248,58,70,63,119,146,206,160,137,240]},"announce":[],"urlList":[]}}