{"title":"Linda Ronstadt - Universal Amphitheatre, LA CA, 1976 (FM)","uid":10727820,"size":348097196,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0cf369d617cf531ea82cfe7fbe6e0b376401c1cc&amp;dn=Linda+Ronstadt+-+Universal+Amphitheatre%2C+LA+CA%2C+1976+%28FM%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"thewaymouth","files":-1,"time":1407596596,"description":"Linda Ronstadt in concert.\n\n\nLinda Ronstadt - &quot;Crazy&quot; (Universal Amphitheatre, LA CA, 1976 FM)\n\n\nUniversal Amphitheatre (Los Angeles, CA)\n\n      Date: 11.03.1976\n      Total Time: 56:26\n\n      Catalog: King Biscuit Flower Hour\n\n      FLAC c/o download from Wolfgang's Vault\n\n      [note: show no longer available for sale there]\n\n\nConcert Set List\n\n    * 1.  That'll Be The Day 2:42\n    * 2.  Love Has No Pride 4:38\n    * 3.  Silver Threads And Golden Needles 2:40\n    * 4.  Willin' 3:28\n    * 5.  It Doesn't Matter Anymore 3:45\n    * 6.  When Will I Be Loved? 2:37\n    * 7.  Crazy 4:24\n    * 8.  Lo Siento Mi Vida 4:30\n    * 9.  Love Is A Rose 2:14\n    * 10. Hasten Down The Wind 2:37\n    * 11. Band Intros 0:55\n    * 12. You're No Good 5:00\n    * 13. Heat Wave 2:44\n    * 14. Crowd 1:16\n    * 15. Heart Like A Wheel 3:13\n    * 16. Crowd 1:22\n    * 17. Desperado 3:40\n    * 18. Someone to Lay Down Beside Me 4:41\n\n\nLinda Ronstadt - vocals\nKenny Edwards - bass, vocals, harp\nAndrew Gold - guitar, vocals\nWaddy Wachtell - guitar, vocals\nMichael Botts - drums\nBrock Walsh - keyboards\nDan Dugmore - pedal steel guitar, guitar, harmonica\n\n____________________________________________________\n\n\nWV: Linda Ronstadt was arguably the most popular female vocalist in America when she recorded a series of shows on her 1976 US tour for the King Biscuit Flower Hour. It took nearly six years from the time she hit gold with her first group, the Stone Ponys, to the time she would finally be at the top of the charts as a solo artist, but throughout this period Ronstadt continued to be an extraordinary interpreter of the best pop songwriters of this era.\n\n\nWith the help of some savvy producers and a great band of support musicians dedicated to making her sound as good as possible, Ronstadt continually delivered great covers such as Buddy Holly's &quot;That'll Be The Day,&quot; Eric Kaz's &quot;Love Has No Pride,&quot; Dusty Springfield's &quot;Silver Threads And Golden Needles,&quot; Lowell George's &quot;Willin,'&quot; Paul Anka's &quot;It Doesn't Matter Anymore,&quot; the Everly Brothers', &quot;When Will I Be Loved?&quot; and Willie Nelson's &quot;Crazy,&quot; originally a massive country hit for Patsy Cline in 1963.\n\n\nShe mixes up-tempo rockers like her re-make of &quot;You're No Good&quot; and the Motown classic, &quot;Heat Wave&quot; with tender ballads such as The Eagles' &quot;Desperado&quot; and her friend Karla Bonoff's tear jerker, &quot;Someone To Lay Down Beside Me.&quot; In all, it was always an incredibly well-rounded set of material when Ronstadt took the stage. This show was no exception.\n\n\nOne of the few female singers of considerable depth and musical substance to come out of the 1970s Southern California music scene, Ronstadt would be wildly popular with both fans and music industry insiders for many years after this show was recorded. She had her first radio hit, a soft rock ballad called &quot;A Different Drummer,&quot; in 1967 with her old band, the Stone Ponys, and she began a string of successful solo LPs in 1969 on Capitol Records. Members of her band included future Eagles Don Henley and Glen Frey. Her breakthough records would come with 1973's Don't Cry Now and 1974's Heart Like A Wheel.\n\n\nRonstadt would remain a pop icon through most of the early 1990s, when she plunged into more eclectic musical projects and collaborations.\n\n__________________________\n\n__________________________\n\n\nFan-made front cover incl\n\n\ntwm SQ rating = 9.5/10\n\n______________________\n\n_______________\n\n\nLinda Ronstadt - The Intrepid Interpreter aka That Just Crazy Beautiful Voice Of 70's Pop Rock\n\n\n2014-08-09 at The Pirate Bay by thewaymouth\n\n\nWolfgang's Vault Comment #thewaymouth | Wednesday, June 25, 2008 | 7:26 pm\n\n\nSimply superb show. &amp; the sound quality is awesome - blows away the other Linda shows up for download. The vault should offer it up. I'd buy it right now.\n\n\nFebruary 4, 2010 - I bought the recording finally made available from Wolfgang's Vault.\n\nIndeed WV came across. And in FLAC no less. Yes!\n\nBut then in 2012, WV abandoned selling all FLAC! And I abandoned WV. (Bill must be rolling over in his grave.) \n\nAnd now, not even in lossy mp3, the vault offers this show for sale no more.\n\n\nBut then Linda does not even have a single live album or DVD in her official catalog. \n\nBut then WHAT-WHAT-WHAT?! Linda does not even have a live show to her name till right now on The Pirate Bay.\n\n\nMeanwhile like just about every performer I know, I prefer her, but especially her, live. \n\n\nAnd not just cause I'm crazy for falling in love twice with her in person prime live (that'll be the daze, back in '74 &amp; '75 with ma da-do-Ron-Ron-on-Boston). For when she comes alive she brings the swing to sing with wings.\n\n\nLinda Ronstadt in The Hasten Down The Wind Tour of 1976. Hasten up the volume on this oh so sweetheart like a wheel.\n\n__________________________________________________________________________\n\n__________________________________________________________________________\n\n\nFeel free to lemme know below, if you want more of some sweet sin er, Lin.\n\nFor more hot Rock Chicks, bitchin bliss kisses, ride the high roll 'er stone on thewaymouth of The Pirate Bay.","torrent":{"xt":"urn:btih:0cf369d617cf531ea82cfe7fbe6e0b376401c1cc","amp;dn":"Linda+Ronstadt+-+Universal+Amphitheatre%2C+LA+CA%2C+1976+%28FM%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cf369d617cf531ea82cfe7fbe6e0b376401c1cc","infoHashBuffer":{"type":"Buffer","data":[12,243,105,214,23,207,83,30,168,44,254,127,190,110,11,55,100,1,193,204]},"announce":[],"urlList":[]}}