{"title":"Cheatbook Database 2015 zip","uid":11783271,"size":69652434,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0d1684011ebeebd0d731181af2d4e56e60ff6e29&amp;dn=Cheatbook+Database+2015+zip%09&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"fake.profile1234","files":1,"time":1427670656,"description":"CheatBook DataBase 2015 - The encyclopedia of game cheats. All Cheats inside from the first CHEATSBOOK January 1998 until today.\n\nCheatbook-DataBase 2015 is a cheats code tracker that makes hints, Tricks, Tips and cheats (for PC, Walkthroughs, Playstation, Playstation 2, Playstation 3, Playstation 4, Sega, Nintendo 64, Nintendo DS, DVD, Gameboy Advance, Gameboy Color, N-Gage, Nintendo DS, XBox, XBox 360, XBox One, iPhone, Gamecube, Dreamcast, Super Nintendo, Wii, Wii U, Sony PSP) easily accessible from one central location.\n\nIf you're an avid gamer and want a few extra weapons or lives to survive until the next level, this freeware cheat database can come to the rescue. Covering more than 22,000 Games Cheats, this database represents all genres and focuses on recent releases. Games are listed alphabetically in the left-hand window. When you click on a game name, the relevant cheat is displayed in a editor window, with convenient buttons that let you print the selection or save any changes you've made. In the latest past many users of the CheatBook-DataBase and readers of the monthly being published magazine have sent to us small error messages and suggestions for improvement again and again. First of all we say &quot;Thank you very much!&quot; to all of you! Due to this assistance and the permanent sending in of new and revised cheats the CheatBook is ever increasing and becoming more and more voluminous.\n\nAll Cheats inside from the first CHEATSBOOK January 1998 until today","torrent":{"xt":"urn:btih:0d1684011ebeebd0d731181af2d4e56e60ff6e29","amp;dn":"Cheatbook+Database+2015+zip%09","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d1684011ebeebd0d731181af2d4e56e60ff6e29","infoHashBuffer":{"type":"Buffer","data":[13,22,132,1,30,190,235,208,215,49,24,26,242,212,229,110,96,255,110,41]},"announce":[],"urlList":[]}}