{"title":"Cornelius Ryan - The Last Battle [audio book]","uid":9037204,"size":454969688,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0d50331b51f176644f40e680f515d5c22cf67475&amp;dn=Cornelius+Ryan+-+The+Last+Battle+%5Baudio+book%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":16,"time":1381535894,"description":"The Last Battle The Classic History of the Battle for Berlin\n\nBy Cornelius Ryan\nPublished by Blackstone Audio in 2012\nTags: nonfiction, history, military, world war 2\nMP3, Unabridged, English (1455156760)\n\nThe classic account of the final offensive against Hitler's Third Reich\n\nThe Battle for Berlin was the culminating struggle of World War II in the European theater. The last offensive against Hitler's Third Reich, it devastated one of Europe's historic capitals and marked the final defeat of Nazi Germany. It was also one of the war's bloodiest and most pivotal battles, whose outcome would shape international politics for decades to come.\n\nThe Last Battle is Cornelius Ryan's compelling account of this final battle, a story of brutal extremes, of stunning military triumph alongside the stark conditions that the civilians of Berlin experienced in the face of the Allied assault. As always, Ryan delves beneath the military and political forces that were dictating events to explore the more immediate imperatives of survival, where, as the author describes it, ''to eat had become more important than to love, to burrow more dignified than to fight, to exist more militarily correct than to win.''\n\nThe Last Battle is the story of ordinary people, both soldiers and civilians, caught up in the despair, frustration, and terror of defeat. It is history at its best, a masterful illumination of the effects of war on the lives of individuals, and one of the enduring works on World War II.","torrent":{"xt":"urn:btih:0d50331b51f176644f40e680f515d5c22cf67475","amp;dn":"Cornelius+Ryan+-+The+Last+Battle+%5Baudio+book%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d50331b51f176644f40e680f515d5c22cf67475","infoHashBuffer":{"type":"Buffer","data":[13,80,51,27,81,241,118,100,79,64,230,128,245,21,213,194,44,246,116,117]},"announce":[],"urlList":[]}}