{"title":"[SexArt] Vanda Lust (Surprise / 09.14.2014)","uid":11033697,"size":294215493,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0d53657ddeb69345bdcf8a4d2165aa8f0ada8ec5&amp;dn=%5BSexArt%5D+Vanda+Lust+%28Surprise+%2F+09.14.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"chkm8te","files":1,"time":1410755182,"description":"[SexArt] Vanda Lust (Surprise / 09.14.2014)\n\nAndrej Lupin's &quot;Surprise&quot; is Vanda Lust's second appearance in a Sexart erotic feature, and it's also her first scene on the site with a male partner. But, in addition to those statistical facts, it's also a bona fide star-turn and an engaging and heated performance that must be seen to be completely appreciated. As the film opens Vanda is getting dressed. She's chosen her outfit deliberately, and the purpose of her costume gives the film its title. That costume consists of demure white thigh-high hose, a button-front white blouse, a pair of embellished white high-top sneakers, and that universally understood symbol of naughtiness, a short, plaid skirt. After stealthily climbing the stairs to present her &quot;Surprise,&quot; Vanda joins Lutro in the study. But Lutro, deeply involved in the book he's intently reading, isn't moved by Vanda's outfit or her advances. Indeed, Lutro resists for longer than seems humanly possible before giving in to Lust's teasing come-ons. But once the bookish stud agrees to stop reading he also assumes the dominant role and treats this beautiful, mischievous nymphet with a firm and aggressive hand. And, in the course of the scene, that hand brings out a rosy glow on the firm, round cheeks of Vanda's beautiful backside. Her pert tits get sucked and nibbled, then Lutro slurps, licks and sucks Lust's up-thrust cunt. This little minx is extremely responsive, giggling, moaning, and gasping as she's orally pleasured, front to back, and back to front. Lust is no less responsive when Lutro begins fucking her, or when she's fucking him back. Ass-slapping continues to add urgency to the action, a pause for some skilled cock-sucking includes genuine enthusiasm and beguiling eye-contact, there's more solid, sizzling, fuck-action, and &quot;Surprise&quot; reaches it's ultimate climax, both literally and figuratively, when Lust gleefully sucks and jerks a generous load from her partner's prick. An irresistible starlet, heated performances, and searing sex make &quot;Surprise&quot; a very pleasant surprise, indeed.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=74oxatk9dibg3fww0xbl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=74oxatk9dibg3fww0xbl.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=g72uty0zbu6zcwex38vs.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=g72uty0zbu6zcwex38vs.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:0d53657ddeb69345bdcf8a4d2165aa8f0ada8ec5","amp;dn":"%5BSexArt%5D+Vanda+Lust+%28Surprise+%2F+09.14.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d53657ddeb69345bdcf8a4d2165aa8f0ada8ec5","infoHashBuffer":{"type":"Buffer","data":[13,83,101,125,222,182,147,69,189,207,138,77,33,101,170,143,10,218,142,197]},"announce":[],"urlList":[]}}