{"title":"Freaks (1932).avi","uid":3992427,"size":731025408,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0d5a1737d95d6693aadc1beda283a9c4d161d699&amp;dn=Freaks+%281932%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"megalilo","files":1,"time":1201119685,"description":"Freaks (1932)\n\nFreaks is a 1932 horror film about sideshow performers, directed and produced by Tod Browning.\n\nThe film was based on Tod Robbins&amp;#039; short story Spurs. Tod Browning took the exceptional step of casting real people with deformities as the eponymous sideshow &quot;freaks,&quot; rather than using costumes and makeup. Director Browning had been a member of a traveling circus in his early years, and much of the film was drawn from his personal experiences. He intended to portray the classic moral of how outer beauty does not necessarily equate to inner beauty. In the film, the physically deformed &quot;freaks&quot; are inherently trusting and honorable people, while the real monsters are two of the &quot;normal&quot; members of the circus who conspire to murder one of the performers to obtain his large inheritance.\n\nReaction to this film was so intense that Browning, famed at the time for his collaborations with Lon Chaney, Sr. and for directing Bela Lugosi in Dracula (1931), had trouble finding work afterwards, and this in effect brought his career to an early close. Because its deformed cast was shocking to moviegoers of the time, the film was banned in the United Kingdom for thirty years.\n\nIn 1994, the film was selected for preservation in the United States National Film Registry as being &quot;culturally, historically, or aesthetically significant&quot;.","torrent":{"xt":"urn:btih:0d5a1737d95d6693aadc1beda283a9c4d161d699","amp;dn":"Freaks+%281932%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d5a1737d95d6693aadc1beda283a9c4d161d699","infoHashBuffer":{"type":"Buffer","data":[13,90,23,55,217,93,102,147,170,220,27,237,162,131,169,196,209,97,214,153]},"announce":[],"urlList":[]}}