{"title":"POtHS - Conspiracy - 062 - GRAY  STATE","uid":12165509,"size":5966305577,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0f5b31c9b0ed598221c34812681042a288cd1058&amp;dn=POtHS+-+Conspiracy+-+062+-+GRAY++STATE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"POtHS11","files":67,"time":1438019765,"description":"POtHS - Conspiracy - 062 - GRAY  STATE\n\n\n\nThe GRAY STATE Project - The Rise, Rough Cut Version that got David Crowely Murdered - DVD:\nThe world reels with the turmoil of war, geological disaster, and economic collapse, while Americans continue to submerge themselves in illusions of safety and immunity. While rights are sold for security, the federal government, swollen with power, begins a systematic takeover of liberty in order to bring about a New World Order.\n\nAmericans, quarantined to militarized districts, become a population ripe for tyrannical control.\nFearmongering, terrorism, police state, martial law, war, arrest, internment, hunger, oppression, violence, resistance - these are the terms by which Americans define their existence. Neighbor is turned against neighbor as the value of the dollar plunges to zero, food supplies are depleted, and everyone becomes a terror suspect. There are arrests. Disappearances. Bio attacks. Public executions of those even suspected of dissent. Even rumors of concentration camps on American soil.\n\nThis is the backdrop to an unfolding story of resistance. American militias prepare for guerilla warfare. There are mass defections from the military as true Patriots attempt to rally around the Constitution and defend liberty, preparing a national insurgency against federal forces, knowing full well this will be the last time in history the oppressed will be capable of organized resistance.\n\nIt is a time of transition, of shifting alliance, of mass awakening and mass execution. It is an impending storm, an iron-gray morning that puts into effect decades of over-comfort and complacency, and Americans wake up to an occupied homeland. It is a time of lists. Black list, white list, and those still caught in the middle, those who risk physical death for their free will and those who sell their souls to maintain their idle thoughts and easy comforts. It is in this Gray State that the perpetuation of human freedom will be contested, or crushed.\n\nIs it the near future, or is it the present? The Gray State is coming - by consent or conquest. This is battlefield USA.\n\n\n\n\nEncompassing the world of conspiracy theory, economic collapse, global disaster, end-time prophecies, martial law, and growing civil unrest, GRAY STATE is a piercing look into the immediate future in which the withered remains of freedom are traded for an impression of security.\n\nGRAY STATE is the reality that can no longer be ignored. It is coming - by consent or conquest.\n\n\nWatch the first official Gray State concept trailer here.\n\nWhat is the Gray State?\nThe GRAY STATE is here. It always was","torrent":{"xt":"urn:btih:0f5b31c9b0ed598221c34812681042a288cd1058","amp;dn":"POtHS+-+Conspiracy+-+062+-+GRAY++STATE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f5b31c9b0ed598221c34812681042a288cd1058","infoHashBuffer":{"type":"Buffer","data":[15,91,49,201,176,237,89,130,33,195,72,18,104,16,66,162,136,205,16,88]},"announce":[],"urlList":[]}}