{"title":"The Art Instinct: Beauty, Pleasure, and Human Evolution[iDeusEx]","uid":8495970,"size":3959377,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f61cc5fa8fcfd04175f9db070bf5f08b23ad5ca&amp;dn=The+Art+Instinct%3A+Beauty%2C+Pleasure%2C+and+Human+Evolution%5BiDeusEx%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"iDeusEx","files":-1,"time":1369145661,"description":"The Art Instinct: Beauty, Pleasure, and Human Evolution\nDenis Dutton (Author)\n\n\n\nThe Art Instinct combines two of the most fascinating and contentious disciplines, art and evolutionary science, in a provocative new work that will revolutionize the way art itself is perceived. Aesthetic taste, argues Denis Dutton, is an evolutionary trait, and is shaped by natural selection. It's not, as almost all contemporary art criticism and academic theory would have it, &quot;socially constructed.&quot; The human appreciation for art is innate, and certain artistic values are universal across cultures, such as a preference for landscapes that, like the ancient savannah, feature water and distant trees. If people from Africa to Alaska prefer images that would have appealed to our hominid ancestors, what does that mean for the entire discipline of art history? Dutton argues, with forceful logic and hard evidence, that art criticism needs to be premised on an understanding of evolution, not on abstract &quot;theory.&quot; Sure to provoke discussion in scientific circles and an uproar in the art world, The Art Instinct offers radical new insights into both the nature of art and the workings of the human mind.","torrent":{"xt":"urn:btih:0f61cc5fa8fcfd04175f9db070bf5f08b23ad5ca","amp;dn":"The+Art+Instinct%3A+Beauty%2C+Pleasure%2C+and+Human+Evolution%5BiDeusEx%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f61cc5fa8fcfd04175f9db070bf5f08b23ad5ca","infoHashBuffer":{"type":"Buffer","data":[15,97,204,95,168,252,253,4,23,95,157,176,112,191,95,8,178,58,213,202]},"announce":[],"urlList":[]}}