{"title":"Olivier Clement - The Roots of Christian Mysticism (pdf)","uid":8187292,"size":2862045,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0fcdf3ff820a761d9b490cdbdc7eb31e0f3e57de&amp;dn=Olivier+Clement+-+The+Roots+of+Christian+Mysticism+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"pharmakate","files":-1,"time":1361749393,"description":"Olivier Clement - The Roots of Christian Mysticism: Text and Commentary (New City, 1995) 380 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nWestern Orthodox theologians (i.e., Eastern Orthodox who live in the West!) are some of the best around, and this is one of the best books by just such a theologian. Absolutely amazing. This is what Christianity is about -- the real thing.\n\nBack cover:\n\nBy linking together a series of brilliantly chosen texts from the early centuries of the Church, the author lays bare the roots of the deeply mystical spirituality that has flourished among Christians throughout the ages. This is a book that will appeal to anyone who is interested i the field of spirituality; it is a masterly contribution to Christian scholarship.\n\n&quot;There are some books so good that all one wants to say is: go out buy it and read it - it is marvellous! And so it is with this fine translation.&quot;\n\n--Andrew Louth, Fairacres Chronicle\n\n&quot;The Roots of Christian Mysticism with its carefully selected texts from Christian tradition, east and west, demonstrates the constant thirst of the human being for the transcendent. Clement shows that our life is ever a mystical wonder.&quot;\n\n--John E. Rotelle, O.S.A., Director Augustinian Heritage Institute, Villanova, PA\n\nBiography:\n\nOlivier Clement is one of the foremost Orthodox theologians of the day. He teaches at the Institute of St. Sergius at Paris and is a member of the Ecumenical Institute founded by L'Institut Catholique.","torrent":{"xt":"urn:btih:0fcdf3ff820a761d9b490cdbdc7eb31e0f3e57de","amp;dn":"Olivier+Clement+-+The+Roots+of+Christian+Mysticism+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fcdf3ff820a761d9b490cdbdc7eb31e0f3e57de","infoHashBuffer":{"type":"Buffer","data":[15,205,243,255,130,10,118,29,155,73,12,219,220,126,179,30,15,62,87,222]},"announce":[],"urlList":[]}}