{"title":"Daryl.Hall.Live.from.Daryl's.House.E27.Eli.Reed.Alan.Gorrie.W","uid":5282894,"size":385634199,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1046218a76bf97cf0bf847b8cb61a12c8ec5e745&amp;dn=Daryl.Hall.Live.from.Daryl%5C%27s.House.E27.Eli.Reed.Alan.Gorrie.W&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"PhillySoul","files":18,"time":1263613335,"description":"Eli &quot;Paperboy&quot; Reed and Alan Gorrie\n\nDaryl Hall and Boston singer/songwriter Eli &quot;Paperboy&quot; Reed, who is about to release his Capitol Records debut, Come and Get It, immediately discovered they had something in common before joining together for the 27th and latest installment of LFDH. As a special added attraction, Average White Band's Alan Gorrie sat in on bass, helping Daryl and Eli cover one of the group's biggest hits, &quot;Pick Up the Pieces.&quot; Both Daryl and Eli are stone soul music freaks, with Reed's odyssey taking him from a preternaturally mature teenage R&amp;B shouter from a Boston high school to a Mississippi Delta juke joint, from Sunday morning gigs behind the organ at a tiny South Side Chicago church to headlining the coolest clubs in Brooklyn with his red-hot band, The True Loves.\n\nIn this episode Daryl and Eli collaborated on a set that includes a cover of Hall and Oates' &quot;It's Uncanny,&quot; from their 1977 No Goodbyes &quot;hits compilation&quot; for Atlantic Records and legendary Philly street corner band The Volcanos' &quot;Storm Warning,&quot; an H&amp;O outtake originally intended for the 1990 album, Change of Season, now included on the recently released Sony Legacy box set, Do What You Want, Be What You Are.\n\nThe performances also includes the Reed originals, &quot;Take My Love With You,&quot; &quot;I Found You Out,&quot; &quot;Pick a Number&quot; and &quot;You Can Run On,&quot; and covers of AWB's &quot;Pick Up the Pieces,&quot; Don Gardner and Dee Dee Ford's &quot;I Need Your Loving Everyday,&quot; The Falcons featuring Wilson Pickett's &quot;I Found a Love&quot; and Chicago soul duo Mel and Tim's &quot;Starting All Over Again,&quot; a song covered by Daryl and John for their 1990 Change of Season album.\n","torrent":{"xt":"urn:btih:1046218a76bf97cf0bf847b8cb61a12c8ec5e745","amp;dn":"Daryl.Hall.Live.from.Daryl%5C%27s.House.E27.Eli.Reed.Alan.Gorrie.W","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1046218a76bf97cf0bf847b8cb61a12c8ec5e745","infoHashBuffer":{"type":"Buffer","data":[16,70,33,138,118,191,151,207,11,248,71,184,203,97,161,44,142,197,231,69]},"announce":[],"urlList":[]}}