{"title":"Sex Slaves [AVI - Documentary - Slavery Exists In Your Neighbour","uid":3911556,"size":376598564,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:104e0b9007432ec26a72fa98f8aea4c45d345e8b&amp;dn=Sex+Slaves+%5BAVI+-+Documentary+-+Slavery+Exists+In+Your+Neighbour&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"lkobescak","files":1,"time":1196189541,"description":"Sex Slaves\n----------\n\nEmmy Award Winner - Best Investigative Documentary\n\nAn estimated half million women are trafficked annually for the purpose of sexual slavery. They are &quot;exported&quot; to over 50 countries including Britain, Italy, Japan, Germany, Israel, Turkey, China, Kosovo, Canada and the United States. Misunderstood and widely tolerated, sex trafficking has become a multi- billion dollar underground industry.\n\nAccording to the International Herald Tribune, human trafficking is the fastest growing form of organized crime in Eastern Europe. Kidnapped and/or lured by those who prey on their dreams, their poverty, and their naivetÃƒÂ©, Eastern European women are trafficked to foreign lands -- often with falsified visas -- where they become modern day sex slaves. Upon arrival, they are sold to pimps, drugged, terrorized, caged in brothels and raped repeatedly. For these women and young girls, there is no life, no liberty and no chance for a happy and meaningful future.\n\nHELP THE VICTIMS: If you are interested in helping any of the victims of sex trafficking who appeared in the documentary Sex Slaves, a trust account has been opened by the production company responsible for the film. The company has been collecting donations and wiring them directly to the victims who appear in the documentary. Should you be interested in helping, you can contact the producers of the film at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;86f0efe5f2efebf5e9e0f2f4e7e0e0efe5edefe8e1c6e7f6eaf2e2a8e5e7&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; for further information. \n\nSex Slaves takes us to &quot;ground zero&quot;; of the sex trade \n- Moldova and Ukraine - where traffickers effortlessly find vulnerable women desperate to go abroad and earn some money. \n\nThe film focuses on the remarkable story of Viorel, a Ukrainian man on a mission to find his pregnant, trafficked wife in Turkey. Our hidden cameras follow Viorel as he travels to Turkey; his only lead the telephone number of the pimp who, he believes, has Katia in his possession. To secure his wife's release, after days of desperate efforts, Viorel poses as a trafficker and sets out to buy his wife back. We follow Viorel to his meeting with Katia's captor and from there into the world of trafficked women. \n\n\nInterwoven with Viorel's story, we meet other victims, traffickers and the families that have been torn apart by the trade in human flesh. Sex Slaves is the first film to have a convicted trafficker talk openly about how trafficking works, and how women are coerced into sexual slavery. With hidden cameras, we watch as traffickers move people across borders with impunity and expose how easy it is to purchase a modern day sex slave.\n\nSex Slaves also takes us to England and Canada where we find victims who tell harrowing tales of being repeatedly sold from country to country. Hiding her identity to protect her life, &quot;Natasha&quot;; shares her heart wrenching story of being bought and sold from Romania to Italy and on to Germany and Belgium. Her final stop was Britain where she was put to work in a north London sauna. &quot;Natasha&quot;; was finally freed from her nightmare in a police raid, a year after her abduction. For her part, &quot;Eva&quot;; thought she was getting a job as a nanny in Toronto until her handlers took her from the airport to a strip club and forced her to work off her &quot;debt&quot;;, i.e., her purchase price, before she could be set free.\n\nSex Slaves explores the global trafficking problem through personal stories and unfettered access to traffickers and the people they use as human chattel. The documentary captures both the investigative story and the human story behind the headlines. From the villages of Moldova and Ukraine, to underground brothels and discotheques, we witness firsthand the brutal world of white sex slavery. \n\nSex Slaves is written and directed by Ric Esther Bienstock, and produced by Bienstock, Felix Golubev and Simcha Jacobovici. Executive Producers are Simcha Jacobovici and Brian Woods, and is produced in association with CBC-TV, Channel 4 and Canal D. For photos, director's notes and reviews visit the filmmakers website.\n\n\nFOR MORE INFORMATION: Visit the PBS Frontline website for more about this story, links to organizations that work with trafficking victims and to watch an excerpt of the film.\n &lt;a href=&quot;\nhttp://www.pbs.org/wgbh/pages/frontline/slaves&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/wgbh/pages/frontline/slaves&lt;/a&gt;\n\n\nRun Time: 55 minutes\n\n\n------------------------------------------------------------------------\n\nAdditional information on September 11th, NWO and the great threat to you can be found ator www.prisonplanet.tv\n\n------------------------------------------------------------------------ \n","torrent":{"xt":"urn:btih:104e0b9007432ec26a72fa98f8aea4c45d345e8b","amp;dn":"Sex+Slaves+%5BAVI+-+Documentary+-+Slavery+Exists+In+Your+Neighbour","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"104e0b9007432ec26a72fa98f8aea4c45d345e8b","infoHashBuffer":{"type":"Buffer","data":[16,78,11,144,7,67,46,194,106,114,250,152,248,174,164,196,93,52,94,139]},"announce":[],"urlList":[]}}