{"title":"This is Wonderland Series 1","uid":9409449,"size":5289657790,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:109d2d1127248112433819e9f312990a674957ca&amp;dn=This+is+Wonderland+Series+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"claudiatannahill","files":14,"time":1388246067,"description":"This Is Wonderland was a Canadian television series which aired on CBC Television. The series was a legal drama with comedic elements, or a comedy-drama.\n\nAlice De Raey, played by Cara Pifko, a young criminal lawyer fresh out of Osgoode Hall Law School, is thrown into a chaotic justice system. She encounters characters ranging from the truly desperate to the bizarre. Alice, with a good-natured openness that cloaks a tenacious, committed spirit, finds herself on a journey that constantly tests her patience and compassion. Alice has a distinctive habit of muttering to herself.\n\nSet in the courtrooms of Toronto's Old City Hall, cast regulars include Michael Riley, Michael Murphy, Michael Healey, Siu Ta, Eric Peterson, Janet-Laine Green and Kathryn Winslow. Jayne Eastwood and Ron Lea joined the cast in 2005.\n\nIn addition to Alice's education in the real world of low rent criminal justice, distinctive features of the Wonderland courtroom include respectful treatment of the mental health concerns of both defendants and the authority figures (judges and lawyers) faced with the contradictions of the system and the multicultural nature of Toronto society. Events in many of the characters' lives overwhelm their ability to emotionally cope and the shortcomings of the &quot;blunt instrument&quot; of the judicial system to address those situations are fully explored. Language and cultural barriers routinely figure into the course of justice, raising questions about the ability of the judicial system to respond to the needs of a changing society.  DVD rip ","torrent":{"xt":"urn:btih:109d2d1127248112433819e9f312990a674957ca","amp;dn":"This+is+Wonderland+Series+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"109d2d1127248112433819e9f312990a674957ca","infoHashBuffer":{"type":"Buffer","data":[16,157,45,17,39,36,129,18,67,56,25,233,243,18,153,10,103,73,87,202]},"announce":[],"urlList":[]}}