{"title":"Smart Kids Games By bobiras2009","uid":7551067,"size":10907399,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:10d61102c6814929f2f94b5d1c638e79f2739066&amp;dn=Smart+Kids+Games+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"bobiras2009","files":-1,"time":1345483681,"description":"                                  By bobiras2009\t\n\n\nRequirements: Android 2.2+\nOverview: Fun learning program for children of all ages.\nSmart Kids Games is a fun learning program for children of all ages.\nImage\n\nContains 15 games in one:\n\n- Learning of letters and numbers sound animated with translation English / Spanish.\n- Learn to recognize more than 100 animals including their sounds, classifieds for pets, farm animals and marine wildlife.\n- Distinguishes shapes and colors and match the pieces.\n- Distinguishes between colors and show your ability to move animated balls around the screen.\n- Practice your memory with &quot;Simon evolution&quot; and &quot;Match the cards&quot;\n- Play with fireworks and try to catch the ball.\n- Learn the sound of musical instruments and play their music.\n- Play puzzles with pictures of your environment.\n- Skilled puzzle with pictures of the most important places in the world.\n- Flash cards with letters of the alphabet illustrated with drawings in various languages.\n- Listen and learn the funny sound of the more familiar vehicles\n\nChildren can have fun playing a long time.\n\nBesides the game to acquire the following skills by playing:\n\n- Improve children's skills in memory, concentration and development of knowledge of their environment.\n- Help with the recognition of the letters of the alphabet and learning english and Spanish languages.\n- Keep the children entertained with fun sound effects and animal sounds, musical instruments and vehicles ..\n- The game is adapted to be handled very easily.\n- Is specifically designed as an educational tool for interface of preschoolers and later.\n\n\n                                  By bobiras2009\t","torrent":{"xt":"urn:btih:10d61102c6814929f2f94b5d1c638e79f2739066","amp;dn":"Smart+Kids+Games+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10d61102c6814929f2f94b5d1c638e79f2739066","infoHashBuffer":{"type":"Buffer","data":[16,214,17,2,198,129,73,41,242,249,75,93,28,99,142,121,242,115,144,102]},"announce":[],"urlList":[]}}