{"title":"Batman Incorporated  v1 01-08 + LS! (2011-2012, Dgtl, Cypher-E)","uid":9536097,"size":195267680,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:115207b7ae65db36f37c0e3cc4a635acc4e1828d&amp;dn=Batman+Incorporated++v1+01-08+%2B+LS%21+%282011-2012%2C+Dgtl%2C+Cypher-E%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1390936855,"description":"For more information about this series, please check out the wikilink here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Batman_Incorporated#Volume_1_.282010.E2.80.932011.29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Batman_Incorporated#Volume_1_.282010.E2.80.932011.29&lt;/a&gt;\n\nGrant Morrison's Batman run continued after the return of Bruce Wayne, as he formed a new international take on Batman and dealt with the mysterious Leviathan organization. Morrison depicted a driven, focused Batman who was only stronger for his recent harrowing experience at the hands of Darkseid, and who wanted to make Batman an multi-national image of justice. The series' first volume explored interesting new takes on old characters long forgotten as well as looking some key relationships that Wayne has had with Catwoman and Batwoman - both professionally and personally. Of course, the overarching menace of Leviathan - and who ultimately was behind it - was a logical and thrilling conclusion, especially when Bruce and his compatriots are forced to endure a seemingly inescapable death trap. The protrayal of Damian Wayne has a lot of added depth in the final chapter. The imagery of ouroboros was used to great effect - in fact, there were a lot of nice local flavors added to the mix both in terms of writing and art. The foreign &quot;feel&quot; was unique to Batman stories and rather enjoyable in terms of a change-up from all-too-familar Streets of Gotham. This torrent contains all 8 issues along with the &quot;Leviathan Strikes!' special that closes the first volume run. Digital copies are provided by Cypher-Empire, please seed and enjoy! :-)","torrent":{"xt":"urn:btih:115207b7ae65db36f37c0e3cc4a635acc4e1828d","amp;dn":"Batman+Incorporated++v1+01-08+%2B+LS%21+%282011-2012%2C+Dgtl%2C+Cypher-E%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"115207b7ae65db36f37c0e3cc4a635acc4e1828d","infoHashBuffer":{"type":"Buffer","data":[17,82,7,183,174,101,219,54,243,124,14,60,196,166,53,172,196,225,130,141]},"announce":[],"urlList":[]}}