{"title":"Kirsty MacColl  Tropical Brainstorm - Flac","uid":3422282,"size":345681209,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1179187458447c84d8d7edc4a122c604d669c85e&amp;dn=Kirsty+MacColl++Tropical+Brainstorm+-+Flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"billysbar","files":13,"time":1134949481,"description":"\nKirsty Maccoll... just brilliant, tragic death... \n\n(http://www.justiceforkirsty.org/)\n\nWill be uploading the following albums..\n\nTropical Brainstorm\nElectric Landlady\nThe One And Only\nGalore\nTitanic Days\nKite\n\n\n... if anyone has anything else by Kirsty... please post it.. or email me..\n\nthanx..\n\n\nTropical Brainstorm:\nThis is a very difficult album to critique in a dispassionate way. A singer/songwriter with a nearly perfect bloodline (her father was Ewan MacColl and Peggy Seeger was her step-mother), Kirsty MacColl had been writing brilliant songs and releasing modestly successful albums since the early '80s. The last time listeners heard from her, on 1993's grim Titanic Days, she had just gone through a painful divorce; she swore that she wouldn't record another album until she could make a happy one. Almost eight years later, she did just that. Tropical Brainstorm is, in part, a celebration of the musical traditions of Cuba, Brazil, and Mexico; mambo and samba rhythms are everywhere, and Latin percussion bumps up against violins, trombones, and nylon-string guitars on almost every track. But the songs' lyrical themes range more broadly -- while &quot;Mambo de la Luna&quot; is all about the flavor of life in Cuba, &quot;England 2, Colombia 0&quot; is a hilarious tale of romantic treachery and &quot;Us Amazonians&quot; a wry depiction of a matriarchal tropical utopia. But even when her lyrics cut to the bone, there's an underlying sense of happiness and good humor that was entirely missing from her last album. And there's the rub. What makes this album so difficult to approach with much critical distance is the fact that MacColl was killed in a boating accident several months after it was completed; she died in the ocean off the coast of Mexico, one of the places that inspired the exuberant and sweet-natured music on this wonderful record. How to listen to this music in the wake of that fact? With grateful joy, one supposes. And with a gentler gratitude that she was this happy at the end of her life -- if Titanic Days had been her last effort, it would have been difficult listening indeed.","torrent":{"xt":"urn:btih:1179187458447c84d8d7edc4a122c604d669c85e","amp;dn":"Kirsty+MacColl++Tropical+Brainstorm+-+Flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1179187458447c84d8d7edc4a122c604d669c85e","infoHashBuffer":{"type":"Buffer","data":[17,121,24,116,88,68,124,132,216,215,237,196,161,34,198,4,214,105,200,94]},"announce":[],"urlList":[]}}