{"title":"Unsealed Conspiracy Files-USA DocuConspiracy Series (2012) S01E0","uid":7942035,"size":165858274,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:11edffba8d590e3b9605148adecd2dab2078b703&amp;dn=Unsealed+Conspiracy+Files-USA+DocuConspiracy+Series+%282012%29+S01E0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"psspss","files":2,"time":1356016373,"description":"Unsealed Conspiracy Files - USA DocuConspiracy Series (2012) S01E01 only xvid avi\n\nEpisode 1 DOOMSDAY.. watch before 21st dec 2012 :) \n\nfound episode 1 in bits and converted and joined and resynced audio to xvid avi\n\ni believe its complete.. each episode is 20min long without ads\n\nthere are 10 episodes in Season 1.. but still trying to source the rest\nperhaps someone has them recorded as they aired sept-oct 2012\n\nENJOY and HELP TO SEED!\n\nnote also missing is a sister series called Unsealed Alien Files also 10 parts\nepisode 3 is floating about but other episode are missing ?\nalso aired in Sept-Oct 2012\n\n---- site INFO\n1 \t1x01 \t24/Sep/2012 \tDoomsday \tN/A\n2 \t1x02 \t01/Oct/2012 \tBio-Hazard Island \tN/A\n3 \t1x03 \t08/Oct/2012 \tMind Control \tN/A\n4 \t1x04 \t15/Oct/2012 \tNew World Order \tN/A\n5 \t1x05 \t22/Oct/2012 \tZombies \tN/A\n6 \t1x06 \t29/Oct/2012 \tHAARP Around the World \tN/A\n7 \t1x07 \t05/Nov/2012 \tCloning \tN/A\n8 \t1x08 \t12/Nov/2012 \tBigfoot \tN/A\n9 \t1x09 \t19/Nov/2012 \tWho Is the Antichrist? \tN/A\n10 \t1x10 \t26/Nov/2012 \tRise of the Machines \tN/A\n\nWe've all heard them ... the Mafia killed JFK, the government had a hand in 9/11 and the existence of aliens is the world's best-kept secret. Conspiracy theories are as old as mankind itself, and for just as long people have been taking sides.\n\nThe Believers claim that those in control have always gone to great lengths to manipulate the &quot;truth&quot;- often to consolidate their power and occasionally to hide truths so shocking that their discovery would alter the course of history. For centuries, kings, governments and power players have covered up discoveries, repressed scientific results and generated propaganda in an effort to keep the common man from knowing the truth. After all, knowledge is power.\n\nThe advent of the internet provides a unique opportunity to level the playing field and give all men equal access to the facts. Suddenly countries are clamoring for their elected officials to release generations' worth of &quot;secret documents&quot; and &quot;sensitive files&quot;.\n\nIn a country &quot;of the people, by the people and for the people&quot; this information belongs to every American citizen. In April 2011, the FBI finally relented and established an online repository of files, documents and reports called &quot;The Vault&quot;.\n\nUnsealed: Conspiracy Files is a ground breaking new show that shines a light on many of these archived case files.\n\nEach week Unsealed will tackle one compelling conspiracy theory by opening these and other previously off-limits secret files. Based on the new information found there, we will re-examine faulty assumptions, look for inconsistencies, and follow developing leads. In addition, a new generation of experts has harnessed the burgeoning power of new technologies to take their research farther then ever anticipated.\n\nThe show will feature cutting edge graphics, engaging music and a fast, energetic style that will appeal to experts and novices alike. Unsealed will have hardcore conspiracy fans and curious, open-minded newbies wanting more.\n\nUnsealed: Conspiracy Files ... welcome to the world of Conspiracy! \n\n","torrent":{"xt":"urn:btih:11edffba8d590e3b9605148adecd2dab2078b703","amp;dn":"Unsealed+Conspiracy+Files-USA+DocuConspiracy+Series+%282012%29+S01E0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11edffba8d590e3b9605148adecd2dab2078b703","infoHashBuffer":{"type":"Buffer","data":[17,237,255,186,141,89,14,59,150,5,20,138,222,205,45,171,32,120,183,3]},"announce":[],"urlList":[]}}