{"title":"RealtimeBondage--Broken Blonde Part 3  Rain DeGrey  Ashley Lane ","uid":10247588,"size":1150809267,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:11f8fd23631d1d2e7ee0ea620e5fe8b1c95203e3&amp;dn=RealtimeBondage--Broken+Blonde+Part+3++Rain+DeGrey++Ashley+Lane+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"merzedes","files":-1,"time":1401310818,"description":"Broken Blonde 3 | Rain DeGrey | Ashley Lane\n\nMay 24, 2014\n\n\nMP4 only.\n\n\nRain DeGrey enjoys watching Ashley Lane cum. It's nice to see someone else get their pussy tortured with intense vibrations for a bit. This beautiful redhead has a banging body, firm tits, and an amazingly sensitive pussy. So sensitive that a few minutes with the Hitachi has her screaming her lungs out through the ball gag in her mouth. It's a complete orgasm overload for Ashley. She would snap her legs shut forever if they weren't held open by chains. We're going to keep her cumming until her eyes roll back in her head and her voice gives out.\n\nRain won't get to look on forever, though. We have something even more intense in store for her. The Hitachi may be the most powerful hand held vibrator, but it pales in comparison to the power of the Sybian. Rain won't even have her feet on the ground while she rides this motorized monster. All of her weight will keep her clit pressed firmly against the machine. It's powerful enough to tear orgasms for her aching pussy through caning, breath-control, and whatever other distractions we provide. She has no hope of escape. Just like Ashley, all she can do is scream and cream.\n\nUnlike our lovely decoration, Rain isn't done after a bit of fun. We've got her face down and ass up, bound by her ankles and wrists over a barrel. Ashley is looking on from her cage, happy that what comes next isn't happening to her. Rain gets caned so brutally that the welts form instantly. She's whipped so hard that her back is covered in stripes. Tears pour down her face and she grips her bondage for support. She's spitting, cursing and crying but we don't let us for a second. She said she didn't feel challenged enough earlier. Well, she certainly doesn't have that problem now. \n \nScreens &lt;a href=&quot;\nhttp://www.realtimebondage.com/live/bondage/2014/05_24rdegrey11/RealTimeBondage-Rain-DeGrey-Ashley-Lane-Broken-Blonde-3.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.realtimebondage.com/live/bondage/2014/05_24rdegrey11/RealTimeBondage-Rain-DeGrey-Ashley-Lane-Broken-Blonde-3.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:11f8fd23631d1d2e7ee0ea620e5fe8b1c95203e3","amp;dn":"RealtimeBondage--Broken+Blonde+Part+3++Rain+DeGrey++Ashley+Lane+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11f8fd23631d1d2e7ee0ea620e5fe8b1c95203e3","infoHashBuffer":{"type":"Buffer","data":[17,248,253,35,99,29,29,46,126,224,234,98,14,95,232,177,201,82,3,227]},"announce":[],"urlList":[]}}