{"title":"STAR WARS: The Unaltered Original Trilogy (MKV files)","uid":8829765,"size":15296318838,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:12118e24c75cef248e7d5e7c848553e0c1d88b4a&amp;dn=STAR+WARS%3A+The+Unaltered+Original+Trilogy+%28MKV+files%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Spandex_Angel","files":-1,"time":1376937524,"description":"Spandex_Angel's very first torrent!\n----------------------------------------------------\nWhat you have here is the original Star Wars Trilogy as they were first presented before George Lucas &amp; Friends decided to go beyond a simple digital restoration and instead place all kinds of cartoon shit in the movies we love.  There's no more Looney Tunes entry into Mos Eisley.  Boba Fett has his original voice before he was redubbed to sound like Jango Fett.  That stupid digital song and dance sequence in Jabba's place... GONE!  There's no Hayden Christensen at the end of ROTJ, and we get back our beloved Yub Nub!  We even have the original monkey-eyed Emperor in ESB, voiced by Clive Revil.\n\nThis comes from the DVD editions by Demonoid.com and uploaded by Legendarian.  That release has 3 burnable ISO files meant for dual-layer discs, and it came with menus and multiple subtitles.\n\nThe problem I had with that release was that the picture was too small.  The video was widescreen, but for a 4:3 television; thus it looked like a small rectangle surrounded by black bars.  Also, the subtitles looked ugly on my screen as I viewed them with VLC.\n\nI used Handbrake to rip the DVD files and turn them into MKVs, while also cropping the picture for 16:9 widescreen displays.  I also remade the alien subtitles separately and used mkvmerge to add the subtitles to the files.  You can see the before &amp; after by looking at MKV_Fix.jpg.\n\n----------------------------------------------------\n\nWhat's missing from this release?  Well, I actually remade the movies into MKVs for my own personal viewing and decided to place these online for others only as an after-thought.\n\nTherefore, there are no subtitles in any language throughout the movies EXCEPT for the alien subtitles in English.  I know this sucks for some of you, but my plan is to burn all 3 mkv files onto one Blu-ray disc, and I wanted to make sure the alien subtitles popped up correctly without having to mess around with my remote.\n\n-----------------------------------------------------\n\nI know the quality looks a little low.  That's because the screen was small to begin with, and now it's expanded.  However, you will not find any better online, at least for now.  I've found that the picture looks better than VHS when I sit back from the TV at a normal viewing distance.\n\n----------------------------------------------------\nSPECS:\n\tSTAR WARS:\n\t\tLength:\t\t02:01:07\n\t\tFrame:\t\t714x274\n\t\tTotal Bitrate:\t5354kbps (upconverted)\n\t\tFrame rate:\t23fps\n\t\tVideo Tracks:\tH264 (High @L3.0)\n\t\tAudio Tracks:\tAAC 2.0(eng); AC3 2.0 (eng)\n\t\tChannels:\t2 (stereo)\n\t\tAudio SR:\t48kHz\n\n\tESB:\n\t\tLength:\t\t02:04:53\n\t\tFrame:\t\t716x274\n\t\tTotal Bitrate:\t5361kbps (upconverted)\n\t\tFrame rate:\t23fps\n\t\tVideo Tracks:\tH264 (High @L3.0)\n\t\tAudio Tracks:\tAAC 2.0(eng); AC3 2.0 (eng)\n\t\tChannels:\t2 (stereo)\n\t\tAudio SR:\t48kHz\n\n\tROTJ:\n\t\tLength:\t\t02:11:42\n\t\tFrame:\t\t708x274\n\t\tTotal Bitrate:\t5355kbps (upconverted)\n\t\tFrame rate:\t23fps\n\t\tVideo Tracks:\tH264 (High @L3.0)\n\t\tAudio Tracks:\tAAC 2.0(eng); AC3 2.0 (eng)\n\t\tChannels:\t2 (stereo)\n\t\tAudio SR:\t48kHz\n\n----------------------------------------------------\n(Note:  Lucasfilm or Disney does not lose any money because you download this, BECAUSE YOU CAN'T FIND THIS TRILOGY UNLESS YOU BUY IT OFF eBAY!  I'll take this torrent down the day they release the theatrical releases of the Star Wars original trilogy on DVD and/or Blu-Ray.)\n----------------------------------------------------\nHOPE YOU ENJOY!!!","torrent":{"xt":"urn:btih:12118e24c75cef248e7d5e7c848553e0c1d88b4a","amp;dn":"STAR+WARS%3A+The+Unaltered+Original+Trilogy+%28MKV+files%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12118e24c75cef248e7d5e7c848553e0c1d88b4a","infoHashBuffer":{"type":"Buffer","data":[18,17,142,36,199,92,239,36,142,125,94,124,132,133,83,224,193,216,139,74]},"announce":[],"urlList":[]}}