{"title":"Lynch-Frost - On the air 7.avi","uid":4535959,"size":244193280,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1224a1600490a6b3b6a61dc6fe103fc4de61d96e&amp;dn=Lynch-Frost+-+On+the+air+7.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"the_corpse_vanished","files":1,"time":1227735398,"description":"The year is 1957. A new program entitled &quot;The Lester Guy Show&quot; is debuting on the Zoblotnick Broadcasting Corporation (ZBC). Most of the cast is nuts, the crew is incompetent and everything that could go wrong always does. Of course, this makes the show a hit.\n\nWhile mixing the sound for an episode of the second season of Twin Peaks, Lynch was hit with a sudden inspiration. &quot;It just came into my head, the idea of people trying to do something successful and having it all go wrong.&quot; Following the initial success of Twin Peaks, David Lynch and Mark Frost were hot properties in Television. When they approached ABC with the idea for &quot;On the Air,&quot; the network was eager to take them up on the offer. The show itself was a half-hour absurdist comedy featuring many of the cast and crew from Twin Peaks. The pilot tested very well, and six more episodes were ordered. However, by the time it came to scheduling the On the Air, things with Twin Peaks had already fallen apart, and the network was no longer eager to work with Lynch. &quot;During that time everything was going belly up with Twin Peaks, and there wasn't any support from ABC for this show at all. They really hated it.&quot; The series' broadcast was delayed and finally run during the summer, a time when most networks know people are away from their television sets, thus they dump undesirable shows then. Lynch knew the timeslot meant certain death for the show at the hands of the network. &quot;I've heard that summertime is pretty much the worst time you can be on, but we're going on in summer. I've heard that Saturday night is the worst night of the week to be on, and we're going on Saturday night.&quot; As expected, the show received poor ratings, and only three of the seven episodes were aired by ABC before they gave it the axe (all seven episodes were aired overseas however).\n\n\nEPISODE 07 (finale)\n\nEpisode 7\nOriginal air date: Never aired in the U.S.\nProduced by Deepak Nayar\nCo-Executive Producer: Robert Engels\nWritten by David Lynch and Robert Engels\nDirected by Jack Fisk\n\nGuest Starring: John Quade (Billy &quot;the ear&quot; Mulkahey), Bellian Logan (Woman with no name), Sydney Lassick (Mr. Zoblotnick)\nFeaturing: Gregory Sporleder (sax player) Irwin Keyes (shorty the stagehand), Everett Greenbaum (announcer), Buddy Douglas (Buddy Morris), Raleigh Friend (hurry up twin), Raymond Friend (hurry up twin).\n\nSummary:\nLester tries to convince Budwaller to put the Woman With No Name, a beatnik from &quot;downtown&quot; on the show. Betty has forgotten her mother's name for two days and is worried. Gochktch is fascinated with the beatnik and her boots. Meanwhile, Lester and Nicole plot to ruin Betty using a voice disintegrator to mess up her voice. Mr. Zoblotnick pays a visit to the set to see the great beatnik Gochktch has been telling his uncle about. Lester and Nicole's plan isn't going well as they can't get Betty to say anything. She refuses to speak until she remembers her mother's name. Instead they plan to use the machine live during the show. The only problem is, the machine accidentally switches itself to be aimed at Lester instead of Betty. Gochktch and Mr. Z are still obsessed by the beatnik. Showtime arrives, and Lester is humiliated by his voice being distorted by the voice disintegrator machine. The Woman With No Name performs. Betty, while singing, remembers that her mother's name is Mary. Ruth finally realizes that &quot;beatnik&quot; is German for &quot;bootmaker,&quot; hence the reason Gochktch and Mr. Z keep bringing her boots. Everyone joins end and performs with the Woman With No Name.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0103505/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0103505/&lt;/a&gt;\n\nEp. 1-3 &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4535328/Lynch-Frost_-_On_the_air_1-3.avi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4535328/Lynch-Frost_-_On_the_air_1-3.avi&lt;/a&gt;\n\nEp. 4-6 &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4535943/Lynch-Frost_-_On_the_air_4-6.avi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4535943/Lynch-Frost_-_On_the_air_4-6.avi&lt;/a&gt;\n","torrent":{"xt":"urn:btih:1224a1600490a6b3b6a61dc6fe103fc4de61d96e","amp;dn":"Lynch-Frost+-+On+the+air+7.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1224a1600490a6b3b6a61dc6fe103fc4de61d96e","infoHashBuffer":{"type":"Buffer","data":[18,36,161,96,4,144,166,179,182,166,29,198,254,16,63,196,222,97,217,110]},"announce":[],"urlList":[]}}