{"title":"Richard Dawkins: How A Scientist Changed the Way We Think","uid":9061232,"size":3248683,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12a4a4448d26c61edff483199ae29757555977e9&amp;dn=Richard+Dawkins%3A+How+A+Scientist+Changed+the+Way+We+Think&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Robin1966","files":4,"time":1382045916,"description":"Books : Biography : English\n\n\nAlan Grafen, ?Mark Ridley - Richard Dawkins: How a Scientist Changed the Way We Think\nPublished: 2007-05-17 | ISBN: 0199214662 | EPUB + MOBI | 304 pages | 3 MB\n\n\nWith the publication of the international bestseller The Selfish Gene some thirty years ago, Richard Dawkins powerfully captured a newly emerging way of understanding evolution--a gene's eye view. Dawkins went on to publish five more bestselling books, including The Blind Watchmaker and Unweaving the Rainbow. He is one of the most high profile public intellectuals today and any attempt to understand the scientific view of the world must grapple with his ideas.\n\nNow, in this exciting collection of original essays, some of the world's leading thinkers offer their take on how Dawkins has changed the way we think. Readers will find stimulating pieces by Daniel Dennett, the renowned philosopher of mind and author of Darwin's Dangerous Idea; Steven Pinker, the brilliant Harvard linguist who wrote The Language Instinct and The Blank Slate; Matt Ridley, author of the bestselling Genome; and James Watson, who with Francis Crick discovered the structure of DNA, arguably the greatest scientific discovery of the last century. Dawkins' widely admired literary style forms the subject of several pieces, including one from novelist Philip Pullman (author of the bestselling His Dark Materials trilogy). As one of the world's best known rationalists, Dawkins' stance on religion is another theme in this collection, explored by Simon Blackburn, Michael Ruse, Michael Shermer, and the Bishop of Oxford. Numbering twenty in all, these articles are not simply rosy tributes, but explore how Dawkins' ideas have shaped thinking and public debate, and include elements of criticism as well as thoughtful praise.\n\nRichard Dawkins' work has had the rare distinction of generating as much excitement outside the scientific community as within it. This stimulating volume is a superb summation of the depth and range of his influence.\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:12a4a4448d26c61edff483199ae29757555977e9","amp;dn":"Richard+Dawkins%3A+How+A+Scientist+Changed+the+Way+We+Think","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12a4a4448d26c61edff483199ae29757555977e9","infoHashBuffer":{"type":"Buffer","data":[18,164,164,68,141,38,198,30,223,244,131,25,154,226,151,87,85,89,119,233]},"announce":[],"urlList":[]}}