{"title":"The Divine Comedy - Casanova [1996]","uid":9470289,"size":368271427,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:132b6fbdf7e294d245a6ddba7135817e02e6279c&amp;dn=The+Divine+Comedy+-+Casanova+%5B1996%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GenXRock","files":-1,"time":1389550798,"description":"Review by Ned Raggett  [-]\nTurning back to a slightly more straightforward rock/pop format turned out to be advantageous for Neil Hannon; Casanova turned into a smash hit in the U.K., while the singles &quot;Something for the Weekend&quot; (at once soaring, cheeky, leering, and truly weird, with lyrics detailing a guy led astray by his lover and attacked by her secret thug companions) and &quot;Becoming More Like Alfie&quot; (a sly '60s acoustic pop number with solid percussion, sampling the Michael Caine movie in question and reflecting on how all the wrong people in life seem to get the girls) became Top Ten charters. Recruiting the equivalent of a full orchestra didn't hurt either, fleshing out the classical/art rock/pop Divine Comedy fusion to even more expansive ranges than before, while drummer Darren Allison and Hannon continued overseeing and co-producing everything, again demonstrating their careful collective ear for the proceedings. Hannon's lyrical music fires on all cylinders as well, from the cockeyed vision of romance in &quot;The Frog Princess&quot; (with more than one low-key French reference in both lyrics and sweeping music) to the wickedly funny and elegant &quot;Songs of Love,&quot; detailing how boys and girls seem to be in heat everywhere while all the songwriters are stuck alone writing the title objects in question. In the meantime, there are great one-off moments scattered throughout Casanova. For instance, Hannon's impersonation of a modern dandy as fortune teller at the start of &quot;Middle-Class Heroes&quot; is to die for. He also does one of the best Barry White takeoffs yet recorded in the mid-song break of &quot;Charge,&quot; packed with Tennyson references and army commands amid swirling strings and an increasingly loud beat. After topping that off with &quot;Theme from Casanova,&quot; a slightly tongue-in-cheek number detailing all the basic credits and inspiration for the album, the result is a massive project that hits the jackpot with smiles all around. (4.5/5)","torrent":{"xt":"urn:btih:132b6fbdf7e294d245a6ddba7135817e02e6279c","amp;dn":"The+Divine+Comedy+-+Casanova+%5B1996%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"132b6fbdf7e294d245a6ddba7135817e02e6279c","infoHashBuffer":{"type":"Buffer","data":[19,43,111,189,247,226,148,210,69,166,221,186,113,53,129,126,2,230,39,156]},"announce":[],"urlList":[]}}