{"title":"J.River Media Jukebox Version. 12.0.534","uid":4418436,"size":13356915,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:133e44eda71d40dc0c898495b9adb58366c11a4c&amp;dn=J.River+Media+Jukebox+Version.+12.0.534&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"xxThugxx","files":2,"time":1222646650,"description":"\n\n\n                        *******   *    *  *     *   *****\n                           *      *    *  *     *   *\n                           *      ******  *     *   *\n                           *      *    *  *     *   * ****\n                           *      *    *  *     *   *    *\n                           *      *    *  *******   ******\n\n        \n                                  \n                               J.River Media Jukebox\n\n\n\nListen most formats, burn CDs, rip MP3s and much more with Media Jukebox 8. \nThis advanced jukebox software is for playing MP3s and ripping, burning, and managing a digital music collection. \n\n\nJ.River Media Jukebox will encode your files to WMA, MP3, OGG, and APE.\nThe Media View feature gives you control over file organization. It supports more than 20 media file formats, including MP3, RealMedia, Windows Media, and QuickTime. \n\n\nThe Find CD feature lets you search for purchasable music by the currently playing artist. Tune into Web radio or watch TV/DVD on your PC. \n\n\nA Visualization Studio feature lets you create your own savable visualizations, \nand a DSP Studio allows customization of the listening environment. Other utilities include Media Scheduler for sleep, alarm, and recording functions, and Media Editor for editing sound files. .\n\n\nThe new Download Manager utility works seamlessly with sites such as Emusic.com for easy download and playback of tracks and albums.\n\nMedia Jukebox is foremost a media file organizational tool,which includes an easy to navigate media tree. Group or access tracks by Artist, Album, Playlist and by Category. \n\nMedia Jukebox will extract file information and automatically categorize and assign your music collection where you want it. Files can also be organized manually by dragging and dropping tracks.\n\nThe organization tree gives you instant access to find and play your favorite files, export them to a handheld player, stream Web TV and radio and search for on-line music.\n\nHere are some key features of &quot;J River Media Jukebox&quot;:\n\nÃ‚Â· Collect, organize and play your digital music collection. Handles more files than any other jukebox \nÃ‚Â· Sync to iPods, PlaysForSure Devices, and some phones \nÃ‚Â· Create unlimited Playlists and Smartlists from your music library \nÃ‚Â· Flexible library database lets you create custom View Schemes to browse your collection as you wish \nÃ‚Â· Rip and Burn at top speed for free \nÃ‚Â· Encode files to a variety of formats, including WMA, OGG, APE and FLAC \nÃ‚Â· Buy DRM-free tracks from the Amazonmp3 store and import them automatically into your library \nÃ‚Â· The best sound performance with high-quality DSP settings, bit-perfect music, and full support \nfor a range of lossless music formats and ASIO \n\n\n\n\n\n","torrent":{"xt":"urn:btih:133e44eda71d40dc0c898495b9adb58366c11a4c","amp;dn":"J.River+Media+Jukebox+Version.+12.0.534","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"133e44eda71d40dc0c898495b9adb58366c11a4c","infoHashBuffer":{"type":"Buffer","data":[19,62,68,237,167,29,64,220,12,137,132,149,185,173,181,131,102,193,26,76]},"announce":[],"urlList":[]}}