{"title":"Chasing the Devil- My Twenty-Year Quest to Capture the Green Riv","uid":11463337,"size":2160926,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:136b54d005002752616b8eed30ed2ff8d892efb1&amp;dn=Chasing+the+Devil-+My+Twenty-Year+Quest+to+Capture+the+Green+Riv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1416011997,"description":"The riveting personal account of one sheriffs epic hunt for America's most heinous serial killer. For eight years, Sheriff David Reichert devoted days and nights to capturing the Green River Killer--the most notorious serial killer in American history. He was the first detective on the case in 1982 and doggedly pursued it as the body count climbed to 49 and it became the most infamous unsolved case in the nation. Frantically following all leads, even as more bodies surfaced near the river outside Seattle, Sheriff Reichert befriended the victims families, publicly challenged the killer, and risked his own safety--and the endurance and love of his family--before he found his madman. But Reicherts hunt didnt end when he finally cornered a truck painter named Gary Ridgway. It would be yet another 11 haunting years before forensic science could prove Ridgways guilt beyond a shadow of a doubt. CHASING THE DEVIL is the gripping firsthand account of Reicherts relentless pursuit--a 21-year odyssey full of near-misses and startling revelations. Told in vivid detail by the man who knows the whole story--the man who has stared into the eyes of absolute evil--this is a page-turning real-life suspense story of unparalleled heroism","torrent":{"xt":"urn:btih:136b54d005002752616b8eed30ed2ff8d892efb1","amp;dn":"Chasing+the+Devil-+My+Twenty-Year+Quest+to+Capture+the+Green+Riv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"136b54d005002752616b8eed30ed2ff8d892efb1","infoHashBuffer":{"type":"Buffer","data":[19,107,84,208,5,0,39,82,97,107,142,237,48,237,47,248,216,146,239,177]},"announce":[],"urlList":[]}}