{"title":"The Wrong Hands: Popular Weapons Manuals (2015) pdf","uid":11976573,"size":2024315,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:137f79334688018a68a521e457841121070b71c2&amp;dn=The+Wrong+Hands%3A+Popular+Weapons+Manuals+%282015%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":1,"time":1433038264,"description":"The Wrong Hands: Popular Weapons Manuals and Their Historic Challenges to a Democratic Society\n\n\n In 1885, there was The Science of Revolutionary Warfare. In 1971, there was The Anarchist Cookbook. In 2012, the Boston Marathon bombers turned to the Internet to learn how to make explosives. For well over a century, the United States government has regarded the circulation of weapons manuals and instruction booklets by radicals as not only dangerous, but criminal. \n\n In The Wrong Hands, Ann Larabee traces the nuanced history of do-it-yourself weapons manuals from the late nineteenth century to the present to explain the trajectory of violent radicalism and how it provokes the state's evolving policy toward radical dissent. Larabee begins with Johann Most's The Science of Revolutionary Warfare, which allegedly served as a cookbook for the accused Haymarket Square bombers of 1886. The judge at the Haymarket trial allowed it to be admitted as evidence, setting a precedent for prosecutorial use of such texts against radicals. Health Is in You!, a bombmaking guide circulated by Italian anarchists, further attracted the attention of federal police, and sabotage books were introduced in show trials of labor activists. In the 1960s, small paramilitary publishers produced instructions, largely drawn from US military sources, to cater to a growing popular interest in do-it-yourself weapons making. Published in 1971, The Anarchist Cookbook achieved legendary status and a lasting presence in the courts. The book's critics immediately connected it to the wave of bombings by left-wing radicals of the era, particularly the Weather Underground. Novelistic instructions for bombmaking, as in Edward Abbey's The Monkey Wrench Gang and William Pierce's The Turner Diaries, provided controversial evidence in prosecutions of radicals on the left and right, including Earth Firsters and Timothy McVeigh. Over the last twenty years, sites have proliferated online explaining how to make weapons, including suicide vests, and older print instructions have been digitized. The struggle over the state's responsibility to police such information has long hinged on whether its disseminators are legitimate. An unevenly applied federal terror policy has increased the penalties for possessing popular weapons instructions if those instructions end up in 'the wrong hands' like right-wing militia figures and jihadists (including the Boston Marathon bombers). Larabee ends with an analysis of the 1979 publication of instructions to make a nuclear weapon, which raises the ultimate question: can a society committed to free speech allow these sorts of manuals to disseminate freely? \n\n A comprehensive account of an alarming yet persistent historical phenomenon, The Wrong Hands will reshape our understanding of radical violence and state repression in American history","torrent":{"xt":"urn:btih:137f79334688018a68a521e457841121070b71c2","amp;dn":"The+Wrong+Hands%3A+Popular+Weapons+Manuals+%282015%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"137f79334688018a68a521e457841121070b71c2","infoHashBuffer":{"type":"Buffer","data":[19,127,121,51,70,136,1,138,104,165,33,228,87,132,17,33,7,11,113,194]},"announce":[],"urlList":[]}}