{"title":"The &quot;Uncensored War&quot;: The Media and Vietnam","uid":11740530,"size":20496224,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1401d6e6c1b0f9f4af8e02c2d554de6d43420b3a&amp;dn=The+%26quot%3BUncensored+War%26quot%3B%3A+The+Media+and+Vietnam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425785381,"description":"Vietnam was America's most divisive and unsuccessful foreign war. It was also the first to be televised and the first of the modern era fought without military censorship. From the earliest days of the Kennedy-Johnson escalation right up to the American withdrawal, and even today, the media's role in Vietnam has continued to be intensely controversial. The &quot;Uncensored War&quot; gives a richly detailed account of what Americans read and watched about Vietnam. Hallin draws on the complete body of the New York Times coverage from 1961 to 1965, a sample of hundreds of television reports from 1965-73, including television coverage filmed by the Defense Department in the early years of the war, and interviews with many of the journalists who reported it, to give a powerful critique of the conventional wisdom, both conservative and liberal, about the media and Vietnam. Far from being a consistent adversary of government policy in Vietnam, Hallin shows, the media were closely tied to official perspectives throughout the war, though divisions in the government itself and contradictions in its public relations policies caused every administration, at certain times, to lose its ability to &quot;manage&quot; the news effectively. As for television, it neither showed the &quot;literal horror of war,&quot; nor did it play a leading role in the collapse of support: it presented a highly idealized picture of the war in the early years, and shifted toward a more critical view only after public unhappiness and elite divisions over the war were well advanced. The &quot;Uncensored War&quot; is essential reading for anyone interested in the history of the Vietnam war or the role of the media in contemporary American politics","torrent":{"xt":"urn:btih:1401d6e6c1b0f9f4af8e02c2d554de6d43420b3a","amp;dn":"The+%26quot%3BUncensored+War%26quot%3B%3A+The+Media+and+Vietnam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1401d6e6c1b0f9f4af8e02c2d554de6d43420b3a","infoHashBuffer":{"type":"Buffer","data":[20,1,214,230,193,176,249,244,175,142,2,194,213,84,222,109,67,66,11,58]},"announce":[],"urlList":[]}}