{"title":"Factorio 0.11.3 x64 - x86 [experimental release]","uid":11469460,"size":1040397900,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1412f3d6a8cf3685fe9fb55404bd694d5842ac76&amp;dn=Factorio+0.11.3+x64+-+x86+%5Bexperimental+release%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":7,"uploader":"AzaZPPL499","files":7,"time":1416067218,"description":"Contains:\n\nLinux:\nLinux x64 - x32/factorio_alpha_i386_0.11.3.tar\nLinux x64 - x32/factorio_alpha_x64_0.11.3.tar\n\nMac:\nMac x64/factorio_alpha_0.11.3.dmg\n\nWindows:\nWindows x64 - x32/Setup_Factorio_Win32_0.11.3.exe\nWindows x64 - x32/Setup_Factorio_x64_0.11.3.exe\nWindows x64 - x32/Factorio_Win32_0.11.3.zip\nWindows x64 - x32/Factorio_x64_0.11.3.zip\n\nVersion:\nBugfix release 0.11.3 is here.\n\nPlease note, that we didn't fix all the reported bugs, but we just tried to solve the most game braking ones.\n\nBugfixes\nFixed crash when building trains.\nFixed that the sandbox scenario was not working.\n(Hopefully) Fixed the missing inet_pton message thus fixing the WinXP compatibility.\nFixed that the alert sounds were not working sometimes.\nFixed crashes when roboport was destroyed or lost power.\nFixed potential crash after using game.removeofflineplayers.\n\nUse the automatic updater if you can (check experimental updates in other settings)\n\nSo the first proper bugfix release for 0.11 is here.\n\nPlease note, that we didn't fix all the reported bugs, but we just tried to solve the most game braking ones.\nThe mac update package is not available until tomorrow.\n\nFeatures:\nMods that don't affect game state are not needed to be synchronised when playing multiplayer game or replaying game. This mainly solves the problem of multiplayer games where some of the people had scenario pack mod and some hadn't.\n\nGraphics\nNew graphics of construction and logistic robots.\n\nBugfixes\nReenabled the windows xp support.\nFixed various buildability collisions problems.\nFixed crashes when using walls in blueprints.\nFixed crash when previewing gates on rails in blueprint.\nFixed problems when rotating blueprint with walls or rotating already built wall.\nFixed that the new hope campaign wasn't working.\nFixed that the &quot;can't build sound&quot; of all players was always played to the first player.\nFixed that the capsule range visualisation was drawn for all players.\nFixed the wrong localisation of No path message of train.\nFixed the script error when finishing FirstSteps/New hope campaigns.\nFixed crashes when someone uses nmap on a computer running MP game.\nFixed multiplayer 3 player &quot;recurring dropping&quot; problem (viewtopic.php?t=6414).\nShift + space pause is switched off when typing in console.\nShift + space pause is switched off in the multiplayer.\nFix that childrennames-method only returns a single name instead of all\nStarting equipment in freeplay is given to all the new players.\nFixed that the Allows+Requires+Cost was not wrapped as the effects list in the technology preview window.\nFixed that single item got stuck in underground belt until second item entered it.\nSave settings when game automatically sets bitmap-caching because of VRAM shortage.\n(viewtopic.php?f=7&amp;t=6467)\nFixed crash when crafting weapon / ammo in the vehicle (viewtopic.php?f=7&amp;t=6296).\nFixed that modules couldn't be used in electric furnace (viewtopic.php?f=7&amp;t=6337).\nFixed crashes in multiplayer freeplay after building rocket defense.\nFixed train movement problems - both desync and the &quot;Ok, so we didn't make the train movement right&quot; errors.\nFixed that ghosts of turrets were not removed when turret was built over.\nAttempted to fix the &quot;receiveMovementImpulse ended up with unreasonable position&quot; car and tank error.\nUnified the Floating point model on all windows distributions. That might solve the 32bit/64bit desync issues.\nFixed bug with double-clicking in assembler gui during autosaving (viewtopic.php?f=7&amp;t=6515).\nFixed bug with burner inserter grabbing coal even when setup with full stack (viewtopic.php?t=5856).\nFixed that the command /c game.regeneratetiles could crash easily, because it didn't take the parallel map generation into account.\nFixed train description speed units and locale.\n\nChanges\nIn multiplayer game anyone can unpause the game (not just the one who paused it).\nWalls and gates are fast replacable.\nIn Multiplayer, research progress gui (in the top right) blinks once research has completed.\nThere is no technology window popup anymore. This is optional behavior in single player as well.\nFixed bug that SP game wouldn't have commands allowed after loaded from MP game.\nMapEditor doesn't allow to place and edit character anymore. Instead a spawn point (red flag) can be put on map.\n\nScripting\nFixed that the onrobotbuiltentity was not working at all.\nFixed that events giving player index were crashing in the sandbox mode.\n(onpickedupitem, onbuiltentity, onplayermineditem, onpreplayermineditem, onplayercreateditem, onplayerrotatedetity)\nFixed crashes when modifying style of gui of player that has no view (always in multiplayer).\nLuaPlayer::name (read) now contains the player name.\nReplaced removeofflineplayer with removeofflineplayers. It takes a lua table of player indexed to remove. If no arguments are provided it removes all the players.\n\nUse the automatic updater if you can (check experimental updates in other settings)","torrent":{"xt":"urn:btih:1412f3d6a8cf3685fe9fb55404bd694d5842ac76","amp;dn":"Factorio+0.11.3+x64+-+x86+%5Bexperimental+release%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1412f3d6a8cf3685fe9fb55404bd694d5842ac76","infoHashBuffer":{"type":"Buffer","data":[20,18,243,214,168,207,54,133,254,159,181,84,4,189,105,77,88,66,172,118]},"announce":[],"urlList":[]}}