{"title":"The Seven Ages Of Rock Complete","uid":4127337,"size":3547620084,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:14bc00d2db4fa08c23e7ce3ef6f7d4d0217a3df5&amp;dn=The+Seven+Ages+Of+Rock+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Rik-1985","files":7,"time":1207854697,"description":"Seven Ages of Rock was a BBC Two series, co-produced by BBC Worldwide and VH1Classic in 2007 about the history of rock music.\n\nIt had six 60-minute episodes with a final episode of 90 minutes, and aired on Saturdays at 21:00 (repeated on BBC One on Sundays). Each episode focused on one type of rock music, each typified by one or two artists or bands. The series producer was William Naylor, and the executive producer for the BBC was Michael Poole, a former editor of the 1990s BBC music, arts and culture programme The Late Show. The production was based at BBC Bristol and each programme was narrated by Julian Rhind-Tutt on the BBC and Dennis Hopper on VH1 classic.[1][2]\n\nThe series also included additional material broadcast on BBC radio and available on the BBC website.\n\n\n[edit] Series structure\nThe series makes heavy use of archive material. These early performances of musicians are interspersed with interviews with various other musicians. Naylor could use interviews from various other music series he had made for the BBC, such as with David Bowie, who was not available for an interview this time.\n\nIn an interview about the series, Naylor says that he has noticed the time is ripe for a revival of rock because he sees a growing popularity of slightly uncomfortable music and a somewhat arrogant attitude, precisely what rock needs.[citation needed] He also claims the series finally says what needed to be said, that England made Jimi Hendrix. He even states that rock music started on 24 September 1966 in London, when Jimi Hendrix went there.\n\nThe series did receive some criticism from the press as it ignored Rock and roll\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s contribution to the birth of rock. Neil McCormick, music critic for the Daily Telegraph (who appeared in one of the episodes as an interviewee) said: \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;...popular music only really gelled into what we now know as rock when Hendrix arrived in London in 1966.\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;[2]\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Seven_ages_of_rock&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Seven_ages_of_rock&lt;/a&gt;\n\n\nIn this torrent you\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;ll find all seven episodes in seven avi-files.\n\n01. The Birth Of Rock - Blues Rock - Jimi Hendrix\n02. White Light, White Heat - Art Rock - Pink Floyd\n03. Blank Generation - Punk Rock - Sex Pistols\n04. Never Say Die - Heavy Metal - Black Sabbath\n05. We Are The Champions - Stadium  Rock - Queen/Bruce Springsteen\n06. Left Of The Dial - US Alternative Rock - Nirvana/R.E.M.\n07. What The World Is Waiting For - British Indie Rock - Oasis\n","torrent":{"xt":"urn:btih:14bc00d2db4fa08c23e7ce3ef6f7d4d0217a3df5","amp;dn":"The+Seven+Ages+Of+Rock+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14bc00d2db4fa08c23e7ce3ef6f7d4d0217a3df5","infoHashBuffer":{"type":"Buffer","data":[20,188,0,210,219,79,160,140,35,231,206,62,246,247,212,208,33,122,61,245]},"announce":[],"urlList":[]}}