{"title":"1408 Room - Camera 1408 [ Horror ] - 2007 - DVDRip .XviD-NeDiVx","uid":4692348,"size":726013234,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:14f3ce96d085d00749e7cc527699b025c6469dd6&amp;dn=1408+Room+-+Camera+1408+%5B+Horror+%5D+-+2007+-+DVDRip+.XviD-NeDiVx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"kiss1911","files":-1,"time":1233436235,"description":"Romanian - Romana\n~~~~~~~~~~~~~~~~~~~~\nFilmul Camera 1408 este adaptat dupa o nuvela inspaimantatoare scrisa de maestrul suspansului, Stephen King. Renumitul romancier de horror-uri Mike Enslin (John Cusack) crede numai in ceea ce vede. Dar, dupa o serie de bestseller-uri care au discreditat evenimentele paranormale ce avusesera loc in cele mai bantuite case si in cimitirele din intreaga lume, el nu are nicio dovada a vietii de dupa moarte. Numai ca ratacirile dupa fantome ale lui Enslin din noptile lungi si singuratice sunt pe cale sa se schimbe in momentul in care se cazeaza in Camera 1408 a renumitului hotel Dolphin, pentru ultimul lui proiect, &quot;Zece nopti in camerele de hotel bantuite&quot;. Fara sa tina seama de avertizarile directorului hotelului (Samuel L. Jackson), autorul este prima persoana care se cazeaza in camera care se zice ca e bantuita, dupa ani intregi. Un alt bestseller pare a fi iminent, dar ca multe alte personaje ale lui Stephen King, mai intai, trebuie sa treaca de la scepticism la credinta adevarata si sa infrunte demonii pentru a supravietui acelei nopti.\n\nTrailer + Info -&gt;&gt; http://www.cinemagia.ro/movie.php?movie_id=17246&amp;what=article&amp;article_id=16646\n\n\n\n\n\nEngleza - English\n~~~~~~~~~~~~~~~~~~~~\nBased on the short Stephen King horror story of the same name, 1408 is about supernatural writer Mike Enslin, an author of two successful books on supernatural phenomena. As research for his latest book, Enslin is determined to check out the notorious room 1408 in a New York City hotel by personally staying as a guest in the fabled room. He believes that 1408 is just a myth perpetuated by stories and rumors that Enslin has collected for his past works. However, hotel manager Mr. Olin has strong objections to Enslin's stay and only warns him of possible danger to come. Enslin is determined to go anyway. But what Mike Enslin is about to experience is no myth, as 1408 truly is a room where the guests don't check out by noon.\n\nTrailer + Info -&gt;&gt;\nhttp://www.imdb.com/title/tt0450385/","torrent":{"xt":"urn:btih:14f3ce96d085d00749e7cc527699b025c6469dd6","amp;dn":"1408+Room+-+Camera+1408+%5B+Horror+%5D+-+2007+-+DVDRip+.XviD-NeDiVx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14f3ce96d085d00749e7cc527699b025c6469dd6","infoHashBuffer":{"type":"Buffer","data":[20,243,206,150,208,133,208,7,73,231,204,82,118,153,176,37,198,70,157,214]},"announce":[],"urlList":[]}}