{"title":"Frans de Waal - Good Natured. The Origins of Right and Wrong in ","uid":10427200,"size":11351650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1551959fd22336fca9f7075950fd2a7a582cdb79&amp;dn=Frans+de+Waal+-+Good+Natured.+The+Origins+of+Right+and+Wrong+in+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Anette14","files":-1,"time":1403719878,"description":"Description\nProduct Details\nBook Title: Good Natured: The Origins of Right and Wrong in Humans and Other Animals\t\nBook Author: Frans B. M. de Waal (Author)\nHardcover: 368 pages\nPublisher: Harvard University Press; 1 edition (March 1, 1996)\nLanguage: English\nISBN-10: 0674356608\nISBN-13: 978-0674356603\n\n===================================================================================\nBook Description\nPublication Date: March 1, 1996 | ISBN-10: 0674356608 | ISBN-13: 978-0674356603 | Edition: 1\nTo observe a dog's guilty look, to witness a gorilla's self-sacrifice for a wounded mate, to watch an elephant herd's communal effort on behalf of a stranded calf--to catch animals in certain acts is to wonder what moves them. Might there he a code of ethics in the animal kingdom? Must an animal be human to he humane? In this provocative book, a renowned scientist takes on those who have declared ethics uniquely human Making a compelling case for a morality grounded in biology, he shows how ethical behavior is as much a matter of evolution as any other trait, in humans and animals alike.\nWorld famous for his brilliant descriptions of Machiavellian power plays among chimpanzees-the nastier side of animal life--Frans de Waal here contends that animals have a nice side as well. Making his case through vivid anecdotes drawn from his work with apes and monkeys and holstered by the intriguing, voluminous data from his and others' ongoing research, de Waal shows us that many of the building blocks of morality are natural: they can he observed in other animals. Through his eyes, we see how not just primates but all kinds of animals, from marine mammals to dogs, respond to social rules, help each other, share food, resolve conflict to mutual satisfaction, even develop a crude sense of justice and fairness.\nNatural selection may be harsh, but it has produced highly successful species that survive through cooperation and mutual assistance. De Waal identifies this paradox as the key to an evolutionary account of morality, and demonstrates that human morality could never have developed without the foundation of fellow feeling our species shares with other animals. As his work makes clear, a morality grounded in biology leads to an entirely different conception of what it means to he human--and humane.\n\n===================================================================================\nEditorial Reviews\nReview\nIn Good Natured Frans de Waal, ethologist and primatologist, asks us to reconsider human morality in light of moral aspects that can be identified in animals. Within the complex negotiations of human society, a moral action may involve thoughts and feelings of guilt, reciprocity, obligation, expectations, rules, or community concern. De Waal finds these aspects of morality prevalent in other animal societies, mostly primate, and suggests that the two philosophical camps supporting nature and nurture may have to be disbanded in order to adequately understand human morality. A theoretician, de Waal is meticulous in his research, cautious not to extrapolate too much from his findings, and logically sound in his arguments. He also writes with precision and a flair for the dramatic, carrying readers along with graceful ease and vivid examples.\n\nFrom Publishers Weekly\nIs morality a biological or cultural phenomenon? Can nonhuman animals be humane? Primatologist de Waal (Chimpanzee Politics) explores these questions in a provocative book and makes a strong case for biology. He is convinced that social tendencies come into existence via a genetic calculus rather than rational choice. He defends anthropomorphism, noting that it serves the same exploratory function as intuition in the sciences. He discusses aggression and altruism and offers abundant anecdotal evidence of moral behavior among primates and other animals?food sharing, protection, sympathy, guilt. De Waal argues that the remarkable trainability among certain species, e.g., sheepdogs and elephants, hints at a rule-based order among them. He takes issue with the animal rights movement; rights, he says, are normally accompanied by responsibilities, which cannot possibly apply to apes and other animals. Readers who enjoyed Why Elephants Weep (Jeffrey Masson and Susan McCarthy) will welcome this volume. Illustrations.\n\nFrom Booklist\nEthologist de Waal is engaged in research that hits humans where they live. Observing monkeys and apes, he seeks to find and explain behaviors among them that bespeak qualities often thought to be exclusively human and artificial. In his new book, morality is the object of inquiry, and in incident-packed chapters on sympathy, hierarchy, exchange, and social accommodation among animals (besides his primate studies, he cites other researchers' work on nonprimates), he demonstrates how animals manifest morality and presents reasons for regarding moral behavior as natural. Not surprisingly, those reasons are social, beginning with the demands of familial loyalty and extending to the requirements of living with others of their species and even to getting along with friends of other species, such as zookeepers and researchers. Of course, in addition to enthralling readers with superbly written reportage of his work, de Waal wants them to consider what his research analogically suggests about human behavior and how to help our societies be happier. Like his marvelous Peacemaking among Primates (1989), this is prime science reading. Ray Olson\n\nFrom Kirkus Reviews\nCan we recognize a sense of morality in creatures other than ourselves? De Waal (Peacemaking Among Primates, 1989, etc.) asks, then smartly, rangingly, appealingly deploys his ethozoological background to see what he can find. Since moral systems are universal among humans, de Waal considers this tendency to be an integral part of human nature- -biologically significant, rather than a cultural counterforce. Yet from the standpoint of evolutionary biology, whence came such moral attributes as self-sacrifice and communal interests, dubious traits in the Darwinian scheme (but only when Darwin is narrowly interpreted, as de Waal notes)? And since the moral ingredients of sympathy, reciprocity, and peacemaking are found scattered throughout the animal kingdom, what is their evolutionary advantage? De Waal isn't looking for proofs--at this stage of research there aren't any. He's more interested in cross- pollinating his delicious array of intuitions, anecdotes, and random observations, with theories from neurobiology, visual anthropology, comparative psychology, evolutionary science, and cognitive ethology (his command of the fields that touch upon the biological roots of morality is dazzling; the guy did his homework, then went for the extra credit). Two theories in particular give some beef to his hunch that animals have a moral faculty: kin selection (in which the genetic imperative is satisfied even at one's own expense) and reciprocal altruism (immediate costs balanced by long-term benefits). The greatest truth emerging from juxtaposing genetic self-interest with intense sociality, de Waal figures, is that human and beast are both noble and brutish, both nurtured and natured. Unpretentious, open, humorous, and with a flair for language, de Waal nimbly displays that rare and wonderful scientific mind: as much at home with contradiction, clutter, and illogic as with systematic data.\n\n===================================================================================\nReviews\nEvolutionary continuities have been sought in intelligence, language, tool making--anywhere but in morality. Now a respected ethologist, Frans de Waal, tackles the problem from a novel angle...Good Natured is no touchy-feely celebration of animal innocence, but a hardheaded study by a specialist in primate behavior with a wealth of observational experience. Mr. de Waal, a research scientist at the Yerkes Regional Primate Center at Emory University, presents his rich data in an accessible prose lit with flashes of wry humor and beautifully illustrated with his own vivid photographs...Far from being half ape, half angel, torn between a moral sense that strives upward and an eons-old bestial viciousness that drags us down, [we are portrayed by de Waal] as inheritors of a basically moral view of life that has evolved over countless millenniums--not through some fictitious social contract between self-sufficient individuals, but through the inevitable give-and-take of communal living...Anyone who cares about humans or their future will profit from this excellent book, which sheds at least as much light on our own lives as it does on those of other creatures. (Derek Bickerton New York Times Book Review)\n\nSo lucid is de Waal's manner of setting things forth that each time he finishes drawing an aspect of animal morality, your first response is to wonder why you hadn't noticed it around the house, if not at a primate research center, a remote island, or the zoo...[His] startling contributions to the way the general reader, or general citizen, has of thinking seriously about &quot;humans and other animals&quot; might be permanent. (Vicki Hearne Village Voice Literary Supplement)\n\nA sparkling master work...de Waal...is perhaps the most literate, entertaining, and soulful of the cognitive ethologists...In Good Natured, [he] takes his humanizing project a step further, employing the rich lexicon of human moral concepts as figures of speech to depict and lend meaning to the behavior of nonhuman animals...[A] provocative, endearing, and brilliantly written book. (Richard A. Shweder Los Angeles Times)\n\nModern Darwinian evolutionary theory is based on individual reproduction, on 'selfish' genes that have been selected at the expense of others that might act for the greater good. How then could survival of the fittest lead to empathy?...This profound paradox has led some scholars in the past to assume that the emergence of morals must be a transcendent process beyond the bounds of scientific explanation. Frans de Waal, one of the world's best-known primatologists, has set out to prove that assumption wrong. On the final page of his startling new book, he asserts that &quot;we seem to be reaching a point at which science can wrest morality from the hands of philosophers.&quot; How the author...came to this conclusion makes for compelling reading. (William C. McGrew Scientific American)\n\nIn [this] original and engaging new book...de Waal makes a strong case that the four ingredients of morality--empathy/sympathy, sharing or reciprocity, justice/rules and peacemaking/reconciliation--are very much evident in other mammals...The book employs a solid core of statistical evidence to bolster his case, but what makes his argument so compelling is the richness of detail...De Waal is an original thinker and writes with such a light hand that the reader can take a stimulating ride through his imaginative philosophical discourse...This work is...penetrating and profound. (Vicki Croke Boston Globe)\n\nDe Waal [questions]...whether the roots of human morality can be found in the behaviour of other species. He is more or less ideally placed to answer that question, after years of perceptive research on captive chimpanzees, bonobos and monkeys...As de Waal fans will already know, chimpanzees and other primates come alive as individuals under his expert gaze...Sympathy, attachment, social norms, punishment, a sense of justice, reciprocation, peacemaking and community concern--all are writ large in chimpanzee society. Good Natured makes the point with the help of a profusion of gripping examples. (Stephen Young BBC Wildlife)\n\nAs a book of ideas...this is excellent and on the whole I am inclined to believe de Waal's case for the antecedents of our own morality in other species, Perhaps most interestingly, however, is that the domain hitherto of philosophers is now being contested by evolutionary biologists. Not only does this tighten up the terms of the debate (as did ape language research for linguistics), but ironically it injects a special kind of humanism that recognises the origins of our moral failings as well as our successes. (Thomas Sambrook Times Higher Education Supplement)\n\nA well-written, provocative book. (Charles T. Snowdon Science)\n\nA large and entertaining collection of anecdotes about animal behaviour. These are used to bolster the proposition that mental processes governing complex forms of human behaviour, such as sympathy and empathy with others, must have their homologues in the animal kingdom...[This book] is extremely well written and very entertaining. (Alan Dixson Quarterly Journal of Experimental Psychology)\n\n[Good Natured] is a tour de force and a landmark in the growing field of cognitive ethology....[It] is an example of the very best in popular science writing. De Waal skilfully weaves together anecdotes, theories and data to create a text that is thought-provoking and a pleasure to read. (Gail Vines New Scientist (UK) 2003-05-24)\n\n===================================================================================\nAbout the Author\nFrans B. M. de Waal is C. H. Candler Professor of Primate Behavior in the Psychology Department and Director of Living Links, part of the Yerkes Primate Center, Emory University.\n===================================================================================","torrent":{"xt":"urn:btih:1551959fd22336fca9f7075950fd2a7a582cdb79","amp;dn":"Frans+de+Waal+-+Good+Natured.+The+Origins+of+Right+and+Wrong+in+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1551959fd22336fca9f7075950fd2a7a582cdb79","infoHashBuffer":{"type":"Buffer","data":[21,81,149,159,210,35,54,252,169,247,7,89,80,253,42,122,88,44,219,121]},"announce":[],"urlList":[]}}