{"title":"Doctor Who Confidential - 2007 - Season 03 - 13 Episodes + 3 Spe","uid":10714962,"size":5380198539,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:156ac43f947f2cbd6a445bbd7198a00fde306b08&amp;dn=Doctor+Who+Confidential+-+2007+-+Season+03+-+13+Episodes+%2B+3+Spe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":5,"uploader":"bnaron","files":-1,"time":1407394614,"description":"Doctor Who Confidential - Season 03 (2006) - 13 Episodes + 3 Specials\n\n\nSeries Description Courtesy:\n\nWikipedia, the free encyclopedia\nen.wikipedia.org/wiki/Doctor_Who_Confidential\n\n\nDoctor Who Confidential is a documentary series created by the British Broadcasting Corporation (BBC) to complement the revival of the long-running British science fiction television series Doctor Who. Each episode was broadcast on BBC Three on Saturdays, immediately after the broadcast of the weekly television episode on BBC One. The running time of the first two series was 30 minutes, being extended to 45 minutes in the third.[1] BBC Three also broadcast a cut-down edition of the program, lasting 15 minutes, shown after the repeats on Sundays and Fridays and after the weekday evening repeats of earlier seasons.\n\nDescribed as focusing on the human element of the series, Confidential features behind-the-scenes footage on the making of Doctor Who through clips and interviews with the cast, production crew and other people, including those who have participated in the television series over the years of its existence. Each episode deals with a different topic, and in most cases refers to the Doctor Who episode that preceded it.\n\nAnthony Head (who played Mr Finch/Brother Lassar in &quot;School Reunion&quot;) replaced Gatiss as narrator for season 3, while David Tennant did the entirety of the series' tenth episode himself. The episode running length was increased to 45 minutes.\n\n\nSeason 03 (2007)\n\n\nEpisode Synopses courtesy of:\n\nThe On-line TV Database\nAn Open Database for Television Fans\nwww.thetvdb.com\n\n\n2007-03-31 - Meet Martha Jones (Video: 704x400, 1183kbps, 25fps - Audio: 44.1kHz, 107kbps)\n\nBehind the scenes of &quot;Smith and Jones&quot;. The Doctor's back, but now his time and space is shared with a brand new companion. By sheer courage and determination, she has wowed the Time Lord and been offered a place on board the TARDIS, and Doctor Who Confidential was backstage to see it all unfold.\n\n\n2007-04-07 - Stage Fright (Video: 700x400, 1190kbps, 25fps - Audio: 44.1kHz, 106kbps)\n\nBehind the scenes of &quot;The Shakespeare Code&quot;. Behind-the-scenes look at Doctor Who. The production team recreated some of the most breathtaking scenes to date as Martha's first trip in the TARDIS takes her to Elizabethan England to meet William Shakespeare.\n\n\n2007-04-14 - Are We There Yet? (Video: 640x368, 989kbps, 25fps - Audio: 44.1kHz, 104kbps)\n\nBehind the scenes of &quot;Gridlock&quot;. Behind the scenes of the Doctor's visit to New Earth, featuring endless space-age motorways and numerous computer generated images, which posed a huge challenge for all those involved. There's also a look at how guest star Ardal O'Hanlon was transformed into his character Brannigan\n\n\n2007-04-21 - A New York Story (Video: 640x368, 989kbps, 30fps - Audio: 44.1kHz, 106kbps)\n\nBehind the scenes of &quot;Daleks in Manhattan&quot;. Helen Raynor reveals where she found her inspiration when writing about the Doctor's visit to Thirties New York. She discusses how Manhattan residents lived in tenement buildings in the era and takes a walk through Central Park\n\n\n2007-04-28 - Making Manhattan (Video: 640x368, 990kbps, 25fps - Audio: 44.1kHz, 107kbps)\n\nBehind the scenes of &quot;Evolution of the Daleks&quot;. Behind-the-scenes look at the making of Doctor Who. There's a trip to to Manhattan to find out how to recreate 1930s New York in the heart of south Wales. The producer and director of episodes four and five visit the New York locations they plan to reproduce and the visual effects supervisor shows what they need to make Manhattan in Cardiff.\n\n\n2007-05-05 - Monsters Inc (Video: 640x368, 988kbps, 25fps - Audio: 44.1kHz, 108kbps)\n\nBehind the scenes of &quot;The Lazarus Experiment&quot;. An episode of Doctor Who just wouldn't be the same without a monster to scare the living daylights out of you! The creation of such a beast is never easy, especially when it's purely computer generated!\n\n\n2007-05-19 - Space Craft (Video: 624x352, 991kbps, 25fps - Audio: 44.1kHz, 122kbps)\n\nBehind the scenes of &quot;42&quot;. It's back into outer space for Doctor Who and this time it's an adventure set entirely on a spaceship. Join Confidential as we gain exclusive access to Doctor Who's art department and take you on a tour of the spaceship's sets and locations. Confidential also journeys back in time to show you some of the best off the wall spaceship designs seen in five decades.\n\n\n2007-05-26 - Alter Ego (Video: 640x368, 989kbps, 25fps - Audio: 44.1kHz, 110kbps)\n\nBehind the scenes of &quot;Human Nature&quot;. With aliens in hot pursuit, the Doctor and Martha find themselves in 1913 England.Confidential is right beside them to delve deeper into the alter ego of the nation's favorite Time Lord.\n\n\n2007-06-02 - Bad Blood (Video: 640x360, 989kbps, 25fps - Audio: 44.1kHz, 114kbps)\n\nBehind the scenes of &quot;The Family of Blood&quot;. With The Family of Blood breathing down the neck of the Doctor, time is running out. Confidential follows the action backstage as we glimpse a life more ordinary (for the Doctor) as well as a vision of the dark future ahead.\n\n\n2007-06-09 - Do You Remember The First Time? (Video: 640x360, 988kbps, 25fps - Audio: 44.1kHz, 112kbps)\n\nBroadcast alongside &quot;Blink&quot;. This week, David Tennant directs his very own Doctor Who Confidential. TV's top Time Lord has been given complete control to film his own very personal account of the making of Doctor Who. David takes a nostalgic voyage of discovery to find out the secret behind the success of Doctor Who.\n\n\n2007-06-16 - 'ello, 'ello, 'ello (Video: 640x368, 990kbps, 25fps - Audio: 44.1kHz, 105kbps)\n\nBehind the scenes of &quot;Utopia&quot;. Doctor Who Confidential says &quot;'ello, 'ello, 'ello&quot; to everyone's favorite time agent, Captain Jack Harkness, who returns to the series this week. Left alone by the Doctor and Rose in series one, we talk to John Barrowman about his return to the show - what it's like for him and his character to be back on Doctor Who and working with a new Doctor and companion.\n\n\n2007-06-23 - The Saxon Mystery (Video: 640x368, 988kbps, 25fps - Audio: 44.1kHz, 107kbps)\n\nBehind the scenes of &quot;The Sound of Drums&quot;. It's back to earth with a bump for the Doctor and his companions as they come face to face the infamous Mr Saxon, brought to life by Life on Mars star, John Simm. Join Doctor Who Confidential in unraveling the mystery behind Saxon, with a detailed look at this character's journey, which surprisingly began way back in series two.\n\n\n2007-06-30 - The Valiant Quest (Video: 640x368, 987kbps, 25fps - Audio: 44.1kHz, 109kbps)\n\nBehind the scenes of &quot;Last of the Time Lords&quot;. It's the end of an amazing series and Confidential goes behind the scenes of the nail biting finale to Series Three as we see two enemies square up for a battle of valiant proportions.\n\n\nSeason 3 (2007) - Specials\n\n\n2007-11-16 - Special - (Children in Need) - Time Crash (Video: 640x360, 989kbps, 25fps - Audio: 44.1kHz, 110kbps)\n\nDoctor Who Confidential for the Children in Need Special 2007 &quot;Time Crash&quot;\n\n\n2007-12-12 - Special - Designs On Doctor Who (Video: 640x368, 989kbps, 25fps - Audio: 44.1kHz, 102kbps)\n\nA 30-minute special, created by the Confidential team, was shown as part of the BBC's arts' season, entitled &quot;Designs On Doctor Who&quot;. It was narrated by Tom Baker.\n\n\n2007-12-25 - Special - Doctor Who Confidential at Christmas (Video: 640x368, 989kbps, 25fps - Audio: 44.1kHz, 106kbps)\n\nThis special Christmas episode follows the production team, writers and cast as they tackle the Titanic and welcome Kylie Minogue aboard as the Doctor's new companion, Astrid.\n\n","torrent":{"xt":"urn:btih:156ac43f947f2cbd6a445bbd7198a00fde306b08","amp;dn":"Doctor+Who+Confidential+-+2007+-+Season+03+-+13+Episodes+%2B+3+Spe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"156ac43f947f2cbd6a445bbd7198a00fde306b08","infoHashBuffer":{"type":"Buffer","data":[21,106,196,63,148,127,44,189,106,68,91,189,113,152,160,15,222,48,107,8]},"announce":[],"urlList":[]}}