{"title":"An Untamed State by Roxane Gay (epub &amp; mobi) {dwg}","uid":15647337,"size":1823204,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:15a707371969423a0585f1266bb1a682af7ec0f4&amp;dn=+An+Untamed+State+by+Roxane+Gay+%28epub+%26amp%3B+mobi%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gratefuldawg77","files":4,"time":1472062627,"description":"368 pages\r\nPublished May 6th 2014 by Grove Press, Black Cat\r\nISBN 0802122515 (ISBN13: 9780802122513)\r\nRoxane Gay is a powerful new literary voice whose short stories and essays have already earned her an enthusiastic audience. In An Untamed State, she delivers an assured debut about a woman kidnapped for ransom, her captivity as her father refuses to pay and her husband fights for her release over thirteen days, and her struggle to come to terms with the ordeal in its aftermath.\r\n\r\nMireille Duval Jameson is living a fairy tale. The strong-willed youngest daughter of one of Haiti’s richest sons, she has an adoring husband, a precocious infant son, by all appearances a perfect life. The fairy tale ends one day when Mireille is kidnapped in broad daylight by a gang of heavily armed men, in front of her father’s Port au Prince estate. Held captive by a man who calls himself The Commander, Mireille waits for her father to pay her ransom. As it becomes clear her father intends to resist the kidnappers, Mireille must endure the torments of a man who resents everything she represents.\r\n\r\nAn Untamed State is a novel of privilege in the face of crushing poverty, and of the lawless anger that corrupt governments produce. It is the story of a willful woman attempting to find her way back to the person she once was, and of how redemption is found in the most unexpected of places. An Untamed State establishes Roxane Gay as a writer of prodigious, arresting talent","torrent":{"xt":"urn:btih:15a707371969423a0585f1266bb1a682af7ec0f4","amp;dn":"+An+Untamed+State+by+Roxane+Gay+%28epub+%26amp%3B+mobi%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15a707371969423a0585f1266bb1a682af7ec0f4","infoHashBuffer":{"type":"Buffer","data":[21,167,7,55,25,105,66,58,5,133,241,38,107,177,166,130,175,126,192,244]},"announce":[],"urlList":[]}}