{"title":"Tenko Season 2 Part 1 DixX XVID","uid":3547011,"size":2664579643,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:15bb23b2b466c2b52f83ce0bcea925c352ce6668&amp;dn=Tenko+Season+2+Part+1+DixX+XVID&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dejayjay","files":6,"time":1162008322,"description":"The first series deals with the Japanese invasion of Singapore, disrupting lives of the ex-pats living in the British colony. Forced to evacuate, the survivors fall into Japanese hands, and we follow some of the women into prison. Mentioning \\&quot;the survivors\\&quot; is a very relevant point. Tenko is not afraid to show that life in this condition can result in awful, lingering death. Characters whom we grow to know and love, to understand and empathise with, are struck down with beriberi, cholera, malaria. The aching sadness and genuine humanity of Tenko is truly remarkable. Gradually revealing more about the characters, their past lives, and their hopes for the future, piles on the emotion, making it absolutely unmissable. \n\nSeason two moves the women to a new camp, offloading several en route and picking up some new faces. The new camp, although better equipped, has a very different regime, and introduces us to Miss Hasan, the malicious and spiteful right-hand woman to the Commandant. The second half of season two deals with a prisoner receiving a gunshot wound: operating on her in a hut full of flies, with just a pair of sugar-tongs to remove the bullet, is absolutely gripping. \n\n","torrent":{"xt":"urn:btih:15bb23b2b466c2b52f83ce0bcea925c352ce6668","amp;dn":"Tenko+Season+2+Part+1+DixX+XVID","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15bb23b2b466c2b52f83ce0bcea925c352ce6668","infoHashBuffer":{"type":"Buffer","data":[21,187,35,178,180,102,194,181,47,131,206,11,206,169,37,195,82,206,102,104]},"announce":[],"urlList":[]}}