{"title":"(PSX-PSP) Dino Crisis 1 &amp; 2 converted properly (Kingdom-games by","uid":4559000,"size":654200550,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:15c2511d0234821d126743224716286b7388b557&amp;dn=%28PSX-PSP%29+Dino+Crisis+1+%26+2+converted+properly+%28Kingdom-games+by&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"toxicjuggalo","files":3,"time":1228598774,"description":"IMPORTANT NOTE:\n\nYou MUST USE NO LESS THEN 3.71 POPS WITH BOTH GAMES...Using less than 3.71 POPS will result in voice audio loss.....KloWn\n\n\nDIN0 CRISIS 1:\n\nYour most primal fears grab you on this new journey into survival horror from the creators of Resident Evil and Resident Evil 2. Suspicious and terrifying... the world&amp;#039;s most renowned scientist has disappeared and you&amp;#039;ve been recruited to investigate on a mysterious, remote island. Suddenly, out of the mist appears a predator, which has haunted mankind&amp;#039;s imagination for centuries... experience the pure terror!\n\nDINO CRISIS 2:\n\nThe dinosaurs return and this time they&amp;#039;re really, really mad in DINO CRISIS 2. The government has secretly continued Dr. Kirk&amp;#039;s research into Third Energy. Once again a rift in time has opened, and everything related to the project is lost in time. Now, Regina and her special forces team must use a different time device and travel to the era where they believe the facility is now located. When the team arrives, it is quickly decimated by a dinosaur attack. It&amp;#039;s up to Regina and Dylan, the only two survivors, to find out what happened. In order to defeat the dinos and return home safely, you&amp;#039;ll have to learn to use each character&amp;#039;s special talents. One thing you&amp;#039;ll have no matter which character you are is sharp shooting skills, which come in handy when you&amp;#039;ve got 10 different species of dinosaurs on your tail! If you score quick kills, you will earn you big points that can be used to obtain additional weapons, ammunition, and other supplies. The government is counting on you to retrieve the Third Energy device and return home safely in DINO CRISIS 2.\n\nEnJoY Everyone :)","torrent":{"xt":"urn:btih:15c2511d0234821d126743224716286b7388b557","amp;dn":"%28PSX-PSP%29+Dino+Crisis+1+%26+2+converted+properly+%28Kingdom-games+by","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15c2511d0234821d126743224716286b7388b557","infoHashBuffer":{"type":"Buffer","data":[21,194,81,29,2,52,130,29,18,103,67,34,71,22,40,107,115,136,181,87]},"announce":[],"urlList":[]}}