{"title":"Clerks (1994) [1080p] x264 BRRip [HQ] - Jalucian","uid":9709136,"size":9567317820,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:15e163786bca40da00f00fac64e399353963a8e3&amp;dn=Clerks+%281994%29+%5B1080p%5D+x264+BRRip+%5BHQ%5D+-+Jalucian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"jalucian","files":-1,"time":1394087957,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0109445/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0109445/&lt;/a&gt;\n\n\nIMDB RATING: 7.9\n\n\nPlot:\n\nA day in the lives of two convenience clerks named Dante and Randal as they annoy customers, discuss movies, and play hockey on the store roof. \n\n\n\nCONTAINER....................: MP4\nCODEC........................: X264\nGENRE........................: Comedy\nFILE SIZE....................: 8.90 GB\nRESOLUTION/ASPECT RATIO......: 1080p @ 16:9 (1918x1080)\nBITRATE MODE.................: Variable\nAVG. VIDEO BITRATE...........: 12.6 Mbps\nAVG. AUDIO FORMAT/BITRATE....: AAC/256kbps\nCHANNELS.....................: 2, Dolby Pro Logic II\nSAMPLING RATE................: 48.0 KHz\nFRAME RATE...................: 23.976 fps\nLANGUAGE.....................: English\nSUBTITLES....................: English (included external .srt file)\nRUNTIME......................: 1:39:30\n\n\nNotes:\n\nThis is an HQ version specifically made for larger screen HD viewing. If your screen size is less than 42&quot; or so, there's probably no need for you to be downloading an HQ encode and for you I would recommend my Clerks Collector's Pack instead, which contains all three versions of the film but in 720p with reduced bit rate (and therefore file size.) \n\nThis is an HQ (high quality) version of Clerks (The Final Cut, not the theatrical version.) This was encoded directly from physical disk and not a re-encode. I am proud to present the first and only high quality encode of Clerks in 1080p (the only other 1080p-version torrent - by another encoder - is a fraction of the size it needs to be to have any kind of real quality on larger screens.) Due to the massive amount of grain in this black and white film, it took a bit rate of over 12.5Mbps just to reach a CRF value of 23 (the minimum recommended CRF setting for HD encodes according to most x264 developers.) Any versions with CRFs of 22 or 21 encoded directly from physical disk would be significantly larger than this...which might explain why no one has yet released a decent 1080p version until now - grain/noise in the picture is almost like a black hole for bits - it takes a LOT of them to accurately reproduce the grain in black and white films such as Clerks and Pi.\n\nAlso remember that high quality means 'accurately producing, with a high degree of precision, the look of the blu-ray or HD source.' Since Clerks was filmed in black and white with the grain and noise being a deliberate, stylistic choice on the part of the producers, making a high quality encode means making one that reproduces as much of the original grain as possible - not to filter any of it out or skimp on the bit rate required. This is common knowledge to good encoders, but I feel the need to mention this in the notes just to pre-empt potentially ignorant comments after seeing how grainy the film is, and then asking how I can possibly call this a &quot;high quality encode.&quot; And the answer is, because high quality means accurately reproducing the source, not doctoring it or &quot;improving&quot; it. \n\nPlease consider seeding until reaching a share ratio of at least 3:1 since this is currently - and may remain for some time - the only high quality torrent of this movie in 1080p.","torrent":{"xt":"urn:btih:15e163786bca40da00f00fac64e399353963a8e3","amp;dn":"Clerks+%281994%29+%5B1080p%5D+x264+BRRip+%5BHQ%5D+-+Jalucian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15e163786bca40da00f00fac64e399353963a8e3","infoHashBuffer":{"type":"Buffer","data":[21,225,99,120,107,202,64,218,0,240,15,172,100,227,153,53,57,99,168,227]},"announce":[],"urlList":[]}}