{"title":"Abdul Kalam - Ignited Minds.epub","uid":9931927,"size":3697786,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:15e5eb0eef3cd18b5b2856dc2a3bf41ef6c01cde&amp;dn=Abdul+Kalam+-+Ignited+Minds.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1397113895,"description":"Ignited Minds: Unleashing the Power Within India is a bestselling book that has inspired many people to expect significant improvements in the nation of India. The book delves into the details of why we aren't able to excel in whatever we might do, irrespective of the fact that Indians are immensely talented in many ways. The book questions why we settle for the least, when we can grab what is truly the best, given our tremendous skills and resources. The author asks a resounding question in his book: What is India missing? The book lays tremendous stress upon the fact that India has all that she needs to achieve greatness in every sphere of life. Instead of devising a procedure to achieve success, the author addresses various issues that he had come across, while on his two-year journey throughout India. He portrays a kind of patriotism that melts the boundaries that are created by religion and politics. Keeping in mind the author's humility, he has set out to explore a subject as deep as this. The book is an ideal motivator for every Indian who wants to get on the right track, as far as success is concerned. The new edition of Ignited Minds: Unleashing the Power Within India has been published by Penguin India, in the year 2003.\n\nReview\n'Ignited Minds will fire the minds of the young to whom it is primarily addressed.' -- Khushwant Singh in Outlook\n\n'[Ignited Minds] should be in every school bag and on the desktop of every parliamentarian, bureaucrat and industrialist in [India].' -- Wilson John in Pioneer\nAbout the Author\nThe author of Ignited Minds: Unleashing the Power Within India, Dr. A.P.J. Abdul Kalam was born in Rameswaram, Tamil Nadu and majored in Aero Engineering from the famed Madras Institute of Technology. He has contributed immensely with reference to Indian satellites and launch vehicles. He has written several other books, which include Wings of Fire: An Autobiography, Turning Points: A Journey Through Challenges and My Journey: Transforming Dreams into Actions.","torrent":{"xt":"urn:btih:15e5eb0eef3cd18b5b2856dc2a3bf41ef6c01cde","amp;dn":"Abdul+Kalam+-+Ignited+Minds.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15e5eb0eef3cd18b5b2856dc2a3bf41ef6c01cde","infoHashBuffer":{"type":"Buffer","data":[21,229,235,14,239,60,209,139,91,40,86,220,42,59,244,30,246,192,28,222]},"announce":[],"urlList":[]}}