{"title":"Deponia GOG","uid":7814831,"size":4455982573,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:163560766acefe8c81d5fa557a7cd46d6360e992&amp;dn=Deponia+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"AN0NYMOUS142857","files":-1,"time":1352629527,"description":"genre: adventure / point-and-click / modern \nrelease date: August 7, 2012 \ncompatible with: Windows XP, Windows Vista, Windows 7 \nlanguages: English, German, Russian \ndeveloper / publisher: Daedalic Entertainment / Daedalic Entertainment \ngame modes: single-player \n\nBonus content included for FREE with purchase: \nmanual \n9 wallpapers \nsoundtrack (English) \nsoundtrack (German) \n25 avatars \n24 artworks \nconcept art \n2 papercraft figures \n\nWhat's cool about it: \n\nUnique comic style with hand-drawn HD resolution 2D graphics. \nBizarre characters and wacky humor. \nChallenging puzzles and hours of dialogue. \nUnique universe in the tradition of Douglas Adams, Terry Pratchett and Matt Groening. \nFrom the creators of the award-winning games Edna &amp; Harvey: The Breakout, Edna &amp; Harvey: Harveys New Eyes, and The Whispered World. \n\nOverview: \n\nRufus is not a pleasant guy. Ill-tempered and entirely too convinced of his own greatness, he lives at the edge of a small settlement somewhere in the most remote sector of the garbage-covered planet Deponia. He dreams of a better life in the floating cities of wealth and beauty high above the planet surface. When the angelic Goal falls from these privileged spheres down into a neighboring trash heap, Rufus sees his chance. He decides to bring the unconscious beauty back to her home. Only a vague hope of making it off Deponia at first, he soon formulates an unscrupulous plan, as he learns that he is a dead ringer for Goals upper-class husband. The planned handover is only the beginning of a wild chase across Deponia full of twists, turns and mystifying mix-ups. \n\nDeponia is a fast-paced comedy of errors and one of the most unusual love stories in gaming history. The twist-filled story takes its off-beat characters all over trash planet Deponia, a unique game world in the style of Douglas Adams, Terry Pratchett and Matt Groening. From Kuvaq, an improvised village built inside a giant trash heap, to the swimming black market and the dark corners of the elevated planetary railways: The new adventure game from the makers of The Whispered World, Edna &amp; Harvey: The Breakout and A New Beginning is brought to life with detailed hand-painted backgrounds in widescreen format and top-quality cartoon animation. \n\nAge requirements: PEGI Rating: 12+ with Bad Language, Sex, Violence. \n\nMinimum system requirements: Windows XP / Windows Vista / Windows 7, Processor 2.5 GHz (Single Core) or 2 GHz (Dual Core), 2GB RAM (4 GB recommended), 3D graphics card compatible with OpenGL 2.0 compatible with 512 MB RAM, 2GB HDD, Mouse, Keyboard. \n\nInstallation \n\nInstall and play\n","torrent":{"xt":"urn:btih:163560766acefe8c81d5fa557a7cd46d6360e992","amp;dn":"Deponia+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"163560766acefe8c81d5fa557a7cd46d6360e992","infoHashBuffer":{"type":"Buffer","data":[22,53,96,118,106,206,254,140,129,213,250,85,122,124,212,109,99,96,233,146]},"announce":[],"urlList":[]}}