{"title":"1776 - David Mccullough","uid":4742492,"size":2535495,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:16547893a09286975ead524e88543ca89628f69c&amp;dn=1776+-+David+Mccullough&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"philmccrevice","files":1,"time":1235635152,"description":"Esteemed historian David McCullough covers the military side of the momentous year of 1776 with characteristic insight and a gripping narrative, adding new scholarship and a fresh perspective to the beginning of the American Revolution. It was a turbulent and confusing time. As British and American politicians struggled to reach a compromise, events on the ground escalated until war was inevitable. McCullough writes vividly about the dismal conditions that troops on both sides had to endure, including an unusually harsh winter, and the role that luck and the whims of the weather played in helping the colonial forces hold off the world's greatest army. He also effectively explores the importance of motivation and troop morale--a tie was as good as a win to the Americans, while anything short of overwhelming victory was disheartening to the British, who expected a swift end to the war. The redcoat retreat from Boston, for example, was particularly humiliating for the British, while the minor American victory at Trenton was magnified despite its limited strategic importance. \nSome of the strongest passages in 1776 are the revealing and well-rounded portraits of the Georges on both sides of the Atlantic. King George III, so often portrayed as a bumbling, arrogant fool, is given a more thoughtful treatment by McCullough, who shows that the king considered the colonists to be petulant subjects without legitimate grievances--an attitude that led him to underestimate the will and capabilities of the Americans. At times he seems shocked that war was even necessary. The great Washington lives up to his considerable reputation in these pages, and McCullough relies on private correspondence to balance the man and the myth, revealing how deeply concerned Washington was about the Americans' chances for victory, despite his public optimism. Perhaps more than any other man, he realized how fortunate they were to merely survive the year, and he willingly lays the responsibility for their good fortune in the hands of God rather than his own. Enthralling and superbly written, 1776 is the work of a master historian. --Shawn Carkonen \n\nThe Other 1776 \n","torrent":{"xt":"urn:btih:16547893a09286975ead524e88543ca89628f69c","amp;dn":"1776+-+David+Mccullough","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16547893a09286975ead524e88543ca89628f69c","infoHashBuffer":{"type":"Buffer","data":[22,84,120,147,160,146,134,151,94,173,82,78,136,84,60,168,150,40,246,156]},"announce":[],"urlList":[]}}