{"title":"Alien Legion Omnibus (v1 + v2) (2009 - 2010) (digital) (Son of U","uid":11164280,"size":892767630,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:16b7159d51fad6efb7a77492bec32be0a53c80f4&amp;dn=Alien+Legion+Omnibus+%28v1+%2B+v2%29+%282009+-+2010%29+%28digital%29+%28Son+of+U&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"nemesis43","files":2,"time":1412605767,"description":"Alien Legion Omnibus (v1 + v2) (2009 - 2010) (digital) (Son of Ultron-Empire)\n\n\nVolume One\n\nFootsloggers and soldiers of fortune, priests, poets, killers, and cads -- they fight for a future Galarchy, for cash, for a cause, for the thrill of adventure. Culled from the forgotten and unwanted of three galaxies, they are trained to be the most elite, and expendable, of fighting forces. Sometimes peacekeepers, sometimes shock troops, the Legion is sent into the Galarchy's most desperate internal and external conflicts. Legionnaires live rough and they die hard, tough as tungsten and loyal to the dirty end.\n\nAlien Legion Omnibus Volume 1 features over three hundred story pages of the groundbreaking series and lays cover fire for a new Alien Legion series from Dark Horse slated to begin in late 2009!\n\nVolume Two\n\nThe Alien Legion is the most feared fighting force in the Galarchy-and Nomad Squad is the best, and the worst, of the lot. Comprised of the outcasts, dregs, and idealists from three galaxies, the expendable grunts of Nomad jump into a series of intense missions prompted by everything from attacks by biomechanical religious zealots, orders to eliminate a traitorous legion hero, and the personal whims of a Galarchy bureaucrat. The squad is devastated when three veteran legionnaires die-and another faces an even worse fate in a legion &quot;Mindrobber&quot; machine. Nomad's chemistry is further altered with the addition of Tamara, a cosmic valkyrie who catches Lt. Montroc's attention.\n\nVolume 2 features over three hundred story pages and rounds out the first Alien Legion series, including the long-out-of-printA Grey Day to Die graphic novel.","torrent":{"xt":"urn:btih:16b7159d51fad6efb7a77492bec32be0a53c80f4","amp;dn":"Alien+Legion+Omnibus+%28v1+%2B+v2%29+%282009+-+2010%29+%28digital%29+%28Son+of+U","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16b7159d51fad6efb7a77492bec32be0a53c80f4","infoHashBuffer":{"type":"Buffer","data":[22,183,21,157,81,250,214,239,183,167,116,146,190,195,43,224,165,60,128,244]},"announce":[],"urlList":[]}}