{"title":"Department of Eagles - In Ear Park (2008) [Lossless/FLAC]","uid":5271614,"size":251613085,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:172a2b24325de2575b73137c6064432aac4914ef&amp;dn=Department+of+Eagles+-+In+Ear+Park+%282008%29+%5BLossless%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"cenkota","files":15,"time":1263264639,"description":"------------------------------------------------------------------------\nEmail me if you are looking for an album in Lossless/FLAC (even obscure ones). I'd be willing to send you a link to it if you would share the album on publicbt/thepiratebay after you finish downloading it. My email: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;91f2f4ffe5e3fef8f5e2a0d1f6fcf0f8fdbff2fefc&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;e4c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;-------\n\nLossless/FLAC\nIncludes: Log/Cue\n\nFrom Pitchfork:\n\n&quot;Department of Eagles have the kind of convoluted, meandering backstory that could squash a less compelling band. Before he joined Grizzly Bear in 2004, Daniel Rossen was splicing together samples and bits of unearthed sound with his NYU roommate, Fred Nicolaus; the duo's collages were released, in 2003, as Department of Eagles' eerie, twittering debut, The Cold Nose. That record was followed, in 2006, by a remix album and preceded by a series of vinyl-only singles, under the name Whitey and the Moon UK (also the original title of The Cold Nose). Not long after its release, Rossen partnered with Ed Droste and Grizzly Bear and the Department of Eagles project was put on hiatus-- until late 2007, when the DOE duo, now enlisting contributions from Rossen's Grizzly Bear brethren Chris Bear and Chris Taylor, began recording again.\n\nUnlike Department of Eagles' earlier output, which was heavily focused on sound art and electronic pastiche, In Ear Park is a sprawling pop record (complete with guitars, piano, horns, banjo, and more) that evokes Sgt. Pepper's, Sung Tongs, Van Dyke Parks, and Gene Clark. Like any good sonic experiment, In Ear Park extends with each listen, and things that once sounded small-- the piano bits on &quot;Teenagers&quot;, the opening fuzz of &quot;No One Does It Like You&quot;, the noirish echoing footsteps sampled in &quot;Classical Records&quot;-- become epic on the fourth or fifth spin, as the album swells and expands.\n\nIn Ear Park is dedicated to Rossen's late father, and while the album is hardly mournful, it is infused with a kind of omnipresent melancholy that occasionally tempers its sunshine (&quot;I laughed so hard I fell down,&quot; Rossen sings in &quot;No One Does It Like You&quot;. &quot;I curse these legs I walked on.&quot;) Opener and title track &quot;In Ear Park&quot; begins with high, twitchy acoustic guitar, which eventually gives way to an unsteady, paranoid haze; this is Department of Eagles at their freak-folkiest, and it's impossible not to hear the mesmeric whirl of the Incredible String Band (occasionally, Rossen's voice-- wispy and soft-- even sounds a bit like Robin Williamson's). Elsewhere, the band is more straightforward (reinforcing Rossen's claim that some of this material was &quot;too personal&quot; for Grizzly Bear)-- the ominous &quot;Around the Bay&quot; is a nice slice of gothic-folk, with its acoustic strums, thunderstorm percussion, and sharp, threatening vocals.\n\nUnlike a lot of side projects, Department of Eagles are remarkably self-sufficient-- possibly because Rossen and Nicolaus' partnership predates the current incarnation of Grizzly Bear. The breather between their earlier work and In Ear Park has paid off, helping Rossen and Nicolaus craft a rich, disorienting new direction for Department of Eagles. Ambitious and complex, it's stuffed with cocooning harmonies and shimmering, sunlight-smacking-the-Pacific melodies-- a languid, easy West Coast record (think Randy Newman or SMiLE), infused with classic East Coast anxiety.&quot;\n","torrent":{"xt":"urn:btih:172a2b24325de2575b73137c6064432aac4914ef","amp;dn":"Department+of+Eagles+-+In+Ear+Park+%282008%29+%5BLossless%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"172a2b24325de2575b73137c6064432aac4914ef","infoHashBuffer":{"type":"Buffer","data":[23,42,43,36,50,93,226,87,91,115,19,124,96,100,67,42,172,73,20,239]},"announce":[],"urlList":[]}}