{"title":"Megaman X Complete PC Collection-Eng-Istruz Ita-TNTVillage","uid":6366382,"size":3587318658,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1771d4268ec3ebcb6ece11dae87c7ac8f9048725&amp;dn=Megaman+X+Complete+PC+Collection-Eng-Istruz+Ita-TNTVillage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"sohlw","files":4,"time":1304524466,"description":"MEGAMAN X - Complete PC Collection\n\n.: INFO :.\n\nTitle: Megaman X - Complete PC Collection\nGenre: Arcade a scorrimento\nHouse: Capcom\nDate of release: 16/09/2005\nLanguage: Inglese, Instructions in Italian too.\n\nIstruzioni anche in Italiano!\n\n.: INFO RELEASE :.\n\nThe release contents are:\n\nAn AIO Iso with all the games:\n\nMegaman X  - Megaman X2\nMegaman X3 - Megaman X4\nMegaman X5 - Megaman X6\nMegaman X7 - Megaman X8\n\nTrainers for MMX1, MMX5 &amp; MMX8. Plus more it comes with a handy Program to create your own trainers!\n\nAll the software that you might need to install/play the games.\n\nAnd FIVE fine ass flash games!\n\n- MM: Project X\n- MM: Project X - Time Trial\n- Zero Race\n- MM X Next &quot;Saviors&quot;\n- Megaman X RPG\n\nALL THE INSTRUCTIONS TO INSTALL/PLAY THE GAMES ARE INSIDE THE TORRENT.\n\nTUTTE LE ISTRUZIONI PER INSTALLARE CORRETTAMENTE I GIOCHI\nSONO ALL'INTERNO DEL TORRENT.\n\n.: STORYLINE :.\n\nMega Man X, commonly known as &quot;X&quot;, was created by Dr. Thomas Light an unknown amount of years after the Mega Man series. Unlike the original Mega Man, X was a new type of robot with the ability to make his own decisions. After completing X, Light realized that there was a possibility X might choose to turn against humankind. He also feared that even if X chose a beneficent path in life with regard to human welfare, people would inexorably be unable to accept him, and that X would be viewed as a technological anomaly at best and an abomination at worst. Both would result in X's rejection as the cogent thinking machine Light originally intended him to be. Fearing that his life's work and magnum opus would be destroyed by fearful human beings, Light sealed X away in a diagnostic capsule for over 30 years of testing to make sure he would not choose an evil path in life. It is unknown what had happened to him during these years, but Dr. Light presumably died and left his diagnostic experiments unfinished. X's capsule was eventually uncovered by an archaeologist named Dr. Cain almost 100 years after X's creation. With X's help, Cain created a legion of new robots that replicated X's free will; these robots were called &quot;Reploids&quot; (Repliroids in Japan). For a time, everything seemed calm and peaceful.\n\nHowever, a virus began spreading that caused Reploids to turn against humans (later discovered to be originated by Dr. Wily implanted in Zero and transferred to Sigma). This was due to the fact that X's circuitry was duplicated imperfectly.[citation needed] These Reploids were dubbed &quot;Mavericks&quot; (Irregulars in Japan), and a force called the Maverick Hunters (Irregular Hunters) was formed to combat them. The Maverick Hunters were originally led by Sigma until he, too, became a Maverick. Because of his betrayal and eventual declaration of war against the humans, X took it upon himself to join the Maverick Hunters and current leader Zero, another powerful robot (created by the evil Dr. Wily), on a mission to save Earth from Sigma.\n\nThroughout the series, X, Zero, and later Axl battle against Sigma and his Maverick followers to stop their many diabolical plots to destroy the human race.","torrent":{"xt":"urn:btih:1771d4268ec3ebcb6ece11dae87c7ac8f9048725","amp;dn":"Megaman+X+Complete+PC+Collection-Eng-Istruz+Ita-TNTVillage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1771d4268ec3ebcb6ece11dae87c7ac8f9048725","infoHashBuffer":{"type":"Buffer","data":[23,113,212,38,142,195,235,203,110,206,17,218,232,124,122,200,249,4,135,37]},"announce":[],"urlList":[]}}