{"title":"VA - Sound City Real To Reel OST (2013) FLAC vtwin88cube","uid":8252517,"size":404653211,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:17f9fe61983985476bfae67f518ebe78b75a8d42&amp;dn=VA+-+Sound+City+Real+To+Reel+OST+%282013%29+FLAC+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1363190454,"description":"\n\n\nSound City\nReal To Reel OST (2013)\n\n\n\n\n\nSound City, Dave Grohl's love letter to the golden age of recording studios, plays very differently as an album than it does a documentary. On the screen, Grohl devotes a significant amount of time tracing the history of Sound City Studios, the legendary Los Angeles studio where such rock classics as Fleetwood Mac's Fleetwood Mac and Rumours, Tom Petty's Damn the Torpedoes, Pat Benatar's Crimes of Passion, Rick Springfield's Working Class Dog, Foreigner's Double Vision, and Nirvana's Nevermind were recorded. Sound City closed in 2011, and Grohl not only wound up purchasing the studio's Neve mixing board, he made his film as a tribute to this golden age of rock and, then, decided to make an accompanying album of all-new songs using that board in his own home studio, finalizing his salute to the golden age of analog. Grohl brought in friends and colleagues, including his longtime jam partner Josh Homme, then invited a bunch of Sound City veterans like Springfield, Stevie Nicks, Cheap Trick's Rick Nielsen, and Fear's Lee Ving to cut new songs. He also roped in Paul McCartney to play with Krist Novoselic and Pat Smear -- aka, the surviving members of Nirvana -- a nifty coup that earned the project tons of publicity and resulted in a pretty good little rocker called &quot;Cut Me Some Slack.&quot; It's not the only tune here with an immediate hook or melody -- Nicks' &quot;You Can't Fix This&quot; isn't bad, Ving's &quot;Your Wife Is Calling&quot; conjures a bit of Fear, and Rick Springfield's &quot;The Man That Never Was&quot; is rather excellent -- but it's one of only a handful, as the rest of Sound City: Real to Reel sounds exactly like what it is: a bunch of old rockers jamming in a studio. Often, this is quite enjoyable, as they're all excellent musicians playing through a top-notch board, but the songs do have a tendency to drift away from the point, sounding like exceedingly well-executed first drafts. It is telling that the songs that do catch hold all come from survivors of the golden age of classic rock, musicians who can knock out a well-sculpted song without too much effort, and that is as much a testament to the heyday of Sound City as the soundtrack itself. \n\n\n\n\n\nAudio Quality:\t\tPerfect (Lossless)\nAudiochecker:\t     \t99.91% CDDA\nLabel:\t\t\tRCA\nCatalogue:\t\t88765449922\nContains:\t\tAlbum Art &amp; ID Tags\n\n\nAudio-Info:\n\n\n01.Heaven And All - Robert Levon Been/Dave Grohl/Peter Hayes\n02.Time Slowing Down - Chris Goss/Tim Commerford/Dave Grohl/Brad Wilk\n03.You Can't Fix This - Stevie Nicks/Dave Grohl/Taylor Hawkins/Rami Jaffee\n04.The Man That Never Was - Rick Springfield/Dave Grohl/Taylor Hawkins/Nate Mendel/Pat Smear\n05.Your Wife Is Calling - Lee Ving/Dave Grohl/Taylor Hawkins/Alain Johannes/Pat Smear\n06.From Can To Can't - Corey Taylor/Dave Grohl/Rick Nielsen/Scott Reeder\n07.Centipede - Joshua Homme/Chris Goss/Dave Grohl/Alain Johannes\n08.A Trick With No Sleeve - Alain Johannes/Dave Grohl/Joshua Homme\n09.Cut Me Some Slack - Paul McCartney/Dave Grohl/Krist Novoselic/Pat Smear\n10.If I Were Me - Dave Grohl/Jessy Greene/Rami Jaffee/Jim Keltner\n11.Mantra - Dave Grohl/Joshua Homme/Trent Reznor\n\n\n\n\n\n\n\n\n\nThanks for Seeding\nEnjoy...\n\n","torrent":{"xt":"urn:btih:17f9fe61983985476bfae67f518ebe78b75a8d42","amp;dn":"VA+-+Sound+City+Real+To+Reel+OST+%282013%29+FLAC+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17f9fe61983985476bfae67f518ebe78b75a8d42","infoHashBuffer":{"type":"Buffer","data":[23,249,254,97,152,57,133,71,107,250,230,127,81,142,190,120,183,90,141,66]},"announce":[],"urlList":[]}}