{"title":"[Tony_Mullen]Introducing Character Animation with Blender(epub){","uid":11047775,"size":62873941,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:18e5bbf8d2f3d29288a78ea75daa7e0afbc1b91d&amp;dn=%5BTony_Mullen%5DIntroducing+Character+Animation+with+Blender%28epub%29%7B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"zombie_rox","files":2,"time":1410974236,"description":"Introducing Character Animation with Blender, 2nd Edition is written in a friendly but professional tone, with clear descriptions and numerous illustrative screenshots. Throughout the book, tutorials focus on how to accomplish actual animation goals, while illustrating the necessary technical methods along the way. These are reinforced by clear descriptions of how each specific aspect of Blender works and fits together with the rest of the package. By following all the tutorials, the reader will gain all the skills necessary to build and animate a well-modeled, fully-rigged character of their own. The character built over the course of the tutorials is included as a .blend file on the companion website, for the reader to experiment with and learn from.\n\nIntroducing Character Animation with Blender, 2nd Edition is inspiring as well as educational. A color insert includes sample characters and frames from animations by many of the Blender community's most talented artists, which help to illustrate the impressive potential of the software.\n\nPublisher: Sybex; 2 edition (April 26, 2011)\nLanguage: English\nISBN-10: 047042737X\nISBN-13: 978-0470427378\n\nEditorial Reviews\nFrom the Back Cover\n\nFROM CONCEPTS TO FULLY RIGGED CHARACTERS\n\nCompanion WebSite\n\nFind source files for the tutorials in the book, useful Blender links, and much more on the companion website.\n\nwww.sybex.com/go/introducingblender\n\nTap the power of Blender, blend in your creativity, and build memorable animated characters with this practical guide from Blender guru Tony Mullen. Covering the new Blender 2.5, this book offers clear, step-by-step tutorials, a complete discussion of all tools, and illustrations that will both enlighten and inspire you.\n\nFollow all the projects and you'll soon have the skills you need to build and animate a well-modeled, fully-rigged character of your own. A full-color insert presents dazzling examples from some of the most talented artists in the Blender community.\n\n    Get up to speed on Blender 2.5's extensively redesigned user interface\n\n    Master organic mesh modeling tools and build a complex character mesh\n\n    Fashion skin, hair, and clothing with material shaders, textures, and slots\n\n    Use Blender's new Rigify add-on to create complete, professional-quality character rigs with ease\n\n    Learn to sync lip movements with a sound file\n\n    Understand function curves, keyframes, and the basics of animating\n\n    Learn to link assets and use Armature proxies to organize your productions\n\n    Analyze the Blender short film, Sintel, and read what its creators have to say\n\nAnimate a rigged character to get him running\n\nUse particles and subsurface scattering to create hair and skin\n\nExplore open content from the Blender Foundation Open Movie Projects\nAbout the Author\n\nTony Mullen, PhD, has a broad background in CG-related work. He teaches at Tsuda College and Musashino Art University, where his courses have included modeling and animation with Blender and programming with Python. Mullen has been a cartoonist and an illustrator; his screen credits include writer, codirector, and lead animator on several short films, including the award-winning, live-action/stop-motion film Gustav Braustache and the Auto-Debilitator. He is the author of Blender Studio Projects: Digital Movie-Making; Mastering Blender; and Bounce, Tumble and Splash!: Simulating the Physical World with Blender 3D, all from Sybex.","torrent":{"xt":"urn:btih:18e5bbf8d2f3d29288a78ea75daa7e0afbc1b91d","amp;dn":"%5BTony_Mullen%5DIntroducing+Character+Animation+with+Blender%28epub%29%7B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18e5bbf8d2f3d29288a78ea75daa7e0afbc1b91d","infoHashBuffer":{"type":"Buffer","data":[24,229,187,248,210,243,210,146,136,167,142,167,93,170,126,10,251,193,185,29]},"announce":[],"urlList":[]}}