{"title":"The Plot Whisperer Book of Writing Prompts","uid":13163141,"size":301621,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1931ba2a46f58f8d63f6e45ff2ed1c3db4de8832&amp;dn=The+Plot+Whisperer+Book+of+Writing+Prompts+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZamKhan","files":1,"time":1452179466,"description":"Daily exercises guaranteed to spark your writing!\r\n\r\nThe Plot Whisperer Book of Writing Prompts gives you the inspiration and motivation you need to finish every one of your writing projects. Written by celebrated writing teacher and author Martha Alderson, this book guides you through each stage of the writing process, from constructing compelling characters to establishing an unforgettable ending. Alderson also helps you get into the habit of writing creatively every day, with brand-new imaginative prompts, such as:\r\n\r\nCreate an obstacle that interferes with the protagonist's goal and describe how that scene unfolds moment-by-moment.\r\nProvide sensory details of the story world and what your main character is doing at this very moment.\r\nScan earlier scenes for examples of the protagonist's chief character flaw and develop it. He or she will need to overcome this flaw in order to achieve his or her ultimate goal.\r\nShow an issue or situation in the main character's life that needs attention and have him or her take the first step forward toward a course of action.\r\nFilled with daily affirmations, plot advice, and writing exercises, The Plot Whisperer Book of Writing Prompts will set your projects in the right direction--and on their way to the bestseller list!","torrent":{"xt":"urn:btih:1931ba2a46f58f8d63f6e45ff2ed1c3db4de8832","amp;dn":"The+Plot+Whisperer+Book+of+Writing+Prompts+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1931ba2a46f58f8d63f6e45ff2ed1c3db4de8832","infoHashBuffer":{"type":"Buffer","data":[25,49,186,42,70,245,143,141,99,246,228,95,242,237,28,61,180,222,136,50]},"announce":[],"urlList":[]}}