{"title":"Prozak Discography","uid":10037355,"size":1048702573,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:196917b65c25d9b83cc8c7da0814dee91c27842f&amp;dn=Prozak+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"yabrokehomie","files":154,"time":1398418431,"description":"Prozak Discography\n\n\nLabel: Strange Music\n\nGenres: Underground Rap/Horrorcore\n\nHometown: Saginaw, Michigan\n\nFormat: MP3\n\n\n11 Albums Included:\n\n\nBedlam -2000- Chemical Imbalancez Vol. 1\n\nBedlam -2001- Chemical Imbalancez Vol. 2\n\nBedlam -2003- Bedlamitez Rize\n\nBedlam -2003- The Wickedstock Detroit Show\n\nBedlam -2004- Shock Treatment\n\n\nProject Deadman -2004- Self Inflicted\n\n\nProzak -2003- Aftabirth\n\nProzak -2008- Tales From The Sick\n\nProzak -2012- Nocturnal\n\nProzak -2012- Paranormal\n\nProzak -2013- We All Fall Down\n\n\n\n\nBio:\n\n Steven T. Shippy, better known by his stage name Prozak, is an American independent rapper and film director from Saginaw, Michigan. He's a member of the group Project: Deadman with Mike E. Clark as well as the group Bedlam. He is one of the few rappers of Egyptian descent.\n\n\n\n Project: Deadman is a group that consists of two members: Prozak and Mike E Clark. Many Juggalos already know Mike E Clark due to his constant work with ICP throughout their career. Project: Deadman is a horrorcore group that started in Detroit, Michigan in 2003. Mike E Clark is legendary for his music production skills and he has received mutliple gold and platinum records due to his incredible skills. Mike E Clark has produced music for ICP, Kid Rock, and many other artists. He is also the head of &quot;B4 Records&quot; and &quot;The Fun House&quot;, both located in Detroit. The other member, Prozak, needs more details. \n\n Prozak was once a member of a horrorcore group known as &quot;Bedlam&quot;. Bedlam was formed in early 1999. Bedlam consisted of three members, Prozak, Staplez, and Madness. The group was signed to &quot;Virus Independent&quot;, the record lable that The R.O.C. and Skrapz started when they formed HaLFBrEEd and left Latnem Records. Their debut cd &quot;Chemical Imbalancez Volume 1&quot; was released only after a couple of months of work and quickly became an instant success. It featured guest appearances by Sol and Skrapz, and many instantly fell in love with the dark lyrics that covered the entire album. They toured with Esham and HaLFBrEEd in order to truly introduce the world to the horror that Bedlam was capable of making. \n\n Their next ablum was a sequel to &quot;Chemical Imbalancez Volume 1&quot; and yet again Prozak, Staplez and Madness delivered a great album that their fans would love. Songs like &quot;A.M.K.R.&quot; were some of the most gruesome horrorcore songs ever recorded! &quot;Chemical Imbalancez Volume 2&quot; is considered by many to be one of greatest horrorcore albums of all time. Following the release of this album however, Staplez left the group in order to pursue a college education, this made the group lose one of their best members. \n\n So, as a result, Prozak and Madness returned to the studio again and recorded a short EP entitled &quot;Wicked Stock&quot;. Bedlam followed up 2000-01 by doing underground shows with artists like Esham, The Dayton Familly, Project Born, Simkenheights, Krazy Klan, HaLFBrEEd, Kapitol G, and many others. Between Madness' connections, and Prozak's money handling skills, Bedlam quickly became huge. By the end of 2001, Bedlam was in the studio recording there 3rd full length album, &quot;Shock Treatment&quot;. The album was still dark, but it also contained very political lyrics, more of a feeling that Project: Deadman delivers to this day. This album showed a new side, and style of Bedlam, showing that they were versitile and creative. The album was released in April of 2002, at their then second annual Wicked Stock. They began to promote &quot;Shock Treatment&quot; like crazy, and the sales were incredible. They spent 2002 the same way, promoting, networking, and traveling city to city to make their dreams a reality. \n\n In 2003, Bedlam hit the studio to record an album in dedication to there supporters. The album was entitled &quot;Bedlamitez Rize&quot;. They wanted this album to be big, in order to truly give their fans an album worth listening to and a true way to thank their fans for all their support. So, they decided on a special guest line up, and began to work on it. Guest appearances included: Mastamind, Esham, Lavel and producing by Mike E Clark. Bedlam decided to start hitting the live performance scene again, doing a string of free shows as part of the respects they were paying to their fans loyality over the years. They also made their 3rd annual Wicked Stock a free show, and followed it up with a Wicked Stock detroit show at the shelter in detroit, via ticketmaster. \n\n After all of this, something happened along the way, and Bedlam disbanded. Prozak went on to seek a solo career and released his first album &quot;Aftabirth&quot; which was released in 2004. With his dark lyrics overflowing on every track, Prozak supplied the horrorcore world with great songs. He then went on tour with Tech N9ne, this is where Project: Deadman was born. Prozak met up with Mike E Clark and asked him to produce his newest album &quot;Self Inflicted&quot;, but rather than release it as a solo ablum, Prozak decided to make Mike E Clark a member of the group, and the two became known as Project: Deadman. Songs such as &quot;Dead Man Walking&quot; and &quot;Last Breath&quot; which cover the topic of suicide, prove that PDM can deliver constant horrorcore greatness. Prozak has even been called the &quot;The Stephen King of Rap&quot; due to his ability to write such dark lyrics. PDM is also known for their constant dissing of the government. Prozak's strong political views are constantly expressed through his lyrics with songs like &quot;Corporate Lies&quot; and &quot;Holy War&quot;. Prozak does the rapping for the group while Mike E Clark does the music production. Prozak is not only a rap artist, but he also writes and directs music videos, such as &quot;Bout To Bubble&quot; by Tech N9ne. Their debut album was entitled &quot;Self Inflicted&quot; and it was released in 2004 under Strange Music Records, the same label as Tech N9ne. The album reached number 84 on the Billboard top 200. So, they went on tour with Tech N9ne to promote the album, and the tour was called &quot;Hostile Take Over Tour&quot;. Project: Deadman quickly became the second most popular act signed to Strange Music, falling behind only Tech N9ne. They finished their 2004 success by performing at Prozak's annual Wicked Stock. \n\n Due to the graphic nature of PDM's songs, they quickly fell into the eyes of the media as a bad influence for the youth of today. Project: Deadman was attacked by the media saying that their violent music was what caused a shooting in Red Lake, Minnesota. Prozak and Mike E Clark simply ignored the blame that the media was placing on them since they believed &quot;Music doesn't kill people. People kill people&quot;.\n\n\n\nPS3 &amp; Android ready.\n\n\n\nENJOY &amp; SEED\n\n \nIf you like Prozak then buy all his shit and go see his shows. Please support the artists you like this is years of hard work. Leave a comment &amp; rate this download &amp; please seed this takes a lot of time &amp; effort I cant do it all myself.\t\n","torrent":{"xt":"urn:btih:196917b65c25d9b83cc8c7da0814dee91c27842f","amp;dn":"Prozak+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"196917b65c25d9b83cc8c7da0814dee91c27842f","infoHashBuffer":{"type":"Buffer","data":[25,105,23,182,92,37,217,184,60,200,199,218,8,20,222,233,28,39,132,47]},"announce":[],"urlList":[]}}