{"title":"Exercise for Mood and Anxiety: Proven Strategies for Overcoming ","uid":8685469,"size":3089133,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:19922f48750f10835a3b8b0c5f09147a1e10577d&amp;dn=Exercise+for+Mood+and+Anxiety%3A+Proven+Strategies+for+Overcoming+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1373790625,"description":" Michael Otto, Jasper A. J. Smits, &quot;Exercise for Mood and Anxiety: Proven Strategies for Overcoming Depression and Enhancing Well-Being&quot;\nEnglish | ISBN: 0199791007 | 2011 | EPUB | 248 pages | 2,9 MB\n\nExercise has long been touted anecdotally as an effective tool for mood improvement, but only recently has rigorous science caught up with these claims. There is now overwhelming evidence that regular exercise can help relieve low mood-from feelings of stress and anxiety to full depressive episodes.\n\nWith Exercise for Mood and Anxiety, Michael Otto and Jasper Smits, well-known authorities on cognitive behavioral therapy, take their empirically-based mood regulation strategy from the clinic to the general public. Written for those with diagnosed mood disorders as well as those who simply need a new strategy for managing the low mood and stress that is an everyday part of life, this book provides readers with step-by-step guidance on how to start and maintain an exercise program geared towards improving mood, with a particular emphasis on understanding the relationship between mood and motivation. Readers learn to attend carefully to mood states prior to and following physical activity in order to leverage the full benefits of exercise, and that the trick to maintaining an exercise program is not in applying more effort, but in arranging one's environment so that less effort is needed. ","torrent":{"xt":"urn:btih:19922f48750f10835a3b8b0c5f09147a1e10577d","amp;dn":"Exercise+for+Mood+and+Anxiety%3A+Proven+Strategies+for+Overcoming+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19922f48750f10835a3b8b0c5f09147a1e10577d","infoHashBuffer":{"type":"Buffer","data":[25,146,47,72,117,15,16,131,90,59,139,12,95,9,20,122,30,16,87,125]},"announce":[],"urlList":[]}}