{"title":"UK - 2015 - The Coroner - Series 1 - 10 (1280x720) Episodes","uid":12939143,"size":7560234252,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:1a6828bf7aa44b52ddde31d76b1c774389a96740&amp;dn=UK+-+2015+-+The+Coroner+-+Series+1+-+10+%281280x720%29+Episodes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"bnaron","files":12,"time":1449614338,"description":"UK - 2015 - The Coroner\r\nSeries 1\r\n10 (1280x720) Episodes\r\n\r\n\r\nDescription Courtesy of: TheTVDb.com\r\n\r\nBBC One Crime drama following high-flying solicitor Jane Kennedy as she takes over the job of coroner in the English coastal town she escaped from as a teenager. A solicitor returns to the seaside town she left as a teenager to take up the post of coroner, becoming an advocate for the dead as she investigates sudden, violent or unexplained deaths.\r\n\r\n\r\nAll videos are:\r\n\r\n(Video: H264, 2000kbps, 1280px720p, 25fps)\r\n(Audio: AAC, 275kbps, 48kHz, 6 Channel)\r\n\r\n\r\nEpisode Descriptions:\r\n\r\n2015-11-16 - 01 - First Love\r\n\r\nWhen a teenager is found dead at the foot of a tower, Detective Sergeant Davey Higgins believes it was a tragic suicide, but Coroner Jane Kennedy thinks there is more to the case than meets the eye.\r\n\r\n\r\n2015-11-17 - 02 - How to Catch a Lobster\r\n\r\nWhen a body washes up on the shore, Jane is convinced it's a botched sea burial, but Davey believes otherwise. With a steak at stake, both are determined to prove each other wrong.\r\n\r\n\r\n2015-11-18 - 03 - That's the Way to Do It\r\n\r\nWhen the town's new mayor is found dead in a hotel room, Jane's quest for the truth puts her own life in danger.\r\n\r\n\r\n2015-11-19 - 04 - The Fisherman's Tale\r\n\r\nA popular local businessman is shot dead by a sniper in public. Davey is forced to watch as an officer from the Metropolitan Police takes over his investigation and then makes a move on Jane.\r\n\r\n\r\n2015-11-20 - 05 - Gilt\r\n\r\nWhen a treasure hunter is found dead in his own home, Jane wonders whether one of his colleagues wanted the loot for themselves, while the locals fear it was something more supernatural...\r\n\r\n\r\n2015-11-23 - 06 - Capsized\r\n\r\nA man is found dead in a shipwrecked container on the beach. Davey is convinced it was an unfortunate accident, but Jane fears darker forces might be responsible.\r\n\r\n\r\n2015-11-24 - 07 - The Salcombe Selkie\r\n\r\nThe sleepy town of Lighthaven is stunned when a teenage girl returns from the dead. Where has she been for a whole year? And who was buried in her place?\r\n\r\n\r\n2015-11-25 - 08 - Napoleon's Violin\r\n\r\nWhen the patriarch of the local aristocratic family is found stabbed to death, Jane and Davey investigate and find themselves revisiting an embarrassing chapter of their teenage romance.\r\n\r\n\r\n2015-11-26 - 09 - The Deep Freeze\r\n\r\nWhen a man is found dead in a walk-in freezer, Jane and Davey's relationship is tested to the limit as they clash over who they think is responsible.\r\n\r\n\r\n2015-11-27 - 10 - Dirty Dancing\r\n\r\nA woman drops dead in the build-up to a Latin dance festival in Lighthaven. As Jane and Davey argue over what they think happened, the body mysteriously vanishes from the mortuary","torrent":{"xt":"urn:btih:1a6828bf7aa44b52ddde31d76b1c774389a96740","amp;dn":"UK+-+2015+-+The+Coroner+-+Series+1+-+10+%281280x720%29+Episodes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a6828bf7aa44b52ddde31d76b1c774389a96740","infoHashBuffer":{"type":"Buffer","data":[26,104,40,191,122,164,75,82,221,222,49,215,107,28,119,67,137,169,103,64]},"announce":[],"urlList":[]}}