{"title":"Bottlenecks, A  New Theory of Equal Opportunity [PDF] [StormRG]","uid":10733472,"size":1913035,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ab5f16820c52c138d555d8123915e47d7b592fe&amp;dn=Bottlenecks%2C+A++New+Theory+of+Equal+Opportunity+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"F1restorm","files":-1,"time":1407659028,"description":"Bottlenecks: A New Theory of Equal Opportunity\nAuthor: Joseph Fishkin\nPublished: 2014\nPublisher: Oxford University Press\nISBN: 9780199812141\nFormat: Retail PDF\n__________________________________________________________________________________\n\nEqual opportunity is a powerful idea, and one with extremely broad appeal in contemporary politics, political theory, and law. But what does it mean? On close examination, the most attractive existing conceptions of equal opportunity turn out to be impossible to achieve in practice, or even in theory. As long as families are free to raise their children differently, no two people's opportunities will be equal; nor is it possible to disentangle someone's abilities or talents from her background advantages and disadvantages. Moreover, given different abilities and disabilities, different people need different opportunities, confounding most ways of imagining what counts as &quot;equal.&quot;\n\nThis book proposes an entirely new way of thinking about the project of equal opportunity. Instead of focusing on the chimera of literal equalization, we ought to work to broaden the range of opportunities open to people at every stage in life. We can achieve this in part by loosening the bottlenecks that constrain access to opportunities-the narrow places through which people must pass in order to pursue many life paths that open out on the other side. A bottleneck might be a test like the SAT, a credential requirement like a college degree, or a skill like speaking English. It might be membership in a favored caste or racial group. Bottlenecks are part of the opportunity structure of every society. But their severity varies. By loosening them, we can build a more open and pluralistic opportunity structure in which people have more of a chance, throughout their lives, to pursue paths they choose for themselves-rather than those dictated by limited opportunities. This book develops this idea and other elements of opportunity pluralism, then applies this approach to several contemporary egalitarian policy problems: class and access to education, workplace flexibility and work/family conflict, and antidiscrimination law.","torrent":{"xt":"urn:btih:1ab5f16820c52c138d555d8123915e47d7b592fe","amp;dn":"Bottlenecks%2C+A++New+Theory+of+Equal+Opportunity+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ab5f16820c52c138d555d8123915e47d7b592fe","infoHashBuffer":{"type":"Buffer","data":[26,181,241,104,32,197,44,19,141,85,93,129,35,145,94,71,215,181,146,254]},"announce":[],"urlList":[]}}