{"title":"Kaya Project - Elixir","uid":4842358,"size":112340047,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1aeb4b976ed5c55a116b680bd023a94064fd428e&amp;dn=Kaya+Project+-+Elixir&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"AndrewRC","files":13,"time":1239552919,"description":"With the airwaves still stirring, Kaya Project follow up on the acclaimed success of their debut album, 'Walking Through' with a new album, 'Elixir', released October 24th on Interchill Records.\n\nIn this new release, Seb Taylor artfully combines elements from studio sessions he collected in his travels with fresh ethnic beats and a vision for the next level of global fusion. 'Elixir' maintains the uncomprimising production quality listeners have come to expect from Kaya Project while delivering another dynamic series of tracks richly steeped in the eastern traditions of world music. Built on a solid framework of intricate and funky tribal percussion, each cut on the album seamlessly blends diverse musical instrumentation with warm basslines and modern arrangement in creating a deeply captivating listening experience.\n\nCurrently based in the UK, Kaya Project is the newest musical incarnation of Seb Taylor who has also achieved notable success with his other projects over the past 10 years including Digitalis, Angel Tears, and Shakta. As a proficient and skilled musician Seb also plays guitar, cello and flute on many of his tracks as well as adeptly handling the programming and production. Along with additional acoustic support from his partner Natasha Chamberlain, Momi Ochion and a wide variety of accompanying musicians scattered across the planet, Kaya Project is decidedly one of the more collaborative and innovative acts on the cutting edge of the world electronic scene.","torrent":{"xt":"urn:btih:1aeb4b976ed5c55a116b680bd023a94064fd428e","amp;dn":"Kaya+Project+-+Elixir","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1aeb4b976ed5c55a116b680bd023a94064fd428e","infoHashBuffer":{"type":"Buffer","data":[26,235,75,151,110,213,197,90,17,107,104,11,208,35,169,64,100,253,66,142]},"announce":[],"urlList":[]}}