{"title":"Fawlty Towers (Complete  DivX episodes with optional subs too)","uid":5155174,"size":2889100304,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1c213d5b52fa96dae751d221359d6169bb0dd905&amp;dn=Fawlty+Towers+%28Complete++DivX+episodes+with+optional+subs+too%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"mrizzo2","files":-1,"time":1257801372,"description":"If you've previously downloaded these individual volumes from our past\ntorrent postings, You should consult someone if you need to learn how\nto slip those folders into this torrentto help seed, (after you get anything\nmore that you might have previously missed downloaded), so you havent\nwasted a thing! merci\n\n\nFawlty Towers is the best of comedy that thre is to be found - British!\nIt ranks with &quot;Yes Prime Minister&quot;in its popularity among many if not most\nand is bloody great entertainment for which there can be no acceptable\nsubstitute of resempling quality.\n\nThis entire collection of ALL Fawlty Towers episodes from the complete DVD\ncollection is in efficient DivX format to save downloading time and bother.\nGreat picture and sound, and you could even downlod yourselves a software\nconverter (if needed) for your video ipod, perhaps!\n\nPick and choose from the episodes on the torrent file, or go for all\nat once, its all the same (you can simply activate one episode at a time\nwhile going for the whole nine yards). speaking of which, we do have German\nand French subtitles as a courtesy, however the humour is likely to be all\nlost without some basic English literacy. Thanks for seeding to everyone\nthats wanting to be intitiated or to enjoy this whenever they wish!! ta!!\n\nMichael Rizzo Chessman\nReviews: moviesbyrizzo.info\n\nOptional Note: This is a multi-tracker torrent\nIf you use utorrent software, simply click on &quot;trackers&quot; in your software,\nthen right click on th tracker that shows, then select &quot;add tracker&quot;\nYou'll then see all the trackers thatare included by default. Place\na space (blank line) between each tracker showing, then click &quot;ok&quot;\nYour trackers will now show status and update more easily when required.\n\nPS If you enable &quot;show alternating background color&quot; in your preferences\nmenu for &quot;UI settings&quot;, you'll find your csreen easier on the eye and more\npleasing. Enjoy!\n","torrent":{"xt":"urn:btih:1c213d5b52fa96dae751d221359d6169bb0dd905","amp;dn":"Fawlty+Towers+%28Complete++DivX+episodes+with+optional+subs+too%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c213d5b52fa96dae751d221359d6169bb0dd905","infoHashBuffer":{"type":"Buffer","data":[28,33,61,91,82,250,150,218,231,81,210,33,53,157,97,105,187,13,217,5]},"announce":[],"urlList":[]}}