{"title":"Persian Pilgrimages - Journeys Across Iran (Essay Travel Ebook).","uid":9195161,"size":10223335,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d7647456b1604a2bd2bc1c7d76d36ae4960f7af&amp;dn=Persian+Pilgrimages+-+Journeys+Across+Iran+%28Essay+Travel+Ebook%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1384474238,"description":"Afshin Molavi, &quot;Persian Pilgrimages: Journeys Across Iran&quot;\nEnglish | ISBN: 0393051196 | edition 2002 | PDF | 320 pages | 9,8 mb\n\nJournalist Molavi begins the chronicle of his year-long journey through a land in perpetual turmoil by saying, &quot;This is a book about Iran and Iranians.&quot; In the midst of America's war on terrorism and as America is faced with the very real possibility of a second war with Iraq, this is a timely read. \n\nReflective and at times deeply personal, Molavi, who was born in Iran and now lives in Washington, D.C., poignantly reveals Iran and its history through the voices of the people he interviewed, including merchants, students, feminists, traditionalists, children and revolutionaries, as they speak on such subjects as poetry, campus politics, personal appearance, democracy, religion, war and the West. In addition to his descriptions of landmarks and monuments, Molavi makes comparisons to other writings on Iran. He takes readers much further beyond the scope of magazine and newspaper articles, leading them through his own discovery of his homeland. In the end, he leaves Iran a conflicted man, weighed down by his new knowledge of the people and himself. &quot;Surely, it would not be the last time I visited Iran, but somehow, I felt melancholy.... Had I seen everything I needed to see? Had I talked to enough people? What was this sense of loss I felt?&quot; Not only a portrait of a country and people, this is also a personal journey into a man's past and his future.\n\nPS Scan quality slightly below average, but books of this type on Iran are rae so...","torrent":{"xt":"urn:btih:1d7647456b1604a2bd2bc1c7d76d36ae4960f7af","amp;dn":"Persian+Pilgrimages+-+Journeys+Across+Iran+%28Essay+Travel+Ebook%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d7647456b1604a2bd2bc1c7d76d36ae4960f7af","infoHashBuffer":{"type":"Buffer","data":[29,118,71,69,107,22,4,162,189,43,193,199,215,109,54,174,73,96,247,175]},"announce":[],"urlList":[]}}