{"title":"OpenGL Insights","uid":7861062,"size":16189546,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d99d5366d3b9744f94efa41e6008d412780b45f&amp;dn=OpenGL+Insights&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"renatosistema","files":-1,"time":1353890779,"description":"Book Description\n\nGet Real-World Insight from Experienced Professionals in the OpenGL Community\n\nWith OpenGL, OpenGL ES, and WebGL, real-time rendering is becoming available everywhere, from AAA games to mobile phones to web pages. Assembling contributions from experienced developers, vendors, researchers, and educators, OpenGL Insights presents real-world techniques for intermediate and advanced OpenGL, OpenGL ES, and WebGL developers.\n\nGo Beyond the Basics\nThe book thoroughly covers a range of topics, including OpenGL 4.2 and recent extensions. It explains how to optimize for mobile devices, explores the design of WebGL libraries, and discusses OpenGL in the classroom. The contributors also examine asynchronous buffer and texture transfers, performance state tracking, and programmable vertex pulling.\n\nSharpen Your Skills\nFocusing on current and emerging techniques for the OpenGL family of APIs, this book demonstrates the breadth and depth of OpenGL. Readers will gain practical skills to solve problems related to performance, rendering, profiling, framework design, and more.","torrent":{"xt":"urn:btih:1d99d5366d3b9744f94efa41e6008d412780b45f","amp;dn":"OpenGL+Insights","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d99d5366d3b9744f94efa41e6008d412780b45f","infoHashBuffer":{"type":"Buffer","data":[29,153,213,54,109,59,151,68,249,78,250,65,230,0,141,65,39,128,180,95]},"announce":[],"urlList":[]}}