{"title":"The Tall T (Western) {Scott, Boone} [1957]","uid":7934296,"size":794483110,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1dc49399c2f60accd1edcebc20d56872608c1ae8&amp;dn=The+Tall+T+%28Western%29+%7BScott%2C+Boone%7D+%5B1957%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"alien99","files":-1,"time":1355800755,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0051047/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0051047/&lt;/a&gt;\n\nStoryline\n\nHaving lost his horse in a bet, Pat Brennan hitches a ride with a stagecoach carrying newlyweds, Willard and Doretta Mims. At the next station the coach and its passengers fall into the hands of a trio of outlaws headed by a man named Usher. When Usher learns that Doretta is the daughter of a rich copper-mine owner, he decides to hold her for ransom. Tension builds over the next 24 hours as Usher awaits a response to his demands and as a romantic attachment grows between Brennan and Doretta. \n\nUser Review\n\n\nIt's a no-nonsense El Cheapo Western shot on a low budget, an elementary piece of exposition of masculine honor, with Boetticher, Scott, Kennedy, Richard Boone, and movie flats -- all at the top of their forms.\n\nWhat distinguishes the half-dozen or so Westerns that came from Boetticher and Scott is not so much the plot, which is generally simple, but the slight twists in character and the occasional grace notes in the dialogue.\n\nYou have to love this dialogue. &quot;Cookin'? That's WIMMIN's work!&quot; And, said by Scott in all sincerity, &quot;There are some things a man can't ride around.&quot; And, &quot;There are ten head of wimmin for every man in Sonora. Course, most of them is just hurrah gals.&quot; And, &quot;I'm not gonna get shot in the belly just 'cause you're feelin' sorry for yourself.&quot; And, &quot;Why don't you just say it out in words?&quot;\n\nBasically the story has Scott and O'Sullivan (who, twenty years earlier had been Tarzan's delectable mate) held hostage by Boone and his two shallow young companions, Billy Jack (Skip Homeier) and Chink (Henry Silva). Boone, although a vicious murderer, is not entirely unsympathetic. He feels forced to &quot;run with&quot; these coarse companeros who live from moment to moment. They don't even know their own ages. They've been beaten and mistreated since they were kids. (&quot;You run with them,&quot; says Scott reprovingly.) Boone, on the other hand, is sick of their talk about wimmin and such. He is lonely, has no family or wummin waiting for him. &quot;Talk,&quot; he orders Scott at gunpoint, &quot;about anything!&quot; He dreams of someday having a spread of his own, with a couple of cattle, working the ground.\n","torrent":{"xt":"urn:btih:1dc49399c2f60accd1edcebc20d56872608c1ae8","amp;dn":"The+Tall+T+%28Western%29+%7BScott%2C+Boone%7D+%5B1957%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dc49399c2f60accd1edcebc20d56872608c1ae8","infoHashBuffer":{"type":"Buffer","data":[29,196,147,153,194,246,10,204,209,237,206,188,32,213,104,114,96,140,26,232]},"announce":[],"urlList":[]}}