{"title":"Modified Ultra light Windows XP for Virtual machines only","uid":10635949,"size":223752894,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1e11fddfbce3f16f06c37376177bef72ec749ff4&amp;dn=Modified+Ultra+light+Windows+XP+for+Virtual+machines+only&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"asafaq","files":4,"time":1406388741,"description":"Modified Ultra light Windows XP SP3 for Virtual machines only.\n\nWindows XP SP3 comes supplied with drivers and software to support all computers. None of those are needed to run on a Virtual Machine.\n\nWith the usage of nLite, I've trimmed away all the unnecessary drivers, utilities, documents, services, settings, etc that come supplied with Windows XP. Example for most things that got trimmed away: Windows Media Player, Support for Zip drives, battery, tablets, infra-red, joystick, firewire, brother hardware, modem, multimedia, themes, cursors, sounds, all help documents, all languages except English and Hebrew, DR Watson, FAT support, and many many other. I've kept mspaint and calc, because they're cool.\n\nThis version of Windows XP installs unattended, runs faster, is ultra light and designed only for Virtual machines. Final Windows directory size is around 600MB. Virtual memory is set to 768MB and the pagefile will take around 1GB. Image included in torrent.\n\nInstallation:\nMount the floppy disk with SCSI drivers in the F6 menu in the start of the installation. Image is available here http://kb.vmware.com/selfservice/microsites/search.do?language=en_US&amp;cmd=displayKC&amp;externalId=1005208. If you encounter 'NTLDR missing' error, restart, as the Virtual Machine loads, hit F2 during POST to enter BIOS, make sure the Boot Priority is CD &gt; HD &gt; Removeables. Remember to change it to HD &gt; CD after you finish installation, or just unmount the setup ISO. The rest of the installation should be unattended. The product key is included in the unattended installation but you may still need it J6T2H - YBT26 - FWXGY - 2HVXJ - TTBDY\n\n\n\nAs the uploader, I have a 800Kbps up link, please seed.\n\nMany thanks to Dino at http://www.nliteos.com/\n\n\n\n* If you want resolution greater then 800 by 600 pixels, you will have to install VMware Tools. Windows will identify those foreign files and ask to install from the Setup CD, decline it.\n* A work around to setup an image for background: Open the image in IE &gt; Right Click &gt; Set background.\n* To access the recycle bin: Start &gt; Run &gt; and type &quot;shell:RecycleBinFolder&quot;\n* The users' directories are in root directory &quot;&quot; , not in &quot;Documents and Settings&quot;\n* Thank you all.","torrent":{"xt":"urn:btih:1e11fddfbce3f16f06c37376177bef72ec749ff4","amp;dn":"Modified+Ultra+light+Windows+XP+for+Virtual+machines+only","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e11fddfbce3f16f06c37376177bef72ec749ff4","infoHashBuffer":{"type":"Buffer","data":[30,17,253,223,188,227,241,111,6,195,115,118,23,123,239,114,236,116,159,244]},"announce":[],"urlList":[]}}