{"title":"Amy Tan - Saving fish from drowing (E-Book)NLT-Release","uid":6850383,"size":2958613,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e5b8bb7697bda7f20899a15bd43b0304f5d4c99&amp;dn=Amy+Tan+-+Saving+fish+from+drowing+%28E-Book%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"linday1","files":-1,"time":1322498091,"description":"\nPas op dit boek is in het Engels en is een verzoekje.\n\nA provocative new novel from the bestselling author of The Joy Luck Club and The Bonesetter's Daughter. \n\nOn an ill-fated art expedition into the southern Shan state of Burma, eleven Americans leave their Floating Island Resort for a Christmas-morning tour-and disappear. Through twists of fate, curses, and just plain human error, they find themselves deep in the jungle, where they encounter a tribe awaiting the return of the leader and the mythical book of wisdom that will protect them from the ravages and destruction of the Myanmar military regime. \n\nSaving Fish from Drowning seduces the reader with a fagade of Buddhist illusions, magician's tricks, and light comedy, even as the absurd and picaresque spiral into a gripping morality tale about the consequences of intentions-both good and bad-and about the shared responsibility that individuals must accept for the actions of others. \n\nA pious man explained to his followers: &quot;It is evil to take lives and noble to save them. Each day I pledge to save a hundred lives. I drop my net in the lake and scoop out a hundred fishes. I place the fishes on the bank, where they flop and twirl. 'Don't be scared,' I tell those fishes. 'I am saving you from drowning.' Soon enough, the fishes grow calm and lie still. Yet, sad to say, I am always too late. The fishes expire. And because it is evil to waste anything, I take those dead fishes to market and I sell them for a good price. With the money I receive, I buy more nets so I can save more fishes.&quot;\n\nHashcode:\n1E5B8BB7697BDA7F20899A15BD43B0304F5D4C99\n\nNLT-RELEAS IS TERUG KOM SNEL NAAR DE SITE:\n &lt;a href=&quot;\nhttp://www.nlt-release.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt-release.nl&lt;/a&gt;\n\nBy Linday","torrent":{"xt":"urn:btih:1e5b8bb7697bda7f20899a15bd43b0304f5d4c99","amp;dn":"Amy+Tan+-+Saving+fish+from+drowing+%28E-Book%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e5b8bb7697bda7f20899a15bd43b0304f5d4c99","infoHashBuffer":{"type":"Buffer","data":[30,91,139,183,105,123,218,127,32,137,154,21,189,67,176,48,79,93,76,153]},"announce":[],"urlList":[]}}