{"title":"Braga Santos - Sym No 4 - Cassuto, NSO of Ireland [Philidor]","uid":15751309,"size":235779206,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1e7be21b47feeea4ff76546ce3ca1a344355859a&amp;dn=Braga+Santos+-+Sym+No+4+-+Cassuto%2C+NSO+of+Ireland+%5BPhilidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Philidor","files":7,"time":1473033487,"description":"Joly Braga Santos is considered the foremost symphonic composer Portugal produced in the 20th century--and still something of a well-kept secret, despite rave reviews when those symphonies were finally recorded a number of years ago. They divide fairly neatly into two compositional periods. The first four were written when he was between the ages of 22 and 27, and display both a warm-hearted romanticism, and a strong interest in modalism that he associated with the golden age of Portuguese polyphony. In the 1960s he cut back on composition to conduct more, both at home and abroad. When he resumed composition his style had become far more chromatic, and his structures mess transformative than developmental. His last pair of symphonies date from this period.\r\n\r\nBraga Santos' Fourth Symphony is considered by some reviewers his finest. His thematic content is memorable and emotionally laden, his orchestration distinctive, and his handling of the inherent flow of tension and relaxation in the handling of symphonic structure, masterful. The finale has developed a life of its own in his native Portugal--Braga Santos really does get quite a workout for his muscular main theme, which around 11:00 suddenly morphs into a vast, lyrical landscape, but the work as a whole is a fine example of what this underrated composer could accomplish.\r\n\r\n\r\nTransfers are made at 768 kBits/s, directly from the disc.\r\n\r\nA bio is enclosed. You can find all my classical uploads by searching on Philidor, or just looking in this regularly updated thread","torrent":{"xt":"urn:btih:1e7be21b47feeea4ff76546ce3ca1a344355859a","amp;dn":"Braga+Santos+-+Sym+No+4+-+Cassuto%2C+NSO+of+Ireland+%5BPhilidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e7be21b47feeea4ff76546ce3ca1a344355859a","infoHashBuffer":{"type":"Buffer","data":[30,123,226,27,71,254,238,164,255,118,84,108,227,202,26,52,67,85,133,154]},"announce":[],"urlList":[]}}