{"title":"Britney Spears - ...Baby One More Time (1998) 320 KBPS","uid":7289774,"size":105922811,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1e7e2e9790c2910ca8be19f1ba54c1eb1a5b0ce7&amp;dn=Britney+Spears+-+...Baby+One+More+Time+%281998%29+320+KBPS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Mr320KBPS","files":12,"time":1337700110,"description":"...Baby One More Time is the debut studio album of American recording artist Britney Spears, released on January 12, 1999, by Jive Records. In June 1997, while Spears negotiated with manager Lou Pearlman to join female pop group Innosense, her mother asked family friend and entertainment lawyer Larry Rudolph for his opinion and submitted a tape of Spears singing over a Whitney Houston karaoke song. Rudolph decided to pitch her to record labels, sending them a demo tape with an unused song from Toni Braxton. Jive was interested and appointed the singer to work with producer Eric Foster White. After hearing the recorded material, Jive signed Spears to a multi-album deal.\n\nSpears traveled to Sweden to work with producers Max Martin, Denniz Pop and Rami Yacoub, among others. Martin showed Spears and her management a track titled &quot;Hit Me Baby One More Time&quot;, which was originally written for American R&amp;B group TLC; however, they rejected the track. Spears later claimed that she felt excited when she heard it and knew it was going to be a hit record. By June 1998, the album had been finished. The songs on ...Baby One More Time are sung by Spears in a mid-nasal voice, and lyrically talk about love and relationships.\n\nCritics gave the album mixed reviews, describing the singer as a Madonna next door, considering it silly and premature. The album was successful on the charts, reaching the top five in several countries, while reaching number one in Canada and the United States. It also received several certifications around the world, including an fourteen-times platinum certification by the Recording Industry Association of America (RIAA), for shipments over 14 million units in the country. As of 2012 ...Baby One More Time was Spears' most successful album, selling over 33 million copies worldwide.\n\nFive singles came from the album. With &quot;...Baby One More Time&quot; becoming a worldwide success and one of the best-selling singles of all time, at over nine million copies. The album was promoted with appearances on live television, and also by the ...Baby One More Time Tour in 1999, with a second leg titled Crazy 2k Tour in 2000. Spears claimed she wasn't able to explore her vocal ability on the album. This album set Spears' international pop culture icon image and launched her career.\n\n\n\nTrack Listing:\n\n1. &quot;...Baby One More Time&quot;  \t\t\n2. &quot;(You Drive Me) Crazy&quot;  \t\n3. &quot;Sometimes&quot;  \t \t\n4. &quot;Soda Pop&quot;  \t\n5. &quot;Born to Make You Happy&quot;  \t\t\n6. &quot;From the Bottom of My Broken Heart&quot;  \t\n7. &quot;I Will Be There&quot;  \t\t\n8. &quot;I Will Still Love You&quot; (duet with Don Phillip)\t\n9. &quot;Thinkin' About You&quot;  \t\n10. &quot;E-Mail My Heart&quot;  \t\n11. &quot;The Beat Goes On&quot;  ","torrent":{"xt":"urn:btih:1e7e2e9790c2910ca8be19f1ba54c1eb1a5b0ce7","amp;dn":"Britney+Spears+-+...Baby+One+More+Time+%281998%29+320+KBPS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e7e2e9790c2910ca8be19f1ba54c1eb1a5b0ce7","infoHashBuffer":{"type":"Buffer","data":[30,126,46,151,144,194,145,12,168,190,25,241,186,84,193,235,26,91,12,231]},"announce":[],"urlList":[]}}