{"title":"4 Rare 80s Albums [Part 1] New Wave [Re-seed]","uid":4744595,"size":304894254,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1ed6a71dd6978d13981bf7e1b7333b999c0ac8f4&amp;dn=4+Rare+80s+Albums+%5BPart+1%5D+New+Wave+%5BRe-seed%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"80zforever","files":-1,"time":1235813908,"description":"A Year ago today I started posting these series that have now reached 53 volumes. I am going to re-seed them gradually because of many requests I am getting for a re-post. Apparently older torrents have either no or few seeders. Also since my intention is to promote these long forgotten bands, I am hoping there will be new downloaders as well. \n\n\nBlue Zoo - 2 x 2 [1982]\n\n \nBlue Zoo was formed in 1980,  Band members were: Mike Ansell on bass, Matthew Flowers (formerly of new wave band &quot;Sore Throat&quot;) on keyboards, Pete Lancaster on trumpet, Andy O on vocals, Tim Parry on guitar and Mickey Sparrow on drums. Steve Pond from Inner City Unit played occasional synthesizer. Parry later went on to become a record producer.\n\nBlue Zoo had one UK hit single. In October 1982 &quot;Cry Boy Cry&quot; charted and reached number 13. It stayed on the UK Singles Chart's Top 40 for eight weeks.\n\n  \n\nStabilizers - Tyranny [1986]\n\nThe Stabilizers were a pop/rock duo founded in the early 1980s by musicians Dave Christenson and Rich Nevens. With Christenson on lead vocals and Nevens on guitars and occasional keyboards. In 1986, They released Tyranny, their first and only album. The guitar and synth-laced album followed in the style of other 1980s bands such as Duran Duran, Tears for Fears and Mr. Mister. The first single from Tyranny was &quot;One Simple Thing,&quot; which peaked at number 21 on the Billboard Mainstream Rock Tracks chart and number 93 on the Billboard Hot 100.\n\n \nTrees - Sleep Convention [1983]\n\nFronted by Dane Conover, Trees was a New Wave one-man band from San Diego, California. Trees only released one album on MCA and produced by Earle Mankey in 1982 called Sleep Convention which was a critical success but a commercial failure due to MCA's problems at the time. And also created 5 Low Budget Music Videos. Reviews included comments like &quot; Pop Music of the Future, and &quot;is a stunning debut which shows remarkable originality and talent. That this record died the commercial death is not just incomprehensible, it's criminal.&quot; Dane Conover ended Trees after one album to move on to other projects.  \n\nTwo Minds Crack - Victory Parade [1986]\n\nTwo Minds Crack was a new wave power pop band fronted by Kevin Jones [singer/guitarist and main songwriter]. Victory Parade is a critically acclaimed album and extremely catchy. A must grab for new wave power pop band lovers!\n\n ","torrent":{"xt":"urn:btih:1ed6a71dd6978d13981bf7e1b7333b999c0ac8f4","amp;dn":"4+Rare+80s+Albums+%5BPart+1%5D+New+Wave+%5BRe-seed%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ed6a71dd6978d13981bf7e1b7333b999c0ac8f4","infoHashBuffer":{"type":"Buffer","data":[30,214,167,29,214,151,141,19,152,27,247,225,183,51,59,153,156,10,200,244]},"announce":[],"urlList":[]}}