{"title":"Star Trek The Next Generation A Final Unity","uid":7235210,"size":592989135,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1ef04d859f64d53ea0e0b2617453ce7c976b0b97&amp;dn=Star+Trek+The+Next+Generation+A+Final+Unity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"esharoth","files":-1,"time":1335970312,"description":"Title: Star Trek: The Next Generation - A Final Unity\nGenre: adventure / strategy / sci-fi\nReleased: 31st May 1995\nDeveloper: Spectrum HoloByte\nPublisher: MicroProse\nDescription:\nStar Trek: The Next Generation - A Final Unity is a PC game based on and licensed for the Star Trek: The Next Generation television series. It features the voices of all the original cast of the show, in hundreds of hours of recorded dialog. The script was created specifically for this game.\n\nWhile on a routine patrol of the Romulan neutral zone, the Enterprise intercepts a distress signal from the crew of a Garidian scout ship, seeking asylum in Federation space. After a brief confrontation with the commander of a Garidian Warbird, the crew of the scout ship is beamed aboard the Enterprise. One of the refugees mentions to Captain Picard that they are in search of the Lawgiver's legendary Fifth Scroll, which could aid in preventing war on Garid. Picard agrees to assist them, and the crew of the Enterprise sets out in search of clues to the location of the scroll.\n\nA Final Unity features both adventure and strategy segments. Whilst on the ship the player can use the tactical console to engage in occasional battles against enemies, repair damaged systems, and select teams for away missions. These missions constitute the larger portion of the game and are played like a traditional point&amp;click adventure, including item manipulation and puzzle-solving. Dialogues may vary depending on the crew members previously selected by the player.\n\nBonus content: manual.\n\nHow to play:\n1) Download the game;\n2) Mount or burn disc image;\n3) Run setup.exe to install;\n4) Play the game without the disc using desktop or start menu shortcuts.\n\n! Notice\nThe game is already configured to run with DOSBox and it works on modern PCs.","torrent":{"xt":"urn:btih:1ef04d859f64d53ea0e0b2617453ce7c976b0b97","amp;dn":"Star+Trek+The+Next+Generation+A+Final+Unity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ef04d859f64d53ea0e0b2617453ce7c976b0b97","infoHashBuffer":{"type":"Buffer","data":[30,240,77,133,159,100,213,62,160,224,178,97,116,83,206,124,151,107,11,151]},"announce":[],"urlList":[]}}