{"title":"10 Simple Solutions to Chronic Pain: How to Stop Pain ","uid":8537719,"size":316625,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f28703bc90a458f002887c9366bc5bae0f16d25&amp;dn=10+Simple+Solutions+to+Chronic+Pain%3A+How+to+Stop+Pain+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1370302005,"description":"10 Simple Solutions to Chronic Pain: How to Stop Pain from Controlling Your Life (The New Harbinger Ten Simple Solutions Series) by Blake H. Tearnan\nEnglish | 2007 | ISBN: 1572244828 | ISBN-13: 9781572244825 , 9781608825332 | 192 pages | EPUB | 0,3 MB\n\nGet Chronic Pain Under Control\nHave you tried a number of approaches to manage chronic pain without much relief? The discouraging cycle of hope followed by frustration and continued pain can be as damaging to your quality of life as pain itself.\n\nTo address this problem, the most current approaches to pain management advocate living well despite pain. They encourage pain sufferers to set aside their struggle with pain and learn the skills they need to stay engaged with life. Distilled from the very best of these techniques, 10 Simple Solutions to Chronic Pain offers you ten simple, effective solutions for thriving with chronic pain.\n\nFirst, you'll get a quick introduction to the physiology of pain. Then it's down to the business of improving your quality of life: You'll learn tips for getting better sleep, ways to build a strong support system, and techniques for overcoming fear, anxiety, and depression. You'll discover better ways to communicate with doctors about your problems and find out which treatment options are likely to do you the most good. With the advice in this book, you can move from a debilitating cycle of pain to a full and rewarding life.","torrent":{"xt":"urn:btih:1f28703bc90a458f002887c9366bc5bae0f16d25","amp;dn":"10+Simple+Solutions+to+Chronic+Pain%3A+How+to+Stop+Pain+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f28703bc90a458f002887c9366bc5bae0f16d25","infoHashBuffer":{"type":"Buffer","data":[31,40,112,59,201,10,69,143,0,40,135,201,54,107,197,186,224,241,109,37]},"announce":[],"urlList":[]}}