{"title":"Edwardian London Through Japanese Eyes - The Art and Writings of","uid":9733274,"size":17512823,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f4748d332b87953fcec378a84702f8d87fcee8b&amp;dn=Edwardian+London+Through+Japanese+Eyes+-+The+Art+and+Writings+of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1394411113,"description":"William S. Rodner, &quot;Edwardian London Through Japanese Eyes: The Art and Writings of Yoshio Markino, 1897-1915&quot; \nEnglish | 2012 | ISBN: 9004220399 | 224 pages | PDF | 16,7 MB\n\nEdwardian London Through Japanese Eyes considers the career of the Japanese artist Yoshio Markino (1869-1956), a prominent figure on the early twentieth-century London art scene whose popular illustrations of British life adroitly blended stylistic elements of East and West. \nHe established his reputation with watercolors for the avant-garde Studio magazine and attained success with The Colour of London (1907), the book that offered, in word and picture, his outsider's response to the modern Edwardian metropolis. Three years later he recounted his British experiences in an admired autobiography aptly titled A Japanese Artist in London. Here, and in later publications, Markino offered a distinctively Japanese perspective on European life that won him recognition and fame in a Britain that was actively engaging with pro-Western Meiji Japan. \nBased on a wide range of unpublished manuscripts and Edwardian commentary, this lavishly illustrated book provides a close examination of over 150 examples of his art as well analysis of his writings in English that covered topics as wide-ranging as the English and Japanese theater, women's suffrage, current events in the Far East and observations on traditional Asian art as well as Western Post-Impressionism. \nEdwardian London Through Japanese Eyes, the first scholarly study of this neglected artist, demonstrates how Markino became an agent of cross-cultural understanding whose beautiful and accessible work provided fresh insights into the Anglo-Japanese relationship during the early years of the twentieth century.","torrent":{"xt":"urn:btih:1f4748d332b87953fcec378a84702f8d87fcee8b","amp;dn":"Edwardian+London+Through+Japanese+Eyes+-+The+Art+and+Writings+of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f4748d332b87953fcec378a84702f8d87fcee8b","infoHashBuffer":{"type":"Buffer","data":[31,71,72,211,50,184,121,83,252,236,55,138,132,112,47,141,135,252,238,139]},"announce":[],"urlList":[]}}