{"title":"Introduction to Compiler Construction in a Java World LittleFair","uid":10146129,"size":5305675,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f645155cd752f5e4b38063abefcb73d50787721&amp;dn=Introduction+to+Compiler+Construction+in+a+Java+World+LittleFair&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"SirHates","files":1,"time":1400057159,"description":"\n\nBill Campbell, Swami Iyer, &quot;Introduction to Compiler Construction in a Java World&quot; \n2013 | ISBN: 1439860882 | 381 pages | PDF | 5 MB \n\n\nImmersing students in Java and the Java Virtual Machine (JVM), Introduction to Compiler Construction in a Java World enables a deep understanding of the Java programming language and its implementation. The text focuses on design, organization, and testing, helping students learn good software engineering skills and become better programmers.\n\nThe book covers all of the standard compiler topics, including lexical analysis, parsing, abstract syntax trees, semantic analysis, code generation, and register allocation. The authors also demonstrate how JVM code can be translated to a register machine, specifically the MIPS architecture. In addition, they discuss recent strategies, such as just-in-time compiling and hotspot compiling, and present an overview of leading commercial compilers. Each chapter includes a mix of written exercises and programming projects. \n\nBy working with and extending a real, functional compiler, students develop a hands-on appreciation of how compilers work, how to write compilers, and how the Java language behaves. They also get invaluable practice working with a non-trivial Java program of more than 30,000 lines of code.","torrent":{"xt":"urn:btih:1f645155cd752f5e4b38063abefcb73d50787721","amp;dn":"Introduction+to+Compiler+Construction+in+a+Java+World+LittleFair","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f645155cd752f5e4b38063abefcb73d50787721","infoHashBuffer":{"type":"Buffer","data":[31,100,81,85,205,117,47,94,75,56,6,58,190,252,183,61,80,120,119,33]},"announce":[],"urlList":[]}}