{"title":"The Big Book of ACT Metaphors [PDF &amp; Epub] [StormRG]","uid":11000443,"size":3261218,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:202ff80ed6868f5ccff95a70372db8d593954f93&amp;dn=The+Big+Book+of+ACT+Metaphors+%5BPDF+%26amp%3B+Epub%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"steelballz","files":-1,"time":1410130984,"description":"Description\nBig Book of ACT Metaphors, The\nAuthor:Hayes, Steven C., Stoddard, Jill A., Afari, Niloofar\nPublisher and Published Date:New Harbinger Publications (March 31 2014)\nISBN-10:1608825299\nISBN-13:9781608825295\nFormat: Retail PDF\nReader Required: Adobe Acrobat\n\n\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\nIt should also be noted that any reference to any dvd, cd, or any other dlc or extra content in this, or any other torrent I upload, is not available in the torrent unless I state otherwise. If you want the extras, buy the product\nThis PDF is encrypted! This encryption will NOT interfere with opening, printing, or copying the PDF. It will only prevent editing of the PDF. I have my reasons for it. If you have questions pm me through my acct on KAT\nIf you do have difficulties opening this file while running a Linux OS, try opening in windows or mac using Adobe Acrobat. If you still can't open, pm me and I'll investigate.\n\n\nimage\nCover from actual book file\n\n\nProduct Description\n\nProfessional\nMetaphors and exercises play an incredibly important part in the successful delivery of acceptance and commitment therapy (ACT). These powerful tools go far in helping clients connect with their values and give them the motivation needed to make a real, conscious commitment to change. Unfortunately, many of the metaphors that clinicians use have become stale and ineffective. That's why you need fresh, new resources for your professional library.\n\nIn this breakthrough book, two ACT researchers provide an essential A-Z resource guide that includes tons of new metaphors and experiential exercises to help promote client acceptance, defusion from troubling thoughts, and values-based action. The book also includes scripts tailored to different client populations, and special metaphors and exercises that address unique problems that may sometimes arise in your therapy sessions.\nSeveral ACT texts and workbooks have been published for the treatment of a variety of psychological problems. However, no one resource exists where you can find an exhaustive list of metaphors and experiential exercises geared toward the six core elements of ACT. Whether you are treating a client with anxiety, depression, trauma, or an eating disorder, this book will provide you with the skills needed to improve lives, one exercise at a time.\n\nWith a special foreword by ACT cofounder Steven C. Hayes, PhD, this book is a must-have for any ACT Practitioner.\n\nAbout the Author\nJill A. Stoddard, PhD, is the founder and director of The Center for Stress and Anxiety Management, an outpatient clinic in San Diego, CA. She specializes in evidence-based treatments for anxiety and related disorders, and is associate professor of psychology at Alliant International University where she teaches, conducts research, and mentors students in topics related to anxiety disorders; trauma; emotion regulation; acceptance and commitment therapy (ACT); and cognitive behavioral therapy (CBT). She received her PhD in clinical psychology from Boston University in 2007.\n\nNiloofar Afari, PhD, is an associate professor of psychiatry at the University of California, San Diego; director of Mental Health Integrative and Consultative Services at VA San Diego Healthcare System; and director of Clinical Research at the VA Center of Excellence for Stress and Mental Health in San Diego, CA. In addition to clinical practice, she conducts research and mentors graduate and postdoctoral students in the application of ACT to chronic health conditions. She received her PhD in clinical psychology in 1996 from the University of Nevada, Reno, under the mentorship of ACT cofounder, Steven C. Hayes.\n\nSteven C. Hayes, PhD, is Nevada Foundation Professor in the department of psychology at the University of Nevada. An author of thirty-four books and more than 470 scientific articles, he has shown in his research how language and thought leads to human suffering, and cofounded ACT, a powerful therapy method that is useful in a wide variety of areas. Hayes has been president of several scientific societies and has received several national awards, including the Lifetime Achievement Award from the Association for Behavioral and Cognitive Therapy.\n\nimage\nScientia est potentia","torrent":{"xt":"urn:btih:202ff80ed6868f5ccff95a70372db8d593954f93","amp;dn":"The+Big+Book+of+ACT+Metaphors+%5BPDF+%26amp%3B+Epub%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"202ff80ed6868f5ccff95a70372db8d593954f93","infoHashBuffer":{"type":"Buffer","data":[32,47,248,14,214,134,143,92,207,249,90,112,55,45,184,213,147,149,79,147]},"announce":[],"urlList":[]}}