{"title":"Gene Krupa - Drummin Man TQMP","uid":4772689,"size":225080297,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:20831a3538739b5e6b57b5d808d6157466728fdc&amp;dn=Gene+Krupa+-+Drummin+Man+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"zootallure","files":29,"time":1237105985,"description":"Many consider Krupa to be one of the most influential drummers of the 20th century, particularly regarding the development of the drum kit. Many jazz historians believe he made history in 1927 as the first kit drummer ever to record using a bass drum pedal. Others, however, believe this was done earlier by Baby Dodds. His drum method was published in 1938 and immediately became the standard text. He is also credited with inventing the rim shot on the snare drum.\n\nKrupa in the 1930s prominently featured Slingerland drums. At Krupa's urging, Slingerland developed tom-toms with tuneable top and bottom heads, which immediately became important elements of virtually every drummer's set-up. Krupa also developed and popularised many of the cymbal techniques that became standards. His collaboration with Armand Zildjian of the Avedis Zildjian Company developed the hi-hat stand and standardized the names and uses of the ride cymbal, the crash cymbal, the splash cymbal, the pang cymbal and the swish cymbal.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health:-)","torrent":{"xt":"urn:btih:20831a3538739b5e6b57b5d808d6157466728fdc","amp;dn":"Gene+Krupa+-+Drummin+Man+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20831a3538739b5e6b57b5d808d6157466728fdc","infoHashBuffer":{"type":"Buffer","data":[32,131,26,53,56,115,155,94,107,87,181,216,8,214,21,116,102,114,143,220]},"announce":[],"urlList":[]}}