{"title":"Fitted Knits: 25 Designs for the Fashionable Knitter","uid":9422497,"size":31942651,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:209fb03d2e3b084f9ef526dd96c9a0699ca5877a&amp;dn=Fitted+Knits%3A+25+Designs+for+the+Fashionable+Knitter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"KnitLady","files":-1,"time":1388614311,"description":"Customize handknits to fit and flatter your figure\nWhether you're tall or short, curvy or slender, you deserve clothes that fit you perfectly. Fitted Knits gives you patterns that create well-fitted garments designed to accentuate your positives. You simply knit to your measurements, easily adjusting the pattern so it's tailored to your unique shape. You'll be surprised at how easy it is to add shaping details that ensure a perfect fit for your figure.\n\nThere is something here to keep you knitting happily the whole year through, from lightweight summer tanks and tees to shrugs, wraps and cardigans perfect for those transitional times, and, of course, warm and cozy sweaters, vests and coats to get you through the cold months.\n\nInside Fitted Knits you'll find:\n\na How to Fit Your Knits guide that shows you exactly how to adjust the patterns in the book to get a perfect fit\n25 wearable fashion-inspired knits for all seasons\na user-friendly skill level guide so you know what to expect with each pattern\nan essential information section including a knitting abbreviations key, a knitting needle conversion chart, a helpful Reference Library and a list of great knitting websites\nNo more boxy, shapeless sweaters for you! Pick up your needles today and knit to fit.","torrent":{"xt":"urn:btih:209fb03d2e3b084f9ef526dd96c9a0699ca5877a","amp;dn":"Fitted+Knits%3A+25+Designs+for+the+Fashionable+Knitter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"209fb03d2e3b084f9ef526dd96c9a0699ca5877a","infoHashBuffer":{"type":"Buffer","data":[32,159,176,61,46,59,8,79,158,245,38,221,150,201,160,105,156,165,135,122]},"announce":[],"urlList":[]}}