{"title":"Call of Duty: Modern Warfare 2 NO INSTALL","uid":5157018,"size":11878239416,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:20aff7b9d6ea7967a942ecc12be5b3f5c2b5dda9&amp;dn=Call+of+Duty%3A+Modern+Warfare+2+NO+INSTALL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"tibrusjer","files":-1,"time":1257911802,"description":"The call of duty needs answering once again, as the blockbusting first person shooter series returns to the modern day. A direct sequel to Call of Duty 4: Modern Warfare, you now play new character Sgt Gary &quot;Roach&quot; Sanderson. Your commander is &quot;Soap&quot; from the first game as you join a multinational anti-terrorist squad out to stop Russian ultra nationalists.\n\nWatch your squad grow from inexperienced rookies to veteran warriors A snowmobile race is just one of the new vehicle sections. Modern Warfare 2 is a direct sequel to Call of Duty 4. You'll journey all around the world in the fight against terrorism\n\nMany of the details on the game are still sketchy but it promises to feature an even more varied series of locales than the ever before, including a snowbound enemy camp that starts with a daredevil mountain climb across the ice before a stealthy infiltration goes awry and you have to run for your life by commandeering a snowmobile.\n\nBut that's just the single player mode - the multiplayer is expected to be even more ground-breaking than before, with new co-op options and even more rewards and perks for competitive play. \n\nCall of Warfare: Stunning cinematic action, including new underwater missions, new gadgets such as the motion detector and new vehicles including snowmobiles and more.\nRough guide: Massive globe-spanning adventure sees you travelling to the deserts of Afghanistan, the slums of Rio de Janerio and the wilderness of Russia.\nBigger world: New larger levels allow you to tackle missions however you want: will you try a frontal assault or a more stealthy approach from another angle?\nSpecial co-op: New Special Forces mode will introduce two player co-operative play for the first time, in a series of non-story missions.\nBe the best: Competitive multiplayer is even bigger and better than before, with all-new rewards for everyone from raw recruits to the most experienced players.\n\n___________________________________________________________________________________\n\nMin System Requirements\n\nOS: Microsoft Windows XP, Windows Vista and Windows 7 (Windows 95/98/ME/2000 are unsupported)\nProcessor: Intel Pentium 4 3.2 GHz or AMD Athlon 64 3200+ processor or better supported\nMemory: 1 GB RAM\nGraphics: 256 MB NVIDIA GeForce 6600GT or better or ATI Radeon 1600XT or better\nDirectX: Microsoft DirectX(R) 9.0c\nHard Drive: 12GB of free hard drive space\nSound: 100% DirectX 9.0c compatible sound card\nInternet: Broadband connection required for Multiplayer Connectivity. Internet Connection required for activation\n\nDon't worry about the internet activation.\n\n___________________________________________________________________________________\n\n1. Download the torrent.\n2. Unrar the zip files.\n3. Play the game.\n\nEnjoy!\n\nPacked for easy storage on DVDs.\n\nCracked: Skidrow\nPacked:  TibbiT\n\nPlease support the developers by buying this game after trying.\nRemember, it's the multiplayer that made Modern Warfare a hit!","torrent":{"xt":"urn:btih:20aff7b9d6ea7967a942ecc12be5b3f5c2b5dda9","amp;dn":"Call+of+Duty%3A+Modern+Warfare+2+NO+INSTALL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20aff7b9d6ea7967a942ecc12be5b3f5c2b5dda9","infoHashBuffer":{"type":"Buffer","data":[32,175,247,185,214,234,121,103,169,66,236,193,43,229,179,245,194,181,221,169]},"announce":[],"urlList":[]}}