{"title":"The True Gold Standard - Lewis Lehrman","uid":11710023,"size":1144948,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:211e7dee80250e0c3d41af8d3f8ed9a124c4321d&amp;dn=The+True+Gold+Standard+-+Lewis+Lehrman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starxteel","files":1,"time":1424294140,"description":"\nIn the Newly Revised and Enlarged Second Edition There are a few lessons to take away. One lesson of this book is that, contrary to conventional academic opinion, the quantity of money in circulation is not the problem. The problem of monetary disorder is how money is issued.\n\nA second lesson of this book is the pernicious falsehood, spread worldwide, by the trendy quotation drawn from John Maynard Keynes: In the long run we are all dead. Such indifference or cynicism towards future generations may characterize a few self-centered individuals. But throughout the world, for parents and grandparents and most individuals, the long-run common good is an essential preoccupation of every generation sharing the human condition and its hope for the future.\n\nA third lesson of this book is that there is a time-tested way out of the present world financial crisis.\n\nThis Monetary Reform Plan proposes to establish the framework for an enduring, stable value for the United States dollar; that is, to define the dollar by statute as a certain weight unit of gold to be coined into lawful money.\n\nA dollar convertible to gold is warranted by the United States Constitution in Article I, Sections 8 and 10. A monetary standard of precious metal (gold and silver) was the monetary foundation, the gyroscope of the great Industrial Revolution of the western world, giving rise, after the Coinage Act of 1792, to a stable American currency. For two centuries, free markets, free prices, and international trade were gradually integrated worldwide by the gradual adoption among nations of the international gold standard. Major wars did interrupt. But over the long run, sound money, free prices, and economic productivity led to population expansion, unprecedented growth of international trade, and prosperity.\n\nEmployment growth, a rising standard of living, and a reasonably stable price level became the economic hallmarks of the United States from the Coinage Act of 1792 until 1971 when the last vestige of dollar linkage to gold was suspended. The rise of thirteen impoverished colonies by the sea to world leadership was associated with a stable dollar, that is, a dollar convertible to gold.\n\nAfter 1971, floating-paper currencies, mixed with pegged and manipulated exchange rates, have caused alternating episodes of inflation, deflation, and protectionism to this very day. There has, it is true, been economic growth since 1971, but the real (inflation-adjusted) American standard of living has been falling. Average, hourly, real wages have stagnated since 1971, only compensated by more family members at work. Average, real family income has fallen for more than a decade making the American paper money era, during its most recent chapter, a false inflationary prosperity except for the very rich.\n\nThroughout ancient and modern history it was the unique properties of the gold monetary standard which made it universally acceptable to trading peoples in the market. The test of what The Purpose of The True Gold Standard will endure as honest money can only be studied in the empirical laboratory of human history; mathematical abstractions, drawn from the blackboards of academic economists, will not do. Because trust and universal acceptability are the trademarks of honest money these virtues must be affirmed, in the long run, by the tests of the open market, and then reinforced by wise, limited, and prudent governments which understand and embrace the inductive, tested verdict of the market. \n\n\nAbout the author:\nLEWIS E. LEHRMAN has written widely about economic and monetary policy in publications such as Harper s, The Washington Post, The Wall Street Journal, Weekly Standard, Policy Review, NewYork Post,Greenwich Time, The American Spectator, Crisis, Washington Times, Washington Examiner, National Review and The New York Times. His writings about monetary economics earned him an appointment by President Ronald Reagan to the Presidential Gold Commission in 1981. Along with Congressman Ron Paul, Lewis Lehrman collaborated on a minority report of the commission, which was published as The Case for Gold (1982). He is also the editor of Money and the Coming World Order (2012) and author of Lincoln at Peoria: The Turning Point (2008)","torrent":{"xt":"urn:btih:211e7dee80250e0c3d41af8d3f8ed9a124c4321d","amp;dn":"The+True+Gold+Standard+-+Lewis+Lehrman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"211e7dee80250e0c3d41af8d3f8ed9a124c4321d","infoHashBuffer":{"type":"Buffer","data":[33,30,125,238,128,37,14,12,61,65,175,141,63,142,217,161,36,196,50,29]},"announce":[],"urlList":[]}}