{"title":"Super Imperialism: The Economic Strategy of American Empire","uid":4463961,"size":1603715,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:212f4c2a684ca0c5a8313328ad3856ed7f07a66d&amp;dn=Super+Imperialism%3A+The+Economic+Strategy+of+American+Empire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"arnomd","files":1,"time":1224829557,"description":"Super Imperialism: The Economic Strategy of American Empire\n\n2nd edition 2003\n\nPress release\n\nHow America will get Europe to finance its 2002-03 Oil War with Iraq \n\nMichael Hudson \n\nIn the 1991 Gulf War, America got its allies to bear most of the costs voluntarily. After all, U.S. diplomats asked, wasn&amp;#039;t the war fought to protect Kuwait and the next petro-domino, Saudi Arabia, from Iraqi attack - and in the process to protect Europe&amp;#039;s oil and gas supplies from an aggressive grabber? Wasn&amp;#039;t it therefore fair to ask the Kuwaitis and Saudis, along with the Germans, British and other countries, to bear the lion&amp;#039;s share of the cost of the oil war? \n\nEurope and the Near East agreed to pay, and their central banks turned over some of the U.S. Treasury bonds they had accumulated by running trade and payments surpluses year after year with America. But as matters stood it did not really matter whether they wanted to finance America&amp;#039;s wars or not. The international financial system gave them little choice but to do so. \n\nThe Treasury-bond standard of international finance has enabled the United States to obtain the largest free lunch in history. Whereas the world&amp;#039;s financial system formerly rested on gold, central bank reserves now are held in the form of U.S. Treasury IOUs that can be run up without limit. America has been buying up Europe, Asia and other regions with paper credit that it has informed the world it has little intention of ever paying off. That is the essence of today&amp;#039;s &quot;paper gold,&quot; and there is little Europe or Asia can do about the situation except reject the dollar and create their own alternative financial system. \n\nWhat makes today&amp;#039;s Super Imperialism different from past &quot;private enterprise&quot; imperialism \nMichael Hudson&amp;#039;s Super Imperialism: The Origins and Fundamentals of U.S. World Dominance explains how forcing the dollar off gold in 1971 obliged the world&amp;#039;s central banks to finance the U.S. balance-of-payments deficit by using their surplus dollars to buy U.S. Treasury bonds, whose volume now exceeds America&amp;#039;s ability or willingness to pay. \nThese payments finance the U.S. Government&amp;#039;s domestic budget as well. The larger America&amp;#039;s balance-of-payments deficit grows, the more dollars end up in the hands of European, Asian and Near Eastern central banks, and the more money they must recycle back to the United States by buying its Treasury bonds, whose interest rates have fallen steadily. Over the past decade American savers have been net sellers of these bonds, putting their own money into the higher yielding stock market, real estate and corporate bonds. \nPast studies of imperialism have focused on how companies invest in other countries to extract profits and interest. This phenomenon occurs largely via private investors and exporters, and any nation can play this game. But today&amp;#039;s newest form of financial imperialism occurs between the U.S. Government and the central banks of nations running balance-of-payments surpluses. The larger their surpluses grow, the more U.S. Treasury securities they are obliged to buy. The new imperialism occurs on inter-governmental account. \n\nHow the United States makes other countries pay for its wars \n\nSince Europe&amp;#039;s Middle Ages and Renaissance, going to war has left nations with heavy public debts. Two centuries ago Adam Smith gave a list of how each new war borrowing in Britain had led to a new tax being imposed to pay its interest charges. Belligerent nations became highly indebted, high-tax and high-cost economies. \n\nWhen foreign funds could not be borrowed, countries had to pay gold to defray the costs of their military spending, or go off gold to print money freely and see their currencies depreciate. After the Napoleonic Wars ended in 1815 and again after World War I, Britain and other countries imposed deflationary policies lead to trade depression until prices fell to a point where the currency achieved its prewar gold price. Such economies were sacrificed to save creditors from suffering a loss of their capital as measured in gold. \n\nAt first America&amp;#039;s war in Vietnam seemed to follow this time-honored scenario. U.S. overseas military spending ended up in the hands of foreign central banks, which cashed in their surplus dollars for gold almost on a monthly basis from the 1965 troop buildup onward. Germany did on a quiet scale what General de Gaulle did with great fanfare in cashing in the dollars sent from France&amp;#039;s former colonies in Indo-China. \n\nBy 1971 the dollar&amp;#039;s gold cover - legally 25 percent for Federal Reserve currency - was nearly depleted, forcing America to withdraw from the London Gold Pool. The dollar no longer could be redeemed for gold at $35 an ounce. It seemed that the Vietnam War had cost America its world financial position, just as World War I had stripped Britain and its Allies of their financial leadership as a result of their arms debts to the United States. \n\nIn going off gold, however, the United States inaugurated a new of system of international finance. It was a double standard, a dollar-debt standard whose consequences have drained Europe and Asia of hundreds of billions of dollars worth of output and property. \nToday the Near East and Moslem world have announced their opposition to a new U.S. oil war, and popular opinion throughout Europe also has turned against American adventurism. \nAt first glance it might appear that America will have to finance its war alone. \n\nAnd indeed it would if today&amp;#039;s global financial system were what it was before 1971. In that bygone era it seemed that no country ever again could go to war without seeing its international reserves depleted and its currency collapse, forcing its interest rates to rise and its economy to fall into depression. Yet in all the argument over the coming U.S.-Islamic war, Europeans have not seen that it is they that will have to bear the U.S. military costs, and to do so without limit. \n\nAlmost without anyone noticing, central banks have been left with only one asset to hold: U.S. Treasury bonds of dubious value. \nCentral banks do not buy stocks, real estate or other tangible assets. When Saudi Arabia and Iran proposed to use their oil dollars to buy American companies after 1972, U.S. officials let it be known that this would be viewed as an act of war. OPEC was told that it could raise oil prices all it wanted, as long as it used the proceeds to buy U.S. Government bonds or small minority positions in U.S. companies via the stock market, creating a nice boomlet for U.S. investors to ride. This enabled Americans to pay for oil in their own currency, not in gold or other &quot;money of the world.&quot; Oil exports to the United States, as well as German and Japanese autos and sales by other countries, were bought with paper dollars that could be created ad infinitim. \n\nImagine if third world countries, Europe or Asia could do this. It would mean the end of austerity and a new era of affluence. But under today&amp;#039;s international financial system this option is available only to America. \n\nAmerica&amp;#039;s free lunch as Europe&amp;#039;s and Asia&amp;#039;s expense \n\nAfter World War I and during World War II, U.S. diplomats forced Britain and other countries to pay their arms debts and other military expenditure by selling off their gold and turning over their major companies to U.S. investors. But this is not what American officials are willing to do today, now that the balance-of-payments tables have turned. The world economy now operates on a double standard that enables America to spend internationally without limit, following whatever economic and military policies it wishes to without facing any international constraint. \n\nU.S. officials claim that the world&amp;#039;s dollar glut has become the &quot;engine&quot; driving the international economy. Where would Europe and Asia be, they ask, without the U.S. import demand? Do not dollar purchases help other countries employ labor that otherwise would stand idle? \n\nThis kind of rhetorical question fails to acknowledge the degree to which America imports foreign goods, buys foreign assets and pumps dollars into the world economy without providing any quid pro quo. The important question to be asked is why European and Asian central banks don&amp;#039;t create their own domestic credit to expand their markets. Why can&amp;#039;t they increase their consumption and investment levels rather than relying on the U.S. economy to buy their consumer goods and capital goods for surplus dollars that have no better use than to accumulate in the world&amp;#039;s central banking system as excess reserves? \n\nThe answer is that Europe and Asia suffer from a set of economic blinders known as the Washington Consensus. It is a cover story to perpetuate America&amp;#039;s free ride at global expense by pretending that the Treasury bill standard is something other than an exploitative free ride. The idea is to block other countries from creating their own credit, while enabling the United States to do so at will. \n\nToward debtor countries American diplomats work through the World Bank and IMF to demand that debtors raise their interest rates and impose taxes and austerity programs to keep their wages low, sell off their public domain to pay their foreign debts, and deregulate their economy so as to enable foreign investors to privatize local electricity, telephone services and other infrastructure formerly provided at subsidized rates to help these economies grow. Toward creditor nations, however, America relates as the world&amp;#039;s most Highly Indebted Military Power by refusing to raise its own interest rates or taxes, or to permit key U.S. industries to be sold off. \n\nSuper-Imperialism explains how this double standard came about. Hudson&amp;#039;s narrative begins with World War I, showing how unforgiving America was of Europe&amp;#039;s arms debts. Its stance was in sharp contrast to France&amp;#039;s forgiveness of America&amp;#039;s own Revolutionary War debt, and also to America&amp;#039;s insistence today that Europe and Asia agree to finance present and future U.S. wars or trade deficits with unlimited lines of credit. \n\nThe United States used Britain as its Trojan Horse within Europe after World Wars I and II by getting Britain to acquiesce in relinquishing its world economic power to America instead of trying to go it alone. In both wars America and Britain than confronted the rest of Europe with a fait accompli on harsh U.S. terms. It looks as if little has changed today. \n\nProf. Hudson began writing Super Imperialism while serving as the balance-of-payments economist for the Chase Manhattan Bank and Arthur Anderson in 1964-69, and completed it in 1972 while teaching international finance at The New School in New York. (He is now Distinguished Professor of Economics at the University of Missouri at Kansas City.) His book was soon translated into Spanish, Japanese, Russian and Arabic, and a new and revised edition was republished in Japan earlier this year before being published in Britain by Pluto Press. \n\nThis book was the first to explain how America has obliged other countries to finance its payments deficit, including its foreign military spending and its corporate buyouts of European and Asian companies. The Treasury-bill standard enables America to import goods far beyond its ability to export, providing the United States with a unique form of affluence achieved by getting a free ride from Europe, Asia and other regions. When British exporters (or the owners of companies or real estate being sold for dollars) receive more dollars, for instance, the recipients turn these payments over to the Bank of England for sterling. The Bank of England in turn invests these dollars in U.S. Treasury bonds, receiving a relatively small interest rate. There is no alternative for how to spend these dollars now that the gold option has been closed. America has found a way to make the rest of the world pay for its imports, and indeed pay for its takeover of foreign companies, and most imminently to pay for its new war in the Middle East. \n\nIn effect, America has devised a new means to tax Europe and Asia via their central banks&amp;#039; willingness to accept unlimited sums of dollars. Super Imperialism reviews how the British and Germans, Japanese and Chinese, and even the central banks of France and Russia are about to finance the war in Iraq indirectly, by absorb the dollars that will be thrown off by America&amp;#039;s military adventurism. Ã‚Â The burden on Europe and Asia is not felt directly as a tax, but works indirectly through their payments surpluses with the United States.\n\n","torrent":{"xt":"urn:btih:212f4c2a684ca0c5a8313328ad3856ed7f07a66d","amp;dn":"Super+Imperialism%3A+The+Economic+Strategy+of+American+Empire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"212f4c2a684ca0c5a8313328ad3856ed7f07a66d","infoHashBuffer":{"type":"Buffer","data":[33,47,76,42,104,76,160,197,168,49,51,40,173,56,86,237,127,7,166,109]},"announce":[],"urlList":[]}}