{"title":"Mysticism Examined - Philosophical Inquiries into Mysticism","uid":8202876,"size":2390582,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:214b97cf2c90441ab5d0d3025c64158ccc4a9757&amp;dn=Mysticism+Examined+-+Philosophical+Inquiries+into+Mysticism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"imarion","files":-1,"time":1362058400,"description":"\nMysticism Examined: Philosophical Inquiries into Mysticism By Richard H. Jones\n1993 | 318 Pages | ISBN: 0791414361 , 0791414353 | PDF | 2 MB\n\n\n\nIn discussing mysticism, the first thing one must do is specify exactly what phenomenon is being talked about. The term &quot;mysticism&quot; has been used to refer to any religious experience, mythology, miracles, schizophrenia, hallucinations, trances, any altered state of consciousness, alleged psychic powers such as levitation, visions, parapsychology, and in general anything considered irrational, unintelligible, or occult. But the term &quot;mysticism&quot; for purposes of this book will refer only to two types of experiences, knowledge-claims centered upon such experiences, and ways of life in which these experiences figure centrally. Mystical experiences result from a process of turning one's attention inward and stilling all normal cognitive and emotional activities. It is a process of &quot;forgetting,&quot; to use the medieval Christian term, or &quot;fasting of the mind,'' to use a phrase from many mystical traditions. Meister Eckhart speaks of ''unknowing&quot;the withdrawal of all powers of the mind from all objects. The Yoga Sutras describe the process as the removal by concentration (samadhi) of all obscuring and distorting memory traces (samskaras) accumulated over this and previous lives until the mind is completely clear and discriminating. ","torrent":{"xt":"urn:btih:214b97cf2c90441ab5d0d3025c64158ccc4a9757","amp;dn":"Mysticism+Examined+-+Philosophical+Inquiries+into+Mysticism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"214b97cf2c90441ab5d0d3025c64158ccc4a9757","infoHashBuffer":{"type":"Buffer","data":[33,75,151,207,44,144,68,26,181,208,211,2,92,100,21,140,204,74,151,87]},"announce":[],"urlList":[]}}