{"title":"Michael B. Oren - Six Days of War. June 1967 and the Making of t","uid":10316952,"size":10068542,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:215a34933083d90efc71f7d3282b73f85867a473&amp;dn=Michael+B.+Oren+-+Six+Days+of+War.+June+1967+and+the+Making+of+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"Anette14","files":-1,"time":1402258428,"description":"Description\nProduct Details\nBook Title: Six Days of War: June 1967 and the Making of the Modern Middle East\nBook Author: Michael B. Oren (Author)\nHardcover: 480 pages\nPublisher: Oxford University Press (June 6, 2002)\nLanguage: English\nISBN-10: 0195151747\nISBN-13: 978-0195151749\n\n===================================================================================\nBook Description\nPublication Date: June 6, 2002\nIn Israel and the West it is called the Six Day War. In the Arab world, it is known as the June War, or simply as &quot;the Setback.&quot; Never has a conflict so short, unforeseen and largely unwanted by both sides so transformed the world. The Yom Kippur War, the war in Lebanon, the Camp David accords, the controversy over Jerusalem and Jewish settlements in West Bank, the intifada and the rise of Palestinian terror: all are part of the outcome of those six days of intense Arab-Israeli fighting in the summer of 1967.\nMichael B. Oren's Six Days of War is the most comprehensive history ever published of this dramatic and pivotal event, the first to explore it both as a military struggle and as a critical episode in the global Cold War. Oren spotlights all the participants--Arab, Israeli, Soviet, and American--telling the story of how the war broke out and of the shocking ways it unfolded.\nDrawing on thousands of top-secret documents, on rare papers in Russian and Arabic, and on exclusive personal interviews, Six Days of War recreates the regional and international context which, by the late 1960s, virtually assured an Arab-Israeli conflagration. Also examined are the domestic crises in each of the battling states, and the extraordinary personalities--Moshe Dayan and Gamal Abdul Nasser, Hafez al-Assad and Yitzhak Rabin, Lyndon Johnson and Alexei Kosygin--that precipitated this earthshaking clash.\n\n===================================================================================\nEditorial Reviews\nFrom Publishers Weekly\nThis is the most complete history to date of the Six Day War of 1967, in which Israel entered and began its occupation of the West Bank and Gaza Strip. While no account can be definitive until Arab archives open, Oren, a Princeton-trained senior fellow at Jerusalem's Shalem Center who has served as director of Israel's department of inter-religious affairs and as an adviser to Israel's U.N. delegation, utilizes newly available archival sources and a spectrum of interviews with participants, including many Arabs, to fill gaps and correct misconceptions. Further, Six Days of War is an attack on &quot;post-Zionism&quot;: the school of politics and history that casts Israel as the author of policies that intentionally promote the destuction of Palestine as a separate entity and of Palestinians as a people, not least through the occupation that began with the 1967 War. By contrast, Oren convincingly establishes in an often engrossing narrative the reactive, contingent nature of Israeli policy during both the crisis preceding the conflict and the war itself. As Prime Minister Levi Eshkol held the Israeli Defense Forces in check that May, Operation Dawn, an Egyptian plan for a preemptive strike against Israel, came within hours of implementation. It was canceled only because Egypt's President Gamal Abdel Nasser feared it had been compromised. Israel's decision to seek its own security in arms was finally triggered, Oren shows, by Jordan's late accession to the hostile coalition dominated by Egypt and Syria. Geographically, the West Bank, then under Jordanian rule and occupation, cut Israel nearly in half. The military risk to Israel was unacceptable, Oren makes clear, in the context of a U.S. enmeshed in Vietnam and a West unwilling to act even in support of the status quo. Far from being a product of strategic calculation, Oren further argues, occupation of the West Bank and the Gaza Strip was also contingent: the consequence of a victory so rapid and one-sided that even Israel's generals found it difficult to believe it was happening. Israel, having proved it could not be defeated militarily and now possessing something to trade, hoped for comprehensive peace negotiations in a rational-actor model. Oren notes that some initiatives for peace did in fact develop. He seems, however, trying to convince himself along with his readers. Oren puts what he sees as Israel's enduring weaknesses in relief: not arrogance, but self-doubt, self-analysis and self-criticism, all carried to near-suicidal degrees in 1967. Arab policy, by contrast, featured a confident commitment to erasing Israel from the map. The Six Day War shook that confidence, he finds, but did not alter the commitment. About the nature of Israeli policy since the war, the book says little, but finds that &quot;for all its military conquests, Israel was still incapable of imposing the peace it craved.&quot;\n\nFrom Library Journal\nIn perhaps one of the most valuable recent works on this subject, Oren, a scholar and Senior Fellow at the Shalem Center, Jerusalem, details events from the Six Day War known in the Arab world as Al-Naksah (the setback) or simply the June war. The book's value lies in its focus and extensive documentation of multilingual resources, including archives, newspapers, reports, books, interviews, and Internet sites. In addition, Oren covers the international, regional, and domestic implications of the war and uses maps to illustrate the geographical changes and military strategies. Many books, e.g., Ahron Bregman's Israel's War: 1947-1993, Tibi Bassam's Conflict and War in the Middle East, 1967-91, and Eric Hammel's Six Days in June, cover a broader period, rely heavily on analysis, or fall short of objectivity. While Oren also recounts some necessary historical context for understanding the war's catalysts and discussing its aftermath, he primarily focuses on the pivotal six days of conflict, dedicating a full chapter for each day. Predictably, the most controversial information is his new findings on an Egyptian top-secret plan that came very close to eradicating Israel's army and nuclear power plant. While this is an essential addition for academic libraries, the book's exhaustive documentary style makes it a lesser candidate for public libraries. Ethan Pullman, Univ. of Pittsburgh Lib.\n\n===================================================================================\nReviews\n&quot;An excellent new history of the 1967 war.&quot;--David Remnick, The New Yorker\n\n&quot;In Michael Oren's richly detailed and lucid account, the familiar story is thrilling once again.... What makes this book important is the breadth and depth of the research...he uses many Arab memoirs and accounts, giving the book a balanced tone and offering fascinating new details. 'Six Days of War,' coming soon after Israel--on a 30 year declassification rule--opened its archies on 1967, is a powerful rendering of what has turned out to be a world-historical event.&quot;--Gary J. Bass, The New York Times Book Review\n\n&quot;This is a masterly book.... With a remarkably assured style, Oren elucidates nearly every aspect of the conflict.... In writing his strategic chronicle, Oren has also drawn the most penetrating and subtle assessment of the Israeli mind that I've encountered.... Oren's will remain the authoritative chronicle of the war. His achievement as a writer and a historian is awesome.&quot;--Ben Schwarz, The Atlantic Monthly\n\n&quot;In addition to being a highly readable, even gripping account of the 1967 conflict, Mr. Oren's 'Six Days of War' is also a powerful illustration of the way history mixes basic forces with the accidental and the improvisational.... Provides fabulous richness of detail, including fly-on-the-wall accounts of the words and actions of many of the principal actors in places like Moscow and Washington, Damascus, Tel Aviv, and Cairo.... He has woven a seamless narrative out of a staggering variety of diplomatic and military strands.... Tragedy is character, as the Greeks understood, and Mr. Oren's masterly account shows how apt that insight is to the tragedy-afflicted Middle East, past and present.&quot;--Richard Bernstein, The New York Times\n\n&quot;A first-rate new account of the conflict.&quot;--Michael Kelly, Washington Post\n\n&quot;A magisterial work that is not only riveting reading, but also likely to become the standard work on the war that shaped the contemporary Middle East.&quot;--Jack Fischel, Philadelphia Inquirer\n\n&quot;This is not only the best book so far written on the Six Day War, it is likely to remain the best.&quot;--Geoffry Wheatcroft, Washington Post Book World\n\n&quot;The most comprehensive chronicle of this crucial turning point in contemporary Middle East history.... An elegantly detailed, often riveting account.&quot;--Suzy Hansen, Chicago Sun-Times\n\n&quot;The timing, alas, is perfect. Michael Oren's definitive history of the 1967 Arab-Israeli war and its aftermath is sure to be the must-read in the White House this month.&quot;--New York Magazine\n\n&quot;There have been many books written on the Six Day War, none breaks new ground like this magnificent book does.&quot;--Fouad Ajami, NPR\n\n===================================================================================\nFrom the Inside Flap\nThough it lasted for only six tense days in June, the 1967 Arab-Israeli war never really ended. Every crisis that has ripped through this region in the ensuing decades, from the Yom Kippur War of 1973 to the ongoing intifada, is a direct consequence of those six days of fighting. Michael B. Oren?s magnificent Six Days of War, an internationally acclaimed bestseller, is the first comprehensive account of this epoch-making event.\nWriting with a novelist?s command of narrative and a historian?s grasp of fact and motive, Oren reconstructs both the lightning-fast action on the battlefields and the political shocks that electrified the world. Extraordinary personalities?Moshe Dayan and Gamal Abdul Nasser, Lyndon Johnson and Alexei Kosygin?rose and toppled from power as a result of this war; borders were redrawn; daring strategies brilliantly succeeded or disastrously failed in a matter of hours. And the balance of power changed?in the Middle East and in the world. A towering work of history and an enthralling human narrative, Six Days of War is the most important book on the Middle East conflict to appear in a generation. --This text refers to an out of print or unavailable edition of this title.\n\n===================================================================================\nAbout the Author\nMichael B. Oren is the author of The Origins of the Second Arab-Israeli War, and has written extensively on Middle Eastern history and diplomatic affairs. He received his Ph.D. from Princeton University in Middle East studies, and has served as Director of Israel's Department of Inter-Religious Affairs in the government of the late Prime Minister Yitzhak Rabin, and as an advisor to the Israeli delegation to the United Nations. He is currently a Senior Fellow at the Shalem Center in Jerusalem.\n===================================================================================","torrent":{"xt":"urn:btih:215a34933083d90efc71f7d3282b73f85867a473","amp;dn":"Michael+B.+Oren+-+Six+Days+of+War.+June+1967+and+the+Making+of+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"215a34933083d90efc71f7d3282b73f85867a473","infoHashBuffer":{"type":"Buffer","data":[33,90,52,147,48,131,217,14,252,113,247,211,40,43,115,248,88,103,164,115]},"announce":[],"urlList":[]}}