{"title":"PBS Independent Lens - China Blue (2007 TVRip SoS)","uid":5771643,"size":522700847,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:21d34232fd79f8df8007818b4ee68c82d5c5707a&amp;dn=PBS+Independent+Lens+-+China+Blue+%282007+TVRip+SoS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Temptation","files":2,"time":1282130614,"description":"[b]PBS Independent Lens - China Blue (2007.TVRip.SoS[/b])\n\nOriginally aired: 2007.04.03\n\n&quot;They live crowded together in cement factory dormitories where water has to be carried upstairs in buckets. Their meals and rent are deducted from their wages, which amount to less than a dollar a day. Most of the jeans they make in the factory are purchased by retailers in the U.S. and other countries. CHINA BLUE takes viewers inside a blue jeans factory in southern China, where teenage workers struggle to survive harsh working conditions. Providing perspectives from both the top and bottom levels of the factory's hierarchy, the film looks at complex issues of globalization from the human level.\n\nWhile CHINA BLUE shows how the global economic system leaves the Chinese factory owner with few choices, it also explores in detail what that means for the workers. Anxious to avoid getting fined for falling asleep on the job, Jasmine and her friend Li Ping sneak out of the factory to buy energy tea, but they get caught and are fined. Other workers resort to clipping clothespins on their eyelids to keep their eyes open. When the workers' endurance reaches a breaking point, their only recourse may be a strike, which is illegal in China.\n\nCHINA BLUE, which was made without permission from the Chinese authorities, offers an alarming report on the economic pressures applied by Western companies and the resulting human consequences, as the real profits are made and kept in first-world countries. The unexpected ending makes the connection between the exploited workers and U.S. consumers even clearer.&quot;\n\nmore info:  &lt;a href=&quot;\nhttp://www.pbs.org/independentlens/chinablue/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/independentlens/chinablue/&lt;/a&gt;\n\n==\nruntime = 54mins\nxvid.640x480.1147kbps.mp3.112.vbr\nfilesize = 500MB\n\nSupport your local PBS Station by making a contribution or by purchasing their DVDs. To help speed up future releases, please try to seed this torrent as much as possible. Thanks.\n==\nSoS = http://www.sonofshun.com/forums","torrent":{"xt":"urn:btih:21d34232fd79f8df8007818b4ee68c82d5c5707a","amp;dn":"PBS+Independent+Lens+-+China+Blue+%282007+TVRip+SoS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21d34232fd79f8df8007818b4ee68c82d5c5707a","infoHashBuffer":{"type":"Buffer","data":[33,211,66,50,253,121,248,223,128,7,129,139,78,230,140,130,213,197,112,122]},"announce":[],"urlList":[]}}