{"title":"The Divan-i-Hafiz (e-book, PDF) (re-seed)","uid":6374243,"size":248672859,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2272a7e48a830190a84542c19b70d9eb279a675c&amp;dn=The+Divan-i-Hafiz+%28e-book%2C+PDF%29+%28re-seed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"inst23","files":-1,"time":1304795734,"description":"The Divan-i-Hafiz\nby Hafiz (Author), H. Wilberforce Clarke (Translator)\n\nIbex Publishers | 2007 | ISBN: 0936347805 | PDF | 1096 pages | English\n\nAmazon: http://www.amazon.com/Divan-I-Hafiz-Classics-Persian-Literature/dp/0936347805\n\n\n\nDescription:\n\nThe Divan-i-Hafiz is a complete unabridged translation of all of the Hafiz' poetry into English. It is accompanied by extensive notes, a biography, a new introduction and a concordance. As the most popular translation of Hafiz into English, it has variously been described as: accurate, erudite, accessible, faithful and the most respected translation of Hafiz into English. \n\nUnlike other translations, which are more about the translator than about Hafiz, H. Wilberforce Clarke's word-by-word translation fully conveys the Persian original. For this reason, many modern poets who did not know Persian use this work to bring Hafiz to the English reader. Among others, Elizabeth Gray, Michael Boylan and Thomas Rain Crowe and Daniel Ladinsky come to mind.\n\nThe 693 poems in this volume include every ghazal, rubai, qita , masnavi, the saqinameh, the moghaninameh, qasaid, and mokhamas. Included are a biography of the Hafiz; a description of other translations; an index of the people referred to; and an index of the figures of speech used. There are also more than 2,300 detailed notes explaining practically every line of the poems. The notes are based on Mohammad Sudi s authoritative commentary. The introduction by Professor Michael Hillmann, a scholar of Hafiz at the University of Texas, introduces the translation and the historical and literary characteristics of the Hafiz s poetry.\n\n\n\nReviews:\n\nA True Guide to the Language of Hafiz\n\nFor anyone interested in understanding the depth of the poetry of Hafiz, Clarke's translations are a must. His comprehensive knowledge of Sufism and the hidden meanings in Hafiz' poetry is superior to any renderings that have come before these translations or after. Well worth reading whether for pleasure or research.","torrent":{"xt":"urn:btih:2272a7e48a830190a84542c19b70d9eb279a675c","amp;dn":"The+Divan-i-Hafiz+%28e-book%2C+PDF%29+%28re-seed%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2272a7e48a830190a84542c19b70d9eb279a675c","infoHashBuffer":{"type":"Buffer","data":[34,114,167,228,138,131,1,144,168,69,66,193,155,112,217,235,39,154,103,92]},"announce":[],"urlList":[]}}