{"title":"Pink Narcissus (1971) - James Bidgood","uid":4982608,"size":546711552,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:22989bd08ea2b4250a29043fe9cdef425e239fe1&amp;dn=Pink+Narcissus+%281971%29+-+James+Bidgood&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"tur.chen","files":1,"time":1246415883,"description":"Pink Narcissus is a 1971 drama film by James Bidgood visualizing the erotic fantasies of a gay man.\n\nBetween visits from his keeper, or john, a handsome male prostitute (Bobby Kendall), alone in his apartment, lounges, fantasizing about worlds where he is the central character. For example, he pictures himself as a matador, a Roman slave boy and the emperor who condemns him, and the keeper of a male harem for whom another male performs a belly dance.\n\nThe movie is mostly shot on 8 mm film with bright, otherworldly lighting. Aside from its last, climactic scene, which was shot in a downtown Manhattan loft, it was produced in its entirety (including outdoor scenes) in Bidgood's small New York apartment over a seven year (from 1963 to 1970) period and ultimately released without the director's consent who therefore had himself credited as Anonymous.\n\nIt was not widely known who had created the movie, and there were rumors that Andy Warhol was behind it. In the mid-1990s, writer Bruce Benderson, who was obsessed with the film, began a search for its maker based on several leads and finally verified that it was James Bidgood, who was still living in Manhattan and was working on a film script. In 1999, a book researched and written by Benderson was published by Taschen about Bidgood's body of photographic and filmic work.\n\nBidgood's unmistakable kitschy style has later been imitated and refined by artists such as Pierre et Gilles.","torrent":{"xt":"urn:btih:22989bd08ea2b4250a29043fe9cdef425e239fe1","amp;dn":"Pink+Narcissus+%281971%29+-+James+Bidgood","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22989bd08ea2b4250a29043fe9cdef425e239fe1","infoHashBuffer":{"type":"Buffer","data":[34,152,155,208,142,162,180,37,10,41,4,63,233,205,239,66,94,35,159,225]},"announce":[],"urlList":[]}}