{"title":"American Vampire collection","uid":13998157,"size":1790812254,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:22c979a5ba45ecde4018d88f823135844950f4c8&amp;dn=American+Vampire+collection&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Reiner999","files":1,"time":1458759515,"description":"American Vampire collection\r\nCbr\r\nEnglish\r\n\r\nAmerican Vampire – Second Cycle (001-011)(2014-2015) (Digital) (Zone-Empire)\r\nAmerican Vampire (2010)\r\nLord of Nightmares\r\nSurvival of the Fittest\r\nAmerican Vampire – Anthology (One-Shot) (Oct 2013).cbr\r\nAmerican Vampire – The Long Road To Hell (One-Shot) (Aug 2013).cbr\r\n\r\nThe series imagines vampires as a population made up of many different secret species, and charts moments of vampire evolution and inter-species conflict throughout history. The focus of the series is a new American bloodline of vampires, born in the American West in the late 1800s.The first of this new species is a notorious outlaw named Skinner Sweet, who wakes from death, after being infected, to find he has become a new kind of vampire, something stronger and faster than what came before, impervious to sunlight, with a new set of strengths and weaknesses. The series goes on to track his movements through various decades of American history – along with the movements of his first and only known progeny: Pearl Jones, a young woman working as a struggling actress in the 1920s silent film industry when she is attacked by a coven of European vampires hiding in Hollywood. Sweet saves her (uncharacteristically) by giving her his blood, thereby turning her into an American vampire like him, at which point she seeks revenge on the classic vampires who attacked her in life.The complicated and charged relationship Jones has with Sweet is another focus of the series.The first five issues featured two stories — one by Snyder and the other by Stephen King, both drawn by Rafael Albuquerque. As of the sixth issue, Scott Snyder has taken over as sole writer.In its second year of publication, American Vampire spawned a spin-off mini-series titled American Vampire: Survival of the Fittest, drawn by Sean Murphy, which focuses on the case files of the V.M.S., the vampire-hunting organization of the series’ mythology.This download includes the first 30 issues of American Vampire, and the complete Survival of the Fittest mini-series. I hope you all enjoy this ongoing comic book series!","torrent":{"xt":"urn:btih:22c979a5ba45ecde4018d88f823135844950f4c8","amp;dn":"American+Vampire+collection","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22c979a5ba45ecde4018d88f823135844950f4c8","infoHashBuffer":{"type":"Buffer","data":[34,201,121,165,186,69,236,222,64,24,216,143,130,49,53,132,73,80,244,200]},"announce":[],"urlList":[]}}