{"title":"NubileFilms - Alexis Adams, Karla Kush (Memories Of A Threesome)","uid":12830880,"size":380351765,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:240c7ab849b1a5c2b81c4464257f7f549c901bbc&amp;dn=NubileFilms+-+Alexis+Adams%2C+Karla+Kush+%28Memories+Of+A+Threesome%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"EndYou","files":1,"time":1448395004,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/album/ZV\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nThe name of the actress: Alexis Adams, Karla Kush\r\nName movie: Memories Of A Threesome\r\nNPP site and the site: NubileFilms.com / NubilesNetwork.com\r\n\r\nYear: 2015\r\nGenre: All sex, Blowjob, Lesbian, Threesome, Gonzo, Hardcore\r\nDuration: 00:23:55\r\n\r\nSitting outside, Alexis Adams enjoys a private moment to read through her diary and to reflect on her threesome with Karla Kush and Bambino. The memories are so intense that Alexis just can not keep her hands off of her big boobs as she gets hot and horny just reading about her adventurous lovemaking.\r\nIn Alexis's memories, she and Karla are quick to peel off each other's bras so that they can take turns playing with each other's boobs while Bambino watches. When Alexis pulls up Karla's miniskirt, Bambino leans in to pull off her thong and then dives in with his eager mouth to enjoy a lusty pussy eating.\r\nNext the girls enjoy the show as Bambino strips for them. It is not long before he drops to his knees in front of his two women so that he can slide his tongue into Alexis's landing strip twat while tracing his finger along Karla's needy snatch. When Alexis replaces his hand on Karla's puss with hers, Bambino focuses all his attention on his pussy feast.\r\nAfter bringing Alexis to a quick climax, Bambino shifts his attention to Karla. Wanting to keep her other lover involved, Karla eagerly laps and licks at Alexis's landing strip fuck hole when it is positioned directly above her face, leaving both girls pleasurably engaged.\r\nThe oral fun is not over until Bambino gets a turn, and the girls are eager to comply. Taking turns opening their mouths wide, Alexis and Karla deliver a double deep throat blowjob that leaves their lover covered in spit and rock hard for the fuck fest he knows is coming.\r\nGetting down on her hands and knees, Karla offers up her tight snatch to be the first to be filled by Bambino. He takes her up on her offer, slamming himself balls-deep into her pussy and then going to town with strokes so hard that her whole body quivers with the force.\r\nSwitching things up, Alexis lies down on her back so that she can cradle Bambino between her thighs while also accommodating Karla when she positions her pussy right above her lover's mouth. Karla's face sitting does not last for long; soon Karla has leaned forward to take Alexis's heavy boobs in her mouth, which happens to put the blonde's tits at the perfect position for Alexis to return the favor.\r\nBambino takes the next turn lying on the bed while the girls dominate him from above. Alexis starts out by getting Karla situated in a cowgirl stiffie ride that has the blonde shaking her booty with the force of her efforts. Once Karla is firmly impaled on Bambino's fuck stick, Alexis takes her place over his mouth so that he can satisfy them both at once.\r\nWhen Karla has fucked Bambino to her satisfaction, the girls arrange themselves in a 69 with Alexis on top. That way, Alexis can play with Karla's landing strip snatch to her heart's content while Bambino can slide into Alexis's pussy from behind to deliver the hard pounding that Alexis needs to reach her pleasurable peak.\r\nAs Bambino works Alexis to her final climax of the day, he reaches the end of his own endurance. Just as he feels Alexis pulsing around him, he pulls out and urges her onto her knees so that he can unload his cum shot all over her generous breasts. There's plenty of mess, but fortunately there are two lusty girls to lick Bambino clean.\r\n\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264), 960x540, 23.976fps, 2003kbps\r\nAudio: AAC, 44100Hz, 2 channels, 110kbps","torrent":{"xt":"urn:btih:240c7ab849b1a5c2b81c4464257f7f549c901bbc","amp;dn":"NubileFilms+-+Alexis+Adams%2C+Karla+Kush+%28Memories+Of+A+Threesome%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"240c7ab849b1a5c2b81c4464257f7f549c901bbc","infoHashBuffer":{"type":"Buffer","data":[36,12,122,184,73,177,165,194,184,28,68,100,37,127,127,84,156,144,27,188]},"announce":[],"urlList":[]}}