{"title":"Tangerine Dream 24 Bit Vinyl Pack","uid":9158792,"size":11814983185,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:242cdc77021904fb2d62e21b56c29f53b465204c&amp;dn=Tangerine+Dream+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"politux","files":-1,"time":1383838646,"description":"  Tangerine Dream 24 Bit Vinyl Pack\n\n  Genres: Electronic, Avant-Garde\n  Styles: Ambient, Experimental, Kraut Rock\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 44,100 Hz\n\n  1971 Alpha Centauri\n  1975 Rubycon\n  1975 Ricochet\n  1977 Encore\n  1978 Cyclone\n  1979 Force Majeure\n  1980 Tangram \n  1982 Logos: Live at the Dominion\n  1985 Dream Sequence\n\n  Without doubt, the recordings of Tangerine Dream have made the greatest impact on the widest variety of instrumental music during the 1980s and '90s, ranging from the most atmospheric new age and space music to the harshest abrasions of electronic dance. Founded in 1967 by Edgar Froese in Berlin, the group has progressed through a full three dozen lineups (Froese being the only continuous member with staying power) and four distinct stages of development: the experimentalist minimalism of the late '60s and early '70s; stark sequencer trance during the mid- to late '70s, the group's most influential period; an organic form of instrumental music on their frequent film and studio work during the 1980s; and, finally, a more propulsive dance style, which showed Tangerine Dream with a sound quite similar to their electronic inheritors in the field of dance music.\n\n  Froese, born in Tilsit, East Prussia, in 1944, was little influenced by music while growing up. Instead, he looked to the Dadaist and Surrealist art movements for inspiration, as well as literary figures such as Gertrude Stein, Henry Miller, and Walt Whitman. He organized multimedia events at the residence of Salvador Dali in Spain during the mid-'60s and began to entertain the notion of combining his artistic and literary influences with music; Froese played in a musical combo called the Ones, which recorded just one single before dissolving in 1967. The first lineup of Tangerine Dream formed later that year, with Froese on guitar, bassist Kurt Herkenberg, drummer Lanse Hapshash, flutist Volker Hombach and vocalist Charlie Prince. The quintet aligned itself with contemporary American acid rock (the Grateful Dead, Jefferson Airplane), and played around Berlin at various student events. The lineup lasted only two years, and by 1969 Froese had recruited wind player Conrad Schnitzler and drummer Klaus Schulze. One of the trio's early rehearsals, not originally intended for release, became the first Tangerine Dream LP when Germany's Ohr Records issued Electronic Meditation in June 1970. The LP was a playground for obtuse music-making -- keyboards, several standard instruments, and a variety of household objects were recorded and filtered through several effects processors, creating a sparse, experimentalist atmosphere.\n\n  Both Schulze and Schnitzler left for solo careers later in 1970, and Froese replaced them the following year with drummer Christopher Franke and organist Steve Schroeder. When Schroeder left a year later, Tangerine Dream gained its most stable lineup core when organist Peter Baumann joined the fold. The trio of Froese, Franke, and Baumann would continue until Baumann's departure in 1977, and even then, Froese and Franke would compose the spine of the group for an additional decade.\n\n  On 1971's Alpha Centauri and the following year's Zeit, the trio's increased use of synthesizers and a growing affinity for space music resulted in albums that pushed the margin for the style. Atem, released in 1973, finally gained Tangerine Dream widespread attention outside Europe; influential British DJ John Peel named it his LP of the year, and the group signed a five-year contract with Richard Branson's Virgin Records. Though less than a year old, Virgin had already become a major player in the recording industry, thanks to the massive success of Mike Oldfield's Tubular Bells (widely known for its use in the film The Exorcist).\n\n  Tangerine Dream's first album for Virgin, Phaedra, was an milestone not only for the group, but for instrumental music. Branson had allowed the group free rein at Virgin's Manor Studios, where they used Moog synthesizers and sequencers for the first time; the result was a relentless, trance-inducing barrage of rhythm and sound, an electronic update of the late-'60s and early-'70s classical minimalism embodied by Terry Riley. Though mainstream critics were unsurprisingly hostile toward the album (it obviously made no pretense to rock &amp; roll in any form), Phaedra broke into the British Top 20 and earned Tangerine Dream a large global audience.","torrent":{"xt":"urn:btih:242cdc77021904fb2d62e21b56c29f53b465204c","amp;dn":"Tangerine+Dream+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"242cdc77021904fb2d62e21b56c29f53b465204c","infoHashBuffer":{"type":"Buffer","data":[36,44,220,119,2,25,4,251,45,98,226,27,86,194,159,83,180,101,32,76]},"announce":[],"urlList":[]}}