{"title":"Democracy 3 v2.0.0.3 (2-click run)","uid":9164610,"size":41770807,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2540ffd12de8856598ddffcd5c7cb970aa07650e&amp;dn=Democracy+3+v2.0.0.3+%282-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1383946390,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a 'Easy Run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nDESCRIPTION:\nHave you ever wanted to be president? or prime-minister? \nConvinced you could do a better job of running the country? \nLet's face it, you could hardly do a worse job than our \ncurrent political leaders. \n\n\nAn entire virtual country\n\nDemocracy 3 simulates the motivations, loyalties and desires of everyone in the country. A custom-designed neural network is used to model individual voters, each which varying memberships of voting groups, political parties and pressure groups. Each voters income is modelled, along with their levels of complacency and cynicism. This is the most sophisticated political strategy game ever created.\n\n\nUnique user interface\n\nDespite being vastly detailed under-the-hood, Democracy 3 has a unique user interface that makes visualising the connections between laws, policies, voters and situations easy. A simple iconic-based view of your countries issues allows you to 'drill-down' through all the relationships between policies and voters to quickly analyse the impacts of your decisions. Your trade policy may affect GDP, which will affect unemployment, which will effect poverty, and thus crime, leading to a change in tourism, which affects GDP...\n\n\nComplex simulated voters\n\nEach individual voter is a mixture of a subset of the 21 different voter groups represented within the game. They might be a young, wealthy, liberal socialist commuter, or a retired conservative religious capitalist, for example. Not only this, but the extent to which they identify each of those groups is both variable, and can be affected by your policies in the long term. Convert your country to religion, or atheism, to capitalism, or socialism by careful and nuanced adjustment of your policies and laws over time. A 'focus group' feature lets you look at individual voters and see exactly how they came to a decision to vote for you (or not!).\n\n\nDetailed policy model\n\nEach policy (or law) in the game has a slider which allows you to fine tune it's intensity to get the balance just right. A series of equations within the game allows the same policy to have radically different effects on each voter group at different points in the slider, so some voters may be indifferent to a policy unless it reaches extreme levels, for example. Democracy 3 also models the global economy, including credit rating agencies and debt interest levels, as well as the impact of global events on your country.\n\n\n\n\nInstallation instructions:\n1. Execute the Democracy 3 v2.0.0.3 (2-click run).exe file.\n2. Follow the instructions.\n3. Enjoy the program.","torrent":{"xt":"urn:btih:2540ffd12de8856598ddffcd5c7cb970aa07650e","amp;dn":"Democracy+3+v2.0.0.3+%282-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2540ffd12de8856598ddffcd5c7cb970aa07650e","infoHashBuffer":{"type":"Buffer","data":[37,64,255,209,45,232,133,101,152,221,255,205,92,124,185,112,170,7,101,14]},"announce":[],"urlList":[]}}