{"title":"Islamic Fascism (2016) epub","uid":13839469,"size":1571357,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2553c0c78c77e7fb9aff897c202500af6ba84a33&amp;dn=Islamic+Fascism+%282016%29+epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":1,"time":1457786075,"description":"\nThis polemic against Islamic extremism highlights the striking parallels between contemporary Islamism and the 20th-century fascism embodied by Hitler and Mussolini. Like those infamous ideologies, Islamism today touts imperialist dreams of world domination, belief in its inherent superiority, contempt for the rest of humanity, and often a murderous agenda. The author, born and raised in Egypt and now living in Germany, not only explains the historical connections between early 20th-century fascist movements in Europe and extremist factions in Islam, but he also traces the fascist tendencies in mainstream Islam that have existed throughout its history.\r\n\r\nExamining key individuals and episodes from centuries past, the book shows the influence of Islam's earliest exploits on current politics in the Islamic world. The author's incisive analysis exposes the fascist underpinnings of the Muslim Brotherhood, Hamas, Hezbollah, the Shia regime in Iran, ISIS, Salafi and Jihadist ideologies, and more. \r\n\r\nForcefully argued and well-researched, this book grew out of a lecture on Islamic fascism that the author gave in Cairo, resulting in a call for his death by three prominent Egyptian clerics","torrent":{"xt":"urn:btih:2553c0c78c77e7fb9aff897c202500af6ba84a33","amp;dn":"Islamic+Fascism+%282016%29+epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2553c0c78c77e7fb9aff897c202500af6ba84a33","infoHashBuffer":{"type":"Buffer","data":[37,83,192,199,140,119,231,251,154,255,137,124,32,37,0,175,107,168,74,51]},"announce":[],"urlList":[]}}