{"title":"PSP-PSX MORTAL KOMBAT 3 by Desesperado","uid":3765350,"size":358226719,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:261aece58a1d3cf5b05d173e1d56abee90452c5a&amp;dn=PSP-PSX+MORTAL+KOMBAT+3+by+Desesperado&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"desesperado","files":2,"time":1186484460,"description":"Shao Khan has won. The Earthrealm is no more. In order to revive his Queen Sindel, the emperor Shao Khan used the Outworld Tournament from Mortal Kombat 2 as a diversion while his Shadow Priests revive his fallen Queen on Earth. Once enacted, the dimensional bridge between the two realms connects, allowing Khan&amp;#039;s extermination squads to invade and destroy Earth, and enslave the population&amp;#039;s souls. \n\nA small team of Raiden&amp;#039;s &quot;Chosen Warriors&quot; survives the attack: Mortal Kombat champion Liu Kang and his ally Kung Lao, Special Forces agents Sonya Blade and Jax, the shaman Nightwolf, the riot cop Stryker, the nomadic Kabal, and former Lin Kuei warrior Sub-Zero, who has gone rogue from his clan. Facing the warriors are the mercenary Kano, cyber-ninjas Smoke, Sektor and Cyrax, Sheeva, a female Shokan, the sorcerer Shang Tsung, and Queen Sindel herself. \n\nMortal Kombat 3 brings new elements to the 2D fighting series: multi-level playfields, &quot;Dial-A-Combo&quot; attacks, a &quot;Run&quot; button to speed up the battles, and &quot;Vs.&quot; codes, which unlock new powers and abilities once both players enter a code sequence in pre-match-up screens. Also included are more stage fatalities and finishing moves as each warrior attempts to go one-on-one with the Centaurian enforcer Motaro, and Shao Khan himself. \n\nMortal Kombat 3 is the last traditional one-on-one fighting game game in the series to feature motion-captured digitized graphics for its kombatants, and introduces online network play to the PC version. \n\nEnjoy this great game!!","torrent":{"xt":"urn:btih:261aece58a1d3cf5b05d173e1d56abee90452c5a","amp;dn":"PSP-PSX+MORTAL+KOMBAT+3+by+Desesperado","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"261aece58a1d3cf5b05d173e1d56abee90452c5a","infoHashBuffer":{"type":"Buffer","data":[38,26,236,229,138,29,60,245,176,93,23,62,29,86,171,238,144,69,44,90]},"announce":[],"urlList":[]}}