{"title":"Mark Goldie - The Cambridge History of Eighteenth-Century Politi","uid":10001477,"size":8031126,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2628de238a36ed3495a8955b96599e36b7d81ce9&amp;dn=Mark+Goldie+-+The+Cambridge+History+of+Eighteenth-Century+Politi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Anette14","files":-1,"time":1397984607,"description":"Description\nProduct Details\nBook Title: The Cambridge History of Eighteenth-Century Political Thought (The Cambridge History of Political Thought)\t\nBook Author: Mark Goldie , Robert Wokler\nSeries: The Cambridge History of Political Thought\nHardcover: 936 pages\nPublisher: Cambridge University Press (September 11, 2006)\nLanguage: English\nISBN-10: 0521374227\nISBN-13: 978-0521374224\n--------------------------\nBook Description\nPublication Date: September 11, 2006 | ISBN-10: 0521374227 | ISBN-13: 978-0521374224\nThis major work of academic reference provides a comprehensive overview of the development of western political thought during the European enlightenment. Written by a distinguished team of international contributors, this Cambridge History is the latest in a sequence of volumes that is now firmly established as the principal reference source for the history of political thought. Every major theme in eighteenth-century political thought is covered in a series of essays at once scholarly and accessible, and the essays are complemented by extensive guides for further reading, and brief biographical notes of the major characters in the text, including Rousseau, Montesquieu and David Hume. Of interest and relevance to students and scholars of politics and history at all levels from beginning undergraduate upwards, this volume chronicles one of the most exciting and rewarding of all periods in the development of western thinking about politics, man (and increasingly woman), and society.\n--------------------------\nReview\n&quot;The European Enlightenment is often regarded as the defining moment of modernity in western society....The contributors to this volume have succeeded in providing a comprehensive exploration of this moment in history...The work is highly recommended and an essential reference guide for anyone researching this period of history of Western society.&quot; -- American Reference Books Annual\n--------------------------\nBook Description II\nThis major work of academic reference provides a comprehensive overview of the development of political thought during the European enlightenment. Written by a distinguished team of international contributors, this is the latest in a sequence of volumes now established as the principal reference source for the history of political thought.\n--------------------------\nAbout the Author\nMARK GOLDIE is a University Senior Lecturer in History and a Fellow of Churchill College, Cambridge\nROBERT WOKLER taught for many years at the University of Manchester, and currently teaches at Yale University.\n","torrent":{"xt":"urn:btih:2628de238a36ed3495a8955b96599e36b7d81ce9","amp;dn":"Mark+Goldie+-+The+Cambridge+History+of+Eighteenth-Century+Politi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2628de238a36ed3495a8955b96599e36b7d81ce9","infoHashBuffer":{"type":"Buffer","data":[38,40,222,35,138,54,237,52,149,168,149,91,150,89,158,54,183,216,28,233]},"announce":[],"urlList":[]}}