{"title":"The Seahorses - Do it yourself - 1997 - Stone Roses guitarist - ","uid":4012916,"size":65629316,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:264a18c1f2e4272302dfa8eb1229803d53f91357&amp;dn=The+Seahorses+-+Do+it+yourself+-+1997+-+Stone+Roses+guitarist+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"john111111111111111111111","files":11,"time":1202199583,"description":"Do it Yourself is the debut album by short-lived English band The Seahorses, the group formed by ex-Stone Roses guitarist John Squire.\n\nTrack listing:\n\n   1. &quot;I Want You to Know&quot; ? 4:52 (Helme/Squire)\n   2. &quot;Blinded by the Sun&quot; ? 4:39 (Helme)\n   3. &quot;Suicide Drive&quot; ? 3:31\n   4. &quot;Boy in the Picture&quot; ? 2:54\n   5. &quot;Love Is the Law&quot; ? 7:43\n   6. &quot;Happiness is Egg-Shaped&quot; ? 3:45\n   7. &quot;Love Me and Leave Me&quot; ? 3:55 (Squire/L. Gallagher)\n   8. &quot;Round the Universe&quot; ? 3:45\n   9. &quot;1999&quot; ? 3:25\n  10. &quot;Standing on Your Head&quot; ? 4:39\n  11. &quot;Hello&quot; ? 2:22 (Helme)\n\n    * Chris Helme - Vocals, acoustic guitar, backing vocals\n    * John Squire - Guitar\n    * Stuart Fletcher - Bass\n    * Andy Watts - Drums, backing vocals\n    * Lili Hayden - Violin\n    * Tony Visconti - Mellotron, tambura, theremin\n\nFormed in 1996, The Seahorses leaned more towards guitar-driven music than the dancehall rock of Stone Roses. For the band, Squire picked three unknowns. First to join was the bassist Stuart Fletcher who Squire saw standing in for a friend in a York pub band called The Blueflies, next was the lead vocalist Chris Helme (who a friend of Squire&amp;#039;s had spotted busking outside Woolworths, also in York), with drummer Andy Watts, who also provided backing vocals, being the last to join.\n\nTheir one and only album, Do it Yourself, was produced by Tony Visconti, for Geffen Records in June 1997, and received varied reviews. One of the songs on the album, &quot;Love Me and Leave Me&quot;, was co-written with Liam Gallagher of Oasis, with whom the Seahorses toured in 1997.\n\nShortly before the release of the single &quot;Love Me And Leave Me&quot;, it was announced that drummer Andy Watts was leaving the group to spend more time with his family. It was later brought to light in an online interview with Watts that he was asked to leave by the bands lawyer&amp;#039;s on behalf of the band, because they didn&amp;#039;t approve of the drummer&amp;#039;s excessive behavior on tour, and felt he didn&amp;#039;t fit in with the desired image for the band. Watts was eventually replaced by Mark Heaney and played several secret gigs showcasing new material destined for a second album. However, the group disbanded in 1999 during recording sessions. A bootleg entitled &quot;2nd Album Recordings&quot; can be found containing many new tracks and demos which were destined for the second Seahorses album which would have been titled either &quot;Minus Blue&quot; or &quot;Motorcade&quot;. It is believed Helme showed more interest in pursuing a solo career off the back of his involvement with Squire than working on the 2nd album, and John Squire walked out of the sessions.\n\nThe origin of the name The Seahorses has been the subject of various theories after a pair of NME readers spotted it was an anagram of the phrase He Hates Roses, and wrote in to the paper. Other anagrams include The Rose Ashes, and by dropping the definitive article, She&amp;#039;s A Rose. Squire has claimed in interviews that the band was named after a large fiberglass seahorse which Squire bumped his head against while leaving a pub on the very day he announced his departure from The Stone Roses.\n\nFollowing the controversy, the name was changed from The Seahorses to simply Seahorses. The name-change was short-lived, becoming the subject of a dispute when another band revealed they had already been performing as Seahorses for several years.\n\nFollowing the demise of The Seahorses John Squire released two albums as a solo artist. Stuart Fletcher and Chris Helme currently play together in semi-pro outfit The Yards who play pub gigs around their hometown of York, Fletcher also plays with former Shed Seven frontman Rick Witter in his new band Rick Witter &amp; The Dukes.\n\n\n\nBrought to you by Sumavska Records.\n\nIn honour of their gig in Prague 1997, supporting Oasis.","torrent":{"xt":"urn:btih:264a18c1f2e4272302dfa8eb1229803d53f91357","amp;dn":"The+Seahorses+-+Do+it+yourself+-+1997+-+Stone+Roses+guitarist+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"264a18c1f2e4272302dfa8eb1229803d53f91357","infoHashBuffer":{"type":"Buffer","data":[38,74,24,193,242,228,39,35,2,223,168,235,18,41,128,61,83,249,19,87]},"announce":[],"urlList":[]}}