{"title":"151 Quick Ideas to Deal With Difficult People -Mantesh","uid":6708083,"size":1764003,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:267889dc30fb41b7bf86c463092ff0a2c159580c&amp;dn=151+Quick+Ideas+to+Deal+With+Difficult+People+-Mantesh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MANTESH","files":3,"time":1317252618,"description":"\n\n &lt;a href=&quot;\nhttp://www.aedes.us/i10/3wcrj.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.aedes.us/i10/3wcrj.jpg&lt;/a&gt;\n\n\n\n\n\n151 Quick Ideas to Deal With Difficult People\n\n\nPublisher: Career Press  \nCarrie Mason-Draffen\nEnglish \nApril 30, 2007 \nISBN: 1564149382 \nPDF \n190 pages \n1.68MB\n\n\nIf you have ever wished you had the equivalent of a &quot;Nanny 911&quot; to defuse tensions in the office, your wish has come true. 151 Quick Ideas to Deal With Difficult People is the ultimate guide on how to face challenging employees and coworkers.\n\nThe extensive topics in this book deal with how to handle characters ranging from Bunglers to Backstabbers to Bullies. Few books on difficult employees, if any, offer such an extensive assortment of the characters you're likely to encounter at work and how best to deal with them.\n\nWhen faced with difficult employees, too often managers and coworkers lack the skills for handling the stressful encounters, so they throw up their hands in complete exasperation. Well, all that ends with this book. You'll learn how to:\n* Keep problem employees from setting the tone in the office.\n* Take steps to turn troublemakers into team players.\n* Keep them from demoralizing or scaring away other employees.\n* Know when to cut your losses.\n* Avoid hiring troublemakers in the first place.\n* Confront bullies, harassers, and ageists.\n* Keep a backstabber from sabotaging your career.\n* Keep an aggressive colleague from commandeering your meeting.\n* Deal with colleagues who infringe on your time.\n\nBecause the information in this book is so concise and practical, you'll refer to it again and again. Whether you are a manager or a coworker of difficult employees, the advice will give you the tools to better supervise problem workers or the confidence to stand up to them. You will no longer live in fear of an aggressive employee ruining your day.\n\n\n[/color][/quote][/b]","torrent":{"xt":"urn:btih:267889dc30fb41b7bf86c463092ff0a2c159580c","amp;dn":"151+Quick+Ideas+to+Deal+With+Difficult+People+-Mantesh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"267889dc30fb41b7bf86c463092ff0a2c159580c","infoHashBuffer":{"type":"Buffer","data":[38,120,137,220,48,251,65,183,191,134,196,99,9,47,240,162,193,89,88,12]},"announce":[],"urlList":[]}}