{"title":"Is War Necessary for Economic Growth?: Military Procurement... ","uid":12138570,"size":157111104,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:267ffdc50973f45ae5f1aa92ae27153559c4d7e4&amp;dn=Is+War+Necessary+for+Economic+Growth%3F%3A+Military+Procurement...+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"heliiaruy","files":6,"time":1437282921,"description":"Is War Necessary for Economic Growth?: Military Procurement and Technology Development         Publisher: Oxford University Press; 1 edition (January 5, 2006)\n       Print Length: 232 pages\n                                 Vernon W. Ruttan (Author)\n\nMilitary and defense-related procurement has been an important source of technology development across a broad spectrum of industries that account for an important share of United States industrial production. In this book, the author focuses on six general-purpose technologies: interchangeable parts and mass production; military and commercial aircraft; nuclear energy and electric power; computers and semiconductors; the INTERNET; and the space industries. In each of these industries, technology development would have occurred more slowly, and in some case much more slowly or not at all, in the absence of military and defense-related procurement.\n\nThe book addresses three questions that have significant implications for the future growth of the United States economy. One is whether changes in the structure of the United States economy and of the defense-industrial base preclude military and defense-related procurement from playing the role in the development of advanced technology in the future, comparable to the role it has played in the past. A second question is whether public support for commercially oriented research and development will become an important source of new general-purpose technologies. A third and more disturbing question is whether a major war, or the threat of major war, will be necessary to mobilize the scientific, technical, and financial resources necessary to induce the development of new general-purpose technologies.\n\nWhen the history of United States technology development in the next half century is written, it will focus on incremental rather than revolutionary changes in both military and commercial technology. It will also be written within the context of slower productivity growth than of the relatively high rates that prevailed in the United States in the 1950s and 1960s or during the information technology bubble that began in the early 1990s. These will impose severe constraints on the capacity of the United States to sustain a global-class military posture and a position of leadership in the global economy.\n\n---------'''''''''''' thanks cntrl+c. \n\nGreat quality for a 2006 amazon ebook. Yes, lemme explain, I included .mobi .epub .azw3 .htmlz here, as the AZW file received was converted, within Calibre, to .htmlz        \n               This seems to run counter to user_none's discussion on AZW \n               conversions, but it is what it is.  So the file didn't turn out So \n               super neat. It is highly readable, and lets be honest, if you are\n               going to be reading THIS book, you don't givashit about\n               the aesthetic of cerebration inducing material. Use the link T.oC. \n               in the front, &amp; enjoy a neat little monograph","torrent":{"xt":"urn:btih:267ffdc50973f45ae5f1aa92ae27153559c4d7e4","amp;dn":"Is+War+Necessary+for+Economic+Growth%3F%3A+Military+Procurement...+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"267ffdc50973f45ae5f1aa92ae27153559c4d7e4","infoHashBuffer":{"type":"Buffer","data":[38,127,253,197,9,115,244,90,229,241,170,146,174,39,21,53,89,196,215,228]},"announce":[],"urlList":[]}}