{"title":"What Functional Managers Need to Know About Project Management","uid":5149561,"size":3005572,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:273c5844ba7506e905af0fa0f3f88d7adaf109ad&amp;dn=What+Functional+Managers+Need+to+Know+About+Project+Management&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"VasiaZozulia","files":-1,"time":1257473752,"description":"Discover how functional managers can apply the Kerzner ApproachÃ‚Â® to project management\n\nAs a functional manager today, you need to become more involved in project management. That doesn't mean you need to become a project manager, but rather you need to know how to perform specific project-related tasks, work with project team members, understand each other's priorities and problems, and resolve issues jointly. Now here's the book that gives you everything you need to know about your role in project management clearly and succinctly.\n\nBased on principles set forth in the bestselling Project Management: A Systems Approach to Planning, Scheduling, and Controlling, Tenth Edition, this easy-to-follow guide focuses on the pivotal role you play as an executive in project management. It introduces the acclaimed Kerzner ApproachÃ‚Â®, demonstrating how it empowers functional managers with the skills needed to ensure that projects are completed successfully, on time, and on budget.\n\nThe International Institute for Learning/Wiley Series in Project Management features\n\nthe most innovative, tested-and-proven approaches to project management,\n\nall explained in clear, straightforward language. The series offers new perspectives on solving tough project management problems as well as practical tools for\n\ngetting the job done. Each book in the series is drawn from the related IIL course and is written by noted project management experts. ","torrent":{"xt":"urn:btih:273c5844ba7506e905af0fa0f3f88d7adaf109ad","amp;dn":"What+Functional+Managers+Need+to+Know+About+Project+Management","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"273c5844ba7506e905af0fa0f3f88d7adaf109ad","infoHashBuffer":{"type":"Buffer","data":[39,60,88,68,186,117,6,233,5,175,15,160,243,248,141,122,218,241,9,173]},"announce":[],"urlList":[]}}