{"title":"Outcome Assessment in Advanced Practice Nursing, 3E [StormRG]{HT","uid":11785092,"size":5942820,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2798e6e40381216247414894de64e9380bd2f866&amp;dn=Outcome+Assessment+in+Advanced+Practice+Nursing%2C+3E+%5BStormRG%5D%7BHT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"0xmovva","files":3,"time":1427724560,"description":"TITLE/EDITION Outcome Assessment in Advanced Practice Nursing: Third Edition \nBy: Ruth M. Kleinpell PhD RN-CS FAAN FAANP FCCM\nPaperback: 368 pages\nPublisher: Springer Publishing Company; 3 edition (April 22, 2013)\nLanguage: English\nISBN-10: 0826110479\nISBN-13: 978-0826110473\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\n&quot;This is an excellent and timely tool for advanced practice nurses.&quot; Score: 100, 5 stars -Doody's Medical Reviews\n\nMeasuring the results of APN care has become increasingly important as a way to demonstrate the significant impact of APN nurses on practice outcomes. The third edition of this award-winning volume has been updated to provide the most current knowledge, perspectives, and research on assessing outcomes of APN care. It addresses not only the health outcomes of APN practice but the economic impact of APN care as well.\n\nChapters discuss outcome measurement in all areas of advance practice nursing, including identifying outcomes in specialty areas and in community and ambulatory settings. The text provides detailed descriptions of how to conduct outcomes assessments, how to locate the most current instruments and measures for APN assessment, and perspectives on international initiatives in APN assessment. Examples of outcomes studies at the DNP level are culled from the most current published projects. Written by expert practitioners, educators, and researchers in APN outcomes assessment, this book will provide the essential information to help all APNs-regardless of specialty area or practice setting-to increase their skill level in designing outcomes-focused clinical research, selecting instruments, and analyzing outcomes data as critical components of their professional practice role.\n\nThe third edition is completely updated and expanded to include:\n\nA new chapter on assessing outcomes at the DNP level through data gained from the most current research\nAn expanded literature review on outcomes measurement research\nGuidelines for selecting assessment instruments\nPerspectives on an international initiative for the development of an APN research data collection toolkit\nNew chapter objectives and critical discussion questions\nUpdated web links","torrent":{"xt":"urn:btih:2798e6e40381216247414894de64e9380bd2f866","amp;dn":"Outcome+Assessment+in+Advanced+Practice+Nursing%2C+3E+%5BStormRG%5D%7BHT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2798e6e40381216247414894de64e9380bd2f866","infoHashBuffer":{"type":"Buffer","data":[39,152,230,228,3,129,33,98,71,65,72,148,222,100,233,56,11,210,248,102]},"announce":[],"urlList":[]}}