{"title":"Red Dust (1932) Clark Gable,Jean Harlow Eng","uid":6275969,"size":1499832447,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:281bff4ef33ab54cd7371c0f513ecb40d3904b5a&amp;dn=Red+Dust+%281932%29+Clark+Gable%2CJean+Harlow+Eng&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"johnefp","files":-1,"time":1301255807,"description":"Red Dust was lensed almost entirely on MGM's back lot; even so, we are utterly convinced that the film takes place in Indochina (never mind that everyone pronounces &quot;Saigon&quot; as Say-gone). Even more importantly, the audience never doubts for one moment that the relationship between &quot;hero&quot; Clark Gable and &quot;heroine&quot; Jean Harlow has gone far beyond the meaningful-glances stage. Gable plays the overseer of a rubber plantation, whiling away the hot, lonely nights with his drunken assistant Tully Marshall. Donald Crisp, another of Gable's cohorts, arrives by boat with stranded prostitute Jean Harlow in tow. Gable wants no part of Harlow at first, telling her that she's history the moment the next boat to Saigon shows up. But Gable and Harlow are, in the parlance of the time, made for each other. After the inevitable affair, Harlow leaves, just as engineer Gene Raymond shows up to participate in the construction of a bridge. Raymond has brought along his seemingly proper wife Mary Astor; it isn't long, however, before Astor is throwing herself at the not altogether unwilling Gable. Raymond is such a good egg that Gable feels ashamed of himself for enjoying Astor's favors. When Harlow returns, Gable goes back to her, which drives the already unstable Astor completely off her trolley. She shoots Gable in a fit of jealous rage. Hearing the shot, Raymond rushes in. Proving that she's &quot;aces,&quot; Harlow quickly covers up for Astor, insisting that it was she who shot Gable. None the wiser, Raymond returns to the mainland with Astor, while Gable and Harlow end up in each other's arms for keeps. Fairly &quot;hot&quot; even by pre-code standards, Red Dust has gained legendary status thanks to rumors concerning Jean Harlow's famous bathing scene in a shaved barrel; according to rumor, footage still exists of Harlow totally au naturel (some stories go as far as to claim that the overseas version of Red Dust shows Gable and Harlow &quot;doing it&quot;.) For all the sexual badinage, our favorite bit occurs when Harlow, cleaning out a parrot's cage, mutters &quot;Watcha been eatin', cement?&quot; A heavily laundered remake of Red Dust, Mogambo, appeared in 1954, again with Clark Gable in the lead, but this time with Ava Gardner and Grace Kelly in the Harlow and Astor roles, respectively. \n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0023382/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0023382/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.opensubtitles.org/en/subtitles/3924700/red-dust-pb&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.opensubtitles.org/en/subtitles/3924700/red-dust-pb&lt;/a&gt;\n\n[Movie]\nValid : Yes [AVI]\nDuration : 01:22:46\nMovie complete : Yes\n\n[Video]\nResolution : 704x528 4/3\nCodec : DivX (4 / 5 / 6)\nFPS : 23,98\nBitRate : 2288 Kbps\nQuality Factor : 0,26 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 128 Kbps\n\nPlease seed at least as much as you D/L.\n\nDon't hit and run.\n=======================================\nThanks \n\nJohn\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/johnefp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/johnefp&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:281bff4ef33ab54cd7371c0f513ecb40d3904b5a","amp;dn":"Red+Dust+%281932%29+Clark+Gable%2CJean+Harlow+Eng","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"281bff4ef33ab54cd7371c0f513ecb40d3904b5a","infoHashBuffer":{"type":"Buffer","data":[40,27,255,78,243,58,181,76,215,55,28,15,81,62,203,64,211,144,75,90]},"announce":[],"urlList":[]}}