{"title":"Victory at Sea  (WWII Documentary Series - Complete)","uid":5024900,"size":7417773151,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:28e5dec43eff13af4acb599deffcf261c3112231&amp;dn=Victory+at+Sea++%28WWII+Documentary+Series+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":4,"uploader":"sheila6","files":28,"time":1248643305,"description":"The 26-episode World War II documentary, Victory at Sea is one of the most important series in the history of television. Made in 1952, the show was a huge success, winning many major awards and even spawning albums featuring the orchestral score by Richard Rodgers, best known for his musicals with Lorenz Hart and Oscar Hammerstein II. \n\nProduced with the full cooperation of the U.S. Navy, each 26-minute program consists of black-and-white wartime film set to a narration by Leonard Graves. The two years leading up to America's entry into the war are dismissed in episode one, while the Japanese attack on Pearl Harbor gets a show of its own, the raid depicted in a brilliantly edited montage that almost certainly contains &quot;docu-drama&quot; footage. \n\nEach episode contains at least one powerful stand-alone sequence in the tradition of Serge Eisenstein (Battleship Potemkin), these action-suspense set-pieces giving the programs an urgent, surprisingly modern feel. Indeed, the emphasis is at least as much on entertainment as information, the factual content delivered in poetic narration, the score transforming the war into a more than usually serious Hollywood adventure. \n\nThe documentaries are nothing if not wide-ranging, covering parts of the land war despite the title, and including everything from the Atlantic convoys and U-boat &quot;Wolfpacks&quot; to war in Alaska, the South Atlantic, and the Far East, the Pacific War, and the Fall of Japan. There is an attempt to include other nations - certainly the D-Day episode acknowledges the British far more than Saving Private Ryan - but inevitably the focus is on America's war. \n\nThe very dated narration gives a fascinating insight into how America saw WWII in the early 1950s, while the dynamic cutting and often genuinely remarkable wartime footage make Victory at Sea still gripping today. Twenty years later, Granada's The World at War would become the definitive television WWII history, but this release offers a unique opportunity to see a series of great importance from the very early days of television.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:28e5dec43eff13af4acb599deffcf261c3112231","amp;dn":"Victory+at+Sea++%28WWII+Documentary+Series+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28e5dec43eff13af4acb599deffcf261c3112231","infoHashBuffer":{"type":"Buffer","data":[40,229,222,196,62,255,19,175,74,203,89,157,239,252,242,97,195,17,34,49]},"announce":[],"urlList":[]}}