{"title":"The Intolerance of Tolerance - D.A. Carson","uid":11773353,"size":3743476,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29335f1a2a0771039ff424e68af0ea4d070c7017&amp;dn=The+Intolerance+of+Tolerance+-+D.A.+Carson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starxteel","files":2,"time":1427165628,"description":"\nTolerance currently occupies a very high place in Western societies: it is considered gauche, even boorish, to question it. In The Intolerance of Tolerance, however, questioning tolerance -- or, at least, contemporary understandings of tolerance -- is exactly what D. A . Carson does.\n\nCarson traces the subtle but enormous shift in the way we have come to understand tolerance over recent years -- from defending the rights of those who hold different beliefs to affirming all beliefs as equally valid and correct. He looks back at the history of this shift and discusses its implications for culture today, especially its bearing on democracy, discussions about good and evil, and Christian truth claims.\n\nUsing real-life examples that will sometimes arouse laughter and sometimes make the blood boil, Carson argues not only that the &quot;new tolerance&quot; is socially dangerous and intellectually debilitating but also that it actually leads to genuine intolerance of all who struggle to hold fast to their beliefs.\n\n\nAbout the author:\nD. A. Carson is research professor of New Testament at Trinity Evangelical Divinity School, Deerfield, Illinois. He has written or edited more than fifty other books, including The Gagging of God: Christianity Confronts Pluralism, Becoming Conversant with the Emerging Church, and Christ and Culture Revisited","torrent":{"xt":"urn:btih:29335f1a2a0771039ff424e68af0ea4d070c7017","amp;dn":"The+Intolerance+of+Tolerance+-+D.A.+Carson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29335f1a2a0771039ff424e68af0ea4d070c7017","infoHashBuffer":{"type":"Buffer","data":[41,51,95,26,42,7,113,3,159,244,36,230,138,240,234,77,7,12,112,23]},"announce":[],"urlList":[]}}