{"title":"Science Fact and Science Fiction - An Encyclopedia (Malestrom)","uid":4790904,"size":4579503,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29a9e901bcb20dcf530f2c90d8c3c98e8da56ab3&amp;dn=Science+Fact+and+Science+Fiction+-+An+Encyclopedia+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1237717315,"description":" &lt;a href=&quot;http://www.image-upload.net/images/v02020g5gczynns8eoi.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/v02020g5gczynns8eoi.jpg&lt;/a&gt;\n\nHardcover: 760 pages\nPublisher: Routledge; 1 edition (September 6, 2006)\nLanguage: English\nISBN-10: 0415974607\nISBN-13: 978-0415974608\n\nFrom Booklist\nThis is not an encyclopedia of science fiction, and it's not an encyclopedia of science, either. Instead, it discusses the impact of fantastic literature on science and vice versa. Author Stableford is a science-fiction writer as well as a frequent contributor to works about the genre. In an introduction, he describes the encyclopedia as a way &quot;to construct and maintain bridges between the cultures of science and fiction.&quot;\n\nThe approximately 300 entries are academic in tone and cover topics such Botany, Postmodernism, andTime travel.Writers, like Ursula K. Le Guin, are included on the basis &quot;of the relevance of their works to issues in science, rather than their importance within the history of genre science fiction.&quot; Also profiled are leading theorists such as Johannes Kepler and Karl Marx. Entries make frequent reference to fictional and scientific titles, but no bibliographies for further readings are included. A &quot;Thematic List of Entries&quot; groups entries by broad topics such as &quot;Concepts,&quot; &quot;Leading Figures: Scientists,&quot; and &quot;Technology.&quot; The index includes titles mentioned in the text, which enhances the volume's usefulness.\n\nThe Greenwood Encyclopedia of Science Fiction and Fantasy: Themes, Works, and Wonders (2005) also has thematic essays, but it focuses more on the science-fiction aspect of the concepts being described. Encyclopedia of Science Fiction (Facts On File, 2005) has a more literary focus. Science Fact and Science Fiction fulfills a different purpose than either of these works and will be a useful addition to reference collections in large public and academic libraries. Jack O'Gorman\nCopyright Ã‚Â© American Library Association. All rights reserved\n\nProduct Description\nScience fiction is a literary genre based on scientific speculation. Works of science fiction use the ideas and the vocabulary of all sciences to create valid narratives that explore the future effects of science on events and human beings. Science Fact and Science Fiction examines in one volume how science has propelled science-fiction and, to a lesser extent, how science fiction has influenced the sciences. Although coverage will discuss the science behind the fiction from the Classical Age to the present, focus is naturally on the 19th century to the present, when the Industrial Revolution and spectacular progress in science and technology triggered an influx of science-fiction works speculating on the future. As scientific developments alter expectations for the future, the literature absorbs, uses, and adapts such contextual visions. The goal of the Encyclopedia is not to present a catalog of sciences and their application in literary fiction, but rather to study the ongoing flow andcounterflow of influences, including how fictional representations of science affect how we view its practice and disciplines. Although the main focus is on literature, other forms of science fiction, including film and video games, are explored and, because science is an international matter, works from non-English speaking countries are discussed as needed.","torrent":{"xt":"urn:btih:29a9e901bcb20dcf530f2c90d8c3c98e8da56ab3","amp;dn":"Science+Fact+and+Science+Fiction+-+An+Encyclopedia+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29a9e901bcb20dcf530f2c90d8c3c98e8da56ab3","infoHashBuffer":{"type":"Buffer","data":[41,169,233,1,188,178,13,207,83,15,44,144,216,195,201,142,141,165,106,179]},"announce":[],"urlList":[]}}