{"title":"The Wood Brothers - The Muse [2013]EAC,log,cue.FLAC]","uid":9116517,"size":270754010,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2a10cf8235bf665ea25fd66fa2094058905112da&amp;dn=The+Wood+Brothers+-+The+Muse+%5B2013%5DEAC%2Clog%2Ccue.FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":15,"time":1383023682,"description":"Artist: The Wood Brothers\nRelease: The Muse\nReleased: 2013\nLabel: Southern Ground\nCatalog#: 001\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: Americana\n\nimage\n\n\n1. Wastin' My Mind 2:59\n2. Neon Tombstone 4:55\n3. Sing About It 3:41\n4. Honey Jar 3:59\n5. The Muse 3:21\n6. Keep Me Around 3:39\n7. Sweet Maria 4:19\n8. I Got Loaded 4:04\n9. Who The Devil 4:09\n10. Losin' Streak 4:13\n11. Firewater 4:03\n\n\n\nThe Wood Brothers are hard to pin down -- they play a sort of Americana version of jazz, or country with an edge, or folk with some rhythmic bite, or maybe secular gospel with a touch of swing. At their best, they create the best blend of vernacular American roots music since the Band folded, and while there are a lot of neo-Americana bands out there who critics keep claiming sound like the Band, well, these guys actually do. The Buddy Miller-produced The Muse is their fourth album, and while the previous three releases were pretty darn great, this one is arguably even better, a step forward into a fuller, rounder, and more complete sound, anchored, as always, by Chris Wood's wonderful acoustic basslines (his day job is playing bass for Medeski, Martin &amp; Wood) and Oliver Wood's backwoods vocal style and sharp, literate songwriting skills. This album is a gem, opening with the best song yet by the Band that wasn't written or recorded by the Band, &quot;Wastin' My Mind,&quot; and continuing the feel with &quot;Neon Tombstone,&quot; &quot;Honey Jar,&quot; &quot;Sweet Maria&quot; (a bit of folk cabaret, really), the barroom ballad shuffle &quot;I Got Loaded,&quot; and the set closer, &quot;Firewater,&quot; which comes complete with a boozy horn section that makes it sound like an outtake from the Band's Rock of Ages. The Wood Brothers aren't the second coming of the Band, of course (such a thing will most likely never happen), but they draw on the same wellspring of blues, gospel, folk, country, and R&amp;B to arrive in a similar place, suggesting a rural America where myths are born and made real with music, a place where current fashion is useless, a place where a trip to the local juke for some backwoods jazzy honky tonk gospel blues is nigh near a trip to Heaven.","torrent":{"xt":"urn:btih:2a10cf8235bf665ea25fd66fa2094058905112da","amp;dn":"The+Wood+Brothers+-+The+Muse+%5B2013%5DEAC%2Clog%2Ccue.FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a10cf8235bf665ea25fd66fa2094058905112da","infoHashBuffer":{"type":"Buffer","data":[42,16,207,130,53,191,102,94,162,95,214,111,162,9,64,88,144,81,18,218]},"announce":[],"urlList":[]}}