{"title":"Cricket as I See It - Allan Border","uid":11731370,"size":4476232,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a113204898661f0275e67fe196785dd01c24eb8&amp;dn=Cricket+as+I+See+It+-+Allan+Border&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1425405953,"description":"In the twenty years since Allan Border retired as Australian cricket captain he's been one of the game's closest and most astute observers. His views on cricket - based on his experiences as a player, a captain, a selector and a commentator - are fascinating, forthright and informed by more than three decades of involvement at the game's highest level.\n\nIn Cricket as I See It he gives us his wisdom and opinions on the game he loves - from epic Tests, the rising power of India, and the Twenty20 revolution, through to his thoughts on captaincy, and the essential arts of batting, bowling and sledging. He reflects on the great players and contests of his generation, as well as controversies such as the underarm bowling affair, the turbulent events that led to him shouldering the captaincy, the rebel tour of South Africa, Steve Waugh's dropping as one-day captain, and the divisive 'Monkeygate' scandal. With cricket, Allan calls it as he sees it, and the result is a book to be savoured and enjoyed by cricket lovers everywhere","torrent":{"xt":"urn:btih:2a113204898661f0275e67fe196785dd01c24eb8","amp;dn":"Cricket+as+I+See+It+-+Allan+Border","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a113204898661f0275e67fe196785dd01c24eb8","infoHashBuffer":{"type":"Buffer","data":[42,17,50,4,137,134,97,240,39,94,103,254,25,103,133,221,1,194,78,184]},"announce":[],"urlList":[]}}