{"title":"Have You Seen This Porn? (2013) {documentary video}","uid":8223314,"size":1160225594,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2ac07325d628d36762ed1c95da345912e0882d83&amp;dn=Have+You+Seen+This+Porn%3F+%282013%29+%7Bdocumentary+video%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"one_last_round","files":1,"time":1362526441,"description":"Have You seen This Porn (03.03.13) 640X352\n\nI made this video myself.  The subject covered is porn.  There is some nudity, sexual content, suggestive scenes, possible strong language.  \n\nLength: 1:50:16\nData Rate: 1260 kbps\n\ncheck out my youtube Channel.  My name is lastcallforfreedom1\n\nHere's a list of videos used for this project.\n\nBBC Hardcore Profit (2009)\nTwo-part documentary. Tim Samuels explores the rising pervasiveness of pornography, discovers how new technology is changing porn, and questions porn films' reluctance to portray safe sex on screen.\n\nChannel 4 - The Dark Side of Porn - Diary of a Porn Virgin (2005)\nThis episode gives an insight in the lives of newcomers to the adult entertainment. From the initial approach to a glamour agency and the first sexy photo-shoot to the HIV test, the audition and the first hardcore shoot, it shows the gritty reality of what working in the porn industry means in Britain today.\n\nChannel 4 -The Dark Side of Porn - Amateur Porn (2006)\nThis episode examines what is going on in the British sex industry, where new male actors are lining up to do a job without getting paid. \n\nPBS Frontline - American Porn (2002)\nSince the spring of 2002, the U.S. Supreme Court has decided several cases involving\npornography. \n\nChannel 4 - Addicted to Porn (2007)\nPornography is now more easily accessible than ever before - it's a click away on the internet. \n\nCBC - Porndemic: Sex in the Digital (2009)\nPorndemic: Sex in the Digital Age investigates the world of Internet pornography, a multi-billion dollar industry whose explosive growth knows no bounds. A\n\nBBC 3 - Websex: What's the Harm? (2012)\nNathalie Emmanuel investigates how the internet is changing the sex lives of 16-24 year-olds across Britain. Nathalie meets young people who rely on social networking sites, the latest mobile technology and webcams. For the first time she reveals figures from an academic study which shows how many people have taken their sex lives online, and exactly what they are doing.\n\n","torrent":{"xt":"urn:btih:2ac07325d628d36762ed1c95da345912e0882d83","amp;dn":"Have+You+Seen+This+Porn%3F+%282013%29+%7Bdocumentary+video%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ac07325d628d36762ed1c95da345912e0882d83","infoHashBuffer":{"type":"Buffer","data":[42,192,115,37,214,40,211,103,98,237,28,149,218,52,89,18,224,136,45,131]},"announce":[],"urlList":[]}}