{"title":"The Companion to Development Studies, 3E [Epub &amp; PDF] [Storm","uid":10204517,"size":11540598,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ac28e05094c69b9fb798bca6e33f8b83dc5c2e6&amp;dn=The+Companion+to+Development+Studies%2C+3E+%5BEpub+%26amp%3B+PDF%5D+%5BStorm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"0xmovva","files":-1,"time":1400825870,"description":"Author: Vandana Desai, Rob Potter\nPaperback: 626 pages\nPublisher: Routledge; 3 edition (May 2, 2014)\nLanguage: English\nISBN-10: 1444167243\nISBN-13: 978-1444167245\nFormat: Retail Epub, Retail PDF\nReader Required: \nPDF- Adobe Reader, Adobe Digital Editions\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nFormat conversion: convert epub to mobi (Kindle) with Calibre or online &lt;a href=&quot;\nhttp://ebook.online-convert.com/convert-to-mobi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ebook.online-convert.com/convert-to-mobi&lt;/a&gt;\n\nNOTE: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple \nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nThe Companion to Development Studies contains over a hundred chapters written by leading international experts within the field to provide a concise and authoritative overview of the key theoretical and practical issues dominating contemporary development studies. Covering a wide range of disciplines the book is divided into ten sections, each prefaced by a section introduction written by the editors. The sections cover: the nature of development, theories and strategies of development, globalization and development, rural development, urbanization and development, environment and development, gender, health and education, the political economy of violence and insecurity, and governance and development.\n\nThis third edition has been extensively updated and contains 45 new contributions from leading authorities, dealing with pressing contemporary issues such as race and development, ethics and development, BRICs and development, global financial crisis, the knowledge based economy and digital divide, food security, GM crops, comparative urbanism, cities and crime, energy, water hydropolitics, climate change, disability, fragile states, global war on terror, ethnic conflict, legal rights to development, ecosystems services for development, just to name a few. Existing chapters have been thoroughly revised to include cutting-edge developments, and to present updated further reading and websites.\n\nThe Companion to Development Studies presents concise overviews providing a gateway to further reading and a flexible resource for teaching and learning. It has established a role as essential reading for all students of development studies, as well as those in cognate areas of geography, international relations, politics, sociology, anthropology and economics.","torrent":{"xt":"urn:btih:2ac28e05094c69b9fb798bca6e33f8b83dc5c2e6","amp;dn":"The+Companion+to+Development+Studies%2C+3E+%5BEpub+%26amp%3B+PDF%5D+%5BStorm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ac28e05094c69b9fb798bca6e33f8b83dc5c2e6","infoHashBuffer":{"type":"Buffer","data":[42,194,142,5,9,76,105,185,251,121,139,202,110,51,248,184,61,197,194,230]},"announce":[],"urlList":[]}}