{"title":"Harun Farocki - Wie man sieht aka As you see (1986)","uid":4583574,"size":837555200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2b903b8688e807c4065d9a61668bb423b9fe20e0&amp;dn=Harun+Farocki+-+Wie+man+sieht+aka+As+you+see+%281986%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"44lost","files":3,"time":1229529488,"description":"Wie man sieht aka As you see (1986)\n\nGoethe Institut DVDrip! German audio; Spanish, French, Russian, English, Japanese, Portuguese, Deutsch, Zulu subtitles.\n\nIn As You See, Farocki searches for those instances and facts in the history of technology that have been overlooked or ignored, also exploring the ambivalent relationship between technologies developed for civil use and those designed for military purposes.\n\nThus the film for instance describes how in the 1970's workers at the British arms factory Lucas Aerospace attempted to develop socially useful products to replace the company's military output.\n\nRather than following a linear argument, this essay-film juxtaposes disparate images and weaves them into a mosaic-like structure which makes it possible for the viewers to make their own connections between the different images as well as between the images and the commentary.\n\n&quot;My film As You See is an action-filled feature film. It reflects upon girls in porn magazines to whom names are ascribed and about the nameless dead in mass graves, upon machines that are so ugly that coverings have to be used to protect the workers' eyes, upon engines that are too beautiful to be hidden under the hoods of cars, upon labor techniques that either cling to the notion of the hand and the brain working together or want to do away with it.&quot;\nHarun Farocki\n","torrent":{"xt":"urn:btih:2b903b8688e807c4065d9a61668bb423b9fe20e0","amp;dn":"Harun+Farocki+-+Wie+man+sieht+aka+As+you+see+%281986%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b903b8688e807c4065d9a61668bb423b9fe20e0","infoHashBuffer":{"type":"Buffer","data":[43,144,59,134,136,232,7,196,6,93,154,97,102,139,180,35,185,254,32,224]},"announce":[],"urlList":[]}}