{"title":"Far Cry 4","uid":11925601,"size":8738846720,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:2bb132b67a5095cfe33ef3f86da4510938eb2366&amp;dn=Far+Cry+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"Endryo","files":1,"time":1431700864,"description":"Far Cry 4 is an open world action-adventure first-person shooter video game developed by Ubisoft Montreal and published by Ubisoft for the PlayStation 3, PlayStation 4, Xbox 360, Xbox One, and Microsoft Windows.[11] The sequel to the 2012 video game Far Cry 3, it is the fourth installment in the Far Cry series. The game was released in North America, Australia, and Europe on November 18, 2014. It was also released on January 22, 2015 in Japan.[12]\n\nFar Cry 4 is a first-person shooter video game set in an open world. The game features role-playing game elements, with the player awarded with experience points for completing missions and performing various tasks. These can then be spent on skills which offer performance boosts such as additional health bars, new abilities such as taking down enemies from behind cover, or perks such as discounts at stores. The player is free to choose which of the available skills to unlock next provided that they have enough skill points and story conditions have been met.\n\nFar Cry 4 also offers a variety of weapons, including sidearms, shot guns, assault and sniper rifles, and heavy weapons such as machine guns and rocket launchers. These can be purchased at stores throughout the game world, or taken from fallen enemies. Weapons can be customised and upgraded to improve performance, and the completion of side-quests will unlock &quot;signature&quot; weapons, one-of-a-kind high-performance variations of stock models. The player is initially limited in the number of weapons that they can carry and the amount of ammunition that they can hold, but can craft additional holsters and ammunition pouches by hunting animals.\n\nThe game world is divided into two halves, North and South Kyrat. The player starts in South Kyrat, and is free to explore almost immediately, but can only unlock North Kyrat over the course of the story. The map is progressively opened up by liberating bell towers, freeing them from Pagan Min's influence and allowing the Golden Path to expand. The player will also encounter outposts, or enemy checkpoints that need to be captured by eliminating all soldiers. Four larger outposts, or fortresses, can also be found, featuring stronger defences and more difficult combinations of enemies. Liberating bell towers and clearing outposts will unlock further side-quests including escort missions, hostage rescues, bomb disposal quests, and hunting missions.\n\nThe game offers a co-operative mode in which a player joins another to assist in various missions.\n\nThe story was inspired by the ten-year-long Maoist insurgency in Nepal. The game follows Ajay Ghale, a young Kyrati-American of Nepali origin who returns to his native country of Kyrat (a fictional Himalayan country derived from Kirati, a collection of Himalayan people originating from Tibet) to spread his deceased mother's ashes. Kyrat was once an autonomous state in the Himalayas ruled by a royal family before a series of perpetual civil wars. Ajay finds the country in a state of conflict between Kyrat's Royal Army led by the country's eccentric and tyrannical king Pagan Min and the Golden Path, a rebel movement fighting to free Kyrat from Min's oppressive rule. The choices Ajay makes will determine the fate of Kyrat","torrent":{"xt":"urn:btih:2bb132b67a5095cfe33ef3f86da4510938eb2366","amp;dn":"Far+Cry+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bb132b67a5095cfe33ef3f86da4510938eb2366","infoHashBuffer":{"type":"Buffer","data":[43,177,50,182,122,80,149,207,227,62,243,248,109,164,81,9,56,235,35,102]},"announce":[],"urlList":[]}}