{"title":"Triptykon - Shatter (EP) mp3  2010 ","uid":11543693,"size":66627882,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2c6ec876936d38964c8bd940e9b1817ab3ddac3d&amp;dn=+Triptykon+-+Shatter+%28EP%29+mp3++2010+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"analogkid6103","files":6,"time":1416698340,"description":"1. Shatter\n2. I Am the Twilight\n3. Crucifixus\n4. Circle of the Tyrants (Live)\n5. Dethroned Emperor (Live)\n\n\n\nMyspace Page Official Site\n\n\n\nCreated to further develop the darkness invoked by its immediate precursors, seminal black/extreme metal pioneers Hellhammer and Celtic Frost, Triptykon evolved from a Celtic Frost side project initiated by Tom Gabriel Fischer (a.k.a. Tom Gabriel Warrior), the group's singer, guitarist, and main songwriter.\n\nFollowing five years of songwriting and recording sessions, the subsequent release of their acclaimed Monotheist album, and a 125-date world tour, mounting tensions began to cripple the resplendently disinterred Celtic Frost by late 2007. The situation eventually rendered it virtually impossible for Fischer to succeed in convening Celtic Frost for songwriting and rehearsal sessions for the intended follow-up to Monotheist. Vastly disenchanted and loath to resign to inactivity, Fischer resolved to establish what was to be a temporary substitute project designed to develop, record, and perform the music and lyrics he envisioned for the projected album. The core of the initially unnamed group was completed by Swiss underground bassist Vanja Slajh, a close friend from a past production project.\n\nTalks with a variety of death/doom/black metal guitarists and drummers followed in early 2008. Among the musicians Fischer intended to approach to complete the new band was - rather unexpectedly, given the severity of their disagreements - Celtic Frost drummer Franco Sesa. Alas, it was not to be. The dissension within Celtic Frost ultimately proved insurmountable, and Fischer left the group on April 2, 2008, due to what his subsequent official statement described as an &quot;irresolvable, severe erosion of the personal basis so urgently required to collaborate within a band so unique, volatile, and ambitious&quot;. Fischer later wrote in his blog: &quot;It was not my departure from Celtic Frost which caused the group's inexorable demise. It was the group's inexorable demise which caused my departure.&quot;\n\n\n\n\n\nThe side project was now no longer a mere transient substitute to Celtic Frost but rather the descendant. Fischer named it Triptykon, an homage of sorts to the religiously-themed triptych paintings of the dark ages, such as Hieronymus Bosch's Garden Of Earthly Delights (the right panel of which had been used as cover art for Celtic Frost's Into The Pandemonium album in 1987) or Hans Memling's The Last Judgment. As Fischer has frequently conceded over the years, these paintings have exerted a distinctive influence on his personal creative universe. Moreover, the name &quot;Triptykon&quot; signifies the third and final occult extreme metal group formed by Fischer after Hellhammer and Celtic Frost; i.e., the completion of his very own triptych.\n\nIn late spring of 2008, Celtic Frost's live guitarist, V. Santura of German black metal group Dark Fortress and progressive metal project Noneuclid, joined Triptykon as a full member. Triptykon's initial rehearsal sessions, in late 2008, briefly saw Fischer's long-time friend and former Celtic Frost drummer Reed St. Mark complete the line-up. This configuration proved unsatisfactory, however, and the group subsequently enlisted renowned German drummer Norman Lonhard (formerly of Fear My Thoughts).\n\nThe recording sessions for Triptykon's first album, Eparistera Daimones (&quot;to my left, the demons&quot;, began in August 2009, at Santura's own Woodshed Studio near Landshut, Germany. The album was produced and mixed by Fischer and Santura; it is a persistent development of the virulent and towering musical darkness perpetuated not only by Fischer's early work but also within his extensive contributions to Monotheist. As was to be expected, a significant part of the music and lyrics on the album consists of material written during the past few years and originally intended for Monotheist's successor. This is balanced by much new, original music written by Fischer and Santura since Triptykon's inception.\n\nBoth music and lyrics so far disclosed by Triptykon reveal a group immersed in themes such as history, occultism, human disintegration, religious fanaticism, and nihilism. Songs such as &quot;Abyss Within My Soul&quot;, &quot;A Thousand Lies&quot;, and, particularly, &quot;The Prolonging&quot; bear witness to wastelands of eternal night. The transcending and mergence of seemingly distinct forms of imagination, a hallmark long prominent in Celtic Frost's efforts, is naturally also abundant within Triptykon's sphere of inspiration, which ranges across the works of, e.g., Pieter Bruegel, Roland Villeneuve, HR Giger, HP Lovecraft, Hieronymus Bosch, John Martin, and far beyond.\n\nOnly Death Is Real, Fischer's book detailing Hellhammer's existence and the inception of Celtic Frost, was published by New York-based publishing house Bazillion Points, in March 2010.\n\nEparistera Daimones, Triptykon's debut album, was released to stunning reviews worldwide through Century Media Records in March 2010, under license by Prowling Death Records Ltd.\n\nShatter, Triptykon's follow-up EP,saw the light of the day in fall 2010.\n\nAt the same time, Triptykon commenced playing live concerts as headliners of the renown Roadburn Festival (where Fischer was invited to act as the curator of the festival's second day). The group's live repertoire is evenly divided between Triptykon's own music and classic Celtic Frost material.\n\n\n\nLine Up:\n\nThomas Gabriel Fischer - Vocals, Guitars, Programming\nV. Santura - Guitars, Vocals\nVanja Slajh - Bass\nNorman Lonhard - Drums, Percussion\n\n\nGenre:\tDoom\nSubgenre:\tDoom / Death / Black Metal\nBitrate:\t320 k\nSize:\t63.54 MB\nShow/Hide Files: \t\n6 files","torrent":{"xt":"urn:btih:2c6ec876936d38964c8bd940e9b1817ab3ddac3d","amp;dn":"+Triptykon+-+Shatter+%28EP%29+mp3++2010+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c6ec876936d38964c8bd940e9b1817ab3ddac3d","infoHashBuffer":{"type":"Buffer","data":[44,110,200,118,147,109,56,150,76,139,217,64,233,177,129,122,179,221,172,61]},"announce":[],"urlList":[]}}