{"title":"Gabriella Cilmi - Lessons to be Learned (2008)","uid":4364873,"size":45178806,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2cc874c6e4e770d6dd964e819330b2095d49911e&amp;dn=Gabriella+Cilmi+-+Lessons+to+be+Learned+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"cH3tHAja","files":14,"time":1219850968,"description":"GABRIELLA CILMI - LESSONS TO BE LEARNED, album released UK March 31st and Australia May 10th 2008.\nEncoded 160Kbps [Lame] mp3. Covers included.\n\nGabriella Lucia Cilmi [pronounced Chill-me] is an Australian singer and songwriter [born October 10th 1991 in the Melbourne suburb of Dandenong] who is now based in London. She has drawn comparisons with everyone from Duffy to Amy Winehouse and Macy Gray. She attended Sacred Heart Girls College located in the suburb of Oakleigh, but now continues her education via correspondence. At a young age she acquired an interest in a wide range of musical styles ranging from Nina Simone to Led Zeppelin. Despite her natural aptitude and vocal talent, she was told that she lacked the discipline necessary to pursue a singing career. During this time she formed a garage rock band which performed cover songs of classic bands. At her mother&amp;#039;s suggestion she recorded a demo tape with her friends. In 2004 she captured the attention of Michael Parisi, a record company executive from Warner Music, while giving an impromptu rendition of the Rolling Stones song Jumping Jack Flash at a the Lygon Street Festa, a community festival in Melbourne. At the age of thirteen, Cilmi travelled to the United Kingdom and signed a contract with Island Records. Now living in the UK, she shares a manager with The Sugababes\n\nLessons To Be Learned is the debut album by Australian singer Gabriella Cilmi. It was written and produced with the hit team Xenomania, who have also worked with Kylie, Girls Aloud and Cher. Sweet About Me, the lead single from the album debuted on the UK Singles Chart at number sixty-eight, and rose to its peak position of number thirty-eight two weeks later. On April 14th 2008, the song peaked at No.1 on the Australian Singles Chart. It reached No.1 again on May 19th 2008, while her debut album reached No.3 on the albums chart. This makes her the youngest Australian to reach the top of the charts, beating Australian Idol winner Casey Donovan by just nineteen days. On April 20th 2008, it re-entered the UK Top 40 at a higher position of 34 and has so far peaked at No.8. This is the UK version of the album.\n\nTracks:\n01  Save The Lies\n02  Sweet About Me\n03  Sanctuary\n04  Einstein\n05  Got No Place To Go\n06  Don&amp;#039;t Wanna Go To Bed Now\n07  Messy\n08  Awkward Game\n09  Safer\n10  Cigarettes And Lies\n11  Terrifying\n12  Sit In The Blues\n\nUK Bonus Track:\n13  Echo Beach\n","torrent":{"xt":"urn:btih:2cc874c6e4e770d6dd964e819330b2095d49911e","amp;dn":"Gabriella+Cilmi+-+Lessons+to+be+Learned+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cc874c6e4e770d6dd964e819330b2095d49911e","infoHashBuffer":{"type":"Buffer","data":[44,200,116,198,228,231,112,214,221,150,78,129,147,48,178,9,93,73,145,30]},"announce":[],"urlList":[]}}