{"title":"Good Scripts, Bad Scripts: Craft of Screenwriting Through 25 of ","uid":8942996,"size":3450277,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d0027bc905e94109e5f7460ec9850506203054b&amp;dn=Good+Scripts%2C+Bad+Scripts%3A+Craft+of+Screenwriting+Through+25+of+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1379711228,"description":"Good Scripts, Bad Scripts: Learning the Craft of Screenwriting Through 25 of the Best and Worst Films in History \nby Tom Pope\n\nIn this unique volume, respected screenwriter Thomas Pope offers an innovative and practical approach to teaching the craft of screenplay writing, in the process providing an engaging, behind-the-scenes look at the way the film industry really works. Each chapter deals with a different component of the art of screenwriting, from character development, to the nurturing of subplots, to the fundamentals of good dialogue, illustrating everything through the virtues or mistakes of a particular film. The book encompasses the best and worst of films throughout the years, including Citizen Kane, Pulp Fiction, Chinatown, Singing in the Rain, Bonfire of the Vanities, and many others. With its trenchant analysis and keen insight into the reasons films succeed or fail, Good Scripts, Bad Scripts is not only an invaluable guide for potential screenwriters, but a rich resource for any student interested in film and film history.","torrent":{"xt":"urn:btih:2d0027bc905e94109e5f7460ec9850506203054b","amp;dn":"Good+Scripts%2C+Bad+Scripts%3A+Craft+of+Screenwriting+Through+25+of+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d0027bc905e94109e5f7460ec9850506203054b","infoHashBuffer":{"type":"Buffer","data":[45,0,39,188,144,94,148,16,158,95,116,96,236,152,80,80,98,3,5,75]},"announce":[],"urlList":[]}}