{"title":"Batman - Cacophony 01-03 (2009|Digital|Minutemen-PhD)","uid":9886843,"size":112664063,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2d2d05c756f84c2e64036ef5d282c44178ca0b04&amp;dn=Batman+-+Cacophony+01-03+%282009%7CDigital%7CMinutemen-PhD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1396593545,"description":"Writer/Director Kevin Smith and his long time friend and artist Walt Flanagan team up to present this three-issue miniseries that mixes old and new elements of the Batman mythos with Smith's dialogue-heavy style. Though reviews were somewhat mixed, the story was modestly successful and mostly well-received critically, and warranted a follow-up from the duo as well. Promotional info for the collected edition - &quot;Best-selling comic book writer/director Kevin Smith (GREEN ARROW, Daredevil, Mallrats, Chasing Amy) steps into Gotham City to write this graphic novel featuring the mysterious masked killer known as Onomatopoeia who sets his sights - and sounds - against The Caped Crusader! Will Batman be able to uncover the relationship between The Joker and Onomatopoeia in time to keep them from destroying Gotham City? Or is the combination of these villains too much for The Dark Knight to handle? The wild ride that caught Batman between The Joker and Onomatopoeia comes to a crashing halt as Batman is forced to choose between capturing Onomatopoeia and saving The Joker's life! Will Onomatopoeia have the final word with a deadly &quot;Bang!&quot;? Find out in this exciting stand-alone story!&quot;\n\nThis is the three individual issues in digital format, thanks to Minutemen-PhD. Please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:2d2d05c756f84c2e64036ef5d282c44178ca0b04","amp;dn":"Batman+-+Cacophony+01-03+%282009%7CDigital%7CMinutemen-PhD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d2d05c756f84c2e64036ef5d282c44178ca0b04","infoHashBuffer":{"type":"Buffer","data":[45,45,5,199,86,248,76,46,100,3,110,245,210,130,196,65,120,202,11,4]},"announce":[],"urlList":[]}}