{"title":"Forrest Gump - Winston Groom","uid":4198521,"size":162302383,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2dec6c41b0ce3f488351ad59661d1331b6394b30&amp;dn=Forrest+Gump+-+Winston+Groom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rambam1776","files":3,"time":1211328716,"description":"Forrest Gump - Winston Groom Abridged Audio Book\n\nRead by the Author\n &lt;a href=&quot;\nhttp://www.amazon.com/gp/product/product-description/0743453255/ref=dp_proddesc_0?ie=UTF8&amp;n=283155&amp;s=books&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/gp/product/product-description/0743453255/ref=dp_proddesc_0?ie=UTF8&amp;n=283155&amp;s=books&lt;/a&gt;\n\nTranscribed from audio tape\n\nReview\nOcala Star-Banner A most gentle spirit, Forrest Gump should enter the annals of fiction as a great American hero. \n\nProduct Description\nMeet Forrest Gump, the lovable, hurculean, and surprisingly savy hero of this remarkable comic odyssey. After accidentally becoming the star of Univerity of Alabama\\&amp;#039;s football team, Forrest goes on to become a Vietnam War hero, a worl-class Ping-Pong player, a villainous wrestler, and a business tycoon -- as he wonders with cildlike wisdome at the insanity all around him. In between misadentures, he manages to compare battle scars with Lyndon Johnson, discover the truth about Richard Nixon, and survive the ups and downs of remaining true to his only love, Jenny, on an extraordinary journey through three decades of the American cultural landscape. Forrest gump has one heck of a story to tell -- and you\\&amp;#039;ve got to read it to believe it....\n\n\n\nAbout the Author\nWinston Groom is the author of ten books, including the #1 New York Times bestseller Gumpisms: The Wit and Wisdom of Forrest Gump. He also wrote the acclaimed Vietnam War novel Better Times than These, the prize-winning As Summers Die, the Civil War history Shrouds of Glory, and coauthored Conversations with the Enemy, which was nominated for a Pulitzer Prize. Groom\\&amp;#039;s most recent works include Such a Pretty, Pretty Girl and The Crimson Tide: An Illustrated History of Football at the University of Alabama. He lives in Point Clear, Alabama, with his wife and daughter and in the mountains of North Carolina.\n","torrent":{"xt":"urn:btih:2dec6c41b0ce3f488351ad59661d1331b6394b30","amp;dn":"Forrest+Gump+-+Winston+Groom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dec6c41b0ce3f488351ad59661d1331b6394b30","infoHashBuffer":{"type":"Buffer","data":[45,236,108,65,176,206,63,72,131,81,173,89,102,29,19,49,182,57,75,48]},"announce":[],"urlList":[]}}