{"title":"The Battle of the Sexes in French Cinema, 1930 1956(pdf){Zzzzz}","uid":11404119,"size":3278650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e2e9c3313a69c28abd98608ee32d4997e88f453&amp;dn=The+Battle+of+the+Sexes+in+French+Cinema%2C+1930+1956%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415455929,"description":"In The Battle of the Sexes in French Cinema, Noel Burch and Genevieve Sellier adopt a sociocultural approach to films made in France before, during, and after World War II, paying particular attention to the Occupation years (1940-44). The authors contend that the films produced from the 1930s until 1956 - when the state began to subsidize the movie industry, facilitating the emergence of an &quot;auteur cinema&quot; - are important, both as historical texts and as sources of entertainment. Citing more than 300 films and providing many in-depth interpretations, Burch and Sellier argue that films made in France between 1930 and 1956 created a national imaginary that equated masculinity with French identity. They track the changing representations of masculinity, explaining how the strong patriarch who saved fallen or troubled women from themselves in prewar films gave way to the impotent, unworthy, or incapable father-figure of the Occupation. After liberation, the patriarch reemerged as protector and provider alongside assertive women who figured as threats not only to themselves but to society as a whole.\n\nReview\n&quot;The Battle of the Sexes in French Cinema, 1930-1956 makes an incontrovertible case for a social history of French cinema, bringing to light a whole world of films, and a period in French film history, overlooked by formalist critics. Noel Burch and Genevieve Sellier's analyses of character, gender, and ideology are trenchant, and there is an analytic surprise on every page of this fascinating book. Required reading!&quot; - Alice Kaplan, author of Dreaming in French &quot;This flawless translation of La Drole de guerre des sexes is a boon to cinema studies. Noel Burch and Genevieve Sellier rightly argue that attention to the New Wave and auteur theory obfuscated much of the great film made in France during the years prior to the war, during the Occupation, and after the Liberation. Their book will rejuvenate historical and ideological study of classical French cinema in the Anglophone world. Anyone interested in French film history and theory will find it invaluable.&quot; - Tom Conley, author of An Errant Eye: Poetry and Topography in Early Modern France\n\nAbout the Author\nNoel Burch is Professor Emeritus of Film Studies at the University Charles de Gaulle in Lille. His book &quot;Theory of Film Practice&quot; is widely regarded as one of the key works of Western film criticism.Genevieve Sellier is Professor of Film Studies at the University Michel de Montaigne in Bordeaux. She is the author of several books in French, as well as &quot;Masculine Singular: French New Wave Cinema,&quot; also published by Duke University Press.\n\nPublisher: Duke University Press (25 November 2013)\nLanguage: English\nISBN-10: 0822355477\nISBN-13: 978-0822355472","torrent":{"xt":"urn:btih:2e2e9c3313a69c28abd98608ee32d4997e88f453","amp;dn":"The+Battle+of+the+Sexes+in+French+Cinema%2C+1930+1956%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e2e9c3313a69c28abd98608ee32d4997e88f453","infoHashBuffer":{"type":"Buffer","data":[46,46,156,51,19,166,156,40,171,217,134,8,238,50,212,153,126,136,244,83]},"announce":[],"urlList":[]}}