{"title":"The Ultimate Sniper (2006 Edition!)","uid":4082323,"size":45401510,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2eac0259f0ea77c7e89a360d7f250a2af0c0c47d&amp;dn=The+Ultimate+Sniper+%282006+Edition%21%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":2,"time":1205619670,"description":"When John Plaster&amp;#039;s The Ultimate Sniper was released in 1993, it was hailed as an instant classic in the sniping community, influencing an entire generation of military and police marksmen around the world. Now this revolutionary book has been completely updated and expanded for the 21st century! Through revised text, new photos, specialized illustrations, updated charts and additional information sidebars, The Ultimate Sniper once again thoroughly details the three great skill areas of sniping: marksmanship, fieldcraft and tactics. Just some of the material in this new edition includes: * Cutting-edge sniper rifles, scopes, ammunition and equipment, everything purpose-designed or adapted specifically for military and police sniping. * The latest tactics and techniques from the frontlines of the War on Terror, including the mountains, deserts and urban areas of the Middle East and Central Asia. * Analysis of evolving technologies, including lasers, night vision, FLIR and ballistics programs. * Detailed ballistics and trajectory data for sniper ammunition. * An all-new chapter on countersniping lessons learned in Iraq and Afghanistan * An up-to-date listing of U.S.-based sniper training programs. Find out why professional snipers, sharpshooters and long-range riflemen consider The Ultimate Sniper to be the bible of their craft. A veteran of the top-secret Special Forces covert operations unit MACV-SOG during the Vietnam War, Maj. John L. Plaster combined what he learned of stealth, stalking and camouflage with his postwar experiences as a competitive shooter and firearms instructor to write The Ultimate Sniper. Over 60 pages of the original manual have been replaced with updated, modern information. An additional 120 NEW PAGES have been added with the above information!\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world&amp;#039;s longest running largest explosives and weapons forum on the web!\t","torrent":{"xt":"urn:btih:2eac0259f0ea77c7e89a360d7f250a2af0c0c47d","amp;dn":"The+Ultimate+Sniper+%282006+Edition%21%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2eac0259f0ea77c7e89a360d7f250a2af0c0c47d","infoHashBuffer":{"type":"Buffer","data":[46,172,2,89,240,234,119,199,232,154,54,13,127,37,10,42,240,192,196,125]},"announce":[],"urlList":[]}}