{"title":"The Myth of Junk DNA - Jonathan Wells","uid":11773249,"size":576281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f1fa1ae941e75bec06420da181d659cc84f224d&amp;dn=The+Myth+of+Junk+DNA+-+Jonathan+Wells&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starxteel","files":1,"time":1427160010,"description":"\nAccording to the modern version of Darwin?s theory, DNA contains a program for embryo development that is passed down from generation to generation; the program is implemented by proteins encoded by the DNA, and accidental DNA mutations introduce changes in those proteins that natural selection then shapes into new species, organs and body plans. When scientists discovered forty years ago that about 98% of our DNA does not encode proteins, the non-protein-coding portion was labeled ?junk? and attributed to molecular accidents that have accumulated in the course of evolution.\n\nRecent books by Richard Dawkins, Francis Collins and others have used this ?junk DNA? as evidence for Darwinian evolution and evidence against intelligent design (since an intelligent designer would presumably not have filled our genome with so much garbage). But recent genome evidence shows that much of our non-protein-coding DNA performs essential biological functions.\n\nThe Myth of Junk DNA is written for a general audience by biologist Jonathan Wells, author of Icons of Evolution. Citing some of the abundant evidence from recent genome projects, the book shows that ?junk DNA? is not science, but myth.\n\n\nAbout the author:\nJonathan Wells has received two Ph.D.s, one in Molecular and Cell Biology from the University of California at Berkeley, and one in Religious Studies from Yale University. He has worked as a postdoctoral research biologist at the University of California at Berkeley and the supervisor of a medical laboratory in Fairfield, California. Dr. Wells is also the author of Charles Hodge's Critique of Darwinism (Edwin Mellen Press, 1988), Icons of Evolution: Why much of what we teach about evolution is wrong (Regnery Publishing, 2000), and The Politically Incorrect Guide to Darwinism and Intelligent Design (Regnery, 2006)","torrent":{"xt":"urn:btih:2f1fa1ae941e75bec06420da181d659cc84f224d","amp;dn":"The+Myth+of+Junk+DNA+-+Jonathan+Wells","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f1fa1ae941e75bec06420da181d659cc84f224d","infoHashBuffer":{"type":"Buffer","data":[47,31,161,174,148,30,117,190,192,100,32,218,24,29,101,156,200,79,34,77]},"announce":[],"urlList":[]}}