{"title":"A History of US 10 Audio Books Homeschool Sonlight by Joy Hakim","uid":8821129,"size":4523325112,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2f22407299f273e3f58900111e2ad0a57e2d9ad3&amp;dn=A+History+of+US+10+Audio+Books+Homeschool+Sonlight+by+Joy+Hakim&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"cezen","files":-1,"time":1376703468,"description":"Product Details\n\n    Age Range: 10 and up\n    Grade Level: 5 and up\n    Series: History of US\n    Paperback: 1920 pages\n    Publisher: Oxford University Press, USA (March 5, 2007)\n    Language: English\n    ISBN-10: 0195327268\n    ISBN-13: 978-0195327267\n\nFrom the Publisher\nJoy Hakim has done the impossible. She has students all over the country reading American history... for fun! When she writes about our country's past, she makes it an exciting and suspenseful adventure because she tells stories--great stories--from factual history. The dates and events, characters and complexities, heroes, heroines, and villains are woven into the great drama of American history, and students are reading and responding with enthusiasm.\n\n\n\nAn exceptional, panoramic kids' introduction to U.S. history\nBy A Customer on September 20, 1997\n\nJoy Hakim has accomplished something close to impossible: a readable, thoughtful, even-handed narrative of American history, from the pre-Columbians to the end of the Cold War. The book is fun to read. Hakim tells her stories without stuffiness, pomposity, or self-rightreousness -- and she tells hundreds of stories! Illustrations are almost all from the period being discussed. Marginal comments explain difficult words and concepts. Sidebars print excerpts from diaries, speeches, letters, literature and histories of the time. Hakim relies heavily on biography and anecdote to convey a sense of the times she discusses. She manages to convey a sense of enthusiasm for this country throughout her warts-and-all account of its history. Periodically, she stops to discuss how historians know what they know and to encourage her readers to arrive at their own evaluations.\nMy wife and I started reading this series to our son when he was eight years old. We marvelled at how well it communicated history and its lessons (clear and ambiguous, simple and complex) to him. We found ourselves wishing we'd had books like these when we were first learning U.S. history\n\n*****************************************************************************\n\n\n\n","torrent":{"xt":"urn:btih:2f22407299f273e3f58900111e2ad0a57e2d9ad3","amp;dn":"A+History+of+US+10+Audio+Books+Homeschool+Sonlight+by+Joy+Hakim","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f22407299f273e3f58900111e2ad0a57e2d9ad3","infoHashBuffer":{"type":"Buffer","data":[47,34,64,114,153,242,115,227,245,137,0,17,30,42,208,165,126,45,154,211]},"announce":[],"urlList":[]}}