{"title":"Zaha Hadid - The Complete Buildings and Projects - (Malestrom)","uid":5673599,"size":12719967,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f25428e93db6970692c14865c0e4f2f3074877c&amp;dn=Zaha+Hadid+-+The+Complete+Buildings+and+Projects+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"malestrom_HH","files":2,"time":1278446471,"description":"Zaha Hadid, &quot;Zaha Hadid: The Complete Buildings and Projects&quot;\nPublisher: Rizzoli International Publications | 1998 | 144 Pages | ISBN: 0847821331 | PDF \n\nWith her most recent commission, Cincinnati's Contemporary Arts Center, architect Zaha Hadid becomes the first woman ever to design an American museum. This long awaited frist monograph on one of the world's most important architects collects Hadid's entire oeuvre-more than 80 built and unbuilt projects over 20 years- in one significant volume.Throughout her training at London's Architectural Association, and her work with Rem Koolhaas at OMA, to the establisment of her own worldwide architectural practice, Zaha Hadid has been acclaimed for her vanguard architectonic language. Only a handful of her projects have been built-all to great critcal success- and each new project astonishes the world of design with its commitment to revolutionary forms and ideas. As a result, she has an enormous following of students and practitioners, visionaries and builders.The groundbreaking monograph contains Hadid's own striking drawings and paintings, as well as hundreds of sketches, plans, and models. Readers will recognize her built work-the Vitra Fire Station near Basel and the IBA Building in Berlin- and will welcome details of her competition entry for Chicago's ITT Building, and her winning design for the Cardiff Opera House. With generous commenary by the architect and her office, this is a landmark publication.\n\n","torrent":{"xt":"urn:btih:2f25428e93db6970692c14865c0e4f2f3074877c","amp;dn":"Zaha+Hadid+-+The+Complete+Buildings+and+Projects+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f25428e93db6970692c14865c0e4f2f3074877c","infoHashBuffer":{"type":"Buffer","data":[47,37,66,142,147,219,105,112,105,44,20,134,92,14,79,47,48,116,135,124]},"announce":[],"urlList":[]}}