{"title":"ERD Commander [ISO]","uid":7197081,"size":63366149,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2fa3dada96d214cf8f8eaa29ce58aef18d63ced1&amp;dn=ERD+Commander+%5BISO%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Genomului","files":1,"time":1334820359,"description":"&quot;When your server or workstation won't boot, you need ERD Commander 2005. ERD Commander 2005 boots dead systems directly from CD into a Windows-like repair environment. You'll have full access to the dead system's volumes, so you can diagnose and repair problems using tools located on the ERD Commander 2005 Start menu. And you'll have built-in network access to safely move data off of, or on to, the dead system. With ERD Commander 2005 you can repair a system quickly and easily, saving you time and rescuing your critical data.\n\nKey features:\n-Boots dead systems directly from CD\n\n-Easy, familiar Windows-like interface\n\n-Intuitive Solution Wizard helps you select the right tool to correct your system \nissue\n\n-Includes Crash Analyzer Wizard to pinpoint the cause of recent system crashes for \nrepair\n\n-Allows complete disk sanitizing/data removal with Disk Wipe utility\n\n-Includes the Locksmith utility to reset lost Administrator passwords\n\n-Includes FileRestore so that you can quickly find and recover deleted files\n\n-Provides access to XP Restore Points on unbootable Windows XP systems\n\n-Detect malware and other applications that may be consuming system resources\n\n-Compares key info on unbootable systems with that of a working system for \ndiagnosis and troubleshooting\n\n-Automatically identifies and replaces critical system files that have become \ncorrupt\n\n-Allows for formatting and partitioning of disks\n\n-Provides emergency removal capability for faulty hotfixes\n\n-Built-in network access to safely copy data to/from dead systems\n\n-Repair and diagnostic tools located on Start menu\n\n-Repair tools include System Restore tool, System File Repair, Service and Driver \nManager, Hotfix Uninstall Wizard, Locksmith, Registry Editor, Explorer, Disk \nManagement, and Command Prompt\n\n-Data recovery tools include Disk Commander and FileRestore\n\n-Diagnostic tools include Crash Analyzer Wizard, System Compare, Autoruns, Event \nLog Viewer, System Information, TCP/IP Configuration, and Logical volumes utilities\n\n-Compatible with Windows NT, 2000, XP, and Server 2003.&quot;\n\n                                                                       \n                                                                      - Microsoft.\n\n*Sadly, a discontinued app. There is a newer market app or more &quot;stable release&quot; similar features released about 8 9 months ago called Microsoft Desktop Optimization Pack (MDOP). This is an ISO file with no extra crap.","torrent":{"xt":"urn:btih:2fa3dada96d214cf8f8eaa29ce58aef18d63ced1","amp;dn":"ERD+Commander+%5BISO%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fa3dada96d214cf8f8eaa29ce58aef18d63ced1","infoHashBuffer":{"type":"Buffer","data":[47,163,218,218,150,210,20,207,143,142,170,41,206,88,174,241,141,99,206,209]},"announce":[],"urlList":[]}}