{"title":"Police and Pursuit Driving- Bob Bondurant","uid":4745822,"size":35921254,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2fc536f7a79ac13a924163198ea8a528ea22ae31&amp;dn=Police+and+Pursuit+Driving-+Bob+Bondurant&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":-1,"time":1235871484,"description":"&quot;The Bob Bondurant School of High Performance Driving near Phoenix, Arizona, is one of the most-respected driving schools in the world. It's also the site of Bondurant's highly regarded police and pursuit driving course. Law enforcement officers throughout the United States know of the class and incessantly lobby their superiors for the opportunity to attend. More than 2,000 actually take the class every year. Now Bondurant and veteran law enforcement officer Ed Sanow put to print all elements of police and pursuit driving as taught by Bondurant-the terminology, the car, the road, and, of course, safety. Bondurant's methods for controlling weight transfer, following lines through corners, tail-braking, and more, are also illustrated and addressed. With the recent media focus on police pursuit driving in the U.S., this book is sure to find a place on the shelves of numerous law enforcement officials, as well as general driving enthusiasts.&quot;\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:2fc536f7a79ac13a924163198ea8a528ea22ae31","amp;dn":"Police+and+Pursuit+Driving-+Bob+Bondurant","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fc536f7a79ac13a924163198ea8a528ea22ae31","infoHashBuffer":{"type":"Buffer","data":[47,197,54,247,167,154,193,58,146,65,99,25,142,168,165,40,234,34,174,49]},"announce":[],"urlList":[]}}