{"title":"Raspberry Pi Super Cluster + Code","uid":10122303,"size":1256175,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ff7382751b4c1049a6a94f6182fafbe7b4c1f95&amp;dn=Raspberry+Pi+Super+Cluster+%2B+Code&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"el_hadi","files":-1,"time":1399694431,"description":"Raspberry Pi Super Cluster\nby Andrew K. Dennis\nPackt Publishing | 2013 | PDF | 126 Pages\n\nBuild your own parallel-computing cluster using Raspberry Pi in the comfort of your home\n\nOverview\n- Learn about parallel computing by building your own system using Raspberry Pi\n- Build a two-node parallel computing cluster\n- Integrate Raspberry Pi with Hadoop to build your own super cluster\n\nIn Detail\nA cluster is a type of parallel/distributed processing system which consists of a collection of interconnected stand-alone computers cooperatively working together. Using Raspberry Pi computers, you can build a two-node parallel computing cluster which enhances performance and availability.\n\nThis practical, example-oriented guide will teach you how to set up the hardware and operating systems of multiple Raspberry Pi computers to create your own cluster. It will then navigate you through how to install the necessary software to write your own programs such as Hadoop and MPICH before moving on to cover topics such as MapReduce. Throughout this book, you will explore the technology with the help of practical examples and tutorials to help you learn quickly and efficiently.\n\nWhat you will learn from this book\n- Discover how to set up the hardware to build your parallel computing cluster\n- Set up your Raspberry Pi computers and install an operating system\n- Network your two Raspberry Pi's together\n- Gain an understanding of MPI through practical examples\n- Learn how to work with MPICH to write parallel applications\n- Install Hadoop and experiment with processing text files\n- Get acquainted with MapReduce, the paradigm at the heart of Hadoop","torrent":{"xt":"urn:btih:2ff7382751b4c1049a6a94f6182fafbe7b4c1f95","amp;dn":"Raspberry+Pi+Super+Cluster+%2B+Code","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ff7382751b4c1049a6a94f6182fafbe7b4c1f95","infoHashBuffer":{"type":"Buffer","data":[47,247,56,39,81,180,193,4,154,106,148,246,24,47,175,190,123,76,31,149]},"announce":[],"urlList":[]}}