{"title":"Pixies - Trompe Le Monde [24 bit FLAC] vinyl","uid":8110738,"size":951531686,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:303641b20c3592ef5a63075ba2cd8bed876662f3&amp;dn=Pixies+-+Trompe+Le+Monde+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"24.96","files":-1,"time":1360179531,"description":"The title might be French for &quot;fool the world,&quot; but with Trompe le Monde, the Pixies weren't fooling anyone: this was essentially Black Francis' solo debut. It focuses on Francis' sci-fi fascination and lacks any Kim Deal songs; even her backing vocals are far and few between. Yet the band sounds revitalized on Trompe le Monde, as if it were planned as their last hurrah. The raucous &quot;Distance Equals Rate Times Time&quot; and the explosive cover of the Jesus and Mary Chain's &quot;Head On&quot; are fairly straightforward, but the lyrics remain quirky on &quot;Planet of Sound,&quot; a song about a Martian who lands on Earth, and &quot;Palace of the Brine,&quot; a tribute to sea monkeys and Utah's Salt Lake. He even disses hipsters and pretentious students - basically, the Pixies' fan base - with nasty little digs like &quot;Subbacultcha&quot;'s &quot;I was wearing eyeliner/She was wearing eyeliner&quot; and &quot;U-Mass&quot;' &quot;It's eduuucaaationaal!&quot; Musically, &quot;Trompe le Monde&quot;'s psychedelic sheen and &quot;Alec Eiffel&quot;'s atmospheric keyboards prove that the Pixies' sound wasn't defined by Steve Albini-style rawness. There's also more emotional depth: &quot;The Sad Punk&quot; features the strangely poignant bridge &quot;And evolving from the sea/Would not be too much time for me/To walk beside you in the sun,&quot; and &quot;Letter to Memphis&quot; is a heartfelt, if cryptic, love song. Though Trompe le Monde doesn't sound quite like the Pixies' other work, Come on Pilgrim's spooky beginnings, Surfer Rosa's abrasive assault, Doolittle's deceptively accessible punk-pop, and Bossanova's spacy sonics helped make Trompe le Monde a rousing swan song and a precursor to alternative rock's imminent success. Whether that means their music remained pure or they missed their chance to cash in is debatable; either way, the Pixies are one of America's greatest, most influential bands.","torrent":{"xt":"urn:btih:303641b20c3592ef5a63075ba2cd8bed876662f3","amp;dn":"Pixies+-+Trompe+Le+Monde+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"303641b20c3592ef5a63075ba2cd8bed876662f3","infoHashBuffer":{"type":"Buffer","data":[48,54,65,178,12,53,146,239,90,99,7,91,162,205,139,237,135,102,98,243]},"announce":[],"urlList":[]}}