{"title":"FROM RESOURCE ALLOCATION TO STRATEGY - Joseph L. Bower and Clark","uid":8810096,"size":1779302,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:30d952016cd0b0274f5da9059c5c2a3809eb020b&amp;dn=FROM+RESOURCE+ALLOCATION+TO+STRATEGY+-+Joseph+L.+Bower+and+Clark&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"leopardog","files":1,"time":1376437069,"description":"FROM RESOURCE ALLOCATION TO STRATEGY\nby Joseph L. Bower and Clark G. Gilbert\nPDF FORMAT\n &lt;a href=&quot;\nhttp://www.amazon.com/exec/obidos/ASIN/0199277451/4353-20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/exec/obidos/ASIN/0199277451/4353-20&lt;/a&gt;\n\nIs strategy a coherent plan conceived at the top by a visionary leader, or is it formed by a series of individual commitments, not always reflecting what top management has in mind? If it is a series of commitments, how can they be managed? To answer these questions, Joseph L. Bower and Clark G. Gilbert present research that examines how strategy is actually made by company managers across several levels of an organization. The research penetrates the &quot;black box&quot; of strategy formulation and shows that a company's realized strategy emerges less from the formal statements of corporate strategy, but often out of the pattern of resource commitments that originate across every level of the firm.\n\nDrawing on over thirty yeas of research on resource allocation, including studies from Harvard Business School, Stanford, London Business School, and INSEAD, the book's five sections detail the structural characteristics of the resource allocation process, how the process can lead to breakdowns in strategic outcomes, and where top management can intervene to shape desired results. And while the organizing authors connect over three decades of research on resource allocation, they have also included assessments of this work by thought leaders in the fields of economics, competitive strategy, organizational behavior, and strategic management.\n\nThe processes described represent the complex reality of strategy formulation in large organizations, but the ideas are presented in a way that enables the reader to access and understand the implications of these complexities. The findings should inform the research of economists, strategists, and behavioural scientists. Thoughtful executives and those who consult with them will also find the book provocative and instructive.","torrent":{"xt":"urn:btih:30d952016cd0b0274f5da9059c5c2a3809eb020b","amp;dn":"FROM+RESOURCE+ALLOCATION+TO+STRATEGY+-+Joseph+L.+Bower+and+Clark","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30d952016cd0b0274f5da9059c5c2a3809eb020b","infoHashBuffer":{"type":"Buffer","data":[48,217,82,1,108,208,176,39,79,93,169,5,156,92,42,56,9,235,2,11]},"announce":[],"urlList":[]}}