{"title":"Days of Magic, Nights of War - Clive Barker","uid":12091290,"size":333217714,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:310ef82b7eb8d7409c31de35e67ee7e3dede7551&amp;dn=Days+of+Magic%2C+Nights+of+War+-+Clive+Barker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gbgarista","files":65,"time":1436055681,"description":"Written by Clive Barker\nRead by Richard Ferrone\nFormat: MP3\nUnabridged\n\nCandy Quackenbush's adventures in the amazing world of the Abarat are getting more strange by the hour. Christopher Carrion, the Lord of Midnight, has sent his henchman to capture her. &quot;Why?&quot; she wonders. What would Carrion want with a girl from Minnesota? And why is Candy beginning to feel that the world of Abarat is familiar to her? Why can she speak words of magic she doesn't even remember learning?\n\nThere is a mystery here. And Carrion, along with his fiendish grandmother, Mater Motley, suspects that whatever Candy is, she could spoil their plans to take control of the Abarat.\n\nNow Candy's companions must race against time to save her from the clutches of Carrion, and she must solve the mystery of her past before the forces of Night and Day clash and Absolute Midnight descends upon the islands.\n\nA final war is about to begin. And Candy is going to need to make some choices that will change her life forever.\n\nDon't miss any of the magic in the world of Abarat.\n\nThis is one of my favorite series. Splitting this one into chapters was a project I put a lot of love into. I really hope ya'll enjoy these three","torrent":{"xt":"urn:btih:310ef82b7eb8d7409c31de35e67ee7e3dede7551","amp;dn":"Days+of+Magic%2C+Nights+of+War+-+Clive+Barker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"310ef82b7eb8d7409c31de35e67ee7e3dede7551","infoHashBuffer":{"type":"Buffer","data":[49,14,248,43,126,184,215,64,156,49,222,53,230,126,231,227,222,222,117,81]},"announce":[],"urlList":[]}}