{"title":"Robert Hugh Benson - Lord of the World (EPUB/MOBI/PDF)","uid":11861152,"size":2269564,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:314431c50a136c4a3d96a0a9e2a89a532d80c3a9&amp;dn=Robert+Hugh+Benson+-+Lord+of+the+World+%28EPUB%2FMOBI%2FPDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"ancapcatholic","files":5,"time":1430285539,"description":"Robert Hugh Benson - Lord of the World (1907 Dystopian Science Fiction Novel Recommended by Pope Francis &amp; Pope Benedict) [EPUB, MOBI, PDF]\n\nWritten in 1907, Lord of the World was one of the first &quot;dystopian&quot; visions of the future which would gain popularity as a genre later in the 20th century. In its frightening vision of the future taking place around the year 2000, a hyper-secular and technologically advanced culture, divided between three conglomerate regions - the Americas, Europe/Africa, and the East which is reminiscent of today's global Islamic culture. All formal religious beliefs except for Catholicism have faltered as coherent systems, and the remaining Catholic Church has been completely discredited in the eyes of the rest of the world which has turned to a form of &quot;self religion.&quot; Catholicism has been outlawed and banished to Rome and Ireland. (Remember that this was written before the creation of the independent State of Vatican City as we now know it since 1929.) The novel's pope has preserved these cities of exiles by relinquishing control over the rest of the world's individual churches, which have been destroyed or will eventually be turned into temples of worshiping humanitarianism and sexuality.\n\nThe world finds itself tottering on the brink of either blossoming into a glorious new age of peace, or of dissolving in a final bloodbath of all out global war. Into this globalized and socialist political situation steps Julian Felsenburgh, the world's greatest diplomat, peacemaker, charismatic world leader, and - unbeknownst to his eager followers - Antichrist. Attacks on Christian symbols and beliefs abound, and euthanasia is commonly practiced, even among the physically sound who have no hope nor history. The world's only hope is a beleaguered and globally persecuted Catholic Church, which is eventually viewed by the government as its only remaining viable threat.\n\nA science fiction bestseller when it first appeared in 1907, Robert Hugh Benson's prophetic end times thriller reads as if culled from today's headlines. Many of the book's predictions are compelling to reflect upon and startlingly accurate, not only in some of the critiques of contemporary culture for which it is best known, but even technologically: instant modes of communication, easy transatlantic travel, weapons of almost unimaginable mass destruction, even something along the lines of drones. Its prophetic vision extends to the increased devaluation of human life and the role technology can play in mass murder that was so evident in the death camps and killing fields of the years that would follow it. Lord of the World chillingly predicts the path our secular, post-modern, and largely &quot;post-Christian&quot; world is even now following straight into the clutches of the Enemy.\n\n---\n\nIn 2013 Pope Francis made a reference to Robert Hugh Benson's apocalyptic novel Lord of the World when talking about progressive Catholics seeking to change Church teaching: &quot;Still today, the spirit of worldliness leads us to progressivism, to this uniformity of thought&quot; ... Negotiating one's fidelity to God is like negotiating one's identity, Pope Francis said. He then referenced this 1907 novel in which the author speaks of the spirit of the world that leads to apostasy &quot;almost as though it were a prophecy, as though he envisioned what would happen ... We would do well to think about what happened in the Book of Maccabees,&quot; Pope Francis continued, &quot;about what happened step by step, before we decide to follow an 'adolescent progressivism' and go along with what everyone is doing. We would also do well to ponder the consequences of their infidelity, to think about the 'death sentences, the human sacrifices' which followed thereafter.&quot; He then asked those present: 'Do you think there are no human sacrifices today? There are many, many of them. And there are laws that protect them.'\n\nAgain in 2015, Pope Francis referenced this book during an interview in the context of discussing &quot;ideological colonization&quot; when first world countries offer funds to third world countries with strings attached: &quot;There is a book, excuse me but I'll make a commercial, there is a book that maybe is a bit heavy at the beginning because it was written in 1903 [sic] in London. It is a book that at that time, the writer had seen this drama of ideological colonization and wrote in that book. It is called 'The Lord of the Earth,' or 'The Lord of the World.' One of those. The author is Benson, written in 1903 [sic]. I advise you to read it. Reading it, you'll understand well what I mean by ideological colonization.&quot;\n\nPope Benedict XVI also frequently cited it; then Joseph Cardinal Ratzinger urged his listeners at a speech in 1992 to read Lord of the World in response to then President George H.W. Bush's talk of a &quot;New World Order&quot;, saying that Benson's book depicted &quot;a similar unified civilization and its power to destroy the spirit. The anti-Christ is represented as the great carrier of peace in a similar new world order.&quot;\n\n--\n\nSee also:\n\n--Pierced by a Sword, Conceived Without Sin, House of Gold (e-book novels)\n  &lt;a href=&quot; https://thepiratebay.se/torrent/11219483&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/11219483&lt;/a&gt;\n\n--Rapture: The End-Times Error That Leaves the Bible Behind (e-book)\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10205245&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10205245&lt;/a&gt;\n\n--Dr. Michael Barber - Unlocking the Book of Revelation (audio)\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10177277&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10177277&lt;/a&gt;\n\n--Scott Hahn: The Lamb's Supper (Unabridged Audiobook + epub/mobi)\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10645369&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10645369&lt;/a&gt;\n\n--Marian Apparitions of the 20th Century (2000) - (video)\n  &lt;a href=&quot; https://thepiratebay.se/torrent/11472850&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/11472850&lt;/a&gt;\n\n---\n\nPlease seed!\n\nMore:  &lt;a href=&quot;\nhttps://thepiratebay.se/user/ancapcatholic/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/ancapcatholic/&lt;/a&gt;\n\nTips:  &lt;a href=&quot;\nhttps://bit.co.in/ancapcatholic&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://bit.co.in/ancapcatholic&lt;/a&gt;\n\nâ–ˆâ–€â–€â–€â–€â–€â–ˆ â–„â–„ â–ˆâ–€â–„â–€ â–€   â–„â–„â–€â–„â–ˆâ–„â–„â–€â–ˆ â–ˆâ–€â–€â–€â–€â–€â–ˆ\nâ–ˆ â–ˆâ–ˆâ–ˆ â–ˆ  â–„â–ˆâ–ˆ â–€â–€ â–„â–„ â–€â–„â–€â–„ â–€ â–„â–„â–€ â–ˆ â–ˆâ–ˆâ–ˆ â–ˆ\nâ–ˆ â–€â–€â–€ â–ˆ â–„â–€â–ˆâ–„â–ˆ â–€â–ˆâ–„â–ˆâ–„ â–ˆâ–ˆ â–ˆâ–€ â–„â–€  â–ˆ â–€â–€â–€ â–ˆ\nâ–€â–€â–€â–€â–€â–€â–€ â–ˆâ–„â–€â–„â–€ â–€ â–€ â–ˆâ–„â–€â–„â–€â–„â–ˆ â–€ â–€ â–€â–€â–€â–€â–€â–€â–€\nâ–„   â–ˆâ–ˆâ–€â–€â–„â–€ â–€â–ˆâ–„â–„â–€â–€ â–€  â–„ â–ˆâ–€  â–€â–ˆ â–€â–€â–„ â–„â–ˆ \nâ–€ â–ˆâ–ˆ  â–€â–ˆâ–ˆâ–ˆâ–€â–ˆâ–„â–ˆâ–€â–ˆâ–€â–ˆâ–ˆâ–€â–ˆâ–ˆâ–ˆâ–ˆ â–€ â–ˆ â–€â–„â–€ â–€â–ˆâ–„ \nâ–ˆâ–ˆ â–€â–ˆâ–€â–€ â–€â–€â–„â–„â–ˆâ–ˆâ–€â–€ â–€â–€ â–€â–€â–ˆâ–„  â–€â–€â–„â–€â–€ â–„â–€â–€â–ˆâ–ˆ\nâ–ˆâ–„ â–ˆâ–„â–ˆâ–€â–„â–ˆ â–€â–ˆ â–ˆâ–ˆ  â–ˆâ–ˆâ–ˆâ–ˆ  â–ˆ   â–€â–„â–„â–ˆâ–€â–„â–€â–„ â–„\n â–„â–ˆ  â–„â–€â–ˆâ–„â–ˆâ–ˆâ–€â–€â–„â–ˆ  â–€â–€â–€â–€ â–„â–ˆâ–€â–ˆ â–„â–€â–ˆâ–ˆâ–€â–ˆ â–ˆ â–€\nâ–„â–„â–€â–„â–€ â–€â–€ â–„    â–ˆ  â–ˆâ–ˆâ–ˆâ–ˆ  â–ˆ â–€ â–ˆ â–ˆâ–„ â–„â–„â–ˆâ–„â–„\nâ–€â–ˆâ–„â–„  â–€â–€â–€ â–ˆâ–„â–ˆâ–„â–ˆ  â–ˆâ–ˆâ–ˆâ–ˆ  â–ˆâ–„â–ˆâ–„â–„â–„â–€â–€â–€â–„â–€â–€â–„ \nâ–€â–ˆâ–ˆ â–€ â–€â–€â–„â–„ â–„â–ˆâ–ˆâ–„â–„ â–„â–„ â–„â–„â–ˆâ–ˆâ–„  â–ˆâ–„â–€â–€â–„  â–ˆâ–€ \nâ–„â–ˆ â–€â–„â–€â–€â–„ â–€â–ˆâ–„â–„â–ˆâ–„â–ˆâ–„â–ˆâ–ˆâ–„â–ˆâ–„â–€ â–„â–ˆâ–ˆâ–€â–„â–„â–€ â–„ â–ˆâ–ˆâ–€\n  â–„â–€â–„â–€â–€â–ˆâ–ˆâ–€â–ˆâ–„â–€ â–€ â–„â–„ â–ˆâ–€â–ˆâ–ˆâ–ˆâ–€ â–„â–ˆ  â–ˆâ–€ â–€â–„â–€ \nâ–€â–€ â–€â–€ â–€ â–ˆâ–„ â–€â–ˆâ–„â–„â–„ â–„â–„â–€â–ˆâ–€ â–„â–„â–ˆâ–„ â–ˆâ–€â–€â–€â–ˆâ–€â–ˆâ–„ \nâ–ˆâ–€â–€â–€â–€â–€â–ˆ â–ˆâ–€ â–€â–ˆâ–„ â–€â–ˆ â–ˆâ–ˆâ–ˆâ–„â–ˆâ–€ â–€â–ˆ â–ˆ â–€ â–ˆ â–ˆâ–ˆâ–„\nâ–ˆ â–ˆâ–ˆâ–ˆ â–ˆ â–€ â–„â–„â–„â–„â–„â–€â–ˆâ–€â–€â–„â–ˆâ–„â–€â–€â–€â–€ â–„â–€â–ˆâ–ˆâ–€â–ˆâ–€â–€â–€ \nâ–ˆ â–€â–€â–€ â–ˆ  â–„â–€â–„â–€â–ˆâ–„â–ˆâ–„â–„â–€ â–€â–ˆâ–€ â–„â–€â–„â–ˆ â–€â–€â–€ â–€â–„â–ˆ \nâ–€â–€â–€â–€â–€â–€â–€  â–€ â–€ â–€â–€â–€â–€â–€â–€â–€ â–€ â–€   â–€ â–€  â–€  â–€â–€","torrent":{"xt":"urn:btih:314431c50a136c4a3d96a0a9e2a89a532d80c3a9","amp;dn":"Robert+Hugh+Benson+-+Lord+of+the+World+%28EPUB%2FMOBI%2FPDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"314431c50a136c4a3d96a0a9e2a89a532d80c3a9","infoHashBuffer":{"type":"Buffer","data":[49,68,49,197,10,19,108,74,61,150,160,169,226,168,154,83,45,128,195,169]},"announce":[],"urlList":[]}}