{"title":"Infernal Restraints--Compliance Part 2  Cherie DeVille  Elise Gr","uid":9493647,"size":2244943049,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:31596b942f059a597064c591e29f4d63c497dde2&amp;dn=Infernal+Restraints--Compliance+Part+2++Cherie+DeVille++Elise+Gr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"merzedes","files":-1,"time":1390051531,"description":"Compliance Part 2 | Cherie DeVille | Elise Graves\n\nJanuary 17, 2014\n\n\nMP4 only.\n\n\nWhat can I say about Cherie DeVille that her fans don';t already know? She is a beautiful, blonde bondage slut. One of our favorites, in fact. She has been around us so long that surprising her takes a bit more creativity, but that is alright. We appreciate the challenge of taking a girl like this to the next level. Cherie is the complete package. She has beautiful tits, a tight ass, a pretty pussy, and a mouth made for sucking cock. Add in an undying love for tight bondage, corporal punishment and humiliation and you know it is a recipes for a good day.\n\nIt is all in the build up with girls like this. Cherie is so hot that there is no doubt most men can't keep their hands off her when they have the chance. We take a different tactic. Letting her languish for a while gives her time to contemplate what she thinks is coming next. We never really tell her what's going to happen, since it's more fun to let her wonder. Some times it is just best to let her torment herself in her own mind. \n\nThe way we bent Cherie over the frame has turned her into a humiliating display. Her legs are held apart by a bar that exposes her pussy and leaves her feeling more than a little vulnerable. The metal mask around her face also acts as a gag that pries her mouth open and keeps her from asking the question that she really doesn't want the answer to anyway, &quot;What is going to happen to me?&quot;\n\n\nThe bondage she is in is tight, but not entirely immobilizing. She can struggle against the chains, shackles and straps that hold her into place. It isn't long before she discovers that this is by design. When the cold metal of the ass hook slides pushes against her tight ass she knows things are about to get rough. When she feels OT tie her hair to it she finally understands why she was given so much freedom of movement. Now every time she bucks, squirms or shuffles the iron in her anus will fuck her and pull her hair at the same time. \n\nIt's an incredible feeling for Cherie, knowing that her body and reactions have been turned against her. As the whip and then the twin floggers play across her ass she can';;t decide whether to hold still for them or give into the degrading pleasure of fucking her own ass. It hurts so much to just sit there and take it, can she really just give in and enjoy the ride? \n\nShe doesn't have much of a choice, though. OT is coming with a rubber cock and a powerful vibrator to see what that much stimulation will do to Cherie. Being full in 2 holes at once is embarrassing for her but also deeply erotic. It hurts to have so much inside of her but it feels so good at the same time. She barely has time to get into it before he has walked away, though. \n\nWhen he comes back, at first it isn't clear what he intends to do. Even when he holds the long red object in front of her face Cherie doesn't seem to realize what is coming. It isn';;t until he pulls out a lighter and melts the wax around the wick that the full reality of the situation dawns on her. Cherie';;s eyes go wide as she wonders what OT has planned for that candle. She knows right away that it won't be just a few drops of wax on her back.\n\nAfter transferring Cherie to the stocks, OT invites a friend in to play with his toy. Elise Graves comes in and Cherie can't even see her from her position, all she can do is feel the extra set of hands playing by her feet. Poking, caning, biting, and just generally tormenting, Elise and OT work together while the medieval torture device keep their prey in position. \n\nIt isn't their touch that is causing Cherie the most distress, though. The wooden frames themselves are insidious in the position she's in. While they work her over she is distracted from it, but as soon as she is left alone she can feel the fact that her weight in resting in the worst ways imaginable. She isn't on her hands and knees, even though it looks that way. Instead she is holding herself up by her shins and forearms. Even languishing in this position for a while will leave large bruises from where she spent time pushing against the wood to keep herself from slumping. If she runs out of strength and slides down even a little bit who knows if she will be able to lift herself back up into the stance that she has been commanded to hold. \n\nEven the heavy tit caning that Elise gives her is better than being left alone in this position. Cherie has always liked attention, she loves the spotlight, but she never thought she would be sitting her wishing to be caned rather than being alone with her thoughts. The ball gag in her mouth that at first she thought of as a curse is soon seen as a blessing. It gives her something to bite down on so that she can grit her teeth and suffer through the pain. It doesn't matter that it muffles her screams for mercy. Even if she could freely beg for it, she wouldn't be receiving any from either of them.  \n \nScreens &lt;a href=&quot;\nhttp://infernalrestraints.com/device/bondage/2014/01_17cdeville6/InfernalRestraints-Cherie-DeVille-Elise-Graves-Compliance-Part-2.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://infernalrestraints.com/device/bondage/2014/01_17cdeville6/InfernalRestraints-Cherie-DeVille-Elise-Graves-Compliance-Part-2.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:31596b942f059a597064c591e29f4d63c497dde2","amp;dn":"Infernal+Restraints--Compliance+Part+2++Cherie+DeVille++Elise+Gr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31596b942f059a597064c591e29f4d63c497dde2","infoHashBuffer":{"type":"Buffer","data":[49,89,107,148,47,5,154,89,112,100,197,145,226,159,77,99,196,151,221,226]},"announce":[],"urlList":[]}}