{"title":"The Ruins - Scott Smith","uid":8893782,"size":383050,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:318372fb6b2dc55ca04a4d5330927c92906f80d6&amp;dn=The+Ruins+-+Scott+Smith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TheRose88","files":1,"time":1378649885,"description":"\nThe Ruins Scott Smith (epub)\n\nTwo American couples just out of college head to Mexico for a sun- and tequila-filled vacation. They befriend some like-minded Greek tourists and a German man whose brother has followed an archaeologist to the site of her dig. The Americans and one of the Greeks decide to go into the jungle to help Matthias find his brother. Blissfully ignorant, they head off with minimal rations, but lots of tequila. Despite all warning signs, they continue to a desolate Mayan village whose residents seem intent on keeping them away. Once American Amy steps off the path into a patch of vines, things suddenly change. As in A Simple Plan (Knopf, 1993), Smith creates a gripping story in which each character's uncertainties and human frailties are as horrific as the actual horror around them. Though the story is told in the third person, each American spends time as a protagonist, giving readers an understanding of his or her fears and motivations. This also allows readers to second-guess the characters. The book has no chapter breaks, which echoes the long and dreadful adventure. Even though only a few days pass, it feels much longer, as the plot moves minute-by-minute through each day. The ending is highly satisfactory and perfectly tragic. Though there are some brief scenes of gore, most of the suspense is psychological, but no less frightening. Fans of everything from Jurassic Park to Lost to Stephen King will love this book.","torrent":{"xt":"urn:btih:318372fb6b2dc55ca04a4d5330927c92906f80d6","amp;dn":"The+Ruins+-+Scott+Smith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"318372fb6b2dc55ca04a4d5330927c92906f80d6","infoHashBuffer":{"type":"Buffer","data":[49,131,114,251,107,45,197,92,160,74,77,83,48,146,124,146,144,111,128,214]},"announce":[],"urlList":[]}}