{"title":"Boys Noize - The Remixes 2004-2011 [2011] (Compilation)","uid":7082411,"size":327601893,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:31a92517c39d99bd92f045fd78971b84a09cc90b&amp;dn=Boys+Noize+-+The+Remixes+2004-2011+%5B2011%5D+%28Compilation%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"SidewaysDan","files":-1,"time":1331079130,"description":"_______________________________________Info________________________________________\n\n&quot;BOYS NOIZE is the stage name of Berlin-based DJ and producer ALEX RIDHA.\nRidha (born in 1982, Hamburg) started producing and DJing at early age to find himself supporting the likes of Felix Da Housecat and DJ Hell in a matter of time. Nowadays Ridha himself is known as a one of the most valued electronic artists, awarded with the Independent Music Award in 2010 as well as 3 years in a row Best Electronic Artist on Beatport.\n\nRidha released his early work on labels such as International Deejay Gigolos Records, Kitsune Music and Turbo Recordings. In order to retain full artistic freedom however, he established his imprint Boysnoize Records in 2005.His highly anticipated long players &quot;OI OI OI&quot; and its successor &quot;POWER&quot;, the two long players that included contemporary anthems such as &quot;Don't Believe The Hype&quot;, &quot;&amp;Down&quot; and &quot;Jeffer&quot;.  He remixed David Lynch, N.E.R.D, Depeche Mode, Snoop Dogg and The Chemical Brothers amongst many other great artists and became a producer of note, highly sought after having worked with Kelis, UK rapper Kano and Black Eyed Peas to name a few. \n\n\n*from Myspace (adapted)\n\n__________________________________Tracks___________________________________________\n\n\n1- Apparat\t- Arcadia (Boys Noize reprise)\t         7:09\n2- Para One - Dudun-Dun (Boys Noize remix)\t         6:14\n3- Maurice - This Is Acid (Boys Noize rework)\t 5:10\n4- Djedjotronic - Dirty &amp; Hard (feat Spoek - Boys Noize Jump If You're An Idiot mix)\t                                         3:40\n5- Kaiser Chiefs - Everyday I Love You Less &amp; Less (Boys Noize mix)\t5:27\n6- Marilyn Manson - Putting Holes In Happiness (Boys Noize remix)\t5:37\n7- Charlotte Gainsbourg - Trick Pony (Boys Noize remix)\t3:33\n8- Teenage Bad Girl - Cocotte (Boys Noize rework)\t 6:13\n9- Daft Punk - End Of Line (Boys Noize remix)\t 5:40\n10- Scissor Sisters - Invisible Light (Boys Noize remix)\t7:25\n11- Justice - Phantom Pt II (Boys Noize Turbine remix)\t6:01\n12- The Chemical Brothers - Swoon (Boys Noize summer remix)\t5:21\n13- Gonzales - Working Together (Boys Noize dub mix)\t5:17\n14- David Lynch - Good Day Today (Boys Noize remix)\t 6:16\n15- Sebastien Tellier - L'Amour Et La Violence (Boys Noize Main Version) 5:51\n16- Modeselektor - Monkey Flip (feat Nazizi &amp; Abbas - Boys Noize remix) 4:36\n17- Editors - You Don't Know Love (Boys Noize classic mix)\t7:01\n18- N*E*R*D - Hot-N-Fun (feat Nelly Furtado - Boys Noize remix)\t5:55\n19- Cut Copy - Lights &amp; Music (Boys Noize remix)\t 5:18\n20- Snoop Dogg - Sexual Eruption (Boys Noize remix)\t 4:47\n21- Late Of The Pier - Focker (Boys Noize Terror re-did)\t4:08\n22- Feist - My Moon My Man (Boys Noize classic mix)\t 6:40\n23- Depeche Mode - Personal Jesus (Boys Noize rework)6:54\n24- Royksopp- Happy Up Here (Boys Noize remix)\t 5:28\n\n\n_________________________________Track Info________________________________________\n\n\n\n                               mp3 CBR @320 kbps\n\n                               44.1 kHz\n                           \n   \nI take absolutely no credit for the ripping, encoding and uploading of this track onto the internet. I did the relatively easy task of sharing it on torrent.\n\n\n","torrent":{"xt":"urn:btih:31a92517c39d99bd92f045fd78971b84a09cc90b","amp;dn":"Boys+Noize+-+The+Remixes+2004-2011+%5B2011%5D+%28Compilation%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31a92517c39d99bd92f045fd78971b84a09cc90b","infoHashBuffer":{"type":"Buffer","data":[49,169,37,23,195,157,153,189,146,240,69,253,120,151,27,132,160,156,201,11]},"announce":[],"urlList":[]}}