{"title":"Monopoly Collection (2011) [Wii][PAL][MULTi5]","uid":6803528,"size":4699979776,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:31d22271e3b6c41c86047f37839dcb380507b616&amp;dn=Monopoly+Collection+%282011%29+%5BWii%5D%5BPAL%5D%5BMULTi5%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"webchella","files":1,"time":1320773674,"description":"Monopoly Collection (2011) [Wii][PAL][MULTi5]\n &lt;a href=&quot;\nhttp://uk.wii.ign.com/objects/110/110014.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://uk.wii.ign.com/objects/110/110014.html&lt;/a&gt;\n\n--------\nEnglish:\n--------\nPlatform: Nintendo Wii\nLanguage: English, Spanish, French, Italian, German\nRegion: PAL\nFormat: ISO\nAvailable at Stores\nDeveloper: EA Games\nDistributor: EA\nGenre: Other, Minigames\nPlayers: 1-4\nRelease: 4th Quarter 2011\n\nDescription:\n------------\nMonopoly Deluxe includes two complete sets of Monopoly plus all new bonus content, all on one disc!\nMONOPOLY: The Monopoly video game makes the game accessible to players of all ages and skill levels. The feature multiplayer capabilities allowing up to four aspiring tycoons to play simultaneously. Additionally, players have the ability to open multiple previously unseen, game boards that each has a unique theme such as jungle, snowy ice and delectable desserts.\n\nMonopoly Streets: For the first time, players can experience Monopoly, one of the favorite brands in the world game of the family as a dynamic whole, world of the living, continually evolving to 3D action game. Monopoly Streets comes loaded with a series of imaginative twists, such as the ability to establish house rules where players can save their own set of custom rules tailored to your group of friends. In addition, players are able to create and play as your own Mii from Wii\n\n\nEspaÃƒÂ±ol:\n--------\nPlataforma: Nintendo Wii\nIdioma: Ingles, EspaÃƒÂ±ol, Frances, Italiano, Aleman\nRegion: PAL\nFormato: ISO\nDisponible en: Tiendas\nDesarrollador: EA Games\nDistribuidor: EA\nGÃƒÂ©nero: Otros, Minijuegos\nJugadores: 1-4\nLanzamiento: 4Ã‚Âº Trimestre de 2011\n\nDescripcion:\n-------------\nMonopoly Deluxe incluye dos juegos completos de Monopoly mÃƒÂ¡s todos los nuevos contenidos adicionales, todo ello en un disco!\nMONOPOLY: El videojuego Monopoly hace el juego accesible para jugadores de todas las edades y niveles de habilidad. La funciÃƒÂ³n de las capacidades de juego multijugador que permite hasta cuatro magnates que aspiran a jugar de forma simultÃƒÂ¡nea. AdemÃƒÂ¡s, los jugadores tienen la capacidad de abrir mÃƒÂºltiples nunca antes vistas, tableros de juego que cada uno lleva un tema ÃƒÂºnico, como la selva, el hielo cubierto de nieve y deliciosos postres.\n\nMonopoly Streets: Por primera vez, los jugadores pueden experimentar Monopoly, uno de los favoritos de las marcas de juego del mundo de la familia, como una totalidad dinÃƒÂ¡mica, mundo de los vivos, en 3D que evoluciona continuamente con la acciÃƒÂ³n del videojuego. Monopoly Streets viene cargado con una serie de giros imaginativos, tales como la capacidad de establecer reglas de la casa donde los jugadores pueden guardar su propio conjunto de reglas personalizadas adaptadas a su grupo de amigos. AdemÃƒÂ¡s, los jugadores son capaces de crear y jugar como su propio Mii de Wii\n","torrent":{"xt":"urn:btih:31d22271e3b6c41c86047f37839dcb380507b616","amp;dn":"Monopoly+Collection+%282011%29+%5BWii%5D%5BPAL%5D%5BMULTi5%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31d22271e3b6c41c86047f37839dcb380507b616","infoHashBuffer":{"type":"Buffer","data":[49,210,34,113,227,182,196,28,134,4,127,55,131,157,203,56,5,7,182,22]},"announce":[],"urlList":[]}}