{"title":"[Psx] Dino Crisis 2 [Pal/Ntsc]","uid":5142604,"size":351592182,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:31f69b4e5507f6338a4e40524d62c8559ec5f27e&amp;dn=%5BPsx%5D+Dino+Crisis+2+%5BPal%2FNtsc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Big_dude","files":-1,"time":1257027556,"description":"Dino Crisis 2 for the Ps1                                        Rel. 09/13/2000\n\n\nFormat:        CD-R PAL/NTSC Selector\nLang.:         English\nDiscs:         1\nImage:         MDS/MDF\nGenre.:        Action Adventure Horror\nRequirements:  Modded/Chipped Ps1 or Ps2, Breaker Pro Boot CD, \n               Psx Game Enhancer/Mod-Chip (Allows playing of backups) \n               or Psx Emulator. (You only need one of these methods).\n\n\nCompressed with WinRar, Game was tested and works.\nTry 7Zip its free Google it, If you don't have WinRar.\n\n\nNote: No Ps1 Backup/Game or copy will work unless you have a modded Ps1/Ps2, or if \n      you use a bootdisc like Breaker Pro. You can also use a Game Enchancer/Built-\n      in Mod-Chip which does the same as Breaker Pro expect you have to have any \n      original ps1 game loaded first (loads the boot code) then you swap in \n      your backup &amp; start the game. \n\n\nRelease Notes - This is Dino Crisis 2 for The Ps1, and pre-patched with pal/ntsc \n                selector from Paradox. When paradox screen pops up just press X \n                button for Pal or press O button for Ntsc.\n\n\n\nGame Description:\n\nThe research on the mysterious Third Energy is being continued in secret, but then an entire island with the facility conducting this research and a neighbouring town has vanished, moving back in time to the dinosaur era. A military unit is sent to the past to save the survivors and retrieve the research data. But nearly all soldiers are massacred by dinosaurs. You take control of Regina and Dylan, who managed to escape this fate. Now you must find the survivors, retrieve the data, and get back to your own time. \n\nDino Crisis 2 is a third-person action-adventure game, where you control the characters Dylan and Regina (switching from one to another at various points in the storyline). You will collect items and use them to solve puzzles while fighting the hordes of dinosaurs that inhabit the island. Much like Alone in the Dark, the game uses 3d models for characters, enemies and items and static 2D backgrounds for their surroundings. \n\nInitially, each character starts with a gun and a melee weapon, but more weapons, such as flamethrowers or rocket launchers, can be bought later in the game. The dinosaurs' attacks cause you to lose &quot;vitality&quot;, which can be restored using healing items. Sometimes an attack will cause you to bleed and thus slowly lose health; specific health items stop the bleeding. \n\nFor each killed dinosaur you receive &quot;Extinction Points&quot;. By killing a couple of dinos in quick succession, you activate a 'combo' and thus get more points. The points can be used in &quot;Save Shops&quot; throughout the game to buy weapons, ammo (and cartridge upgrades which allow you to store more ammo within the weapon), healing items and &quot;tools&quot; (such as armor, more powerful melee weapons, or &quot;cards&quot; which allow you to get bigger combos). You can also save the game at these points. \n\nWhile wandering around the island, you'll find many documents and letters to read, including &quot;Dino Files&quot;, which contain a flavor description of a dino species.\n\n\nGame Pics Included.\n\n\nBurn With Alcohol 120% (Included in Download).\n\n(Oops it appears that Alcohol 120% Installer is corrupt for this release, You can find Alcohol 120% + crack anywhere on the net or download my latest psx or downloads that have working version.)\n\nSet DataType to Playstation (Write Method Raw/Dao) and burn at 8x speed.\n\nUse Verbatim or Taiyo Yuden CD Media for best quality, or if other media isn't working.\n\n(No CD-RW will not work).\n\n\nAny Problems or Questions Please Post a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7 do your part and seed to keep the torrent healthy).\n\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:31f69b4e5507f6338a4e40524d62c8559ec5f27e","amp;dn":"%5BPsx%5D+Dino+Crisis+2+%5BPal%2FNtsc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31f69b4e5507f6338a4e40524d62c8559ec5f27e","infoHashBuffer":{"type":"Buffer","data":[49,246,155,78,85,7,246,51,138,78,64,82,77,98,200,85,158,197,242,126]},"announce":[],"urlList":[]}}