{"title":"Native Americans: American History: An Overview of","uid":14600056,"size":102425,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:31f6f11125fefc3f84115ac1df69c33e63f254a0&amp;dn=Native+Americans%3A+American+History%3A+An+Overview+of&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1463022555,"description":"Native Americans: American History: An Overview of &quot;Native American History&quot; - Your Guide To: Native People, Indians, &amp; Indian History (North American ... Indian Wars, Native American Culture)\r\n\r\n\r\nExplore the Fascinating History of Native Americans!\r\n\r\nAre you fascinated by the Indians and the real American History? Have you always wondered how these people actually lived and still live? Do you want to know how the Indians came to America in the first place?\r\n\r\nWith this book Native Americans - American History: An Overview of &quot;Native American History&quot; - Your Guide To: Native People, Indians, &amp; Indian History, you'll learn about Native American culture and traditions. You will also find out some of the notable Native Americans in US history.\r\n\r\nIn Native Americans, you’ll learn more about how the history of the Native American people is full of tears resulting from the mistreatment they suffered under foreign invaders. It was quite sad to learn that even though they got here first, the European colonizers treated them as if they were insurgents. In this book, you will learn about some of the most horrifying things that the Native Americans had to go through during the early years of America. \r\nI will also present to you a list of fun and interesting things you probably didn’t know about Native American people! \r\nAlthough people once regarded them as savages, history has proven that the Native Americans were more than just civilized; they also had an intricate and interesting history and a culture that is uniquely their own","torrent":{"xt":"urn:btih:31f6f11125fefc3f84115ac1df69c33e63f254a0","amp;dn":"Native+Americans%3A+American+History%3A+An+Overview+of","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31f6f11125fefc3f84115ac1df69c33e63f254a0","infoHashBuffer":{"type":"Buffer","data":[49,246,241,17,37,254,252,63,132,17,90,193,223,105,195,62,99,242,84,160]},"announce":[],"urlList":[]}}