{"title":"Sister Wendys American Masterpieces (DK Art Ebook).pdf","uid":10555229,"size":25727146,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:328994fc4e7fbdb2a3120835831092d1c39d3fd4&amp;dn=Sister+Wendys+American+Masterpieces+%28DK+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1405381705,"description":"Pdf / english / 128 pages / 2001 / 24 MB\n\nAn unsurpassed anthology of paintings by a remarkable collection of artists. One of the world's best-loved art historians, Sister Wendy Beckett combines her considerable knowledge of art history and modern art with her unique powers of observation to create an unrivaled personal anthology of over 115 of the greatest masterpieces in American painting. From Albers and Audubon to Warhol and Wyeth, the artists are arranged alphabetically, each represented by one or two key works. Homegrown American favorites, such as Homer and Hopper, are presented alongside pioneering Europeans who became active in the US, including Duchamp, Hockney, and De Kooning, to create a striking juxtaposition of artistic styles and achievements. Illuminating Insights include: White Flag by Jaspar Johns, Early Sunday Morning by Edward Hopper, Blue Poles: No. II by Jackson Pollock and M-Maybe (A Girl's Picture) by Roy Lichtenstein are among the icons of American art featured in this broad-ranging collection. Sister Wendy Beckett offers fresh insights into even the most famous paintings, superbly chronicling the key movements, developments, and artists in the history of American paintings.","torrent":{"xt":"urn:btih:328994fc4e7fbdb2a3120835831092d1c39d3fd4","amp;dn":"Sister+Wendys+American+Masterpieces+%28DK+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"328994fc4e7fbdb2a3120835831092d1c39d3fd4","infoHashBuffer":{"type":"Buffer","data":[50,137,148,252,78,127,189,178,163,18,8,53,131,16,146,209,195,157,63,212]},"announce":[],"urlList":[]}}