{"title":"The Francis Hancock Mystery Collection - Barbara Nadel","uid":11701379,"size":795456309,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:32a55fdc8b4d9c351159469db875785ac39704cc&amp;dn=The+Francis+Hancock+Mystery+Collection+-+Barbara+Nadel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"davieboy1966","files":35,"time":1423931359,"description":"Audio Books : Mystery and Suspense : Other quality : English\n\n\nAll from CD. 48 kbps / 44 kHz Mono, Fraunhofer CBR MP3.\nAll are narrated by Martyn Read.\n\n\n\n\nThis excellent crime series is set in West Ham in the East End of London during The Blitz (1940) and features undertaker Francis Hancock, a half-Indian shell-shocked Great War veteran.\n\nBarbara Nadel's sense of time and place is outstanding. We really do experience something of what it was like to live through those terrifying days of the London Blitz, and the mysteries themselves are good also.\n\nThe sympathetic portrayal of the lives and customs of the people rings true, and all in all this is a most satisfying mystery series.\n\nMartyn Read's narration is heart-felt and compelling.\n\nThe dedication by the author reads: &quot;To all of those whose minds have been taken by war&quot;\nBackground information: http://en.wikipedia.org/wiki/The_Blitz\n\n#1. Last Rights (2005). [10 hrs 29 mins]\nIt is 1940 and London is suffering nightly bombardments by enemy bombs. An undertaker in West Ham - Francis Hancock - is so traumatised by his WWI experiences in the trenches that he can't seek the relative safety of the Anderson shelter and he is compelled to run through the empty streets whilst London explodes around him. One night he encounters a man who seems like him - disoriented and screaming. Another shell-shocked veteran? But this man says he has been stabbed...two days later he arrives in Francis's funeral parlour - Dead! So starts this intriguing and absorbing mystery that takes us through the wartime streets of East London and introduces us to the characters that abounded in the Jewish and Gentile communities, the ordinary people, the thugs, the hookers - good and bad. A great read from beginning to end - highly recommended (M.Cate)\n\n#2. After the Mourning (2006). [7 hrs 8 mins]\nIt is East London during the Blitz, October 1940 and undertaker Francis Hancock is called out to Epping Forest to attend to the corpse of a young gypsy girl who has died suddenly. At the wake, a gypsy named Lily claims to see a vision of the 'Blessed Virgin'. Meanwhile the Military Police are looking for a German gypsy - Martin Stojka - who they believe is a Nazi spy. Then Lily is found murdered. Could it be a crime of passion or cold blooded murder? Is Martin Stojka who he says he is? There is someone lurking in the shadows who will stop at nothing to find what Martin has in his possession...\n\n#3. Ashes to Ashes (2008). [7 hrs 49 mins]\nIt's the 29th December 1940, the night that Hitler has chosen to destroy London under a barrage of flaming incendiary bombs. Their main target - St Paul's cathedral - is where Francis Hancock is sheltering from the onslaught. But the First World War veteran doesn't just have bombs to contend with on this night. A young girl, who was also sheltering in the cathedral, mysteriously goes missing. Then some of those charged with protecting the building are brutally murdered. Francis must face both his own demons and fears in his struggle to catch those responsible and bring them to justice....\n\n#4. Sure and Certain Death (2009). [8 hrs 51 mins] (thanks to meixiang)\nLondon, 1941: Francis Hancock finds the brutally murdered, partially eviscerated body of a woman in a derelict house in Plaistow. Francis' sister, Nancy, knew the victim. Then, shockingly, two more murders follow; again, the victims are female, and also eviscerated. Rumours start to spread through the East End about a modern day Jack the Ripper. When a fourth woman is murdered, Nancy finally admits that she knew all of the victims. They were all White Feather Girls during the First World War; women who spent their time giving any man out of uniform a white feather as a sign of cowardice. Francis is appalled to discover she was involved in such a thing. But, now terrified that his sister might also be murdered, he sets out to find the killer and discovers a trail of murderous resentment that go back decades! \n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:32a55fdc8b4d9c351159469db875785ac39704cc","amp;dn":"The+Francis+Hancock+Mystery+Collection+-+Barbara+Nadel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32a55fdc8b4d9c351159469db875785ac39704cc","infoHashBuffer":{"type":"Buffer","data":[50,165,95,220,139,77,156,53,17,89,70,157,184,117,120,90,195,151,4,204]},"announce":[],"urlList":[]}}