{"title":"Seinfeld S04E11 - The Contest.avi","uid":5438609,"size":183545856,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:32f6080da1e94f0695b967b118b618a60921972d&amp;dn=Seinfeld+S04E11+-+The+Contest.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"stjimmy456","files":1,"time":1268812362,"description":"&quot;The Contest&quot;\nSeinfeld episode\nEpisode no.\tSeason 4\nEpisode 11\n(#51 overall)\nWritten by\tLarry David\nDirected by\tTom Cherones\nOriginal airdate\tNovember 18, 1992\n\n\n&quot;The Contest&quot; was the 51st episode of the NBC sitcom, Seinfeld. The eleventh episode of the fourth season, it aired on November 18, 1992. In the episode, George Costanza tells Jerry Seinfeld, Elaine Benes and Cosmo Kramer that his mother caught him unaware while he was masturbating. The conversation results in George, Jerry, Elaine and Kramer entering into a contest to determine who can go for the longest period of time without masturbating.\n\nThe episode was controversial when broadcast because NBC thought that masturbation was not a topic suitable for prime time television. As a result, the word &quot;masturbation&quot; is never used in the episode. \n\nInstead, the subject is described using a series of euphemisms, while the meaning of the subject is still made clear to the audience. The writer of the episode, Larry David, won the Primetime Emmy Award for Outstanding Individual Achievement in Writing in a Comedy Series for his work on the episode. \n\nOne euphemism used in the episode is &quot;master of my domain,&quot; said by a character when still in the contest. It has become a catchphrase in popular culture, although it is not always used in reference to masturbation.\n\n\n\n\n\n________\n________\n\n\n\n\n\n\nNot uploaded a torrent in years, so here's hoping I've done it right. I was wanting to download this single episode of Seinfeld the other week and couldn't find a torrent - so I had to download an entire Season 4 torrent (which is where this file is from) and delete the episodes I didn't want.\n\nHere's hoping someone else will one day feel the urge to watch this great episode ! And hopefully you'll find this torrent !","torrent":{"xt":"urn:btih:32f6080da1e94f0695b967b118b618a60921972d","amp;dn":"Seinfeld+S04E11+-+The+Contest.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32f6080da1e94f0695b967b118b618a60921972d","infoHashBuffer":{"type":"Buffer","data":[50,246,8,13,161,233,79,6,149,185,103,177,24,182,24,166,9,33,151,45]},"announce":[],"urlList":[]}}