{"title":"Les Claypool - Purple Onion","uid":3749020,"size":81412983,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:334f8682eed86f21d4f7cf8bf51c5531377d6e5c&amp;dn=Les+Claypool+-+Purple+Onion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"diablofn","files":12,"time":1185067712,"description":"320 kb/s rip\n\nTuesday, September 24, the first ever Les Claypool Frog Brigade studio recording, Les&amp;#039; first all original solo project since Primus, &quot;The Les Claypool Frog Brigade-Purple Onion&quot; will be in stores everywhere.\n\nCd includes a free poster.\n\nThe track list:\n\nPurple Onion\nDavid Makalaster\nBuzzards of Green Hill (featuring Warren Haynes)\nLong In The Tooth Whamola (with Fish Fisher of Fishbone)\nDing Dang\nBarrington Hall\nD&amp;#039;s Diner (with Fish and Norwood Fisher, Lonnie Marshall)\nLights In The Sky\nUp On The Roof\nDavid Makalaster II\nCosmic Highway\n\nThe album&amp;#039;s 12 all-new songs are sometimes light, sometimes dark, lyrically thought provoking, and rhythmically compelling. While the Brigade regulars are consistent on much of the record (eenor, Skerik, and new percussionist Mike &quot;Tree Frog&quot; Dillon), many special guests grace the album as well. &quot;D&amp;#039;s Diner&quot; features sitar player Gabby Lang in addition to the triple-bass onslaught of Claypool, Norwood Fisher (Fishbone) and Lonnie Marshall (Weapon of Choice). Warren Haynes (Allman Brothers, GovÃ‚Â¹t Mule, Phil Lesh) handles guitar on the psychedelic hillbilly stomp of &quot;Buzzards of Green Hill&quot; and Fish Fisher (Fishbone drummer) guests on &quot;Whamola,&quot; a live show staple named after the unique instrument Les employs -- a one-string bass played with a drumstick. Those in the know will recognize the references in &quot;Barrington Hall,&quot; named after a Berkeley dorm and series of parties immortalized on Primus&amp;#039; &quot;Frizzle Fry,&quot; which was reissued earlier this year. Original Frog drummer Jay Lane (Ratdog, Sausage) appears on four songs, while Bay Area monster Dean Johnson also makes an appearance.\n","torrent":{"xt":"urn:btih:334f8682eed86f21d4f7cf8bf51c5531377d6e5c","amp;dn":"Les+Claypool+-+Purple+Onion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"334f8682eed86f21d4f7cf8bf51c5531377d6e5c","infoHashBuffer":{"type":"Buffer","data":[51,79,134,130,238,216,111,33,212,247,207,139,245,28,85,49,55,125,110,92]},"announce":[],"urlList":[]}}