{"title":"Bumfights 1-4","uid":4956256,"size":2608201246,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3370c48eb815e534a8fa52dbc50eee924b721afd&amp;dn=Bumfights+1-4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"lordgafal","files":14,"time":1245116162,"description":"IF YOU ENJOY THIS BUY THE PRODUCT : )\nPLEASE SEED YOUR 1:1\n\nthank you very much\n\nenjoy !!\nPeace on earth (and more porn)\n\n\nBumfights 1-4\n\n\nBumfights is a film series created by Indecline Films. The videos feature homeless men in the San Diego and Las Vegas metropolitan areas fighting and attempting amateur stunts in exchange for money, alcohol, and other incentives. The first video, Bumfights: A Cause for Concern, was produced by Ryen McPherson, with friends Zachary Bubeck, Daniel J. Tanner, and Michael Slyman, as Indecline Films. Shortly after sales began to escalate, Indecline Films sold the rights to two investors,who went on to produce three sequels.\n\nThe videos immediately gained criticism from mainstream organizations. The US-based National Coalition for the Homeless (NCH) has stated that the Bumfights videos disseminate hate against the homeless and dehumanize them. In April 2006, the four original filmmakers agreed not to produce any more &quot;Bumfights&quot; videos or distribute videos already made, and to pay three homeless men depicted in the videos, under a settlement announced as a lawsuit was to go to trial.\n\n# Bumfights: A Cause for Concern (2002)\n# Bumfights 2: Bumlife (2003)\n# Bumfights 3: The Felony Footage (2004)\n# Bumfights 4: Return Of Ruckus (2006)\n\nControversies\n\nThe videos have proven to be highly controversial. They have been banned in a number of countries including England, Scotland, Northern Ireland and Canada, and most traditional retail outlets have refused their sale.The popular internet auction site eBay routinely cancels listings which contain copies of the video, citing their policy which prohibits the sale of materials which promote or glorify violence.  In the state of California, both felony and misdemeanor charges were filed against the producers, as well as civil lawsuits; in 2005, the producers were sentenced to six months in prison for having failed to complete the community service to which they had previously been sentenced.The filmmakers maintain that the production of the video was a mutually beneficial arrangement and that the homeless people depicted freely chose to participate.\n\nThe films have likewise been blamed for inspiring a number of violent teenage attacks on the homeless, both in the United States and other countries. A group of suburban Nevada teenagers, who took on the moniker &quot;311 Boyz&quot;, also faced criminal charges, including attempted murder, after filming several violent exploits inspired by Bumfights. The suspects attempted to make a profitable video by instigating fights around their neighborhoods, in some instances imposing on unwilling participants.\n\nEnd of distribution\n\nThe courts involved in the lawsuits surrounding the Bumfights producers enforced the barring of further installments being produced, and stopped sales of videos already made. As a result, Bumfights videos were rendered available through illegal means only.\n\n\n Indecline\n\nRyen McPherson, who sold the rights to Bumfights after only the first installment, moved on to produce a similar reality video called Indecline: Volume One - It's Worse Than You Think.  Though controversial for its fight footage and acts of elaborate graffiti art, legal troubles did not hinder the sales of this video, although the website went offline in June 2008. The indecline web site went back online on November 2008. \n\nIndecline also acted as a record label for a few underground acts, most notably the abstract hip-hop duo Ninth Cloud.","torrent":{"xt":"urn:btih:3370c48eb815e534a8fa52dbc50eee924b721afd","amp;dn":"Bumfights+1-4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3370c48eb815e534a8fa52dbc50eee924b721afd","infoHashBuffer":{"type":"Buffer","data":[51,112,196,142,184,21,229,52,168,250,82,219,197,14,238,146,75,114,26,253]},"announce":[],"urlList":[]}}