{"title":"Railworks TS2015 DTG München - Rosenheim + DB BR 152 ","uid":12201626,"size":854781068,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3464cd7e420b0c4ae2a1e3115f38614522ec9c7f&amp;dn=Railworks+TS2015+DTG+M%26uuml%3Bnchen+-+Rosenheim+%2B+DB+BR+152+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"TS2015","files":1,"time":1438845831,"description":"The Munich to Rosenheim route through Germany serves as one of the most important cross-border lines to Austria, and this beautifully scenic route is now available for Train Simulator. \n\nBuilt between 1860 and 1871, initially as a single-track route into Austria from Germany, the line was increased to two tracks and formed the main line trunk between Austria and Germany, connecting the German city of Munich to the Austrian cities of Vienna and Salzburg. The line became an important connection between the two countries, which increased its popularity as a key corridor of the Trans-Europ Express and Orient Express. \n\nBy 1914, there were as many as 50 trains a day traversing the route, although wartime restrictions saw traffic severely limited due to coal shortages and slower military trains. The line soon returned to full traffic capacity, and today is served by many trains to all parts of Germany and Austria. \n\nThe scenic route sees a mixture of urban landscapes and rural countryside served by Taurus-hauled express trains and regional Taurus 2 and BR 423 multiple units, with Munich serving as the hub for S-Bahn S4 trains to Grafing Bahnhof and main line services to Rosenheim. \n\nThe 64km (40 mile) section of the Munich to Rosenheim railway for Train Simulator includes a DB BR 423 multiple unit for S-Bahn services and a DB BR 101 with RE passenger stock for main line express services. \n\nThe route is also fully fitted with German signalling and safety systems, including SIFA, PZB and LZB signalling, and AFB train power control.\n\n\n\nNOTE THIS ONLY WORKS ON PIRATED VERSION OF TRAIN SIMULATOR 2015","torrent":{"xt":"urn:btih:3464cd7e420b0c4ae2a1e3115f38614522ec9c7f","amp;dn":"Railworks+TS2015+DTG+M%26uuml%3Bnchen+-+Rosenheim+%2B+DB+BR+152+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3464cd7e420b0c4ae2a1e3115f38614522ec9c7f","infoHashBuffer":{"type":"Buffer","data":[52,100,205,126,66,11,12,74,226,161,227,17,95,56,97,69,34,236,156,127]},"announce":[],"urlList":[]}}