{"title":"Escanaba In Da Moonlight.avi","uid":4118901,"size":1181014102,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3477ae2890e5a574721c682961a43063448b366f&amp;dn=Escanaba+In+Da+Moonlight.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"guitarrpp","files":1,"time":1207444293,"description":"Escanaba in da Moonlight (&quot;da&quot; is Yooper for &quot;the&quot;) is a 2001 movie starring Jeff Daniels. It&amp;#039;s a comedy about hunting and hunting traditions. It&amp;#039;s set (and filmed) in the Escanaba, Michigan area. The movie is the film adaptation of the play of the same name, which premiered at Jeff Daniels&amp;#039; Purple Rose Theatre in Chelsea, Michigan.\n\nIn it, Reuben Soady, played by Daniels, goes to the hunting camp cottage, otherwise known as deer camp, with his father Albert (played by Harve Presnell), brother Remnar (Joey Albright) and Jimmy &quot;the Jimmer&quot; Negamanee from Menominee (Wayne David Parker). If Reuben, now 42, doesn&amp;#039;t manage to shoot a buck by the end of the season, he will become the oldest Soady in history not to have achieved this task. This is so taboo in the area that he has become the town outcast, and people run away from him in what appears to be fear.\n\nDeviating from their traditional customs, he instead takes advice from his Native American wife, Wolf Moon Dance (Kimberly Norris), including a drink made with moose testicles, and gets protection from the &quot;evil spirits&quot; with &quot;porcupine piss&quot;. After various unexplainable phenomena, they meet a DNR officer, Tom T. Treado (Randall Godwin), who claims to have literally seen God on the ridge.\n\nAt various times, Reuben, &quot;the Jimmer&quot;, and ranger Tom all get possessed by spirits. Eventually, Reuben runs out into the cold wearing only his long underwear and a hat, climbs a tall cliff, and finds himself face-to-face with his dead great-grandfather, Alphonse. His great-grandfather explains that a &quot;bearwalk&quot;, a Native-American legend, has become a buck just for Reuben.\n\nAfter some encouragement, Reuben manages to shoot the buck, and his great-grandfather&amp;#039;s hand on his shoulder becomes instead the hand of his father. Finally, after so many hunting seasons of failure, he finally says with pride: &quot;Put on the lard and onions, honey. I&amp;#039;m gonna gut you a buck.&quot;\n","torrent":{"xt":"urn:btih:3477ae2890e5a574721c682961a43063448b366f","amp;dn":"Escanaba+In+Da+Moonlight.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3477ae2890e5a574721c682961a43063448b366f","infoHashBuffer":{"type":"Buffer","data":[52,119,174,40,144,229,165,116,114,28,104,41,97,164,48,99,68,139,54,111]},"announce":[],"urlList":[]}}