{"title":"Sinn's Natural Attraction","uid":5313417,"size":476314932,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:352eb0eb81caa685136be9c467affa5f1806795d&amp;dn=Sinn%5C%27s+Natural+Attraction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ipodps3","files":10,"time":1264628296,"description":"The Real Secrets of Natural Attraction DVD\n\nA Step - by - Step System for Creation Natural Attraction At Will\n\n-- The Real Secrets of Natural Attraction Dvd\nThis killer Dvd is definitely the main course of this package. It will help you accelerate whatever your goals are when it comes to success with women.  Because as you probably know by now, you're not going to get anywhere with the ladies if you don't know how to create attraction.\n\nI suggest you work on each of the different components one by one.  You're not going to be able to apply them all at once so don't put all that pressure on yourself.\n\nWork on implementing the stuff in the Dvd not just when talking to girls, but wherever you find yourself.  Eventually, you're going to be able to attract incredibly beautiful women without even thinking about it.\n\n-- The Lay Reports Book: Revised and Updated Edition\nThe Lay Reports Book is the perfect complement to the Dvd because it gives you the actual context and actual dialouge of dozens of succesful seductions.\n\nOnce you know how to create attraction at will, you're going to need a road map for turning that attraction into seduction success. The Book provides that roadmap.  Depending on your goals, be it getting good at dates, same night lays, day game, threesomes, etc, The Lay Reports Book will give you step by step systems for succeeding in all these areas.\n\n-- Approach Anxiety and Sexual Escalation\nThese two audios focus on two of the most common sticking points for a lot of guys.  If you're having issueswith either of these, these seminars will help you easily blast through those sticking points.\n\n \n\nDigital torrent only lol","torrent":{"xt":"urn:btih:352eb0eb81caa685136be9c467affa5f1806795d","amp;dn":"Sinn%5C%27s+Natural+Attraction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"352eb0eb81caa685136be9c467affa5f1806795d","infoHashBuffer":{"type":"Buffer","data":[53,46,176,235,129,202,166,133,19,107,233,196,103,175,250,95,24,6,121,93]},"announce":[],"urlList":[]}}