{"title":"An Applied Guide to Process and Plant Design - Sean Moran","uid":12106563,"size":12732096,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:35bde43fe982072d0c4c83e838ae0b895852f946&amp;dn=An+Applied+Guide+to+Process+and+Plant+Design+-+Sean+Moran&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"clouderone","files":1,"time":1436463235,"description":"An Applied Guide to Process and Plant Design - Sean Moran (Elsevier Butterworth-Heinemann, 2015).pdf\n\nISBN 9780128002421\n\nAn Applied Guide to Process and Plant Design is a guide to process plant design for both students and professional engineers.\n\nThe book covers plant layout and the use of spreadsheet programmes and key drawings produced by professional engineers as aids to design; subjects which are usually learned on the job rather than in education. You will learn how to produce smarter plant design through the use of computer tools, including Excel and AutoCAD, &quot;What If Analysis&quot;, statistical tools, and Visual Basic for more complex problems. The book also includes a wealth of selection tables, covering the key aspects of professional plant design which engineering students and early-career engineers tend to find most challenging.\n\nProfessor Moran draws on over 20 years' experience in process design to create an essential foundational book ideal for those who are new to process design, compliant with both professional practice and the IChemE degree accreditation guidelines.\n\nExplains how to deliver a process design that meets both business and safety criteria\nCovers plant layout and the use of spreadsheet programmes and key drawings as aids to design\nIncludes a comprehensive set of selection tables, covering those aspects of professional plant design which early-career designers find most challenging","torrent":{"xt":"urn:btih:35bde43fe982072d0c4c83e838ae0b895852f946","amp;dn":"An+Applied+Guide+to+Process+and+Plant+Design+-+Sean+Moran","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35bde43fe982072d0c4c83e838ae0b895852f946","infoHashBuffer":{"type":"Buffer","data":[53,189,228,63,233,130,7,45,12,76,131,232,56,174,11,137,88,82,249,70]},"announce":[],"urlList":[]}}