{"title":"Boards that Deliver - Ram Charan [PDF] [Qwerty80]","uid":8016959,"size":1980218,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:367155df9a63dfae04cbe5bb710829a7f2b30907&amp;dn=Boards+that+Deliver+-+Ram+Charan+%5BPDF%5D+%5BQwerty80%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"KatQwerty","files":3,"time":1358121526,"description":" \n[b]Publication Date: February 3, 2005 | PDF [/b]\n \n  \n \nFinally, a book that brings the vision of truly good governance down to earth. Ram Charan, expert in corporate governance and best-selling author, packs this book with useful tools and techniques to take boards and their companies to a higher level of performance. Charan puts his finger on a growing problem for boards: the disconnect between directors' efforts and their results. The added time and attention boards invest is not translating into better governance???that is, governance that adds value to the business.\n \nBoards That Deliver gets beyond the rhetoric of corporate governance reform. It captures the tried-and-true practices used by high-performance boards. In contrast to experts who base prescriptions on number-crunching exercises, Charan identifies the real problems that drain directors' time and suppress their best judgments???and explains clearly and succinctly how boards can solve those problems. These battle-tested solutions help boards achieve what rules and regulations alone cannot???to get succession right, refine a winning strategy, and design a rational CEO compensation package.\n \nGood governance requires leadership. Boards That Deliver is the no-nonsense guide for directors and CEOs who are rising to the leadership challenge to make their boards a competitive advantage.\n \n \n \n \n ","torrent":{"xt":"urn:btih:367155df9a63dfae04cbe5bb710829a7f2b30907","amp;dn":"Boards+that+Deliver+-+Ram+Charan+%5BPDF%5D+%5BQwerty80%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"367155df9a63dfae04cbe5bb710829a7f2b30907","infoHashBuffer":{"type":"Buffer","data":[54,113,85,223,154,99,223,174,4,203,229,187,113,8,41,167,242,179,9,7]},"announce":[],"urlList":[]}}