{"title":"Stryper - discography","uid":3508831,"size":379180127,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:36b13464331d5532c11f3d6002685579d6307f7c&amp;dn=Stryper+-+discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"odocon","files":71,"time":1154346752,"description":"STRYPER (80&amp;#039;s Hard Rock / Metal) (Good Stuff Maynard!!!!!!!!!!!!!)\n\nEven though The Review is For REBORN i dont have that album here! \n\nYou Get\nSoldiers Under Command\nAgainst The Law\nTo Hell With The Devil\nStryper\n\nAll Artwork Included\nAll Ripped at 256\n\n\n\nAfter a 13-year sabbatical in studio albums, Stryper - the rockers who paved the way for Christian rock music - is back with a new album, new tour, and a new bass player, but with the same goals, beliefs, and ability to kick ass even though singing about God. Stryper still, after two decades in existence, not only proves that Christian heavy metal is hardly an oxymoron, but that despite what they&amp;#039;re singing about - they&amp;#039;re musically and vocally contenders among the best in rock and roll. \nIn support of their new album and tour - both aptly named Reborn - the Stryper guys blew into the Windy City on October 9 to rock the House of Blues. \n\nOpening band, Subseven, got the crowd worked up with their exuberance despite the fact that the crowd was anxious for Stryper to hit the stage. Shiny-new and youthful, the Subseven guys rocked the audience with their poppy-punkish tunes and looked like they were having a blast the entire time; doing just what a live band should do. \n\nThen Stryper came on out - and despite having toned down their yellow and black regalia since the early 90&amp;#039;s, I&amp;#039;d instantly felt as if I&amp;#039;d stepped into a time machine. Other than the new songs thrown into the set and breathing a new and contemporary life into the band, Stryper not only sounded just as amazing as they used to live, but they sounded just as good as they have on record...not an easy feat which most bands seem to prove once they hit the road. \n\nThose 13 years since their last record, and probably 15 years since I&amp;#039;d seen them live, all just seemed to slip away. Accentuating the time-travel effect and much to the audience&amp;#039;s delight, the band performed all their biggest hits chronologically creating a groove down memory lane from the beginning to today. \n\nFront man, Michael Sweet, effortlessly demonstrated his unrelenting vocal power that hasn&amp;#039;t lost an iota of its oomph over the years. The other Sweet of the band, drummer and bible-tosser Robert Sweet, bashed away while seeming entranced by the audience and the energy flowing back and forth between the band and fans. Guitarist Oz Fox - the quintessential heavy metal axe-man - jammed away with authority, and then bantered between songs like with tidbits of what each band members&amp;#039; favorites drinks are Starbucks. And newcomer, bassist Tracy Ferrie - who&amp;#039;s been credited with revitalizing the band - couldn&amp;#039;t have fit in any better than if he&amp;#039;d been present throughout their entire history. \n\nWhen Michael Sweet announced that the band is officially back together, cheers of glee broke out - proving that though in the heavy metal genre Stryper might still be considered an oddity, but they&amp;#039;re a much needed and rare source of both rocking and uplifting music. \n\nWith a prayer said by Michael Sweet over an audience where one could hear a pin drop, and some information about The Hope Initiative - a program Stryper is supporting which has been put in place to help the families and communities that have been devastated by the global HIV/AIDS pandemic, the show unfortunately came to an end - but not without satisfying the rock and roll needs of everyone in the house. \n\nNow reformed and &amp;#039;Reborn,&amp;#039; here&amp;#039;s hoping for another twenty years of Stryper music, and another Chicago show really, really soon.\n","torrent":{"xt":"urn:btih:36b13464331d5532c11f3d6002685579d6307f7c","amp;dn":"Stryper+-+discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36b13464331d5532c11f3d6002685579d6307f7c","infoHashBuffer":{"type":"Buffer","data":[54,177,52,100,51,29,85,50,193,31,61,96,2,104,85,121,214,48,127,124]},"announce":[],"urlList":[]}}