{"title":"Tackhead Sound System - Tackhead Tape Time - (Vinyl Rip) - Flac","uid":7105646,"size":213900589,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:36d5f3a84e9f70a54fc7ef5616d698a546071a24&amp;dn=Tackhead+Sound+System+-+Tackhead+Tape+Time+-+%28Vinyl+Rip%29+-+Flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":2,"time":1331859934,"description":"Gary Clail's Tackhead Sound System - Tackhead Tape Time (Vinyl Rip)\n\nVinyl Details:\n\nLabel: FunfUndVierzig - EFA LP 4529 08\nCountry: Europe\nReleased: 1988\n\nSide 1:\n\n01 Mind At The End Of The Tether\n02 Half Cut Again\n03 Reality\n04 M.O.V.E\n\nSide 2:\n\n01 Hard Left\n02 Get This\n03 Man In A Suitcase\n04 What's My Mission Now? (Fight The Devil)\n\nSide 1 - 16.32 mins\n\nSide 2 - 19.26 mins \n\nVinyl ripped at: 16 bit 44,100 Hz\n\nFormat: Flac\nSize: 220MB\n\n\nTackhead:\n\nDoug Wimbish is a bass player, primarily known for his studio work for the rap and hip hop label Sugarhill Records and his membership of the rock band Living Colour. He has played for a vast range of artists, including Jeff Beck, Mick Jagger, Madonna, George Clinton, Paula Cole, Bomb the Bass, Depeche Mode, Joe Satriani, Mos Def and Tarja Turunen. Wimbish is considered to be a pioneer in hip hop bass playing and in the use of bass effects, alternate tunings and extended hand techniques.\n\n\nLittle Axe is the stage name of Skip McDonald. An American blues musician. McDonald played jazz, doo-wop, and gospel when young, and moved to New York as a teenager with his band of friends, called The Entertainers. Axe joined the group Wood Brass &amp; Steel in 1973 with bassist Doug Wimbish and drummer Harold Sargent; the group recorded two albums before their 1979 breakup. Axe then became one of the members of the house band for Sugarhill Records and appeared as guitarist on many early rap albums, including The Message by Grandmaster Flash and The Furious Five.\n\n\nAdrian Sherwood is an English record producer, best known for his work with dub music as well as for remixing a number of popular acts such as Coldcut, Depeche Mode, The Woodentops, Primal Scream, Pop Will Eat Itself, Sinead O'Connor, and Skinny Puppy. Within his role as a record producer, he has worked with a variety of record labels, however his most well-known label is On-U Sound Records. Sherwood has been a member of the band Tackhead.\n\n\nGary Clail is an English singer and record producer. He was part of On-U Sound Records (and also the On-U Sound System) and led Gary Clails Tackhead Sound System.\n\n\nKeith Leblanc is an American drummer and record producer, and is a member of the bands Little Axe and Tackhead. His record, Malcolm X: No Sell Out, was one of the first sample based releases. His career started out on Sugar Hill Records recording with rap pioneers, Grandmaster Flash and Melle Melle. ","torrent":{"xt":"urn:btih:36d5f3a84e9f70a54fc7ef5616d698a546071a24","amp;dn":"Tackhead+Sound+System+-+Tackhead+Tape+Time+-+%28Vinyl+Rip%29+-+Flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36d5f3a84e9f70a54fc7ef5616d698a546071a24","infoHashBuffer":{"type":"Buffer","data":[54,213,243,168,78,159,112,165,79,199,239,86,22,214,152,165,70,7,26,36]},"announce":[],"urlList":[]}}