{"title":"Down- Down II + NOLA","uid":3730577,"size":178203523,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:370a0d8521f71106d10a48d85286f7525412209c&amp;dn=Down-+Down+II+%2B+NOLA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Chozz","files":31,"time":1183391387,"description":"Â·  1 History \nÂ·\t1.1 NOLA (1991-1995)\nÂ·\t1.2 Down II (2001-2002)\nÂ·\t1.3 Down III (2006-Present)\nÂ·  2 Band members \nÂ·\t2.1 Former members\nÂ·  3 Discography \nÂ·\t3.1 Albums\nÂ·\t3.2 Singles\nÂ·\t3.3 Music videos\n\nDown is an American southern heavy metal supergroup formed in 1991. The band is composed of Phil Anselmo (ex-Pantera and Superjoint Ritual vocalist), Pepper Keenan (Corrosion of Conformity guitarist and vocalist), Kirk Windstein (Crowbar guitarist and vocalist), Rex Brown (ex-Pantera bassist), and Jimmy Bower (Crowbar drummer; Superjoint Ritual and Eyehategod guitarist).\n\nHistory\n\nNOLA (1991-1995)\nThe first release was NOLA (for New Orleans, Louisiana) in 1995, an album combining the typical New Orleans &quot;sludge doom&quot; sound with distinct blues and country overtones. A short tour of 13 dates was undertaken shortly after the album&amp;#039;s release. Following the tour, Down was put on hold to allow its members to return to their respective bands.\nDown II (2001-2002)\nThe band regrouped in 2001 to record the more diverse album entitled Down II: A Bustle in Your Hedgerow. The line-up was the same, apart from the replacement of Todd Strange with Rex Brown as bass player. Another tour was undertaken, both on their own and as part of Ozzfest in the summer of 2002. The band was then once more put on hold, as lead singer Anselmo wished to focus his efforts on Superjoint Ritual, which also featured Bower on guitar.\nDown III (2006-Present)\nDown are in the process of writing and recording a new studio album, currently referred to as Down III. Pepper Keenan has recently stated that the band have finished writing the new album&amp;#039;s material and are due to record it in February. The band have numerous acoustic songs written and have some material recorded. The band are looking at an end of summer release. Anselmo is understood to be one of the driving forces behind the new album and is quoted as saying &quot;I want my band back&quot;, in reference to Down. In a recent statement from bassist Rex Brown, Down will be re-releasing their debut album NOLA with Rex playing the bass tracks. He has also stated that both Down albums are going to be remastered and re-released[1].\nAlong with Megadeth, Down will be opening for Heaven and Hell on their upcoming Canadian tour. The latter band features members of Black Sabbath starting with a show in Vancouver, BC on March 11 2007 [2]. Down&amp;#039;s March 13th set in Edmonton as well as every subsequent show were cancelled last minute as Phil developed Strep Throat, much to the dissapproval of fans hoping to see them. The band has stated that they will be returning for &quot;make-up&quot;. Down rejoined the tour on 20 March at Sault Ste. Marie&amp;#039;s Steelback Centre.\nBand members\nÂ·\tPhil Anselmo - Vocals\nÂ·\tPepper Keenan - Guitar\nÂ·\tKirk Windstein - Guitar\nÂ·\tRex Brown - Bass\nÂ·\tJimmy Bower - Drums\nFormer members\nÂ·\tTodd Strange - Bass\nDiscography\nAlbums\nÂ·\t\n\n\nNOLA (1995)\n\n1.Temptation&amp;#039;s Wings\n2.Lifer\n3.Pillars Of Eternity\n4.Rehab\n5.Hail The Leaf\n6.Underneath Everything\n7.Eyes Of The South\n8.Jail\n9.Losing All\n10.Stone The Crow\n11.Pray For The Locust\n12.Swan Song\n13.Bury Me In Smoke\n\nDown II: A Bustle in Your Hedgerow (2002)\n\n1.Lysergik Funeral Procession\n2.There&amp;#039;s Something On My Side\n3.Man That Follows Hell, The\n4.Stained Glass Cross\n5.Ghosts Along The Mississippi\n6.Learn From This Mistake\n7.Beautifully Depressed\n8.Where I&amp;#039;m Going\n9.Doobinterlude\n10.New Orleans Is A Dying Whore\n11.Seed, The\n12.Lies, I Don&amp;#039;t Know What They Say But...\n13.Flambeaux&amp;#039;s Jamming With St. Aug\n14.Dog Tired\n15.Landing On The Mountains Of Meggido\n","torrent":{"xt":"urn:btih:370a0d8521f71106d10a48d85286f7525412209c","amp;dn":"Down-+Down+II+%2B+NOLA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"370a0d8521f71106d10a48d85286f7525412209c","infoHashBuffer":{"type":"Buffer","data":[55,10,13,133,33,247,17,6,209,10,72,216,82,134,247,82,84,18,32,156]},"announce":[],"urlList":[]}}