{"title":"American Tantra: A Modern Guide to Sacred Sex - Sienna Newcastle","uid":8364192,"size":4558319,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3717483e29599f91633f4931b14470574958e5e2&amp;dn=American+Tantra%3A+A+Modern+Guide+to+Sacred+Sex+-+Sienna+Newcastle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"lezm.jjlp","files":2,"time":1365721485,"description":"* American Tantra: A Modern Guide to Sacred Sex *\n\nAuthor: Sienna Newcastle\n\n\nBased on a series of real classes hosted by a nonprofit temple in the Pacific Northwest,&quot; American Tantra,&quot; takes a modern American look at the ancient art of Tantra, using plain English and easily grasped metaphors. Students say it's a life-changing path and have pushed to get this method into print. Ten years of study and feedback from over 200 students helped shape this book, which includes every question asked in class.&quot;American Tantra&quot; is for Americans who know little of Vedic scriptures. It's a way of looking at traditional Eastern practices with American eyes. It's a little bit sexy, a little bit scientific. Along with older White and Red methods, there are new community based &quot;Blue&quot;methods for a unique American outlook. Exercises include balanced actions of both males and females, and instruction for same-sex couples. There are over a dozen hands-on exercises and related stories from students, plus extensive references for further study.All genders and sexual orientations will find this path welcoming. If you are interested in Sacred Sex or maximizing your body, mind, and patriotism at the same time, you will love this book.\n\nPublication Date: May 11, 2009 \n\nenjoy","torrent":{"xt":"urn:btih:3717483e29599f91633f4931b14470574958e5e2","amp;dn":"American+Tantra%3A+A+Modern+Guide+to+Sacred+Sex+-+Sienna+Newcastle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3717483e29599f91633f4931b14470574958e5e2","infoHashBuffer":{"type":"Buffer","data":[55,23,72,62,41,89,159,145,99,63,73,49,177,68,112,87,73,88,229,226]},"announce":[],"urlList":[]}}