{"title":"Chopin 2nd Sonata, Ravel Gaspar, Prokofiev 6th Pogorelich","uid":10581070,"size":221081674,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3762a993bc66ddbd3dbd6b2d69ddbb09ccb6c5e6&amp;dn=Chopin+2nd+Sonata%2C+Ravel+Gaspar%2C+Prokofiev+6th+Pogorelich&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"magneez","files":5,"time":1405684596,"description":"FLAC+CUE\n\nrandom amazon review:\n\none of Pogorelich's best recordings\n\nBack in the 1980s, I remember asking a composer friend what he thought of Ivo Pogorelich. As he was a stickler for musicians observing composers' markings, I expected him to dislike Pogorelich, whose interpretations were very controversial at the time; however, to my surprise he replied that he was &quot;undecided.&quot; Apparently, he had liked some of the recordings, but others he wasn't so crazy about. Years later, I tend to feel the same way, except that I have stronger feelings both ways--some of his recordings I really love, and would take with me to my desert island, while others I have definitely found to be more challenging.\n\nMy chief complaint against Pogorelich is that he has a tendency to drag the music. I once attended a performance of Chopin's 24 Preludes at Carnegie Hall, in which he played some of the pieces so slowly, and with so many pauses, that at times the music seemed to lose all forward momentum. I mention this because listeners should be warned that he does have a tendency to do this on some of his recordings as well (although not on this one here). For example, his Brahms Intermezzi are very slow, not misguided--he definitely understands the ruminative nature of the music, but due to his slow pacing, some may feel that he compromises or retards the overall musical structure. (His Mozart Sonatas are even worse, as he approaches them in the same &quot;romantic&quot; manner as his Brahms.) Yet, at other times, as with his recording of Schumann's dazzling Toccata, he is absolutely incredible--and I mean, phenomenal. In fact, to my mind he is the only pianist to have ever bettered the legendary early Horowitz recording of the Toccata (previously released on the EMI label)...","torrent":{"xt":"urn:btih:3762a993bc66ddbd3dbd6b2d69ddbb09ccb6c5e6","amp;dn":"Chopin+2nd+Sonata%2C+Ravel+Gaspar%2C+Prokofiev+6th+Pogorelich","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3762a993bc66ddbd3dbd6b2d69ddbb09ccb6c5e6","infoHashBuffer":{"type":"Buffer","data":[55,98,169,147,188,102,221,189,61,189,107,45,105,221,187,9,204,182,197,230]},"announce":[],"urlList":[]}}