{"title":"Animal Wise: The Thoughts and Emotions of Our Fellow Creatures [","uid":9094006,"size":1047649,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38cd4573f147b3782d125611bb7f5748a974b6b9&amp;dn=Animal+Wise%3A+The+Thoughts+and+Emotions+of+Our+Fellow+Creatures+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1382647351,"description":"Animal Wise: The Thoughts and Emotions of Our Fellow Creatures [2013][Virginia Morell][mobi/epub][INFERNO]\n\nAnimal Wise: The Thoughts and Emotions of Our Fellow Creatures\nby Virginia Morell\n\n\n\nFormat: mobi/epub\nLength: 304 pages\nGenre: Non-Fiction/Science\nDate: 28 May 2013\n\nDid you know that ants teach, earthworms make decisions, rats love to be tickled, and chimps grieve?\n\nDid you also know that some dogs have thousand-word vocabularies and that birds practice songs in their sleep? That crows improvise tools, blue jays plan ahead, and moths remember living as caterpillars?\n\nNoted science writer Virginia Morell explores the frontiers of research on animal cognition and emotion, offering a surprising and moving exploration into the hearts and minds of wild and domesticated animals.\n\nAnimal Wise takes us on a dazzling odyssey into the inner world of animals, from ants to elephants to wolves, and from sharp-shooting archerfish to pods of dolphins that rumble like rival street gangs. Morell probes the moral and ethical dilemmas of recognizing that even 'lesser animals' have cognitive abilities such as memory, feelings, personality, and self-awareness--traits that many in the twentieth century felt were unique to human beings.\n\nAuthor:\n\nVirginia Morell is an acclaimed science journalist and author. A contributing correspondent for Science, she has covered evolutionary and conservation biology since 1990. A passionate lover of the natural world and a creative thinker, her reporting keeps her in close communications with leading scientists in her fields of interest. Morell is also a regular contributor to National Geographic and Conde Nast Traveler. In 2004, her National Geographic article on climate change was a finalist for Best Environmental Article from the Society of Environmental Journalists.","torrent":{"xt":"urn:btih:38cd4573f147b3782d125611bb7f5748a974b6b9","amp;dn":"Animal+Wise%3A+The+Thoughts+and+Emotions+of+Our+Fellow+Creatures+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38cd4573f147b3782d125611bb7f5748a974b6b9","infoHashBuffer":{"type":"Buffer","data":[56,205,69,115,241,71,179,120,45,18,86,17,187,127,87,72,169,116,182,185]},"announce":[],"urlList":[]}}