{"title":"Bionic Heart","uid":9493926,"size":173400064,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3918e861a9f69485ee232ce45e3fb9164960dcfd&amp;dn=Bionic+Heart&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Rafeweisz","files":1,"time":1390055775,"description":"Bionic Heart is a visual novel video game for the Microsoft Windows, Mac OS X and Linux platforms. The game was developed and published by Tycoon Games and was released on July 17, 2009. On November 4, 2011 an updated version of the game was released and also a version without voice acting. On April 9, 2012 an Android version was released.\n\n-----------------------------------------\n\nPlot\n\nThe game is set in London, 2099. The earth is not what it used to be anymore. Incredible climate changes have corrupted the weather, causing a permanent rain on most of the Earth's surface. Luke Black is a 36-year-old bio-informatic engineer and he is one of the lead programmers at Nanotech, a big nanotechnology research company. But one night, his life is changed forever when he encounters Tanya, an experimental gynoid with memories of the 21st century and no idea why she would have them. Luke soon finds himself protecting Tanya from her creator, Richard, who has bribed the police into helping him search for her.\n\n\n-----------------------------------------\n\nGameplay\n\nThe game offers a mix of classic visual novel gameplay, with dialogues and many choices to make, with some interactive scenes typical of old-time adventure games. A series of actions are shown at the bottom of the screen, along with several location the player can move to. The game features 24 unique endings, a relationship system, and it's fully voiced offering 4h of dialogues.","torrent":{"xt":"urn:btih:3918e861a9f69485ee232ce45e3fb9164960dcfd","amp;dn":"Bionic+Heart","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3918e861a9f69485ee232ce45e3fb9164960dcfd","infoHashBuffer":{"type":"Buffer","data":[57,24,232,97,169,246,148,133,238,35,44,228,94,63,185,22,73,96,220,253]},"announce":[],"urlList":[]}}