{"title":"Smegging Fantastic Red Dwarf Ebook Collection REBORN","uid":7577664,"size":592587743,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:394ce39108ed6bc25a10dca5312d540f6c279c7d&amp;dn=Smegging+Fantastic+Red+Dwarf+Ebook+Collection+REBORN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"skippy_666","files":-1,"time":1346114823,"description":"This torrent was originally posted on Demonoid.  Since it's demise, I have decided to repost the collection again.    \n\nSmeg it! Had to try and recreate the original post. So this reborn one is tidied up, updated and edited a bit.\n\n-----\n\nSmeg it all it to Silicon Hell! Wasted so much time on this. Trying to strive for perfection. Those constant revisions and you thought Rimmer was a anal retentive smeghead. Any more tinkering you would end up with my treatsy of being a fish. So ladies, gentlemen, mechanoids, cats, and polymorphs of all sizes...\n\nThe Smegging Fantastic Red Dwarf Collection - REBORN\n\nI present to you a collection of Red Dwarf reading materials I have gathered or created!\n\nThe first two books where found on Demonoid as mobi's and converted to epubs.  Epubs then compared and tidied up with with the use of two nice pdfs by tardismatrix (plus some commonsense and editing by me). Proofed by me.  No promises of perfection.  So some errors and that might pop up their little ugly heads up\n\nThe last two books Last Human and Backwards where scanned, OCR'd, edited, converted, transmorgified, opened up and messed around with by skippy_666!  Give me praise!  \n\nPlease bear with any errors and problems.  The whole scanning and ebook creation process is an ongoing and learning process.  Still, I am pretty certain I caught most of the errors, well mostly certain, you know how thinga are you always end up with a spare bob or two.  If you find any errors please send me a message.\n\nIncluded in the torrent are....\n\nAll four Red Dwarf books in ePub and mobi format.\n\nInfinity Welcomes Careful Drivers - Grant Naylor (Gestalt entity comprising of Rob Grant and Doug Naylor)\n\nBetter the Life - Grant Naylor - (Gestalt entity comprising of Rob Grant and Doug Naylor)\n\nBackwards - Rob Grant (Alone)\n\nLast Human - Doug Naylor (Alone)\n\n\nAlso included are the Red Dwarf Magazines aka Smegazines.  Found them in a DCP or some digital comic request pack. Still I decided to convert the magazines into PDFs for all those that want them in PDF.  There you go.  (Used to be a link to get the CBRs, maybe in the future.)\n\n\nThe PDF's of the first books Infinity Welcomes Careful Drivers and Better Than Life by tardismatrix on Demonoid. Tardismatrix made some pretty nice look pdfs.  They where helpful in making and editing my ebooks.\n\nRed Dwarf Tarot Cards.  They were created by tarot card fan called Kitten.  You can find the cards and many of her other creations on Avax.\n\n\nRed Dwarf Role Playing Game.  Also found on Demonoid.\n\nBONUS BONUS\n\nAlso since I am a nice guy.  I have included my scan and conversion of Rob Grant's book - Incompetence.  It is now available to purchase at Amazon.  Did not find that out till I was pretty much done with my scan and edit before I found it online for purchase.  The book will be much more rougher than the Red Dwarf books.  Once again consider actually purchasing the book from Amazon.\n\n\n\nIf you have any comments or something to add to the collection - please leave a post or send a message.","torrent":{"xt":"urn:btih:394ce39108ed6bc25a10dca5312d540f6c279c7d","amp;dn":"Smegging+Fantastic+Red+Dwarf+Ebook+Collection+REBORN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"394ce39108ed6bc25a10dca5312d540f6c279c7d","infoHashBuffer":{"type":"Buffer","data":[57,76,227,145,8,237,107,194,90,16,220,165,49,45,84,15,108,39,156,125]},"announce":[],"urlList":[]}}