{"title":"How Pleasure Works: The New Science of Why We Like What We Like-","uid":6187664,"size":202158345,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:39d2481f54be9079f34c7a40f705014ad4bd20cf&amp;dn=How+Pleasure+Works%3A+The+New+Science+of+Why+We+Like+What+We+Like-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"MANTESH","files":3,"time":1298167277,"description":" &lt;a href=&quot;http://ecx.images-amazon.com/images/I/41u072WVY%2BL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://ecx.images-amazon.com/images/I/41u072WVY%2BL._SS500_.jpg&lt;/a&gt;\n\n\n\n\nHow Pleasure Works: The New Science of Why We Like What We Like\n\n\n\nPublisher: Audible, Inc. (June 14, 2010)\nPaul Bloom\nEnglish\nASIN: B003RYCPGI\n7 hour(s) and 1 min.\nAudiobook\nMP3\n64Kbps\n192.79 MB\n\n\n\n\nYale psychologist Paul Bloom presents a striking and thought-provoking new understanding of pleasure, desire, and value. The thought of sex with a virgin is intensely arousing for many men. The average American spends more than four hours a day watching television. Abstract art can sell for millions of dollars. People slow their cars to look at gory accidents, and go to movies that make them cry.\n\nPleasure is anything but straightforward. Our desires, attractions, and tastes take us beyond the symmetry of a beautiful face, the sugar and fat in food, or the prettiness of a painting. In How Pleasure Works, Yale University psychologist Paul Bloom draws on groundbreaking research to unveil the deeper workings of why we desire what we desire. Refuting the longstanding explanation of pleasure as a simple sensory response, Bloom shows us that pleasure is grounded in our beliefs about the deeper nature or essence of a given thing. This is why we want the real Rolex and not the knockoff, the real Picasso and not the fake, the twin we have fallen in love with and not her identical sister.\n\nIn this fascinating and witty account, Bloom draws on child development, philosophy, neuroscience, and behavioral economics in order to address pleasures noble and seamy, highbrow and lowbrow. Along the way, he gives us unprecedented insights into a realm of human psychology that until now has only been partially understood. 3 illustrations\n\n\n","torrent":{"xt":"urn:btih:39d2481f54be9079f34c7a40f705014ad4bd20cf","amp;dn":"How+Pleasure+Works%3A+The+New+Science+of+Why+We+Like+What+We+Like-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39d2481f54be9079f34c7a40f705014ad4bd20cf","infoHashBuffer":{"type":"Buffer","data":[57,210,72,31,84,190,144,121,243,76,122,64,247,5,1,74,212,189,32,207]},"announce":[],"urlList":[]}}