{"title":"The Stories of Breece D'J Pancake (pdf)","uid":8558183,"size":1803631,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:39ede7e1c388359e394a03fd294b0d1c14b7c675&amp;dn=The+Stories+of+Breece+D%27J+Pancake+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pharmakate","files":-1,"time":1370816489,"description":"Breece D'J Pancake - The Stories of Breece D'J Pancake (Holt, 1983). 178 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nAbsolutely brilliant stories by a writer who seems to have been forgotten.\n\ndescription:\n\nBreece D'J Pancake cut short a promising career when he took his own life at the age twenty-six. Published posthumously, this is a collection of stories that depict the world of Pancake's native rural West Virginia.\n\nAfter Pancake's death, author Kurt Vonnegut wrote in a letter to John Casey, &quot;I give you my word of honor that he is merely the best writer, the most sincere writer I've ever read. What I suspect is that it hurt too much, was no fun at all to be that good. You and I will never know.&quot;\n\n\nFrom a letter to his mother, Helen Pancake, that Pancake wrote in Charlottesville, where he was studying writing:\n\n&quot;I'm going to come back to West Virginia when this is over. There's something ancient and deeply-rooted in my soul. I like to think that I have left my ghost up one of those hollows, and I'll never really be able to leave for good until I find it. And I don't want to look for it, because I might find it and have to leave.&quot;\n\nHow can you resist this guy after a quote like that?","torrent":{"xt":"urn:btih:39ede7e1c388359e394a03fd294b0d1c14b7c675","amp;dn":"The+Stories+of+Breece+D%27J+Pancake+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39ede7e1c388359e394a03fd294b0d1c14b7c675","infoHashBuffer":{"type":"Buffer","data":[57,237,231,225,195,136,53,158,57,74,3,253,41,75,13,28,20,183,198,117]},"announce":[],"urlList":[]}}