{"title":"Bridget Jones's Diary _ A Novel - Helen Fielding-viny","uid":6400375,"size":702930,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a7003b8d6469f8bfb6fbff6f193a125a4a2feb4&amp;dn=Bridget+Jones%5C%27s+Diary+_+A+Novel+-+Helen+Fielding-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1305644508,"description":"Bridget Jones's Diary _ A Novel - Helen Fielding-viny\n\nIn the course of the year recorded in Bridget Jones's Diary, Bridget confides her hopes, her dreams, and her monstrously fluctuating poundage, not to mention her consumption of 5277 cigarettes and &quot;Fat units 3457 (approx.) (hideous in every way).&quot; In 365 days, she gains 74 pounds. On the other hand, she loses 72! There is also the unspoken New Year's resolution--the quest for the right man. Alas, here Bridget goes severely off course when she has an affair with her charming cad of a boss. But who would be without their e-mail flirtation focused on a short black skirt? The boss even contends that it is so short as to be nonexistent.\n\nAt the beginning of Helen Fielding's exceptionally funny second novel, the thirtyish publishing puffette is suffering from postholiday stress syndrome but determined to find Inner Peace and poise. Bridget will, for instance, &quot;get up straight away when wake up in mornings.&quot; Now if only she can survive the party her mother has tricked her into--a suburban fest full of &quot;Smug Marrieds&quot; professing concern for her and her fellow &quot;Singletons&quot;--she'll have made a good start. As far as she's concerned, &quot;We wouldn't rush up to them and roar, 'How's your marriage going? Still having sex?'&quot;\n\nThis is only the first of many disgraces Bridget will suffer in her year of performance anxiety (at work and at play, though less often in bed) and living through other people's &quot;emotional fuckwittage.&quot; Her twin-set-wearing suburban mother, for instance, suddenly becomes a chat-show hostess and unrepentant adulteress, while our heroine herself spends half the time overdosing on Chardonnay and feeling like &quot;a tragic freak.&quot; Bridget Jones's Diary began as a column in the London Independent and struck a chord with readers of all sexes and sizes. In strokes simultaneously broad and subtle, Helen Fielding reveals the lighter side of despair, self-doubt, and obsession, and also satirizes everything from self-help books (they don't sound half as sensible to Bridget when she's sober) to feng shui, Cosmopolitan-style. She is the Nancy Mitford of the 1990s, and it's impossible not to root for her endearing heroine. On the other hand, one can only hope that Bridget will continue to screw up and tell us all about it for years and books to come","torrent":{"xt":"urn:btih:3a7003b8d6469f8bfb6fbff6f193a125a4a2feb4","amp;dn":"Bridget+Jones%5C%27s+Diary+_+A+Novel+-+Helen+Fielding-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a7003b8d6469f8bfb6fbff6f193a125a4a2feb4","infoHashBuffer":{"type":"Buffer","data":[58,112,3,184,214,70,159,139,251,111,191,246,241,147,161,37,164,162,254,180]},"announce":[],"urlList":[]}}