{"title":"Boilers and Burners - Design and Theory","uid":12090436,"size":17779055,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3aaf5facc1c6b52f6a3712f442c637ae24baa615&amp;dn=Boilers+and+Burners+-+Design+and+Theory&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1436029413,"description":"Boilers and Burners - Design and Theory - Prabir Basu, Cen Kefa, Louis Jestin (Springer, 2000).pdf\n\nISBN 9781461270614\n\nA joint effort of three continents, this book is about rational utilization of the fossil fuels for generation of heat or power. It provides a synthesis of two scientific traditions: the high-performance, but often proprietary, Western designs, and the elaborate national standards based on less advanced Eastern designs; it presents both in the same Western format. It is intended for engineers and advanced undergraduate and graduate students with an interest in steam power plants, burners, or furnaces. The text uses a format of practice based on theory: each chapter begins with an explanation of a process, with basic theory developed from first principles; then empirical relationships are presented and, finally, design methods are explained by worked out examples. It will thus provide researchers with a resource for applications of theory to practice. Plant operators will find solutions to and explanations of many of their daily operational problems. Designers will find this book ready with required data, design methods and equations. Finally, consultants will find it very useful for design evaluation","torrent":{"xt":"urn:btih:3aaf5facc1c6b52f6a3712f442c637ae24baa615","amp;dn":"Boilers+and+Burners+-+Design+and+Theory","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3aaf5facc1c6b52f6a3712f442c637ae24baa615","infoHashBuffer":{"type":"Buffer","data":[58,175,95,172,193,198,181,47,106,55,18,244,66,198,55,174,36,186,166,21]},"announce":[],"urlList":[]}}