{"title":"Kai's SuperGOO 1.5","uid":15920021,"size":456493882,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3acc65c89f23588dc8463e2a17155e98ab72f8d4&amp;dn=Kai%27s+SuperGOO+1.5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"samstuder599","files":47,"time":1475246792,"description":"\nhttps://i.ytimg.com/vi/zwyP7epedKk/hqdefault.jpg\r\n\r\n\r\nWorks with all versions of windows. Simply put the folder were ever you want. Open the folder and click the Supergoo Applacation file and the proram will start.\r\n\r\nBurn the ISO disk if you wish to use the stuff in the library. You can make animated gif's. Simply make a goo and save to the frame below the goo as you \r\nmanipulate your goo. Save goo as video and run the video though a video to gif converter of your choice. This is a fun and easy program to use.\r\n\r\n\r\n\r\nPart funhouse, part gender blender, part graphics tool, SuperGoo is laugh-out-loud fun. The premise is simple: feed in a photo or start with Abe Lincoln (the default picture), distort and switch features based on SuperGoo's tools, and out the other side comes a &quot;modified&quot; portrait. Recharge your creative batteries or make kids crack up with silly results.\r\nSuperGoo has two function panels: the Face Palette and the Goo Room. The Face Palette, where clothes, glasses, and features are added and positioned, yields the same kind of results as doodles done during study hall--elongated faces and off-kilter images. Users are given the option of switching between male and female characteristics for the faces, and a steady stream of additions are possible: handkerchiefs, glasses, or beard stubble, for example.\r\nThe Goo Room is the place where images get liquefied. While the menu used to save effects isn't very clear, the dials and switches involved with the manipulations are excellent. There are almost as many ways to undo the changes you've made, and the variances themselves are fantastic: &quot;noise&quot; adds ruddy bumps and subtle pixel switching, and &quot;twirl&quot; and &quot;ripple &quot; can pull hair from waves to mountains.\r\nA simple set of concepts done well, SuperGoo provides ideas as well as images. It's an accessible entry into the feats--and fun--possible with digital graphic manipulation","torrent":{"xt":"urn:btih:3acc65c89f23588dc8463e2a17155e98ab72f8d4","amp;dn":"Kai%27s+SuperGOO+1.5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3acc65c89f23588dc8463e2a17155e98ab72f8d4","infoHashBuffer":{"type":"Buffer","data":[58,204,101,200,159,35,88,141,200,70,62,42,23,21,94,152,171,114,248,212]},"announce":[],"urlList":[]}}