{"title":"The Korean War - Max Hastings.epub","uid":9849156,"size":3227561,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3b391c6efb99a6e6eeb3bc9a5652b09dfea36610&amp;dn=The+Korean+War+-+Max+Hastings.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Mohammad_AT","files":1,"time":1396126053,"description":"It was the first war we could not win. At no other time since World War II have two superpowers met in battle. Now Max Hastings, preeminent military historian takes us back to the bloody bitter struggle to restore South Korean independence after the Communist invasion of June 1950. Using personal accounts from interviews with more than 200 vets -- including the Chinese -- Hastings follows real officers and soldiers through the battles. He brilliantly captures the Cold War crisis at home -- the strategies and politics of Truman, Acheson, Marshall, MacArthur, Ridgway, and Bradley -- and shows what we should have learned in the war that was the prelude to Vietnam.\n\nFrom Library Journal\n\nThe Korean War has been misunderstood and neglected. Hastings had the unique opportunity of interviewing Chinese and North Korean veterans, a source denied to most Western historians. He shows how Korea served as a prelude to Vietnam and why Americans were making the same mistakes 15 years later. One minor criticism: Hastings devotes much space to the operations of the British Commonwealth Division. The Commonwealth never had more than 20,000 men in Korea; the United States had well over 500,000. ","torrent":{"xt":"urn:btih:3b391c6efb99a6e6eeb3bc9a5652b09dfea36610","amp;dn":"The+Korean+War+-+Max+Hastings.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b391c6efb99a6e6eeb3bc9a5652b09dfea36610","infoHashBuffer":{"type":"Buffer","data":[59,57,28,110,251,153,166,230,238,179,188,154,86,82,176,157,254,163,102,16]},"announce":[],"urlList":[]}}