{"title":"Hallmark-A Ring By Spring [2014]","uid":9730438,"size":733664232,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3bd171af69a63dba06ce58c41a23c2794e61d318&amp;dn=Hallmark-A+Ring+By+Spring+%5B2014%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"RayCort","files":1,"time":1394371391,"description":"Hallmark-A Ring By Spring (2014)\n\nAir Date: 8 Mar 2014\n\nSummary: Business consultant Caryn Briggs (Rachel Boston) is still single at 30, but is in no rush to wed. She's always been skeptical about marriage, thinking the commitment would mean throwing away her future. She has let a string of steady boyfriends get away in favor of her own freedom. When she attends a fundraising event with friends Gregg (Chad Krowchuk) and Stephanie (Ali Liebert), she playfully agrees to have her fortune read at a charity booth run by soothsayer Madame Rue (Stefanie Powers), who ominously predicts Caryn will have an engagement ring by spring, or she'll never marry. Caryn doesn't give much thought to Madame Rue's fortune as she starts a new job with friendly, laid-back boss Tom Halsey (Kirby Morrow), with whom she has a lot in common. But when Stephanie and Gregg's fortunes come true, Caryn worries she might be closer to a ring than she thought from her uptight boyfriend, Bryce (Chris Jacot). \n\n With Caryn suddenly very nervous about an impending proposal, Bryce shocks her when he breaks up with her instead, claiming she isn't marriage material. Finally faced with the truth, Caryn must admit to herself she needs to get over her fear of lifelong commitment. With spring approaching fast and no ring in sight, Caryn wonders if Madame Rue meant to doom her to a lifetime alone and must learn that the true sacrifice isn't getting hitched, but giving up on a real, lasting love.\n\nCast: \n\nRachel Boston ... Caryn Briggs \n \nKirby Morrow ... Tom Halsey \n \nStefanie Powers ... Madame Rue \n \nAli Liebert ... Stephanie Kirkwood \n \nCrystal Balint ... Ursula \n \nTeach Grant ... Will \n \nGiles Panton ... Rory Matthews  \n","torrent":{"xt":"urn:btih:3bd171af69a63dba06ce58c41a23c2794e61d318","amp;dn":"Hallmark-A+Ring+By+Spring+%5B2014%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bd171af69a63dba06ce58c41a23c2794e61d318","infoHashBuffer":{"type":"Buffer","data":[59,209,113,175,105,166,61,186,6,206,88,196,26,35,194,121,78,97,211,24]},"announce":[],"urlList":[]}}