{"title":"Rise.Fall.Of.Idi.Amin.1981.DVDRIP.XViD","uid":5598360,"size":733833460,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3be8c6beea39be6f2a9cb88baf0626d7aa7525a8&amp;dn=Rise.Fall.Of.Idi.Amin.1981.DVDRIP.XViD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"thelad53","files":50,"time":1275147858,"description":"Rise and Fall of Idi Amin (1981)\n\nThis is an exploitation classic with a heavy dose of &quot;Nollywood&quot;-style African film making.  The movie charts the rise and fall of Idi Amin, the notorious Ugandan dictator and his nation's &quot;number 1 sex champion&quot;, as he constantly styles himself. \n\nThe actor playing Amin has produced a great B-movie performance, charting the strongman's decent farther and farther into meglomania, a journey that is at once both comical and terrifying.  At one point he bestows the country's highest military honour on his six year old son, before &quot;accidentally&quot; shooting the archbishop, and having three of his multiple wives killed when he tires of them.  This is in addition to extra judicial killings ordered about every five minutes.\n\nThe film also follows historical events carefully.  The sinister and paranoid side of Amin's meglomania is shown when he orders Asians, &quot;Zionists&quot; and agents of &quot;imperial&quot; powers out of his country; while at the same time driving it into bankruptcy, and cannibalizing his enemies.\n\nThe reaction of Western powers to these events is also carefully sketched.  Sometimes the grand historical statements minor character make out of thin air seem preposterous, but that is part of the film's charm (beside the severed heads, arms, executions and beatings), and helps frame Amin's insanity.  This is an above average exploitation offering with a unique documentary angle.","torrent":{"xt":"urn:btih:3be8c6beea39be6f2a9cb88baf0626d7aa7525a8","amp;dn":"Rise.Fall.Of.Idi.Amin.1981.DVDRIP.XViD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3be8c6beea39be6f2a9cb88baf0626d7aa7525a8","infoHashBuffer":{"type":"Buffer","data":[59,232,198,190,234,57,190,111,42,156,184,139,175,6,38,215,170,117,37,168]},"announce":[],"urlList":[]}}