{"title":"Matthew Barney - Cremaster 4 (1995)","uid":3744688,"size":732274284,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3beb9c57b889673ad597d9a22ba190561bc6aed5&amp;dn=Matthew+Barney+-+Cremaster+4+%281995%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Beksinski","files":4,"time":1184678500,"description":"Title: Cremaster 4\nDirector: Matthew Barney\nYear: 1995\nLanguage: English\nSubtitles: n/a\nSize: 698 MB (or 715,014 KB or 732,174,336 bytes)\nVideo Codec: Xvid\nVideo Bitrate: 1854 kb/s\nResolution: 640x472 (1.36:1) [~19:14]\nQf: 0.205 bits/pixel\nFramerate: 29.970\nAudio Specs: ac3 (0x2000)\nAudio Bitrate: 448 kb/s (224/ch, stereo) CBR \nFs: 48000 Hz\nRuntime: 00:42:16 (76,004 fr)\nSource: DVD\n\nDescription: CREMASTER 4  (1994) adheres most closely to the project&amp;#039;s biological model. This penultimate episode describes the system&amp;#039;s onward rush toward descension despite its resistance to division. The logo for this chapter is the Manx triskelion - three identical armored legs revolving around a central axis. Set on the Isle of Man, the film absorbs the island&amp;#039;s folklore as well as its more recent incarnation as host to the Tourist Trophy motorcycle race.  Myth and machine combine to narrate a story of candidacy, which involves a trial of the will articulated by a series of passages and transformations. The film comprises three main character zones. The Loughton Candidate (played by Barney) is a satyr with two sets of impacted sockets in his head - four nascent horns, which will eventually grow into those of the mature, Loughton Ram, an ancient breed native to the island. Its horns - two arcing upward, two down - form a diagram that proposes a condition of undifferentiation, with ascension and descension coexisting in equilibrium. The second and third character zones comprise a pair of motorcycle sidecar teams: the Ascending and Descending Hacks. These primary characters are attended to by a trio of fairies who mirror the three narrative fields occupied by the Candidate and the two racing teams. Having no volition of their own, these creatures metamorphose in accordance with whatever field they occupy at any given time.\n      Cremaster 4 begins and ends in a building on the end of Queen&amp;#039;s Pier. As the film starts, the Candidate is being prepared by the fairies for a journey. The motorcycle race begins, and each team speeds off in opposite directions. The camera cuts back and forth between the race and the Candidate, who is tap-dancing his way through a slowly eroding floor. As the bikes vie for the title, the camera pulls in for close-up shots of the riders&amp;#039; torsos.\n      Gelatinous gonadal forms - undifferentiated internal sex organs - emerge from slots in their uniforms in a migratory quest for directionality. In the case of the Ascending Hack, the organs move upward toward a second set of slots in the leather. With the Descending Hack, they ooze downward.\n      Back at the pier, the Candidate plunges through the floor into the sea and heads toward the island. At the moment of his fall - a transition from the utopian realm of pregenital oneness to that of bifurcation - the Ascending Hack collides with a stone embankment and the Descending Hack pulls off the course for a pit stop, where the fairies service its motorcycle. The Candidate reaches land and begins to burrow his way up into the body of the island through a curving channel that he must navigate in order to reach the finish line, where the two Hacks will converge. This conduit leads him to a bluff, where the fairies are having a picnic. They frolic in a game that mirrors the conflict enacted by the principal characters, but with none of the tension. Still in his underground tunnel, the Candidate finally reaches his destination. The Loughton Ram stands at this junction - a symbol for the integration of opposites, the urge for unity that fuels this triple race. But before the Candidate and Hacks meet, the screen goes white. The Candidate&amp;#039;s dream of transcending his biology to dwell in the space of pure symmetry is shattered.\n      In the final sequence at the pier the Hacks are parked on discrete ramps sloping down from the building&amp;#039;s exterior. In the closing image the camera peers through an open crotch at the top of the frame toward the end of the pier. A tightly retracted scrotum is pierced with clasps connected to vinyl cords, which trail off to the awaiting Ascending and Descending Hacks, who will drive toward the island to pick up the slack. Full descension is guaranteed.  &lt;a href=&quot;\nhttp://www.cremaster.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cremaster.net/&lt;/a&gt;\n\n\n********************************* FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art\nto the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\t\t &lt;a href=&quot;\thttp://www.freakyflicks.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.freakyflicks.tk&lt;/a&gt;\n\n\t\t &lt;a href=&quot;\thttp://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://freakyflicks.proboards54.com/&lt;/a&gt;\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;","torrent":{"xt":"urn:btih:3beb9c57b889673ad597d9a22ba190561bc6aed5","amp;dn":"Matthew+Barney+-+Cremaster+4+%281995%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3beb9c57b889673ad597d9a22ba190561bc6aed5","infoHashBuffer":{"type":"Buffer","data":[59,235,156,87,184,137,103,58,213,151,217,162,43,161,144,86,27,198,174,213]},"announce":[],"urlList":[]}}