{"title":"Il professor Layton e il paese dei misteri [NDS] Ita - Rompicapo","uid":5996395,"size":77464124,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:3c0354094511846890021b76954f1f1102102a55&amp;dn=Il+professor+Layton+e+il+paese+dei+misteri+%5BNDS%5D+Ita+-+Rompicapo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"year2012","files":1,"time":1290992367,"description":"Il professor Layton e il paese dei misteri [NDS] Ita - Rompicapo [Nautilus-BT]\n\n\n\nIl professor Layton e il paese dei misteri\n\n Visit this link: http://www.games.it/pictures/20090313/layton-copertina.jpeg\n\n\n\n\nTitolo originale: Reiton-kyoju to Fushigi na Machi\nNazione:\tGiappone\nData di pubblicazione:\t07/11/2008 Europa\nGenere:\tAvventura grafica, Rompicapo\nModalitÃƒÂ  di gioco:\tGiocatore singolo\nPubblicazione:\tLevel-5, Nintendo\n\n\nDescrizione:\n\nIl professor Layton e il paese dei misteri ÃƒÂ¨ un gioco d'avventura del tipo punta e clicca, facente parte della Serie del professor Layton che include 120 puzzle piÃƒÂ¹ 15 sbloccabili da risolvere per il giocatore.\n\nIl videogame ÃƒÂ¨ un'avventura punta e clicca, con il giocatore che controlla i movimenti del professor Layton e del suo giovane assistente Luke in giro per il villaggio di St. MystÃƒÂ¨re, con lo scopo di trovare la &quot;mela d'oro&quot; e risolvere gli altri misteri che sorgono durante la loro ricerca. Saint-MystÃƒÂ¨re ÃƒÂ¨ divisa in sezione, in cui il giocatore puÃƒÂ² muoversi, anche se alcune sezioni sono inaccessibili fino a quando non si raggiungerÃƒÂ  una parte avanzata della storia oppure non saranno stati risolti un requisito minimo del numero di puzzle. Il giocatore puÃƒÂ² parlare con i vari personaggi o interagire con gli oggetti sullo schermo semplicemente toccandoli: in molti casi, infatti, alcuni puzzle sono nascosti e spetta al giocatore scovarli. Progredendo con la storia, se il giocatore non ha risolto alcuni di questi puzzle nascosti, essi verranno raccolti in una speciale locazione, la Bottega di Nonna Enigmina, cosÃƒÂ¬ da permettere di risolverli.\n\nI puzzle variano tra rompicapi, enigmi di logica, di matematica e cosÃƒÂ¬ via: la loro difficoltÃƒÂ  ÃƒÂ¨ misurata in &quot;Picarati&quot;, e si ha un tempo illimitato per risolverli. Ogni puzzle ha a disposizione tre suggerimenti, ma il giocatore deve spendere una &quot;moneta aiuto&quot; per ciascuno. Le monete suggerimento sono limitate: all'inizio sono dieci, mentre le altre son nascoste nel villaggio. Quando il giocatore si sente di avere la risposta, la inserisce tramite touchscreen oppure la seleziona tra quelle disponibili: Se ÃƒÂ¨ corretta, i picarati verranno aggiunti al suo punteggio totale, e talvolta si verrÃƒÂ  ricompensati con un oggetto; se ÃƒÂ¨ sbagliata, si puÃƒÂ² ripetere all'infinito il puzzle anche se, dopo le prime due volte che si sbaglia, il valore del puzzle si riduce di circa il dieci per cento ogni volta. In alternativa, un giocatore puÃƒÂ² chiudere un puzzle senza alcuna penalitÃƒÂ  e provare con un altro, anche se alcuni puzzle sono obbligatori per progredire con la storia. Una volta che un puzzle ÃƒÂ¨ stato completato, infine, il giocatore puÃƒÂ² riprovarlo in qualsiasi momento tramite il menu del gioco.\n\n\n\nVisit http://www.nautilus-bt.org","torrent":{"xt":"urn:btih:3c0354094511846890021b76954f1f1102102a55","amp;dn":"Il+professor+Layton+e+il+paese+dei+misteri+%5BNDS%5D+Ita+-+Rompicapo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c0354094511846890021b76954f1f1102102a55","infoHashBuffer":{"type":"Buffer","data":[60,3,84,9,69,17,132,104,144,2,27,118,149,79,31,17,2,16,42,85]},"announce":[],"urlList":[]}}