{"title":"Good Morning Vietnam (Special Edition) 1987 DVDR NTSC","uid":10815359,"size":4681597983,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3c488d79c50bb0a15274bd6a70b8b7820bba5e80&amp;dn=Good+Morning+Vietnam+%28Special+Edition%29+1987+DVDR+NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Alemao99","files":4,"time":1408456524,"description":"Saigon, 1965 Adrian Cronauer (Robin Williams), an aeronaut, went to Southeast Asia to work as a disc jockey on Radio Saigon, which was operated by the American government. In contrast to the tedious talkers who preceded him, Cronauer is very dynamic and always starts transmissions with a sound and vibrant &quot;Good Morning Vietnam&quot;, playing songs that had not been approved by his superiors shortsighted. But what really drew attention were the jokes he spoke during his program, causing outrage Steven Hauk (Bruno Kirby), a second lieutenant who was Cronauer's immediate superior. Hauk had an overwhelming need to prove that it was hierarchically superior and furthermore had a childish and pathetic mood. Driven by envy and jealousy, but he tries to harm Cronauer's popularity is such that it is protected at the highest levels. Meanwhile, Adrian is attracted by Trinh (Chintara Sukapatana), a Vietnamese young. One day, when Cronauer was leaving Jimmy Wah's, a popular bar that was frequented by Americans, there was an explosion under a plastic explosive having been put on the spot. This attack killed two people and wounded three yet. Despite being prohibited from disclosing what happened, Adrian ironically narrated what happened. Hauk immediately called subversive and was supported by Phillip Dickerson (JT Walsh), an officer who always hated Adrian. However, General Taylor (Noble Willigham) did not allow the incident took great proportions and gave only a suspension for Cronauer, it was agreed that he would be replaced by Hauk, who tried to be funny but only managed to be ridiculous. To make matters worse, played several polkas that nobody liked and well managed several negative criticisms. Moreover, all demanded the return of Cronauer. Given this context, Taylor ordered him reinstated, but something serious would happen, that Taylor would not even be able to get around. \n\nTranslated Title: Good Morning, Vietnam (Special Edition) \nOriginal Title: Good Morning, Vietnam (Special Edition) \nGenre: Comedy | Drama | War \nDuration: 2 H 01 Min \nCountry of Origin: USA \nRelease Year: 1987 \nDirector: Barry Levinson \nIMDB: http://www.imdb.com/title/tt0093105/ \n\nSize: 4.36 GB \nVideo Quality: DVD-R \nVideo codec: MPEG-II \nAudio Codec: AC3 5.1 \nResolution: 720x576 \nAudio Language: English / Spanish \nSubtitles: Portuguese / others\n\n\nScreens: \ni.imgur.com/peRAaVk.jpg \ni.imgur.com/VYFZsWU.jpg\n\n\n\nSEED PLEASE\n\nENNJOY...","torrent":{"xt":"urn:btih:3c488d79c50bb0a15274bd6a70b8b7820bba5e80","amp;dn":"Good+Morning+Vietnam+%28Special+Edition%29+1987+DVDR+NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c488d79c50bb0a15274bd6a70b8b7820bba5e80","infoHashBuffer":{"type":"Buffer","data":[60,72,141,121,197,11,176,161,82,116,189,106,112,184,183,130,11,186,94,128]},"announce":[],"urlList":[]}}