{"title":"The Power Broker: Robert Moses and the Fall of New York Robert C","uid":11596976,"size":925173057,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3cd95a6254c04503f676ef81a3707bb88b7d3806&amp;dn=The+Power+Broker%3A+Robert+Moses+and+the+Fall+of+New+York+Robert+C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":86,"time":1417294830,"description":"By Robert A Caro\n\nFrom the Inside Flap\n\nOne of the most acclaimed books of our time, winner of both the Pulitzer and the Francis Parkman prizes, The Power Broker tells the hidden story behind the shaping (and mis-shaping) of twentieth-century New York (city and state) and makes public what few have known: that Robert Moses was, for almost half a century, the single most powerful man of our time in New York, the shaper not only of the city's politics but of its physical structure and the problems of urban decline that plague us today.\n\nIn revealing how Moses did it--how he developed his public authorities into a political machine that was virtually a fourth branch of government, one that could bring to their knees Governors and Mayors (from La Guardia to Lindsay) by mobilizing banks, contractors, labor unions, insurance firms, even the press and the Church, into an irresistible economic force--Robert Caro reveals how power works in all the cities of the United States. Moses built an empire and lived like an emperor. He personally conceived and completed public works costing 27 billion dollars--the greatest builder America (and probably the world) has ever known. Without ever having been elected to office, he dominated the men who were--even his most bitter enemy, Franklin D. Roosevelt, could not control him--until he finally encountered, in Nelson Rockefeller, the only man whose power (and ruthlessness in wielding it) equalled his own","torrent":{"xt":"urn:btih:3cd95a6254c04503f676ef81a3707bb88b7d3806","amp;dn":"The+Power+Broker%3A+Robert+Moses+and+the+Fall+of+New+York+Robert+C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cd95a6254c04503f676ef81a3707bb88b7d3806","infoHashBuffer":{"type":"Buffer","data":[60,217,90,98,84,192,69,3,246,118,239,129,163,112,123,184,139,125,56,6]},"announce":[],"urlList":[]}}