{"title":"Tab Benoit - Westland","uid":5180498,"size":139967216,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3cfd7ca8e1e476f6cb5e05c7dd99b9a972fb4893&amp;dn=Tab+Benoit+-+Westland&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"muzik62","files":-1,"time":1259217459,"description":"Tab Benmoit - Westland\n\nmp3 320 kbit\n\n---------- Artists -------------\nBrian Stoltz - guitar\nTab Benoit - vocals, guitar\nAnders Osborne\nCarl Dufrene - bass\nDarryl White - drums\n\nProducer Randy Labbe; Tab Benoit\nEngineer Roger Branch\n\n------- Tracks --------\n1. Fast and Free\n2. Stackolina\n3. I Got Loaded\n4. Muddy Bottom Blues\n5. When a Cajun Man Gets the Blues\n6. Too Sweet For Me\n7. Down in the Swamp\n8. These Arms of Mine\n9. Dog Hill\n10. Her Mind Is Gone\n11. Loves Lips\n12. Let Love Take Control\n13. Georgia\n\nRecorded during a month in Louisiana and sounding it, Tab Benoit's sixth album is a swampy example of the best of that state's music. Rocking, bluesy, and filled with soul, guitarist/vocalist Benoit keeps his sound stripped down to just a three-piece, giving his voice and greasy guitar plenty of room to maneuver. From obscure Professor Longhair second-line tunes (&quot;Her Mind Is Gone&quot;) to a cover from zydeco king Boozoo Chavis (&quot;Dog Hill&quot;) to a version of Otis Redding's &quot;These Arms of Mine&quot; that makes it seem like a lost New Orleans classic, Benoit traverses a lot of territory over this hour of music. Like his influences, Benoit never overdoes his approach, preferring to keep the focus on his gritty voice, lean guitar, and stark accompaniment of his backing duo. This is music caught between rootsy rock, funk, R&amp;B, and blues, but far from sounding schizoid, it revels in its multiple inspirations. Benoit is in wonderful voice and spirits throughout, sounding loose yet in control regardless of what style he's playing. His guitar solos are taut and succinct, capturing the essence of the atmosphere without reverting to needless showboating. This is music from the heart, played with class, subtlety, and a reverence for its past squeezed into every spirited groove. Thirteen songs and not a misstep, Wetlands is not only Tab Benoit's best album, it's the one most representative of his upbringing and style. Like the autobiographical &quot;Down in the Swamp,&quot; those who have never made it to Louisiana need only play this to understand how the area -- and Benoit -- oozes with the ambience of the muggy air, rich food, and spirits of musicians who have passed.\nHal Horowitz\n\nmuzik62\n\nmore Tab Benoit:\nhttp://thepiratebay.se/torrent/4984202/Tab_Benoit_-_The_Sea_Saint_Sessions.mp3","torrent":{"xt":"urn:btih:3cfd7ca8e1e476f6cb5e05c7dd99b9a972fb4893","amp;dn":"Tab+Benoit+-+Westland","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cfd7ca8e1e476f6cb5e05c7dd99b9a972fb4893","infoHashBuffer":{"type":"Buffer","data":[60,253,124,168,225,228,118,246,203,94,5,199,221,153,185,169,114,251,72,147]},"announce":[],"urlList":[]}}