{"title":"E. Sulij, D. Mayers - An Introduction to Numerical Analysis","uid":4567171,"size":9561313,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d1327369ebab237f99821c1cfcc167c0b336e5e&amp;dn=E.+Sulij%2C+D.+Mayers+-+An+Introduction+to+Numerical+Analysis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"fransfl","files":1,"time":1228920502,"description":"Book info:\n\n'The book is easy to read. It flows smoothly and I would consider it to be well worth the money and a useful update to the literature.' Mathematics Today 'The book is well written and offers a good level of rigor for the intended readership ... good book for mathematics students who come armed with some background in analysis.' Eugene L. Allgower, Colorado State University 'This is an excellent book for introducing undergraduates to the fascinating discipline of numerical analysis. It is the result of many years of lectures held by the authors at the University of Oxford, a fact that explains the evident ability of the book of addressing questions frequently asked by students.' Internationale Mathematische Nachrichten 'This is a very good textbook to introduce mathematics students to numerical analysis ... The authors have made a good choice of introductory topics in numerical analysis ... The book is very carefully written and can indeed be recommended as a textbook for a course for second or third year mathematics students ... It is a pleasure to browse through this book; it is written in a pleasant style and contains many historic references to ancient and modern mathematicians with some details about their lives.' Zentralblatt MATH 'The book is well written and offers a good level of rigor for the intended readership ... This is a good book for mathematics students who come armed with some background in analysis. It is carefully written with a good level of rigor.' Eugene L. Allgower, Colorado State University, Society for Industrial and Applied Mathematics","torrent":{"xt":"urn:btih:3d1327369ebab237f99821c1cfcc167c0b336e5e","amp;dn":"E.+Sulij%2C+D.+Mayers+-+An+Introduction+to+Numerical+Analysis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d1327369ebab237f99821c1cfcc167c0b336e5e","infoHashBuffer":{"type":"Buffer","data":[61,19,39,54,158,186,178,55,249,152,33,193,207,204,22,124,11,51,110,94]},"announce":[],"urlList":[]}}