{"title":"Rohos Logon Key v3.2 Pro DC 09 08 2016","uid":14855783,"size":5911460,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3dcacf855f2297365a119b5a7f1404f95f392e67&amp;dn=Rohos+Logon+Key+v3.2+Pro+DC+09+08+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZarkBit","files":1,"time":1465473689,"description":"Rohos Logon Key v3.2 Pro DC 09 08 2016\r\n\r\nTwo-factor authentication solution that converts any USB drive into a security token for your computer and allows you to access Windows in a secure way with a USB token, replacing the Windows login.\r\n\r\nSecure access for:\r\n\r\nAny Windows PC\r\nWindows Active Directory\r\nNovell e-Directory\r\nWindows 2003/2008/2012 Terminal Server and Remote Desktop (Rohos Server license required). Learn more..\r\nYour Computer security benefits:\r\n\r\nReplaces weak password-based login with a hardware USB key (USB flash drive or memory card)\r\nUses a long and powerful password, without the need to memorize it\r\nLogin with a USB Key is fully automatic and fast!\r\nThe system is password-protected, but you don’t need to enter it manually each time you log in or unlock Windows\r\nSecure 2-factor login: Your USB Key + PIN code password\r\nUse a single USB key to log into your home, laptop and office computer\r\nRestrict access to a computer based on whether an authorized USB key is inserted\r\nWindows is protected even in Safe Mode\r\nAssigning a password to your user account allows you to set up better protection for a hibernated computer.\r\nRisk-free due to features like:\r\n\r\nEmergency Logon that helps you access your system in the event that you’ve lost you USB drive or forgotten the PIN code\r\nPIN code to protect USB key against unauthorized use for login (with limited attempts to enter the system)\r\nSafe Mode guard – no chance for an attacker to bypass USB key security by loading Windows in Safe Mode\r\nRohos uses NIST-approved data-security principles: the password is not stored on the USB key in open form. USB key copy protection prevents the creation of key copies without authorization. All data on the key is encrypted with AES-256 bit key length.\r\nRohos Logon Key is widely held to be the most convenient, user-friendly and smart password replacement application on the market. Personal vs PRO license\r\n\r\nA variety of devices are supported for authentication:\r\n\r\nany USB flash drive\r\nUSB tokens/smart cards like Aladdin eToken PRO, Futako HiToken v22, Aktiv ruToken, uaToken, Crypto Identity 5,etc\r\nYubiKey  and Swekey – One-Time Password tokens\r\nFingerprint USB flash drive, e.g. Transcend, Apacer, LG, TakeMS, etc.\r\nWireless devices that are Bluetooth-enabled, e.g. Pocket PC, Mobile.\r\nRFID tags","torrent":{"xt":"urn:btih:3dcacf855f2297365a119b5a7f1404f95f392e67","amp;dn":"Rohos+Logon+Key+v3.2+Pro+DC+09+08+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dcacf855f2297365a119b5a7f1404f95f392e67","infoHashBuffer":{"type":"Buffer","data":[61,202,207,133,95,34,151,54,90,17,155,90,127,20,4,249,95,57,46,103]},"announce":[],"urlList":[]}}