{"title":"David G. Myers - Intuition. Its Powers and Perils [2004][A]","uid":10245444,"size":1524551,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e6d44de06109fa67c5ed66d3a03b92930b43e99&amp;dn=David+G.+Myers+-+Intuition.+Its+Powers+and+Perils+%5B2004%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Anette14","files":-1,"time":1401293111,"description":"Description\nProduct Details\nBook Title: Intuition: Its Powers and Perils\t\nBook Author: David G. Myers (Author)\nSeries: Yale Nota Bene\nPaperback: 336 pages\nPublisher: Yale University Press (April 10, 2004)\nLanguage: English\nISBN-10: 0300103034\nISBN-13: 978-0300103038\n\n===================================================================================\nBook Description\nPublication Date: April 10, 2004\nHow reliable is our intuition? How much should we depend on gut-level instinct rather than rational analysis when we play the stock market, choose a mate, hire an employee, or assess our own abilities? In this discussion, David Myers shows us that while intuition can provide us with useful, and often amazing, insights, it can also dangerously mislead us. Drawing on psychological research, Myers discusses the powers and perils of intuition when: judges and jurors determine who is telling the truth; mental health workers predict whether someone is at risk for suicide or crime; coaches, players and fans decide who has the hot hand or the hot bat; personnel directors hire new employees; and psychics claim to be clairvoyant or to have premonitions.\n\n===================================================================================\nEditorial Reviews\nFrom Publishers Weekly\nWith humor and warm disinterestedness, Myers, professor of psychology at Michigan's Hope College, marshals cognitive research on intuition, or &quot;our capacity for direct knowledge, for immediate insight without observation or reason&quot; or what is sometimes called ESP. He finds that the mind operates on two levels, &quot;deliberate&quot; and &quot;automatic.&quot; The nondeliberate mode (aka the intuitive) can be an effective way of knowing and doing, helping us empathize with others, intuit social cues or perform rote tasks like driving cars. It can also lead us astray: illusory correlations, self-fulfilling prophecies, dramatic anomalies and other misleading heuristics may feel like direct perception, but are not. Statistically random events may appear to have patterns, but &quot;random sequences are streaky.&quot; The book treats scientific method as an attractive intellectual tool and shuns &quot;truth is personally constructed&quot; evasions; it is thus delightfully readable and deliberately provocative.\nCopyright 2002 Cahners Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.\n\n===================================================================================\nFrom Library Journal\nMyers (psychology, Hope Coll.) presents here accessible research findings on intuition that are a welcome change from obscure self-help guides on the subject. He holds that people often rely on hunches without factoring in personal backgrounds, scientific fact, and unperceived influences, such as random streaks of occurrence, making those hunches less effective than we might think. Covered here are intuition's general strengths and weaknesses and its relationship to investment, psychotherapy, and employment settings. While some would argue that trying to gauge intuition is futile, Myers argues convincingly that we can measure how we arrive at a conclusion. By and large Myers is not making a case for intuition so much as for logic: he invites us to sharpen our insights and self-knowledge so that when impulse strikes, we can make sounder and less costly decisions. For the psychology sections of larger public libraries and academic libraries. Lisa Liquori, M.L.S., Syracuse, NY\nCopyright 2002 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.\n\n===================================================================================\nFrom the Publisher\nAlso available by David G. Myers: The American Paradox\n\n===================================================================================\nFrom the Back Cover\n&quot;Myers' book brilliantly establishes intuition as a legitimate subject of scientific inquiry.&quot;-Michael Shermer, Los Angeles Times Book Review;\n\n&quot;A lively and thorough review of the powers and pitfalls of gut instinct.&quot;-Eric Bonabeau, Harvard Business Review ;\n\n&quot;[Intuition is a book] that may help you make optimal use of your intuition. . . . [It] offers scientific grounding in the subject and practical steps for becoming more intelligently intuitive.&quot;-Money Magazine's e-mail newsletter;\n\n&quot;Delightfully readable and deliberately provocative.&quot;--Publishers Weekly;\n\n&quot;Entertaining, intelligent, and easy to read, Myers's book offers an abundance of research findings dealing with what is more aptly called the 'nonconscious' mind.&quot; - Choice;\n\n&quot;Intuition is a one-of-a-kind book by one of the best writers in psychology. Exceptionally reasonable, totally up-to-date, and responsible, the book has the potential to be a classic in the field.&quot; - Robert J. Sternberg, 2003 president, American Psychological Assocation\n\n===================================================================================\nAbout the Author\nDavid G. Myers, John Dirk Werkman Professor of Psychology at Hope College, is also the author of The American Paradox: Spiritual Hunger in an Age of Plenty and A Quiet World: Living with Hearing Loss, both published by Yale University Press.\n===================================================================================","torrent":{"xt":"urn:btih:3e6d44de06109fa67c5ed66d3a03b92930b43e99","amp;dn":"David+G.+Myers+-+Intuition.+Its+Powers+and+Perils+%5B2004%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e6d44de06109fa67c5ed66d3a03b92930b43e99","infoHashBuffer":{"type":"Buffer","data":[62,109,68,222,6,16,159,166,124,94,214,109,58,3,185,41,48,180,62,153]},"announce":[],"urlList":[]}}