{"title":"DivineBitches-DiB-39869 Ana Foxxx, Lorelei Lee, Arabelle Raphael","uid":14343005,"size":3032621896,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3e7b970b800b236383d9af1d0bffb724614523a5&amp;dn=DivineBitches-DiB-39869+Ana+Foxxx%2C+Lorelei+Lee%2C+Arabelle+Raphael&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"merzedes","files":98,"time":1460768069,"description":"City of Sin: Entitled John Brought Down a Peg\r\n\r\nApr 15, 2016 - Performers: Lorelei Lee ,  Arabelle Raphael ,  Lance Hart  and  Ana Foxxx \r\n\r\n\r\nMed, Hi and HD MP4 + Pics.\r\n\r\n\r\nClassic tale of the helpless hooker? Another boring narrative that starts with a lady in distress? Fuck no. This is the truth. The real story of the City of Sin and its reigning princesses, the gloriously divine Lorelei Lee, Ana Foxxx, and newest Divine Bitch, Arabelle Raphael. \r\n\r\nWhen entitled john, Lance Hart, tries to take advantage of these three seemingly disadvantaged tricks, he gets an unforgettable taste of the power and strength of women. Three women, to be exact. Three ruthless, gorgeous women. \r\n\r\nAfter poor Mr. Hart grabs Arabelle, thinking he can intimidate this glorious and powerful woman with a little tip of the hat, some harsh words, and a stack of pitiful ones, she calls over her friends, Lorelei and Ana to help teach this entitled boy a lesson in masculinity. \r\n\r\nLesson One: pain. Our pitiable john is flogged repeatedly from all sides, humiliated and beaten down, made to worship the hard working, sweaty feet of the very women he thought himself better than. Lorelei, Arabelle, and Ana pull his chest hair until he screams, laughing mercilessly at his sad, pathetic cries and the pre-cum dribbling from his lonely dick. Smothering, blindfolds, and face slapping drive this lesson home! \r\n\r\nLesson Two: taking cock. The only way to bring entitled men down a peg is - you guessed it - pegging. All three of these gorgeous, powerful women arm themselves with a cock, each one burying dicks thicker than Lance's own deep inside his muscled body - a mere facade meant to shield the soft and snivelling manliness that hides within. Unable to escape the powerful clutches and scathing taunts of Ana, Arabelle, and Lorelei, our john takes the lesson hard and fast, pausing only to suck his own filth off of each divine cock. \r\n\r\nLesson Three: just a toy. That's right. You're just a toy. A toy to be used by women more powerful than you. And when these three powerful women cum again and again, smothering Lance as he devours the delicious flavors that orgasm has scented their heavenly cunts, it becomes clear: his cock is a dildo. A dildo that Lorelei, Arabelle, and Ana use to bring themselves the infinite pleasures that such entitled johns cannot. \r\n\r\nLesson learned? We'll have to wait to see what The Queen of City of Sin has to say about that...\r\n\r\nScreens \nhttp://www.divinebitches.com/site/shoot.jsp?shootId=39869\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttps://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:3e7b970b800b236383d9af1d0bffb724614523a5","amp;dn":"DivineBitches-DiB-39869+Ana+Foxxx%2C+Lorelei+Lee%2C+Arabelle+Raphael","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e7b970b800b236383d9af1d0bffb724614523a5","infoHashBuffer":{"type":"Buffer","data":[62,123,151,11,128,11,35,99,131,217,175,29,11,255,183,36,97,69,35,165]},"announce":[],"urlList":[]}}