{"title":"Rule by Secrecy -Jim Marrs- Hidden Trilateral Freemasons","uid":3370615,"size":373745664,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3ef7cb54d59ba5cb1b3826628d38482da8458888&amp;dn=Rule+by+Secrecy+-Jim+Marrs-+Hidden+Trilateral+Freemasons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"rci","files":1,"time":1124199176,"description":"[nwo] Rule by Secrecy -Jim Marrs- Hidden History Trilateral Freemasons.avi.torrent In Rule by Secrecy Marrs painstakingly examines the world's most closely guarded secrets, tracing the history of secret societies and the power they have wielded, from the ancient mysteries to modern-day conspiracy theories. Searching for truth, he uncovers disturbing evidence that the real movers and shakers of the world collude to start and stop wars, manipulate stock markets and interest rates, maintain class distinctions, and even censor the six o'clock news. And they do this under the auspices of the Council on Foreign Relations, the Trilateral Commission, the Bilderbergers, the CIA, and even the Vatican. According to Marrs, the power of these groups extends as far back as humankind's prehistory. Drawing on historical evidence and his own impeccable research, Marrs clearly traces the mysteries that connect these modern-day secret societies to the Freemasons, the Illuminati, the Knights Templar, and Egypt's Great Pyramids. The result is a masterful synthesis of historical information, much of it long hidden from the public, that sheds light on the people and organizations that rule our lives. http://hiddenmysteries.com/xcart/product.php?productid=16369","torrent":{"xt":"urn:btih:3ef7cb54d59ba5cb1b3826628d38482da8458888","amp;dn":"Rule+by+Secrecy+-Jim+Marrs-+Hidden+Trilateral+Freemasons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ef7cb54d59ba5cb1b3826628d38482da8458888","infoHashBuffer":{"type":"Buffer","data":[62,247,203,84,213,155,165,203,27,56,38,98,141,56,72,45,168,69,136,136]},"announce":[],"urlList":[]}}