{"title":"Teleport Pro v 1.65","uid":7085651,"size":1108896,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3f9b8a738c510eb1c18c57bcf1845c6d7e1f7b84&amp;dn=Teleport+Pro+v+1.65&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"slurpy97","files":-1,"time":1331175047,"description":"Teleport Pro allows users to download and view all the elements of a Web site. While this program provides offline browsing, it is not without some flaws that might turn users off.\n\nThis program's layout is initially intimidating, offering tons of white space and not much direction. Fortunately, there is a wizard that walks users through every step of the process. Utilizing the command icons after downloading a Web site may require a visit to the Help file, as it also provides no direction for the user. Working through the wizard was simple enough for every level to utilize. First, users choose whether they want to download an entire site, duplicate a Web site, search a site for a specific file type, search Web sites for keywords, and a few other options. Beyond that, users enter the URL and click a few radio buttons to perform the download. Each site is displayed as a file tree, which helps showcase how the site is organized and structured. The program is light on features, and we would have liked a viewer, so that users can surf through their downloaded content like an online browser, instead of having to click through the file tree.\n\n\n\nGreetings Realuploads","torrent":{"xt":"urn:btih:3f9b8a738c510eb1c18c57bcf1845c6d7e1f7b84","amp;dn":"Teleport+Pro+v+1.65","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f9b8a738c510eb1c18c57bcf1845c6d7e1f7b84","infoHashBuffer":{"type":"Buffer","data":[63,155,138,115,140,81,14,177,193,140,87,188,241,132,92,109,126,31,123,132]},"announce":[],"urlList":[]}}