{"title":"Coma Cutting Class v1.0.4","uid":12632717,"size":418271059,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3fcbe4000036de581ecd521cfffa6ccb84cfdc72&amp;dn=Coma+Cutting+Class+v1.0.4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Kappel.Eyal","files":1,"time":1445876019,"description":"Title: The Coma: Cutting Class \r\nGenre: Adventure, Indie \r\nPublisher: Devespresso Games\t\r\nRelease Date: 19 Oct, 2015 \r\nLanguage: English \r\n\r\nMinimum System Requirements: \r\nOS: Windows XP \r\nProcessor: Core2Duo \r\nMemory: 2 GB RAM \r\nGraphics: Any with hardware 3D acceleration \r\nDirectX: Version 7.0 \r\nHard Drive: 770 MB available space \r\nSound Card: Soundblaster / equivalent \r\nAdditional Notes: Earphones \r\n \r\nAbout This Game \r\n&quot;Where is everybody?&quot; \r\n\r\nYou were just another normal high school student in Korea. You had just sat down for your final exam, exhausted from an all-night cramming session. The result of all your preparation, and those grueling hours spent studying was dozing off in the middle of the test. \r\n\r\nYou awake to find yourself alone - no one had bothered to wake you when class was over. Night has begun, and you decide to head home. If you can... \r\n\r\nIt's a survival horror 2D adventure. Make your way through the now abandoned high school, packed full of haunting sights and dangerous traps. The school’s hellish corridors are not all you must contend with. Your fellow classmates and teachers have warped into frightening ghosts, who will stop at nothing to hunt you down. \r\nIn this unthinkable situation, your choice is clear: figure out what brought you here and escape the nightmare. Unfortunately, it seems that your school and its inhabitants have other intentions. \r\nCan You Survive The Hunt? \r\nRun, hide, and hold your breath! Someone is out there. Of all the dangers lurking in your school, the most frightening and dangerous of them all is the Hunter. When you hear her footsteps, hide yourself, lest you fall victim to her scream. Good luck, you'll need it! \r\n\r\nRun &amp; Hide \r\nWith no escape in sight, Youngho must roam the halls of his school at night searching for a way out. During this journey he will encounter many threats hell-bent on killing him. Running is the best way to avoid danger — unfortunately, Youngho isn't much of an athlete, so he won't be able to run for long. Find a place to hide from danger! \r\nExplore \r\nThe Coma is a harsh world. This twisted reality of your high school knows no kindness. Use maps, notes, and tips from other characters to navigate your way through the world and figure out how you became trapped in such a bleak place. \r\nSurvive &amp; Escape \r\nEverything is out to get you. Youngho will have to avoid a persistent killer, living vines, and more to survive the school. Unfortunately, health is in short supply, and if you're not careful, you will die. The good news is that save-points provide a welcome breather from the onslaught of things trying to kill you. \r\nKorean Horror \r\nThe Coma provides a glimpse — albeit a horrific one — into the life of Korea's overworked high school students. We hope you'll enjoy our infusion of Korean culture into the survival horror genre. \r\nContent \r\nAs Youngho, you must navigate through the three connected buildings of your high school using the help of NPCs and your own wits. Along the way, you will find unlockable art, notes, and easter eggs that expand on The Coma universe. Oh yeah, and a relentless killer, several traps, and a lot of game overs","torrent":{"xt":"urn:btih:3fcbe4000036de581ecd521cfffa6ccb84cfdc72","amp;dn":"Coma+Cutting+Class+v1.0.4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fcbe4000036de581ecd521cfffa6ccb84cfdc72","infoHashBuffer":{"type":"Buffer","data":[63,203,228,0,0,54,222,88,30,205,82,28,255,250,108,203,132,207,220,114]},"announce":[],"urlList":[]}}