{"title":"RealtimeBondage--Darling destroyed! Harcore ANAL pounding, epic ","uid":9920351,"size":1678729871,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:40136b133261680291f7bbb5c403cf2e62a417e7&amp;dn=RealtimeBondage--Darling+destroyed%21+Harcore+ANAL+pounding%2C+epic+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"merzedes","files":-1,"time":1396998751,"description":"\nDarling utterly destroyed by cock! Harcore ANAL pounding, epic deepthroat, complete sexual disgrace! | Darling\n\nApril 8, 2014\n\n\nMP4 only.\n\n\nIt is time to unleash the beast. Darling has a very very special talent. She can launch herself so deep into sexual subspace that she is unable to recall her own name. She is able to release herself into complete sexual abandon, going further then most people will ever be able to grasp. Darling can become an animal locked into pure pleasure with no holding back. We are going to reveal that animal in the best way possible...via massive amounts of anal. Anal can unlock most sexual animals.\n\nLaced in through a wooden ladder bondage device and roped into place, both ends of Darling are completely, deliciously, exposed. Her bountiful bubble butt on one side, her well trained mouthhole on the other. We step up and begin to dish out the dick. Darling is already loopy from the punishing pace of this live show. She has completely deepthroated 10 inches of BBC, been caged and cum and we are only just getting started. This punishing anal plowing is the key to unlocking that sexual beast. Darling is doomed.\n\nEvery inch of the cock owns her ass. Darling is completely gone. Locked into a sexual zone that most people are unable to even conceive, she is a drooling, vacant eyed mess. The whites of her eyes show, her makeup is panda eyed smudged, her mouthhole slack. The dicks pounds hard and deep without mercy, drilling down from both ends.\n\nBy the time we unpeel this limp well used piece of flesh off the ladder, her eyes are rolling around like pinballs. We drop her down to her knees and blast her facepussy a few more times with the dick, just to remind her of her place. She takes every inch to the base, showing just how trained her throat is. We leave her on her knees, mouth open, tongue out and panting. She is covered in cum, lube and drool, dazed and dizzy. This is the look of a girl properly hit by the cock train. Good job Darling! \n \nScreens &lt;a href=&quot;\nhttp://www.realtimebondage.com/live/bondage/2014/04_08darling5/RealTimeBondage-Darling-Darling-utterly-destroyed-by-cock-Harcore-ANAL-pounding-epic-deepthroat-complete-sexual-disgrace.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.realtimebondage.com/live/bondage/2014/04_08darling5/RealTimeBondage-Darling-Darling-utterly-destroyed-by-cock-Harcore-ANAL-pounding-epic-deepthroat-complete-sexual-disgrace.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:40136b133261680291f7bbb5c403cf2e62a417e7","amp;dn":"RealtimeBondage--Darling+destroyed%21+Harcore+ANAL+pounding%2C+epic+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40136b133261680291f7bbb5c403cf2e62a417e7","infoHashBuffer":{"type":"Buffer","data":[64,19,107,19,50,97,104,2,145,247,187,181,196,3,207,46,98,164,23,231]},"announce":[],"urlList":[]}}