{"title":"The Behavior Gap: Simple Ways to Stop Doing Dumb Things with Mon","uid":9409664,"size":23261777,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4025c55c9774752aeeaa7b750225a2b89bbe472b&amp;dn=The+Behavior+Gap%3A+Simple+Ways+to+Stop+Doing+Dumb+Things+with+Mon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"prabhu_","files":3,"time":1388252337,"description":"The Behavior Gap: Simple Ways to Stop Doing Dumb Things with Money\n\nby Carl Richards\n &lt;a href=&quot;\nhttp://www.mint.com/blog/wp-content/uploads/2012/01/Behavior-Gap-Resized.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mint.com/blog/wp-content/uploads/2012/01/Behavior-Gap-Resized.jpg&lt;/a&gt;\n\nabout book :-\n\n&quot;It's not that we're dumb. We're wired to avoid pain and pursue pleasure and security. It feels right to sell when everyone around us is scared and buy when everyone feels great. It may feel right-but it's not rational.&quot;\n-From The Behavior Gap\n\nWhy do we lose money? It's easy to blame the economy or the financial markets-but the real trouble lies in the decisions we make.\n\nAs a financial planner, Carl Richards grew frustrated watching people he cared about make the same mistakes over and over. They were letting emotion get in the way of smart financial decisions. He named this phenomenon-the distance between what we should do and what we actually do-&quot;the behavior gap.&quot; Using simple drawings to explain the gap, he found that once people understood it, they started doing much better.\n\nRichards's way with words and images has attracted a loyal following to his blog posts for The New York Times, appearances on National Public Radio, and his columns and lectures. His book will teach you how to rethink all kinds of situations where your perfectly natural instincts (for safety or success) can cost you money and peace of mind.\n\nHe'll help you to:\n\navoid the tendency to buy high and sell low;\navoid the pitfalls of generic financial advice;\ninvest all of your assets-time and energy as well as savings-more wisely;\nquit spending money and time on things that don't matter;\nidentify your real financial goals;\nstart meaningful conversations about money;\nsimplify your financial life;\nstop losing money!\nIt's never too late to make a fresh financial start. As Richards writes: &quot;We've all made mistakes, but now it's time to give yourself permission to review those mistakes, identify your personal behavior gaps, and make a plan to avoid them in the future. The goal isn't to make the 'perfect' decision about money every time, but to do the best we can and move forward. Most of the time, that's enough.&quot;\n\nabout the author :-\n\nCarl Richards is a certified financial planner and founder of Prasada Capital Management, a portfolio design firm. He contributes to the Bucks blog at The New York Times and is a columnist for Morningstar Advisor. Richards appears regularly on National Public Radio's Marketplace Money, and is a frequent keynote speaker at financial planning conferences and visual learning events. You can find more of his work at behaviorgap.com. He lives in Park City, Utah, with his family.\n\n`~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\t","torrent":{"xt":"urn:btih:4025c55c9774752aeeaa7b750225a2b89bbe472b","amp;dn":"The+Behavior+Gap%3A+Simple+Ways+to+Stop+Doing+Dumb+Things+with+Mon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4025c55c9774752aeeaa7b750225a2b89bbe472b","infoHashBuffer":{"type":"Buffer","data":[64,37,197,92,151,116,117,42,238,170,123,117,2,37,162,184,155,190,71,43]},"announce":[],"urlList":[]}}