{"title":"Need For Speed II by relentlesstech (1997)","uid":9342090,"size":592687104,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:40281fe8afd3e3c55e429924e98455c7b3a86842&amp;dn=Need+For+Speed+II+by+relentlesstech+%281997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"relentlesstech","files":-1,"time":1386955168,"description":"Need for Speed II featured some of the rarest and most exotic vehicles ever available, including the Ford Indigo concept vehicle, and features country-themed tracks from North America, Europe, Asia and Australia. The PlayStation port of NFS II was the first PlayStation game to take advantage of not only the NeGcon controller, but both the Dual Analog and the DualShock controllers as well.\n\nA new racing mode was also introduced in NFS II dubbed Knockout, where the last racers to finish laps will be eliminated until the only leading racer remains, and wins. Foregoing the realism of the first Need for Speed, NFS II provided a more arcade-like gameplay style, while maintaining the intricately designed levels.[verification needed] In addition, track design was more open-ended; players could now &quot;drive&quot; off the asphalt, and even cut across fields to take advantage of shortcuts.\n\nThe special edition of NFS II, Need for Speed II: Special Edition includes one extra track, extra cars, and support for Glide, the then-burgeoning 3D graphics standard used in 3dfx's Voodoo and Voodoo2 graphics cards.\n\n3. Need for Speed III: Hot Pursuit (1998)\nNeed for Speed III: Hot Pursuit added Hot Pursuit mode, in which the player either attempted to outrun the police or be the cop, arresting speeders.\n\nNFS III took advantage of the multimedia capabilities of the CD-ROM by featuring audio commentary, picture slideshows and music videos. This game also is the first in the series to allow the downloading of additional cars from the official website. As a result, modding communities have sprung up to create more vehicles which would otherwise be unavailable to the game. The PC version is also the first game in Need for Speed series to support Direct 3D hardware 3D acceleration.","torrent":{"xt":"urn:btih:40281fe8afd3e3c55e429924e98455c7b3a86842","amp;dn":"Need+For+Speed+II+by+relentlesstech+%281997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40281fe8afd3e3c55e429924e98455c7b3a86842","infoHashBuffer":{"type":"Buffer","data":[64,40,31,232,175,211,227,197,94,66,153,36,233,132,85,199,179,168,104,66]},"announce":[],"urlList":[]}}