{"title":"Microsoft Windows Security Essentials Exam 98-367","uid":7965553,"size":14533056,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:40305c5b231cc5a25ade550ddc896db575e6e4ad&amp;dn=Microsoft+Windows+Security+Essentials+Exam+98-367&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"d347hBy73","files":-1,"time":1356684877,"description":"Microsoft Windows Security Essentials Exam 98-367\n\n\nPublication Date: June 28, 2011 | ISBN-10: 111801684X | ISBN-13: 978-1118016848 | Edition: 1 | Format: EPUB\n\nWindows security concepts and technologies for IT beginners\nIT security can be a complex topic, especially for those new to the field of IT. This full-color book, with a focus on the Microsoft Technology Associate (MTA) program, offers a clear and easy-to-understand approach to Windows security risks and attacks for newcomers to the world of IT. By paring down to just the essentials, beginners gain a solid foundation of security concepts upon which more advanced topics and technologies can be built.\n\nThis straightforward guide begins each chapter by laying out a list of topics to be discussed, followed by a concise discussion of the core networking skills you need to have to gain a strong handle on the subject matter. Chapters conclude with review questions and suggested labs so you can measure your level of understanding of the chapters content.\n\nServes as an ideal resource for gaining a solid understanding of fundamental security concepts and skills\nOffers a straightforward and direct approach to security basics and covers anti-malware software products, firewalls, network topologies and devices, network ports, and more\nReviews all the topics you need to know for taking the MTA 98-367 exam\nProvides an overview of security components, looks at securing access with permissions, addresses audit policies and network auditing, and examines protecting clients and servers\nIf you're new to IT and interested in entering the IT workforce, then Microsoft Windows Security Essentials is essential reading.","torrent":{"xt":"urn:btih:40305c5b231cc5a25ade550ddc896db575e6e4ad","amp;dn":"Microsoft+Windows+Security+Essentials+Exam+98-367","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40305c5b231cc5a25ade550ddc896db575e6e4ad","infoHashBuffer":{"type":"Buffer","data":[64,48,92,91,35,28,197,162,90,222,85,13,220,137,109,181,117,230,228,173]},"announce":[],"urlList":[]}}