{"title":"Grow a Sustainable Diet - 2014 - EPUB","uid":9677733,"size":3435065,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4032eadc585fa03db5c0ff2dabbb0b32f916781a&amp;dn=Grow+a+Sustainable+Diet+-+2014+-+EPUB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"AtomTPB","files":1,"time":1393595961,"description":"Pages: 240 pages\nPublished: March 4, 2014\nLanguage: English\nISBN-10: 0865717567\nISBN-13: 978-0865717565\nFormat: EPUB\n\n\nEveryone loves to prepare a meal with ingredients fresh from their own garden. But for most of us, no matter how plentiful our harvest, homegrown produce comprises only a fraction of what we eat. And while many gardening guides will tell you everything you ever wanted to know about individual crops, few tackle the more involved task of helping you maximize the percentage of your diet you grow yourself.\n\nGrow a Sustainable Diet will help you develop a comprehensive, customized garden plan to produce the maximum number of calories and nutrients from any available space. Avoid arriving in August buried under a mountain of kale or zucchini (and not much else) by making thoughtful choices at the planning stage, focusing on dietary staples and key nutrients. Learn how to calculate:\n\nWhich food and cover crops are best for your specific requirements\nHow many seeds and plants of each variety you should sow\nWhat and when to plant, harvest, and replant for maximum yield\nFocusing on permaculture principles, bio-intensive gardening methods, getting food to the table with minimum fossil fuel input, and growing crops that sustain both you and your soil, this complete guide is a must-read for anyone working towards food self-sufficiency for themselves or their family.\n\nCindy Conner is a permaculture educator, founder of Homeplace Earth, and the producer of two popular instructional DVDs on sustainable gardening. Her passion is exploring growing a complete diet in a small space while minimizing the use of fossil fuels.","torrent":{"xt":"urn:btih:4032eadc585fa03db5c0ff2dabbb0b32f916781a","amp;dn":"Grow+a+Sustainable+Diet+-+2014+-+EPUB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4032eadc585fa03db5c0ff2dabbb0b32f916781a","infoHashBuffer":{"type":"Buffer","data":[64,50,234,220,88,95,160,61,181,192,255,45,171,187,11,50,249,22,120,26]},"announce":[],"urlList":[]}}