{"title":"Bruno Sanfilippo - Ad Libitum","uid":5184936,"size":93798537,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:41036b135e6fcc99e692274cc44e8c75ac30bfba&amp;dn=Bruno+Sanfilippo+-+Ad+Libitum&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"eugene51","files":13,"time":1259423976,"description":"What a delicately striking album this is. Part dark electronic, part new age, part soundtrack music, ad libitum all blends together into a wonderful tapestry of sonic imagery. \nFrom deep reverberating piano to lush atmospheric textures \nto cool electronic grooves, each element is perfectly placed. \nHipnoide starts with the aforementioned piano, melancholy and lovely in a Harold Budd \nsort of way, simply gorgeous. Tympani is used to great effect in Intention, enhanced by various synthetic touches, strings here, percussion there. \nThe quiet understated mood continues with DevociÃƒÂ³n, dominated by piano, strings, and something resembling harpsichord. It is more orchestral than electronic, and quite moving. Deceptive beauty is a soft ambient piece, with a slowly breathing organic drone as its centerpiece; its title could serve as a two-word review for ad libitum in its entirety. \nOniria is another piano-infused number, perhaps the most delicate piece yet, intoxicating. \nOppio opts for sad tones that resemble oboe or perhaps bassoon. \nJust when it seems the album has set a definitive path in the direction of all things quiet and reflective, two of the last three tracks challenge that just a bit. \nLuminae Psicoactive leaves me grasping for words to describe exactly its style and sound. \nThough it sounds more acoustic than electronic, it reminds me of the lush textures of the Cocteau Twins. \nThe title track adds tribal drums and occasional chants, and then the disc closes \nwith perhaps my favorite, LÃƒÂºdico.The coolest computerized rhythmic groove is laid down, courtesy of Max Corbacho, and Sanfilippo adds rich synth pads to perfectly enhance the proceedings. Ad libitum is a breathtakingly beautiful and complete package.","torrent":{"xt":"urn:btih:41036b135e6fcc99e692274cc44e8c75ac30bfba","amp;dn":"Bruno+Sanfilippo+-+Ad+Libitum","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41036b135e6fcc99e692274cc44e8c75ac30bfba","infoHashBuffer":{"type":"Buffer","data":[65,3,107,19,94,111,204,153,230,146,39,76,196,78,140,117,172,48,191,186]},"announce":[],"urlList":[]}}