{"title":"EssentialPIM Pro v4.02 [Portable] ","uid":6155394,"size":29474801,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4110ae22ccc7a9c4f9f9e754614b34ef36257c8c&amp;dn=EssentialPIM+Pro+v4.02+%5BPortable%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"chusca","files":3,"time":1297018249,"description":"Necesitas una agenda? Prueba entonces con EssentialPIM, una completÃƒÂ­sima utilidad que funciona como gestor de informaciÃƒÂ³n personal y con la que podrÃƒÂ¡s organizar tu vida laboral y personal, anotar todo aquello que consideres importante y mantener perfectamente organizados los datos de tus contactos. El programa cuenta con una atractiva interfaz en la que puedes visualizar toda tu informaciÃƒÂ³n de forma muy clara, y acceder a sus funciones a travÃƒÂ©s de intuitivos menÃƒÂºs.\nEn su modulo de Horarios, podrÃƒÂ¡s apuntar todas aquellas tareas, citas y eventos importantes de los que no puedes olvidarte. Cada tarea puede tener diferente prioridad, programarse para su repeticiÃƒÂ³n cada cierto periodo de tiempo y un aspecto totalmente personalizado. El mÃƒÂ³dulo de Notas te permite guardar anotaciones breves sobre lo que quieras, organizandolas en una lista jerarquizada, y con soporte para formato de texto, inserciÃƒÂ³n de tablas, imÃƒÂ¡genes, etc.\nFinalmente, el mÃƒÂ³dulo de Contactos es capaz de extraer datos directamente desde Microsoft Outlook y Outlook Express, permite poner campos personalizados e incluye un buscador integrado. Toda la informaciÃƒÂ³n que incluyas en EssentialPIM se puede \nproteger mediante clave, y tambiÃƒÂ©n exportarse a otros formatos como HTML, RTF, TXT, etc.\n-Idioma: InglÃƒÂ©s\n\n","torrent":{"xt":"urn:btih:4110ae22ccc7a9c4f9f9e754614b34ef36257c8c","amp;dn":"EssentialPIM+Pro+v4.02+%5BPortable%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4110ae22ccc7a9c4f9f9e754614b34ef36257c8c","infoHashBuffer":{"type":"Buffer","data":[65,16,174,34,204,199,169,196,249,249,231,84,97,75,52,239,54,37,124,140]},"announce":[],"urlList":[]}}