{"title":"Disney Movie - Hot Lead and Cold Feet (1978)","uid":4512927,"size":734607407,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4155175ca3eeac0c7204ecee0b353a4ff1c949c6&amp;dn=Disney+Movie+-+Hot+Lead+and+Cold+Feet+%281978%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"cowboy23","files":2,"time":1226856596,"description":"Uploading this movie per request. Enjoy\n\nJasper Bloodshy (Dale) owns the rough and tumble town of Bloodshy (named after him, because he founded the town) which also lives in fear of Jasper&amp;#039;s gunslinging son Wild Billy (also played by Dale). However, Jasper has just found out he has another son named Eli (again, played by Dale), who lives in Philadelphia. It turns out that years ago, Jasper&amp;#039;s crazy ways were too much for his bride from England, so she left (leaving one of the two twins) and returned to England. So with the help of his English butler Mansfield, he writes a new will that mentions Eli, and he also fakes his death by pretending to fall off a cliff, in front of Bloodshy&amp;#039;s Mayor Ragsdale (McGavin) and Sheriff Denver Kid (Knotts) (both of whom he had just told about his second son). From there, we meet Eli, who turns out to be the opposite of Wild Billy; Eli has been trained to live for the Lord, and works as a Salvation Army missionary in Philadelphia with two orphans named Roxane and Marcus. One day, during a fight in which people are throwing vegetables on Eli and the children, Eli receives a telegram informing him about his father&amp;#039;s death (he had never known about his father) and asking him to come to Bloodshy to collect his inheritance. He decides to accept the invitation and take Marcus and Roxanne.\n\nThe trip becomes a disaster when the stage coach they are riding is held up by the Snead brothers, a group of outlaws that Ragsdale had sent to run off Eli. Unfortunately, nobody was told that Jasper&amp;#039;s other son was a twin, and they mistake Eli for Wild Billy (the first of many to mistake the two). the Sneads run off back to Bloodshy, but had caused the stagecoach to run off, leaving Eli, Marcus, and Roxanne stranded. On their way to Bloodshy (by foot), they meet a woman named Jenny (Valentine) who is also headed for Bloodshy to start a school, and they decide to head for the town together.\n\nBack in Bloodshy, Mansfield brings the will to Sheriff Denver to deliver to Ragsdale. From there, we discover that a contest in involved in the inheritance. And Ragsdale sends Denver to find Billy and tell him that the fortune is his.\n\nThe contest is miles long obstacle course known as the Bloody Bloodshy trail, and involves operating rain engines, crossing a gorge using a rope, climbing a mountain, and driving a wagon.","torrent":{"xt":"urn:btih:4155175ca3eeac0c7204ecee0b353a4ff1c949c6","amp;dn":"Disney+Movie+-+Hot+Lead+and+Cold+Feet+%281978%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4155175ca3eeac0c7204ecee0b353a4ff1c949c6","infoHashBuffer":{"type":"Buffer","data":[65,85,23,92,163,238,172,12,114,4,236,238,11,53,58,79,241,201,73,198]},"announce":[],"urlList":[]}}