{"title":"Disney Movie - The Snowball Express (1972)","uid":4512380,"size":1048346671,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:416b52558d1c3a83f2f383853a80ab65fce417f0&amp;dn=Disney+Movie+-+The+Snowball+Express+%281972%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"cowboy23","files":2,"time":1226836496,"description":"All the elements are in place for an upbeat and likable family comedy riding on the comedic spark of Dean Jones. Jones appeared in a plethora of Disney comedies during the &amp;#039;60s and &amp;#039;70s and his goofy charm is as appealing and present in 1972&amp;#039;s Snowball Express as any of them.\n\nJohnny Baxter (Jones) is an employee of a dry Indemnity and Casualty firm in New York. Learning he has just inherited a Colorado hotel from the death of a distant great uncle, Baxter takes a moment and then quits in style, in a way that only Dean Jones could. This sets Snowball Express in motion, before the opening credits even roll.\n\nSo, Johnny and the Baxters head west, a family of four complete with wife (Nancy Olson, Sunset Boulevard, The Absent-Minded Professor), son (Johnny Whitaker, who appeared in The Biscuit Eater and Napoleon and Samantha for Disney the same year), and daughter (Kathleen Cody, Charley and the Angel, Superdad). They know not what to expect, but being that this is a Disney comedy, you just might be able to guess that the Grand Imperial hotel they inherited is not so grand; in fact, it&amp;#039;s in complete disarray. There are raccoons in the oven, guppies in the water pipes, and cobwebs everywhere.\n\nDean Jones makes a grand exit from his thankless job in New York... ...and the Baxters head for Colorado!\n\nRather than giving up on what appears to be a lost cause, Johnny decides the family ought to try and restore things and open it as a great ski lodge which will draw people from all over the country. To do this, though, the Baxters need loans, and Johnny decides it best for him to pretend to be a ski buff. An avalanche in another part of town suddenly brings the Grand Imperial its first taste of business.\n\nSome comic mishaps leave the Baxters again in need of money, but rather than pass the hotel onto banker Martin Ridgeway (Keenan Wynn) , who shows an unusually strong interest, Johnny thinks that just maybe a snowmobile race with monetary prize could be the answer. This race is shown, complete with action sequences and some amusing banter between Johnny and his sidekick, an oddball squatter (Harry Morgan). Ultimately, it leads to a sticky resolution, which probably overextends in its efforts to push logic behind the inevitable happy ending.\n\nIf a complaint can be lodged against the film, and it can be against many of the &amp;#039;wacky Disney comedies&amp;#039; from this era, it&amp;#039;s that Snowball Express goes a bit heavy on the physical stuff - stunt work and action sequences. They don&amp;#039;t quite become tedious, but they&amp;#039;re just not as personal and entertaining as the interplay among the characters. I think seeing a bit more of the family and the old hotel ruins, and a bit less of the snowy plummets, would have made the film even more funny and endearing. As it is, though, the film doesn&amp;#039;t cease to be entertaining in a lighthearted way. It&amp;#039;s even more amusing than many of the other comedies that the charismatic Jones headlined for the studio.","torrent":{"xt":"urn:btih:416b52558d1c3a83f2f383853a80ab65fce417f0","amp;dn":"Disney+Movie+-+The+Snowball+Express+%281972%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"416b52558d1c3a83f2f383853a80ab65fce417f0","infoHashBuffer":{"type":"Buffer","data":[65,107,82,85,141,28,58,131,242,243,131,133,58,128,171,101,252,228,23,240]},"announce":[],"urlList":[]}}