{"title":"Vanity Fare - The Sun, The Wind, And Other Things (1994)","uid":8649303,"size":473973555,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:41f08aa82724f811acabfa82e221fda2265a6daa&amp;dn=Vanity+Fare+-+The+Sun%2C+The+Wind%2C+And+Other+Things+%281994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"wankawitz","files":36,"time":1373062536,"description":"This is the same torrent that was uploaded to Demonoid in September 2011.\n\n\nVanity Fare - The Sun, The Wind, And Other Things (1994)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51NEDM3AYSL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51NEDM3AYSL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com) DVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nArtwork for Repertoire release folder (with 3 files)\nAMG Bio.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nBiography from All Music (by Jason Ankeny):\n\nBest remembered in the U.S. for the classic &quot;Hitchin' a Ride,&quot; harmony pop ensemble Vanity Fare formed in Kent, England in 1968. Comprising vocalist Trevor Brice, guitarist Tony Goulden, bassist Tony Jarrett, and drummer Dick Allix, the group originally dubbed themselves the Avengers; soon local entrepreneur Roger Easterby signed on as manager, orchestrating a contract with the Page One label and instructing the group to cover the Sunrays' &quot;I Live for the Sun&quot; for their debut single. With their sophisticated harmonies and clean-cut image, the Avengers needed a suitably genteel name, remixing the title of William Makepeace Thackeray's most famous novel to create Vanity Fare; &quot;I Live for the Sun&quot; cracked the U.K. Top 20 in the summer of 1968, although it would take the group a year to return to the charts, with &quot;Early in the Morning&quot; reaching the Top Ten on both sides of the Atlantic. Around this time, Vanity Fare jettisoned its tailored suits for neckerchiefs and fashions direct from Carnaby Street; more importantly, they also added keyboardist Barry Landeman, previously a member of Kippington Lodge, alongside Nick Lowe and Brinsley Schwartz; Landeman would prove the dominant instrumental element in the group's biggest hit, 1969's infectious &quot;Hitchin' a Ride,&quot; which sold over a million copies in the U.S. alone. A North American tour was met with little interest, however, and soon after Vanity Fare returned to Britain. Goulden quit, quickly followed by Allix; Candy Choir guitarist Erica Wheeler and Canterbury Tales' drummer Mark Ellen signed on as their replacements. The new lineup scored a minor hit with 1972's ballad &quot;Better by Far,&quot; and concentrated on touring the cabaret circuit, performing as many as 14 dates a week; the grind ultimately forced Jarrett to resign, with former Tranquility bassist Bernard Hagley signing on for &quot;I'm in Love With the World,&quot; Vanity Fare's first single for new label Phillips. In the wake of 1974's &quot;Fast Running Out of World&quot; their recording career screeched to a halt, but the group continued touring, including several passes through Scandinavia. During one trek to Denmark, Brice fell in love and quit the group, with singer Phil Kitto taking his place. Kitto also exited a few years later, with vocalist Kevin Thompson installed as frontman by the time Vanity Fare recorded 1986's &quot;Dreamer,&quot; its first single in over a decade. With 1993's &quot;Rain,&quot; their recording career again went into mothballs, but the band continues touring, with singer Steve Oakman replacing Thompson in early 2002.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/artist/vanity-fare-p24927/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/vanity-fare-p24927/biography&lt;/a&gt;\n\nAll Music Album Page: &lt;a href=&quot;\nhttp://www.allmusic.com/album/the-sun-the-wind-and-other-things-r238844&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/the-sun-the-wind-and-other-things-r238844&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B0000008XU&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B0000008XU&lt;/a&gt;\n\nCD Universe's page: \n\nTrack List:\n\n01. I Live For The Sun\n02. Hitchin' A Ride\n03. Come Tomorrow\n04. Early In the Morning\n05. Carolina's Comin' Home\n06. Highway Of Dreams\n07. Our Own Way Of Living\n08. Summer Morning\n09. Betty Carter\n10. Is My Lonely Room\n11. For Strong Winds\n12. Nowhere To Go\n13. Waiting For The Nightfall\n14. On Our Own\n15. Man Child\n16. Hey Baby\n17. Megowd\n18. I Hear Trumpets Blow\n19. Music, Music, Music\n20. You Made Me Love You\n21. Lucky Lady Bug\n22. Puppet On A String\n23. Young Girl\n24. On The Other Side Of Love\n25. You've Lost That Lovin' Feelin'\n","torrent":{"xt":"urn:btih:41f08aa82724f811acabfa82e221fda2265a6daa","amp;dn":"Vanity+Fare+-+The+Sun%2C+The+Wind%2C+And+Other+Things+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41f08aa82724f811acabfa82e221fda2265a6daa","infoHashBuffer":{"type":"Buffer","data":[65,240,138,168,39,36,248,17,172,171,250,130,226,33,253,162,38,90,109,170]},"announce":[],"urlList":[]}}