{"title":"Marvel vs Capcom Clash of Super Heroes DC + nulldc Emulator","uid":9692492,"size":332098373,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4232380cac849546aab9ea28adcbf8f401bfd7e7&amp;dn=Marvel+vs+Capcom+Clash+of+Super+Heroes+DC+%2B+nulldc+Emulator&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"razalgul1979","files":-1,"time":1393890751,"description":"Game Details\nMedia: 1 x CD-R\nRegion: NTSC\nESBR Rating: T for Teen: Animated Violence \nLanguages: English Only\nNumber Of Players: 1-4 \nGenre:  Fighting \nRelease Date: October 7, 1999\nPublisher: Capcom\nDeveloper: Capcom \nGame Altered: No\n \n\nFile Details\nFormat: CDI\nUnpacked size: 713 MB (747.689.134 bytes)\nTested and working with null dc on PC Desktop Dual Core 2 GB RAM Gforce GT 610\nNote: Selfboot\n\nInstructions\n1. Unrar\n2. Burn with your choice of burning software, suggest Discjugller at x4 to CD-R and play on console or load on emulator included\n3. Play\n\n\n\nMarvel vs. Capcom: Clash of Super Heroes  is the fifth Marvel Comics-licensed fighting game by Capcom and the third game in the Marvel vs. Capcom series. The game was developed in late 1997 and first released in January 1998. Its later port for the PlayStation was released as Marvel vs. Capcom: EX Edition in Japan; a Sega Saturn version was released as well. It was re-released in 2012 as part of Marvel vs. Capcom Origins.\n\nIn contrast to X-Men vs. Street Fighter and Marvel Super Heroes vs. Street Fighter, the game features characters from numerous Capcom franchises such as Mega Man and Strider, rather than just Street Fighter characters. The game takes place within the Marvel comic continuity, as Professor Charles Xavier calls out for heroes to stop him before he merges with the consciousness of Magneto and becomes the being known as Onslaught, the final boss.\n\nGameplay\n\nUnlike the previous game in the series, the point character of a Marvel vs. Capcom team cannot summon the offscreen partner for an assist attack; instead, an assist character is randomly selected before the match begins. This character can be summoned a limited number of times in battle to attack the opponent in parallel. Codes can be used to force the system to select a certain assist character.\n\nThe Duo Team Attack allows a player to control both characters on his or her team simultaneously for a brief period of time; the characters have unlimited use of their super moves during this time. Since some characters have hard-to-avoid super moves that do substantial damage if blocked, the Duo Team Attack can lead to tactics that are oriented around activating it before an opponent could. Since the PlayStation version only allows one character to play a point, a Duo Team Attack will call the assist character repeatedly without cost during its duration.\n\nAn arcade perfect Dreamcast port was released in 1999 as a launch title. This version contains a &quot;cross-fever&quot; mode that allows four-player simultaneous gameplay.","torrent":{"xt":"urn:btih:4232380cac849546aab9ea28adcbf8f401bfd7e7","amp;dn":"Marvel+vs+Capcom+Clash+of+Super+Heroes+DC+%2B+nulldc+Emulator","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4232380cac849546aab9ea28adcbf8f401bfd7e7","infoHashBuffer":{"type":"Buffer","data":[66,50,56,12,172,132,149,70,170,185,234,40,173,203,248,244,1,191,215,231]},"announce":[],"urlList":[]}}