{"title":"Angel - Complete Season 4 - DVD Rip","uid":4646220,"size":9225211904,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:42327d689b487a98cee23ed504d2c13002acf211&amp;dn=Angel+-+Complete+Season+4+-+DVD+Rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"k22567","files":-1,"time":1231889297,"description":"Angel's story before he met Buffy unfolds in flashbacks scattered among numerous episodes of both Buffy the Vampire Slayer and Angel, presented without concern for chronological order.\n\nAngelus during the 18th century: Liam was born to a middle-class Irish linen merchant, in 1727. By 1753, at the age of 26, he had developed a taste for alcohol, women and sloth. Though a good man at heart and well-educated, Liam was a hedonist whose only real ambitions lay in seeing the world and wishing he could meet a woman who wasn't dull and boring like noblewomen. For the lazy Irishman, this seemed a laughable dream, especially after he was expelled from his father's household. While in a drunken tavern brawl, he caught the eye of Darla, a vampire. Liam was tossed out of the tavern for causing trouble and was lured into an alley by the seductive and elegant Darla, who, promising to show him the world, transformed him into a vampire. Becoming a vampire meant the loss of his human soul, or self, freeing the demon who took over Liam's body to act upon his darker impulses.\n\nOn the night he rose from his grave and in response to Darla's claim that he could have anyone in the village, he set about slaughtering the entire community of Galway, Ireland, starting with a gravedigger. But most important was the killing of his family. First, he killed his little sister, Kathy, who had unknowingly invited the demon in, believing that he had come back to her as an &quot;angel.&quot; This was the source of his adopted name, &quot;Angelus,&quot; the Latinate for &quot;Angel.&quot; He is later described as &quot;the demon with the face of an angel.&quot; He kills his mother, and finally his father. Darla told Angelus that he had not won, because while he could not be disapproved of again, he could never be approved of, either. After leaving Galway, Ireland, Angelus and Darla cut a bloody swath through Wales and northern England. In 1760, Darla split ways with the Master and chose to leave with the &quot;stallion,&quot; Angelus.\n\nIn May 1764, Angelus and Darla killed the family of vampire killer, Daniel Holtz. Holtz vowed revenge on Angelus and Darla, chasing them across Europe. Angelus and Darla had a near miss in France, after making too much noise by ordering room service and eating the waiters. Darla fled to Austria, leaving Angelus in a burning barn on their only horse. After meeting again in Vienna, Angelus and Darla sired the vampires James and Elizabeth. In Marseilles, 1767, Holtz tracked down Angelus, Darla, James and Elizabeth and put numerous arrows in Angelus. Holtz briefly lost them in northern Africa, only to track Angelus to Rome, Italy in 1771. Instead of killing Holtz, they came to view him &quot;like family&quot; while making a sport of ruining his life. Holtz continued his quest, but failed and returned to York, England to die a lonely man, until in 1773 the demon, Sahjhan, offered to take him to the future to continue his revenge.\n\nAngelus later sired a Puritan by the name of Penn, who wreaked havoc on his father and killed his family. He then copied Angelus' custom of leaving a cross-shaped mark on the left cheek of his victims in order to spite God. In 1789, Angelus encountered the Beast in Prussia, standing in a field of bodies. He declined to join with the Beast, and the Svear priestesses banished the Beast while Angelus was passed out.\n\nIn 1860, Drusilla from London, England, a young woman &quot;cursed&quot; with the &quot;sight,&quot; something her mother saw as &quot;an affront to the Lord,&quot; was shown to Angelus by Darla while Drusilla walked with her family. Drusilla and her sisters were all noted to be virgins, and Drusilla was described as having been &quot;sweet, pure and chaste.&quot; Angelus killed her family, which caused Drusilla to flee to a convent. On the day she was to take her holy orders, Angelus massacred the convent (he had an obsession with nuns, including a massacre of those at &quot;Our Lady of Lochenbee&quot;). Then, he proceeded to rape her and drive her insane, before he finally sired her, cursing her with &quot;eternal torment.&quot; Drusilla was Angelus' masterpiece; he saw her and his worst displays of torture as works of art.\n\nDrusilla, in turn, sired William, for whom Angelus largely served as a mentor and &quot;role model.&quot; William, who later becomes known as &quot;Spike,&quot; went so far as to call the elder vampire his &quot;Yoda.&quot; Angelus taught William about the art of mass slaughter, including an incident during a wedding party where Angelus beat the groom to death with his own arm. Angelus threatened to stake Spike in a London mine shaft in 1888, for putting the quartet on the run after attracting too much attention. Angelus introduced Spike to the existence of the Slayer as a cautionary tale.\n\nIn 1890, Angelus attended a production of Giselle by the Blinnikov, a Russian ballet troupe run by Count Kurskov. Despite being evil, he is moved to tears during the performance. In 1894, Angelus and Spike were captured by the Immortal's henchmen in Rome, Italy and tortured while the Immortal had a threesome with a willing Darla and Drusilla. Darla and Angelus were also present at an earthquake in Budapest, Hungary around the turn of the century, where Angelus was a particularly &quot;bad boy.&quot;\n\nIn 1898, while in Borsa, Romania, Angelus tortured and killed the favorite daughter of a tribe of gypsies. To avenge her death, the Kalderash gypsies cursed him by restoring his human soul, thus afflicting him with a conscience and condemning him to an eternity of remorse for the crimes he had committed. Darla found Angel huddled in their apartment talking of all the atrocities they had committed, and she recognized that he had a &quot;filthy human soul.&quot; Darla tried to reverse the curse, but the father of the dead Gypsy girl refused to help. Darla snapped his neck, and with Drusilla and Spike, proceeded to slaughter the entire tribe. Angel killed several men who insulted him, but when he tried to kill the woman, he found that he could not bring himself to.\n\nDuring the Boxer Rebellion in Beijing, China, the ensouled vampire, now known as &quot;Angel,&quot; tried and failed to resume his life with Darla. To satisfy Darla he started killing humans again, but she noticed that he was only hunting rapists, murderers and evil-doers. Darla caught Angel trying to save a group of Christian missionaries from her while they huddled in an alley. While Angel was feeding on rats down at the waterfront, Darla killed the missionary family and brought back their baby to test Angel, but he found himself unable to kill it. Angel fled with the baby and finally left Darla.\n\nAngel came to New York City, New York through Ellis Island in 1902. During World War II, Angel was coerced by The Demon Research Initiative into undertaking a secret mission. He was ordered to rescue an American submarine crew from three Nazi-captured vampires (including Spike), who had murdered most of the crew after escaping. During this adventure, Angel was forced to sire a fatally-injured Sam Lawson in order for him to repair damage to the engine, which they sustained after a German attack. Angel later claims to have known Bugsy Siegel around this era, in the early days of Las Vegas, Nevada.\n\nIn 1952, while in Los Angeles, California, Angel was a resident at the Hyperion Hotel, the future base of Angel Investigations. [1] Although he tried to isolate himself, Angel was forced to become involved by the actions of Judy, who had fled her home town after stealing a sum of money from her job. Things quickly deteriorated when a string of murders and suicides gripped the hotel, and everyone slowly grew increasingly paranoid. As Angel learned, this was the result of a Thesulac demon, a demon living off fear, and he initially tried to kill the demon, until the people at the hotel turned against him and lynched him. Surviving the hanging, and disgusted with the humans, Angel allowed the demon to take everyone inside the hotel.\n\nAngel claims to have known the Rat Pack and to have been present during Elvis Presley's wedding reception after his marriage to Priscilla Ann Beaulieu in Las Vegas, Nevada on May 1, 1967.\n\nIn New York during the 1970s, Angel witnessed a robbery at a doughnut shop. [2] After the robber shot an employee and fled, Angel stayed with the man as he died, and then proceeded to feed on him. Deeply disgusted by his own weakness, Angel fled the shop, and then exiled himself to a life of homelessness, living in alleyways and feeding on rats.\n\nTwo decades later, a shadow of his former self, the reclusive and emotionally tortured Angel was sought out in 1996 by a demon named Whistler, who persuaded him to join the fight against evil. Whistler helped Angel meet the newly-called Vampire Slayer, Buffy Summers. The following year, when he and Buffy finally meet in Sunnydale, he introduces himself, not as Angelus, but as Angel.\n\nBuffy the Vampire Slayer: Although Angel sees Buffy while she is still in L.A. [3], he does not introduce himself to her until after her move to Sunnydale, and after her first day at Sunnydale High [4]. The two fall in love, but Buffy does not realize Angel is a vampire until several weeks later in the episode &quot;Angel.&quot; Though they try to deny their feelings, they cannot resist the passion growing between them. When they finally consummate their relationship in &quot;Surprise,&quot; Angel experiences one moment of pure happiness, which breaks the Gypsy curse and he loses his soul. Without the compassion and conscience instilled by his human soul, Angel instantly reverts to his former evil self, Angelus, in the following episode. [5]\n\nAngelus becomes the &quot;Big Bad&quot; of Buffy's second season. Angelus allies himself once again with Spike and Drusilla, who have recently settled in Sunnydale. Resenting the humiliation he felt because Buffy had made Angel feel like a human being, Angelus takes immense pleasure in tormenting the Slayer and her friends. First, he helps Spike and Dru deploy a powerful demon known as the Judge. After Buffy destroys the Judge, Angelus embarks on a guerilla campaign, lurking in the shadows, preying on Buffy's classmates, sending her gruesome messages, even drawing pictures of her and her mother as they sleep and leaving them in her bedroom.\n\nHe proceeds to murder Jenny Calendar, which serves him in two ways: First, he eliminates an enemy (Jenny was born Janna of the Kalderash clan) and destroys her work just as she manages to successfully decipher the lost Gypsy curse which could be used to restore Angel's soul. Second, Angelus uses Jenny's death to viciously torment Rupert Giles, Jenny's paramour and the person on whom Buffy depends most. After this, Angelus widens his focus and begins a scheme to awaken the demon Acathla and bring about the end of the world. Buffy is determined to stop him despite their history, and is able to overcome him in combat. Just as she prepares for the finishing blow, however, Willow Rosenberg is able to restore Angel's soul. Since Acathla can only be stopped by the blood of the individual who activated him, Buffy is forced to sacrifice Angel to save the world. Impaled on the Slayer's enchanted sword, Angel is sucked into Acathla's vortex which suddenly snaps closed. [6]\n\nThird season: Less than a year later (by Sunnydale time), Angel unexpectedly returns in &quot;Faith, Hope &amp; Trick&quot; from Acathla's hell, reappearing in his mansion in a feral state. Buffy aids him in secret, fostering his rehabilitation. [7] Once he regains his senses, Angel begins to suspect that his return from Hell was not accidental, and that he must serve some unknown, but evil, purpose. Eventually he begins to experience what he believes to be hallucinations, but he is actually being haunted by the First Evil. The First, able to adopt the appearances of Angelus' victims, drives Angel ever closer to the brink of madness and tries to tempt him to lose his soul and kill Buffy. Instead, Angel decides to commit suicide, but finds the sun clouded by snow, a rare occurrence in Sunnydale. [8] After these events, Angel and Buffy try to resume their relationship, but Angel quickly discovers that he cannot possibly give Buffy a remotely normal human life. These thoughts are echoed by Richard Wilkins and Joyce Summers, and Angel decides to leave Sunnydale, doing so at the end of the season three finale, &quot;Graduation Day, Part Two&quot;.\n\nAngel: the series In L.A., Angel spends a few months alone, patrolling dives and dark alleys, battling vampires who hunt there. Soon enough, he receives support in his attempts to redeem himself in the service of others. First, Doyle, a half-demon and fellow Irishman, is sent by The Powers That Be. Almost immediately thereafter, Angel runs into Cordelia Chase, a former classmate of Buffy's who has moved to L.A. to find wealth and fame. The trio form Angel Investigations, a shoestring operation whose mission statement is to &quot;Help the Helpless.&quot;\n\nDoyle, Angel's trusted friend and sole connection to the Powers, sacrifices himself in the episode &quot;Hero&quot; to save others, leading Angel to become even more protective of those few he holds dear. Wesley Wyndam-Pryce, who had briefly served as Watcher to both Buffy and Faith in Sunnydale, arrives in L.A. claiming to be a &quot;rogue demon hunter,&quot; a lone wolf sort who only works solo. [9] After their first case, however, Wesley is eager to stay and assist Angel and Cordelia in their mission. A few months later, they are joined by lifelong demon fighter, Charles Gunn. [10] During this time, three young Wolfram and Hart associates, Lindsey McDonald, Lee Mercer, and Lilah Morgan, attempt to have Angel killed by the rogue vampire slayer, Faith. Under Angel's influence, the deeply troubled Faith starts along her own path to redemption, ultimately turning herself in to the police as the first step toward making amends for her crimes.\n\nSecond season: As Angel continues to help the helpless in Los Angeles, his good deeds begin seriously to disrupt the plans of the evil inter-dimensional law firm, Wolfram and Hart. In an attempt to control him, the firm resurrects his sire and former lover, Darla, who comes back as a human rather than as a vampire. [11] Wolfram and Hart then summons Drusilla, who turns Darla into a vampire again. Angel turns to a darker side of himself, firing his crew and embarks on a vendetta against both the law firm and the newly reunited Darla and Drusilla. During this time, Angel refuses to prevent the slaughter of a very large group of Wolfram &amp; Hart employees at the hands of Dru and Darla. After a devastating spiritual defeat by Holland Manners, Angel attempts to shed his soul by having sex with Darla, but instead of happiness, finds despair. [12] A moment of clarity follows the desperate act, and Angel realizes that his purpose is still to do all the good he can, even if he can't do all the good he wants. Having hoped to get her boy Angelus back, Darla is horrified and infuriated by Angel's epiphany, and flees Los Angeles. After a difficult reconciliation that involves Wesley taking over the official position of leader of the group, the Angel Investigations team find themselves transported to the demon dimension, Pylea, in the episode &quot;Over the Rainbow.&quot; Eventually, after Angel defeats the undefeated Champion of Pylea, the Groosalugg, they return with a new team member, Winifred Burkle, in tow, and to the news that the love of Angel's life, Buffy, has died. [13] During this time the Angel Investigations team also enlists the help of demon karaoke bar-owner Lorne, known initially only as The Host.\n\nThird season: Despite Buffy's miraculous resurrection a few months later, Angel finds that his previously platonic love for Cordelia has grown to be romantic. Before he has a chance to confess his feelings, however, Darla returns, pregnant with his son, to be named Connor. False prophecies, time travelers and betrayal lead to Angel losing his infant son to an old enemy, Holtz, who abducts Connor soon after his birth, taking him to a hell dimension (Quor-Toth) where time passes differently. When Connor returns days later, he is a young man who has been raised by Holtz to believe that Angel is still a soulless monster. Holtz takes his own life in such a way that Connor is led to believe he was killed by Angel and vows to make Angel pay for the suffering he had caused Holtz. That same night, Connor sinks his father to the bottom of the ocean in a steel coffin and Cordelia ascends to a higher plane, the feelings shared between her and Angel still left unspoken.\n\nFourth season: Rescued by Wesley from his watery prison, Angel's relationship with Connor is strained. It is complicated further by the return of an amnesiac Cordelia, who prefers to stay with Connor because he told her the truth while the others lied to her (albeit because they thought it was for her own good). When a very powerful demon known only as the Beast arrives and begins an attempt to bring forth an apocalypse, Angel's worst fears are realized when he has to strip himself of his soul and revert to his evil alter ego in order to defeat it. Angelus does indeed overcome the Beast, and is also deft enough to realize that the Beast was a mere &quot;flunkie&quot; serving an even deeper evil; the Beast he knew from centuries ago was only interested in smashing and slaughter, and it was unlikely that the Beast would have become smarter since Angelus fought him.\n\nAlthough he is momentarily free to wreak a little havoc of his own, Angelus is recaptured and re-ensouled with the help of Faith (who almost dies in her quest to capture Angelus) and Willow, culminating in a brief but violent mental battle between Angel and Angelus. After his soul is restored, Angel figures out that the enemy he has been battling is a little closer to home than the group had previously considered, realizing that whatever the Beast's &quot;boss&quot; is, it is using Cordelia's body to carry out its plans. After battling and defeating the divine being known as Jasmine, Angel is offered the L.A. branch of Wolfram &amp; Hart on the grounds that he ended world peace. Angel acts against all of his instincts and makes a deal with his sworn enemy, in exchange for Wolfram &amp; Hart erasing Connors memories and giving him a normal life, and trying to find a way to cure Cordelia.\n\nFifth season: The lines between good and evil blur as Angel moves into Wolfram &amp; Hart, and they challenge Angel's perceptions of himself and his destiny. Matters are further complicated when Spike appears as a ghost, emerging from a familiar amulet sent to Angel in the mail. Sharing a complicated history of murder and mayhem, they have spent more than a century as rivals in everything. Now both possessing souls, and both still in love with Buffy, they have evolved into very different heroes in the war against evil. Forced to co-exist, they wage a protracted, insidious battle of wits, ending when they finally come to an understanding and acceptance of their unique brotherhood on their journey to redemption.\n\nIn the episode &quot;Destiny,&quot; when they prepare to do battle over the Cup of Perpetual Torment, Spike tells Angel &quot;You had a soul forced on you. As a curse. Make you suffer for all the horrible things you've done. Me, I fought for my soul, went through the demon trials, almost did me in a dozen times over, but I kept fighting. Because I knew it was the right thing to do. It's my destiny.&quot; Although the Cup turns out to be fake, Angel's defeat at the hands of Spike is a source for inner turmoil in the following episodes. Most of these events turn out to be the machinations of Lindsey McDonald, a returning nemesis, and after he is defeated, Angel grows more confident once more.\n\nThis defeat coincides with a last visit from Cordelia, who passes along a single vision to Angel. Now finally understanding that he will never be able to completely stop the forces of evil, Angel decides that temporarily severing the Senior Partners' hold on Earth is enough. Together with his comrades, Angel prepares to suicidally incur the apocalyptic wrath of the Senior Partners as a way of going out in a blaze of glory. They assassinate the members of the Circle of the Black Thorn, the Senior Partners' instruments on Earth for pulling all the political and economic strings. In this effort, Gunn is badly wounded, and Wesley Wyndam-Pryce is killed. Lorne is instructed to kill Lindsey, temporarily an ally, after they've completed their mission, and he does so, leaving behind Angel and his team afterwards. Gunn manages to make it to the meeting point, the alley behind the Hyperion Hotel, where he, Angel, Spike and Illyria engage in battle with the dark armies that the Senior Partners have sent against them. The last words spoken on screen are, &quot;Let's go to work.&quot;\n\nAfter Angel: In the non-canonical comics following the series, the four members of Angel's team seem to have survived the battle. Angel goes to Romania to remove his curse. He helps the Gypsies in a fight versus a dictator and he is forced to dust Natalya, the only person who was able to remove his curse. Natalya had become a vampire.\n\nSeries creator Joss Whedon has stated that he had originally intended Angel to survive this battle and go on into a sixth season. However, this was his original intention prior to the show being cancelled and prior to his writing the final episode. Early previews of the Buffy season eight comics have revealed that Angel and Spike will appear sparingly, suggesting both survived the battle (although death has not stopped either character from coming back in the past, and another dead character from the Buffy series, Anya Jenkins, is reported to make an appearance).\n\nAfter the Fall: Angel has been picked up for a canonical &quot;season 6&quot; comicbook series, to be written by Brian Lynch and plotted by Joss Whedon. It will begin as a twelve issue mini-series titled &quot;Angel: After The Fall.&quot;","torrent":{"xt":"urn:btih:42327d689b487a98cee23ed504d2c13002acf211","amp;dn":"Angel+-+Complete+Season+4+-+DVD+Rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42327d689b487a98cee23ed504d2c13002acf211","infoHashBuffer":{"type":"Buffer","data":[66,50,125,104,155,72,122,152,206,226,62,213,4,210,193,48,2,172,242,17]},"announce":[],"urlList":[]}}