{"title":"In Six Days - Why 50 Scientists Choose To Believe In Creation","uid":10386855,"size":3244635,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:42b3df7c3f6ad5af05525ec51cc646aeaa8b135b&amp;dn=In+Six+Days+-+Why+50+Scientists+Choose+To+Believe+In+Creation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starxteel","files":1,"time":1403141289,"description":"Why would any educated scientist with a PhD advocate a literal interpretation of the six days of creation? Why, indeed, when only one in three Americans believe the Bible is the actual word of God and is to be taken literally, word for word according to a recent Gallup poll.\n\nScience can neither prove nor disprove evolution any more than it can creation. Certainly there are no human eyewitness accounts of either. However, certain factors are present today which are capable of swaying one's beliefs one way or the other.\n\nIn this book are the testimonies of fifty men and women holding doctorates in a wide range of scientific fields who have been convicted by the evidence to believe in a literal six-day creation. For example, meet: The geneticist who concludes that there must have been 150 billion forerunners of 'modern man' in order for the natural selection required by evolution to have taken place in the development of man. The evidence for such vast numbers of 'prehistoric man' is in dire shortage. The orthodontist who discovered that European museum fossils of ancient man have been tampered with to adhere to evolution theories. The geologist who studied under the late Stephen Jay Gould and literally cut the Bible to pieces before totally rejecting evolution. Topics discussed include the big bang theory, the decay of the magnetic field, irreducible complexity, the radioactive dating of rocks, and the fossil record.\n\nAll fifty of these scientists, through faith and scientific fact, have come to the conclusion that God's Word is true and everything had its origin not so very long ago, in the beginning, In Six Days.\n\n\nAbout the editor:\nDr. John F. Ashton PhD is an Australian scientist. He writes, edits and co-authors books which provide evidence for creation and the historical accuracy of the Bible. He also co-authors books on health and nutrition. He holds research degrees in both chemistry and philosophy and is a Chartered Chemist and Fellow of the Royal Australian Chemical Institute. He also serves as an Adjunct Professor in the School of Applied Sciences at RMIT University, Melbourne and as an Adjunct Professor in the School of Biomedical and Health Sciences at Victoria University. His career includes 14 years teaching in tertiary science education and over 26 years in industrial research for large Australian companies.","torrent":{"xt":"urn:btih:42b3df7c3f6ad5af05525ec51cc646aeaa8b135b","amp;dn":"In+Six+Days+-+Why+50+Scientists+Choose+To+Believe+In+Creation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42b3df7c3f6ad5af05525ec51cc646aeaa8b135b","infoHashBuffer":{"type":"Buffer","data":[66,179,223,124,63,106,213,175,5,82,94,197,28,198,70,174,170,139,19,91]},"announce":[],"urlList":[]}}