{"title":"Larry Kramer - Faggots (epub, mobi)","uid":10218908,"size":867308,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:42e0c447d91e05074e56bea6ae1515d0fd50587e&amp;dn=Larry+Kramer+-+Faggots+%28epub%2C+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pharmakate","files":-1,"time":1401000686,"description":"Larry Kramer - Faggots (Grove Press, 1978). Foreword by Reynolds Price.\n\nEpub and mobi formats\n\nThe epub version had a few minor formatting errors that I fixed. It otherwise appears to be retail quality.\n\n\ndescription:\n\nLarry Kramer's Faggots has been in print since its original publication in 1978 and has become one of the best-selling novels about gay life ever written. The book is a fierce satire of the gay ghetto and a touching story of one man's desperate search for love there, and reading it today is a fascinating look at how much, and how little, has changed.\n\n\nVery few writers have the prescience or audacity to produce one of the standard works of their era--not a classic, necessarily, but a book that defines its own cultural moment in startling new terms, like One Flew over the Cuckoo's Nest or Portnoy's Complaint. Activist and rabble-rouser Larry Kramer has the distinction of having written not only one of the earliest and best-known plays on AIDS, The Normal Heart, but also the astonishing satire of gay urban sexual mores Faggots, perhaps the most reviled novel in the gay literary canon. A grim, graphic expansion on John Rechy's Numbers, which chronicled a hustler's soulless game of sexual conquest, Kramer's pornopticon turns off many readers by about page 3, when its hero, the screenwriter Fred Lemish, is offered an array of dubious pleasures in a private room at the infamous Everard Baths in New York. What Lemish really wants, of course, is true love, preferably from his elusive boyfriend, Dinky Adams. But as long as he's in the room...\n\nCelebrated and excoriated when it first appeared in 1978, this reprint of a gay anticlassic is not for the faint of heart. For the rest of us, it is a harsh, fascinating, and somewhat eerie revisitation of the carnal excesses of a generation that couldn't hear the bell tolling over the disco beat.\n\nFrom the Inside Flap\n\nGraphically sexual and one of the all-time best-selling gay novels, Faggots is the story of Fred Lemish, who at thirty-nine has built up his body into a fatless state of being in Great Shape. Lemish is ready to find Mr. Right. But from the Everhard Baths to the Pines on Fire Island to that place of myth and story, The Meat Rack, he is looking for his dream lover in all the wrong places. Faggots is a fierce satire of the gay ghetto and a touching story of one man's desperate search for permanence, commitment, and love.\n\n&quot;A Vesuvian explosion about the gay life that spares no one and no thing...there is much truth and honesty to be found here.&quot;--Seymour Krim, Chicago Tribune\n\n&quot;True comic brilliance--a vicious Swiftian satire that, like all satire, contains a strong moral voice.&quot;--New York\n\n&quot;Faggots, for all its excesses, is frequently right on target and, when it is on target, is appallingly funny.&quot;--Edward Albee\n\n&quot;Larry Kramer has more than come out of the closet, he's housecleaned the neighborhood. Faggots is a novel of courage...a journey worth the chronicle...a noble gesture.&quot;--Baltimore Sun\n\n&quot;Larry Kramer is one of America's most valuable troublemakers. I hope he never lowers his voice.&quot;--Susan Sontag\n\n&quot;The liberation of sexuality from the bonds of moralism has left in its wake a crying need for principled, intelligent, vigorous explorations of how a genuine morality can be introduced to our newly minted freedom. This exploration is a central part of Kramer's historically significant literary work, of which Faggots constitutes an important beginning and a key. As a documentation of an era, as savage and savagely funny social parody, as a cry in the wilderness, and as a prescient, accurate reading of the writing on the wall, the novel is peerless and utterly necessary. It is brilliant, bellicose, contemptuous, compassionate and--as is true of everything Kramer writes--behind its delectable, entertaining, sometimes maddening harshness is a profoundly moving plea for justice and for love. There are few books in modern gay fiction, or modern fiction for that matter, that must be read. Faggots is certainly one of them.&quot;--Tony Kushner\n\n&quot;Since his screenplay for D. H. Lawrence's Women in Love in 1969, Larry Kramer has been a prophet of psychic health and catastrophe among us--a prophet unmatched for the accuracy of his omens and the reliability of his anathemas and remedies. His uncannily foresighted novel Faggots appeared in 1978 just as the AIDS virus flooded whole wings of the American bloodstream; now its Swiftian portrait of an all but vanished subculture stands as that culture's visible memorial. His later plays have been clear as firebells, memorable as tracer bullets.&quot;--The American Academy of Arts and Letters citation, May 1996\n\n&quot;[Faggots] sends up New York's self-imposed gay ghetto, doing for its gyms, discos, orgy rooms, army fatigues, mustaches, and advertising agencies what Portnoy's Complaint did for Mom and masturbation. Faggots is the Uncle Tom's Cabin for homosexual men whose worst oppression is their lack of courage to change the way they live.&quot;--Library Journal\n\n&quot;A corrosive study of the gay underbelly of New York.... Faggots has the air of a Restoration comedy in its mix of Baroque style and bawdy, scathing humor.&quot;--Women's Wear Daily\n\n&quot;A book of major historical importance--the first contemporary novel to chronicle gay life with unsparing honesty and wild humor. Larry Kramer has changed the way we think about gay men. He is one of our great humanists.&quot;--Erica Jong\n\n&quot;Writing as always from an affirmatively homosexual point of view, Kramer in this novel conveys a sense of premonitory unease, even foreboding, about the spread of promiscuity, sadomasochism and narcotics among the homosexual population...more graphic than James Baldwin or Hubert Selby.&quot;--Times Literary Supplement","torrent":{"xt":"urn:btih:42e0c447d91e05074e56bea6ae1515d0fd50587e","amp;dn":"Larry+Kramer+-+Faggots+%28epub%2C+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42e0c447d91e05074e56bea6ae1515d0fd50587e","infoHashBuffer":{"type":"Buffer","data":[66,224,196,71,217,30,5,7,78,86,190,166,174,21,21,208,253,80,88,126]},"announce":[],"urlList":[]}}