{"title":"Efficient Decision Support Systems - Chiang S. Jao","uid":12160114,"size":71150961,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:439b4434a75ffc574f97e0bc38a90bd8655e8acf&amp;dn=Efficient+Decision+Support+Systems+-+Chiang+S.+Jao&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":3,"time":1437874559,"description":"Efficient Decision Support Systems - Chiang S. Jao (InTech, 2011)\n\nThis series is directed to diverse managerial professionals who are leading the transformation of individual domains by using expert information and domain knowledge to drive decision support systems (DSSs). The series offers a broad range of subjects addressed in specific areas such as health care, business management, banking, agriculture, environmental improvement, natural resource and spatial management, aviation administration, and hybrid applications of information technology aimed to interdisciplinary issues.\nThis book series is composed of three volumes: Volume 1 consists of general concepts and methodology of DSSs; Volume 2 consists of applications of DSSs in the biomedical domain; Volume 3 consists of hybrid applications of DSSs in multidisciplinary domains. The book is shaped decision support strategies in the new infrastructure that assists the readers in full use of the creative technology to manipulate input data and to transform information into useful decisions for decision makers. This book series is dedicated to support professionals and series readers in the emerging field of DSS","torrent":{"xt":"urn:btih:439b4434a75ffc574f97e0bc38a90bd8655e8acf","amp;dn":"Efficient+Decision+Support+Systems+-+Chiang+S.+Jao","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"439b4434a75ffc574f97e0bc38a90bd8655e8acf","infoHashBuffer":{"type":"Buffer","data":[67,155,68,52,167,95,252,87,79,151,224,188,56,169,11,216,101,94,138,207]},"announce":[],"urlList":[]}}