{"title":"ITV.Legacy.The.Origins.of.Civilization.5.of.6.Central.America.Th","uid":4343180,"size":481486532,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:43cc7ca2bed6dde727674935b0433b7af43a9a80&amp;dn=ITV.Legacy.The.Origins.of.Civilization.5.of.6.Central.America.Th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"JumpinS","files":1,"time":1218729211,"description":"[b]Legacy - The Origins of Civilization[/b]\n\nHistory Documentary hosted by Michael Wood and published by ITV, NHK in 1991 - English narration\n\n\n[b]Information[/b]\n------------------------------\n\nThe Legacy series is a search for the first civilizations and their continuing legacies. Each hour-long program focuses on one of the following regions: Iraq, India, China, Egypt, Central America, and the West.\n\nAt best, this search for the continuing legacies of past civilizations can help explain how different cultures have developed over time, show how the past greatly influences all our lives, and cultivate a respect for other cultures. At worst, it can send a message that these civilizations have remained virtually unchanged through time, unlike the West, and cultivate a false view of other peoples as less &quot;modern.&quot; The negative impact of the assumption that other cultures are not as modern as the West surfaces when Westerners make judgements, business deals, and policy decisions based on this assumption. Although Legacy aspires to the former objective, it often ends up fulfilling the latter. For example, the following statements by writer and presenter Michael Wood exemplify how the language Westerners often use to talk about non-Western peoples relegates them to a space and time outside of a Western view of the universe: &quot;Two conceptions of civilization have fought for the soul of the peoples of the Americas, one foreign and recent, that of the West, the other ancient and native;&quot; &quot;For over 2000 years, China has been sustained by ideas virtually unchanged since the Bronze Age.&quot; Throughout the series, comments like the ones above and the relative absence of images of people creating and using modern technology make it difficult for viewers to see the integral roles non-Western peoples occupy in the present.\n\nEach program in the series seeks to outline the &quot;great tradition&quot; of a civilization. Wood&amp;#039;s explorations of these various civilizations&amp;#039; great traditions are attempts to delineate some of the broad cultural principles which hold cultures together and distinguish them from one another. However, his efforts serve to create essentialized descriptions of societies that are comprised of numerous classes, ethnic groups, religions, and other types of communities (e.g. agrarian, nomadic, and urban). These descriptions are reminiscent of Ruth Benedict&amp;#039;s characterizations of the Hopi and Apache as Apollonian and Dionysian, respectively. Specifically, he characterizes Iraqis as long-suffering, resilient, hard-bitten, and pessimistic people; he states that Indians hold non-violence, renunciation, the inner-life, and the female as pillars of their civilization; he claims that the Chinese are guided by Confucianism, reverence for ancestors, and the quest for harmony; he asserts that the key to understanding the lives of ancient Egyptians was their desire to overcome time, a yearning to live beyond their time on earth and become immutable; he characterizes Mayans as obsessed with time and the mathematics of eternity, Aztecs as war-like, and all Central Americans as possessed of an inner strength that would allow them to bear any burden, even one as heavy as the last 500 years; and lastly, he describes the great tradition of the West as rooted in a contradiction between savagery and idealism. One can only imagine an encounter between a Westerner and non-Westerner in which the Westerner judges the non-Westerner as an inauthentic Indian, Mayan or Iraqi because he/she does not conform to the essentialized characterizations above.\n\nWood&amp;#039;s presentation is also problematic because he does not allow the people whose civilizations he examines to speak for themselves. Even when he does interview people, he does not allow the viewer to hear their words directly or through a translator, rather he summarizes and interprets the meaning of their statements. In short, Wood deprives them of their ability to represent themselves.\n\nWood is an ever-present guide through the series, perhaps distractingly so. There are several shots focused on him walking through crowds and across landscapes, and of him looking at buildings and artifacts where he obstructs the audience&amp;#039;s view of the object under discussion. The scenes in which he observes buildings, art or ceremonies seem like guides for tourists, instructing them how to properly admire these objects and phenomena.\n\nEach video contains a great deal of information on the civilization it investigates, but the presentation of this information is problematic. In addition to its function as a source of information, this series could be useful as a study of the ways in which cultural information is presented, especially in comparison to other films.\n\n\n[b]5)  Central America - The Burden of Time [/b]\nThis episode explores how indigenous peoples of Central America have &quot;hung on with great tenacity&quot; and resisted spiritual conquest by retaining old languages and practices despite their physical conquest by the Spanish and consumer society over the past 500 years. Wood describes them as &quot;stubbornly collective&quot; and &quot;stoical,&quot; but &quot;possessed of an inner strength that would allow them to bear any burden, even one as heavy as the last 500 years.&quot; Wood laments and condemns the conquest of the Americas, but his emphasis on Central America&amp;#039;s continuity with its pre-Columbian past also seems to serve to alleviate Western guilt. Wood addresses several controversial issues, but his discussions of them always stop short of the point where they would make viewers uncomfortable because they were forced to confront problems for which there are no easy solutions or solutions which Western viewers are willing to embrace. Wood comments that &quot;the West&amp;#039;s progress to civilization has been long and painful,&quot; but he fails to answer the question &quot;painful for whom?&quot;. He closes the episode with an observation that we live in a new time of pluralism where again Native Americans can live their own history in their own time. This statement virtually dismisses the violence and discrimination that indigenous peoples of Central America continue to face. It is doubtful that people such as Rigoberta Menchu, a Mayan/Guatemalan woman who won the Nobel Peace Prize in 1992 for her work on indigenous people&amp;#039;s rights, would agree with Wood&amp;#039;s statement.\n\nWood&amp;#039;s survey of the legacy of Mesoamerican civilizations discusses the Popul Vuh, the Mayan creation myth, explores the Mayan ruins at Teotihuacan, Tikal and Copan and the Aztec temple of Quetzalcoatl in Mexico City, and observes present-day shamans in order to demonstrate the continuity between the Mesoamerican past and present, the Mayans all-consuming obsession with time, and the war-like character of the Aztecs. Although he mentions other aspects of Aztec civilization, he spends most of the time discussing their often-sensationalized practices of human sacrifice. Wood also tends to sensationalize the practices:\n\nHow was it, then, that a civilization of such brilliance in the arts, sculpture, textiles, and poetry could have been so committed to mass bloodletting and mass sacrifice, so that in a four-day festival 10,000 people could be dragged up the steps of the temple to have their hearts ripped out til the place was swimming in blood and reeking to the heavens? \n\nIn short, this episode presents an easy-to-swallow overview of the history of Central American civilizations and their responses to their oppression by the West in various forms over the past 500 years.\n\n[b]Screenshots[/b]\n------------------------------\n\n\n[b]Technical Specs[/b]\n------------------------------\n\n\n [b]*[/b] Video Codec: DIVX\n [b]*[/b] Video Resolution: 528x400\n [b]*[/b] Audio Codec: mpga\n [b]*[/b] Audio BitRate: 160000 BPS and 44100 Hz\n [b]*[/b] Audio Channels: 2\n [b]*[/b] RunTime Per Part: 51:32 mins\n [b]*[/b] Number Of Parts: 6\n [b]*[/b] Part Size: 460 Mb\n [b]*[/b] Subtitles: Not Available\n [b]*[/b] Ripped by anurag\n [b]*[/b] VHS Rip\n\n\n\n[b]Links[/b]\n------------------------------\n\n[b]1)  Related Documentaries [/b]\n [b]*[/b] [url=http://docuwiki.net/?title=Civilisations]Civilisations[/url]\n [b]*[/b] [url=http://docuwiki.net/?title=Lost%20Cities%20of%20the%20Ancients]Lost Cities of the Ancients[/url]\n [b]*[/b] [url=http://docuwiki.net/?title=Secrets%20of%20Lost%20Empires]Secrets of Lost Empires[/url]\n [b]*[/b] [url=http://docuwiki.net/?title=The%20Ascent%20of%20Man]The Ascent of Man[/url]\n [b]*[/b] [url=http://docuwiki.net/?title=Ancient%20Voices]Ancient Voices[/url]\n [b]*[/b] [url=http://docuwiki.net/?title=Lost%20Worlds]Lost Worlds[/url]\n\n[b]2)  ed2k Links [/b]\n\ned2k://|file|ITV.Legacy.The.Origins.of.Civilization.1.of.6.Iraq.The.Cradle.of.Civilization.DivX.MP3.anurag.avi|482457588|58233AF7525666677B9A5DCD4344449D|h=6ESHI3A2B2A5SFL7WU7F5WG462LEN5VH|/\ned2k://|file|ITV.Legacy.The.Origins.of.Civilization.2.of.6.India.Empire.of.the.Spirit.DivX.MP3.anurag.avi|481438246|F2214AF61EA95ACF716F1BD9FB6AC134|h=663GSLJKYKPG7K4ESBM5HLG7Y2U5H2VT|/\ned2k://|file|ITV.Legacy.The.Origins.of.Civilization.3.of.6.China.The.Mandate.of.Heaven.DivX.MP3.anurag.avi|487020580|A715D308F9534CF11BC0CD94F19025E2|h=UFPO4J4ELQAXFCYTDZJEDIC5FERF3KDF|/\ned2k://|file|ITV.Legacy.The.Origins.of.Civilization.4.of.6.Egypt.The.Habit.of.Civilization.DivX.MP3.anurag.avi|487162430|C913D920ED61E8F67A77CBED6F1A446C|h=XYTD7XK3WKU77R5DJ4NGDJQLZOZLFAR5|/\ned2k://|file|ITV.Legacy.The.Origins.of.Civilization.5.of.6.Central.America.The.Burden.of.Time.DivX.MP3.anurag.avi|481486532|EE17A46DF4B808E8AEE885FBDF7E2F50|h=VUB2KTRKOEYH4P6HBC4DN7BJ3JXLNDVZ|/\ned2k://|file|ITV.Legacy.The.Origins.of.Civilization.6.of.6.The.Barbarian.West.DivX.MP3.anurag.avi|478856922|E3D205AD5504C3A505180237DD937B70|h=ZAYUWWW7BRBXLFXMCBH5C6PYIIYFJOTY|/\n\n\n\nAdded by [url=http://docuwiki.net/?title=User%3AJumpinS]JumpinS[/url]\n\nSource: [url=http://docuwiki.net/index.php?title=Legacy_-_The_Origins_of_Civilization]http://docuwiki.net/index.php?title=Legacy_-_The_Origins_of_Civilization[/url]\n","torrent":{"xt":"urn:btih:43cc7ca2bed6dde727674935b0433b7af43a9a80","amp;dn":"ITV.Legacy.The.Origins.of.Civilization.5.of.6.Central.America.Th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43cc7ca2bed6dde727674935b0433b7af43a9a80","infoHashBuffer":{"type":"Buffer","data":[67,204,124,162,190,214,221,231,39,103,73,53,176,67,59,122,244,58,154,128]},"announce":[],"urlList":[]}}