{"title":"David Bowie &amp; Klaus Nomi Saturday Night Live 1979 mp4","uid":7514249,"size":556454026,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4435010a0949e9971cb232ea3074300d0b59829f&amp;dn=David+Bowie+%26amp%3B+Klaus+Nomi+Saturday+Night+Live+1979+mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"diamonddogs","files":2,"time":1344423525,"description":"Saturday Night Live\nDecember 15, 1979\n\nOn December 15, 1979, Bowie was the featured musical performed on NBC's Saturday Night Live show in the USA.\n\nIf viewers were expecting a typical Saturday Night Live performance of Bowie and a band playing as if at a concert, they were in for a rude shock. Instead, Bowie gave an extremely unusual performance, accompanied by two &quot;drag&quot; performers, Klaus Nomi and Joey Arias. \n\nThree songs were performed, The Man Who Sold The World, with Bowie carried to the front of the stage by Nomi and Arias, while wearing a man's evening dress and a large bow tie (emulating the poet Tristan Tzara).\n\nNext was Boys Keep Swinging. For this Bowie emulated a puppet trick (with the help of television) he had seen in German fairs. A small puppet's trunk and limbs were situated just beneath Bowie's head, giving the appearance of a marionette with a huge human head. In a trick he sneaked past the censors, the puppet took a look down Bowie's trousers right at the end of the song.\n\nFinally, for TVC15, Bowie wore a uniform that gave the impression of a Chinese airline stewardesses outfit. In addition, stage designer Mark Ravitz created a pink poodle with a small tv monitor in its mouth, broadcasting the song as it was performed.\n\n","torrent":{"xt":"urn:btih:4435010a0949e9971cb232ea3074300d0b59829f","amp;dn":"David+Bowie+%26amp%3B+Klaus+Nomi+Saturday+Night+Live+1979+mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4435010a0949e9971cb232ea3074300d0b59829f","infoHashBuffer":{"type":"Buffer","data":[68,53,1,10,9,73,233,151,28,178,50,234,48,116,48,13,11,89,130,159]},"announce":[],"urlList":[]}}