{"title":"Karen Armstrong - Jerusalem: One City, Three Faiths (1996)","uid":9084492,"size":14125429,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:44fbb3a320047698f33ccf09dd3c400164150782&amp;dn=Karen+Armstrong+-+Jerusalem%3A+One+City%2C+Three+Faiths+%281996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"workerbee","files":-1,"time":1382468264,"description":"\nKaren Armstrong - Jerusalem: One City, Three Faiths (Knopf, 1996).\n\nISBN: 9780679435969 | 471 pages | EPUB\n\n\nVenerated for millennia by three faiths, torn by irreconcilable conflict, conquered, rebuilt, and mourned for again and again, Jerusalem is a sacred city whose very sacredness has engendered terrible tragedy.  In this fascinating volume, Karen Armstrong, author of the highly praised A History of God, traces the history of how Jews, Christians, and Muslims have all laid claim to Jerusalem as their holy place, and how three radically different concepts of holiness have shaped and scarred the city for thousands of years.\n\nArmstrong unfolds a complex story of spiritual upheaval and political transformation -- from King David's capital to an administrative outpost of the Roman Empire, from the cosmopolitan city sanctified by Christ to the spiritual center conquered and glorified by Muslims, from the gleaming prize of European Crusaders to the bullet-ridden symbol of the present-day Arab-Israeli conflict. \n\nWritten with grace and clarity, the product of years of meticulous research, JERUSALEM combines the pageant of history with the profundity of searching spiritual analysis.  It is a book for the ages.\n\n\nReviews\n\n&quot;Splendid . . . Eminently sane and patient . . . Essential reading for Jews, Christians, and Muslims alike.&quot; -- Washington Post\n\n&quot;The best serious, accessible history of the most spiritually important city in the world.&quot; -- Baltimore Sun\n\n&quot;A work of impressive sweep and grandeur.&quot; -- Los Angeles Times Book Review\n\n&quot;A provocative, splendid historical portrait of Jerusalem that will reward those seeking to fathom a strife-torn city.  [Armstrong's] overarching theme, that Jerusalem has been central to the experience and 'sacred geography' of Jews, Muslims and Christians and thus has led to deadly struggles for dominance, is a familiar one, yet she brings to her sweeping, profusely illustrated narrative a grasp of sociopolitical conditions seldom found in other books.&quot; -- Publishers Weekly\n","torrent":{"xt":"urn:btih:44fbb3a320047698f33ccf09dd3c400164150782","amp;dn":"Karen+Armstrong+-+Jerusalem%3A+One+City%2C+Three+Faiths+%281996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44fbb3a320047698f33ccf09dd3c400164150782","infoHashBuffer":{"type":"Buffer","data":[68,251,179,163,32,4,118,152,243,60,207,9,221,60,64,1,100,21,7,130]},"announce":[],"urlList":[]}}