{"title":"MADAME BOVARY - Gustave Flaubert. Read Donada Peters {FerraBit}","uid":6047599,"size":482890728,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:452a6a9b0ae058d98d882f3f28d8724fa5a1c9eb&amp;dn=MADAME+BOVARY+-+Gustave+Flaubert.+Read+Donada+Peters+%7BFerraBit%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"FerraBit","files":-1,"time":1292614883,"description":"MADAME BOVARY by Gustave Flaubert (1856)\n\nRead by . . : Donada Peters \nPublisher . : Tantor Media (2006)\nISBN . . . .: 1400152747| 9781400152742, 9781400159048\nFormat . . .: MP3. 36 tracks, 456 MB\nBitrate . . : ~90 kbps (iTunes 10, VBR, Mono, 44.1 kHz)\nSource . . .: 1 MP3-CD (11.5 hrs, 128 CBR stereo)\nGenre . . . : Fiction, Classic\nUnabridged .: Unabridged\n\nThe original recording sounds a little thin, a little tinny.\nTracks by chapter. Nicely tagged and labeled, cover scan included.\nPDF, mobi, lit included - ESL, ebook &amp; reference friendly.\n\nThanks for sharing &amp; caring.\nCheers, FerraBit\nDec 2010\n\n\n Links: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Gustave_Flaubert&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Gustave_Flaubert&lt;/a&gt;\n\n Originally posted:                                                           &lt;a href=&quot;\nhttps://thepiratebay.se/user/FerraBit&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/FerraBit&lt;/a&gt; (TPB), Demonoid, KickAssTorrents\nPlease present your FPL card, and comment me some loving.\n______________________________________\n\nFrom Tantor.com:\n\nOne of the acknowledged masterpieces of nineteenth-century realism, Madame \nBovary is revered by writers and readers around the world, a mandatory stop on \nany pilgrimage through modern literature. Gustave Flaubert's legendary style, \nhis intense care over the selection of words and the shaping of sentences, and \nhis unmatched ability to convey a mental world through the careful selection of \ntelling details shine throughout this marvelous work. \n\nMadame Bovary scandalized audiences when it was first published in 1857. And \nthe story itself remains as fresh today as when it was first written, a work \nthat remains unsurpassed in its unveiling of character and society. It tells \nthe tragic story of the romantic but empty-headed Emma Rouault. When Emma marries \nCharles Bovary, she imagines she will pass into the life of luxury and passion \nthat she reads about in sentimental novels and women's magazines. But Charles is \nan ordinary country doctor, and provincial life is very different from the \nromantic excitement for which she yearns. In her quest to realize her dreams she \ntakes a lover, Rodolphe, and begins a devastating spiral into deceit and despair. \nAnd Flaubert captures every step of this catastrophe with sharp-eyed detail and \na wonderfully subtle understanding of human emotions.\n\n\nFrom Wiki:\n\nGustave Flaubert was a French writer who is counted among the greatest Western \nnovelists. He is known especially for his first published novel, Madame Bovary \n(1856), and for his scrupulous devotion to his art and style.\n\nMadame Bovary is Gustave Flaubert's first published novel and is \nconsidered his masterpiece. The story focuses on a doctor's wife, Emma Bovary, \nwho has adulterous affairs and lives beyond her means in order to escape the \nbanalities and emptiness of provincial life. Though the basic plot is rather \nsimple, even archetypal, the novel's true art lies in its details and hidden \npatterns. Flaubert was notoriously a perfectionist about his writing and claimed \nalways to be searching for le mot juste (&quot;the right word&quot;).\n\nThe novel was attacked for obscenity by public prosecutors when it was first \nserialized in La Revue de Paris between October 1, 1856 and December 15, 1856, \nresulting in a trial in January 1857 that made the story notorious. After the \nacquittal on February 7, 1857, it became a bestseller when it was published as \na book in April 1857, and now stands virtually unchallenged not only as a seminal \nwork of Realism, but as one of the most influential novels ever written.\n\nA 2007 poll of contemporary authors, published in a book entitled The Top Ten, \ncited Madame Bovary as one of the two greatest novels ever written, second only \nto Leo Tolstoy's Anna Karenina.\n","torrent":{"xt":"urn:btih:452a6a9b0ae058d98d882f3f28d8724fa5a1c9eb","amp;dn":"MADAME+BOVARY+-+Gustave+Flaubert.+Read+Donada+Peters+%7BFerraBit%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"452a6a9b0ae058d98d882f3f28d8724fa5a1c9eb","infoHashBuffer":{"type":"Buffer","data":[69,42,106,155,10,224,88,217,141,136,47,63,40,216,114,79,165,161,201,235]},"announce":[],"urlList":[]}}