{"title":"iPhone 4S All-in-One For Dummies","uid":7008663,"size":76516077,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:452ac4e99c0f41bb3c4fc1aae9a2d3ad0e679135&amp;dn=iPhone+4S+All-in-One+For+Dummies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Spetses","files":-1,"time":1328314876,"description":"Publication Date: February 28, 2012 | ISBN-10: 1118101197 | ISBN-13: 978-1118101193 | Edition: 1\nGo from smartphone newbie to iPhone rock star with this amazing all-in-one guide!\n\nHere?s the book for iPhone users who want it all--the basics to get started and the advanced info that puts all the iPhone?s power at your fingertips. iPhone All-in-One For Dummies includes seven minibooks--nearly 600 pages in full color--packed with next-step information for iPhone power users at home, at work, or on the go. Writing in the famous straightforward yet fun For Dummies style, tech experts John Hutsko and Barbara Boyd get you acquainted with your iPhone and take you step by step from simple to advanced: surfing the Web to taking photos and videos; staying in touch via e-mail, video calls, and social media to losing yourself in e-books and magazines to guru-level techniques anyone can learn.\n\n    Seven minibooks include Meet the iPhone, Stock the iPhone, The Communicator, The Personal Assistant, The Entertainer, Useful Apps, and The iPhone Geek and Guru; each walks you through all aspects of the incredible iPhone?s functionality\n    Gets you up to speed with the latest iPhone models plus iOS 5 and all its features\n    Explains how to make phone and video calls, exchange e-mails, text and multimedia messages, surf the Web, and buy apps, music, movies, and more\n    Goes beyond fun to getting work done with pocket-sized office suite and doc apps, contacts and calendars, iBooks and eReaders\n    Gives up-to-date info on Facebook, Twitter, Yelp, FourSquare, and other social networks\n    Shares insider tips and troubleshooting techniques\n\nYou?ll take charge of your iPhone and take your world with you everywhere you go with iPhone All-in-One For Dummies.\n","torrent":{"xt":"urn:btih:452ac4e99c0f41bb3c4fc1aae9a2d3ad0e679135","amp;dn":"iPhone+4S+All-in-One+For+Dummies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"452ac4e99c0f41bb3c4fc1aae9a2d3ad0e679135","infoHashBuffer":{"type":"Buffer","data":[69,42,196,233,156,15,65,187,60,79,193,170,233,162,211,173,14,103,145,53]},"announce":[],"urlList":[]}}