{"title":"Andre Malraux - Anti-Memoirs (pdf)","uid":8650586,"size":4124258,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4699c6691e48a26e8f6d4719c2d0dd5b2e6bb9cb&amp;dn=Andre+Malraux+-+Anti-Memoirs+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pharmakate","files":-1,"time":1373087434,"description":"Andre Malraux - Anti-Memoirs (Holt, Rinehart and Winston, 1968). 437 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. \n\n\n\nMemoir by the French novelist and politician.\n\nKIRKUS REVIEW\n\nAnti-Memoirs is a dazzling work, the past recaptured, but cut against the grain, brilliantly set, sharp as steel. Not Malraux, the private man, but Malraux the cultural minister, European adventurer, aesthete, historian. Malraux's public masks and roles. &quot;&quot;So this is your latest incarnation.&quot;&quot; Nehru remarks when Malraux presents his credentials as emissary from the Fifth Republic. East and West, decades of associations, reflections, enactments, the Chinese Revolution, the Spanish Civil War, the Resistance, la voie royale in Singapore and Indo-China. Is there another international figure who has been so privileged? The philosophical causeries with Mao, Nehru, De Gaulle make the usual diplomatic recordings seem schoolboy romances. Malraux looks at the world, high and low, with a mixture of hauteur and involvement unknown outside the pages of Saint-Simon or Chateaubriand. Certainly, no other contemporary writer (Malraux cavalierly divides his chronicle with the titles of his famous novels and essays on art). The book is cold, at times almost cruel in its Manichean meditations. The politics strangely subversive: like De Gaulle, though with unflinching case, Malraux walks a tightrope across left and right, communism, capitalism, Europe, the Third World. What he cares about is the triumph of art over the ephemeral, or the drama of civilization: &quot;&quot;The ornate shadow of Versailles,&quot;&quot; as he says elsewhere, &quot;&quot;tends to hide from us its harassed soul: beneath the rich profusion of the Jesuit churches the rifts in Christendom were ever widening.&quot;&quot; In Malraux, the senses and the intellect uniquely blend; exotic locales, power struggles, ideology and technics, mythic settings for a hero of our times, the last aristocrat.\n\nPub Date: Oct. 21st, 1968\nPublisher: Holt, Rinehart &amp; Winston","torrent":{"xt":"urn:btih:4699c6691e48a26e8f6d4719c2d0dd5b2e6bb9cb","amp;dn":"Andre+Malraux+-+Anti-Memoirs+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4699c6691e48a26e8f6d4719c2d0dd5b2e6bb9cb","infoHashBuffer":{"type":"Buffer","data":[70,153,198,105,30,72,162,110,143,109,71,25,194,208,221,91,46,107,185,203]},"announce":[],"urlList":[]}}