{"title":"Orange Tree Samples Lap Steel Guitar l Kontakt","uid":9679977,"size":630167097,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:469ced00af0a6ddc715ea708788054880d974efa&amp;dn=Orange+Tree+Samples+Lap+Steel+Guitar+l+Kontakt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"imafaggot","files":1,"time":1393649016,"description":"\nLap steel guitars are very flexible and versatile instruments, and make a great addition to a variety of musical styles. As well as easily fitting in folk, country, and pop productions, they also sound great with distortion for rock and blues tunes. The Orange Tree Samples Lap Steel Guitar sample library features around 1 GB of high quality samples, with three dynamics and four round-robin samples for each chromatically-sampled string--giving you a total of over 2,000 samples, powered by an extensive script.\n\n\nBeing that slides are such an integral part of the Lap Steel Guitar, we implemented several technologies to improve the playability and realism of the slides. First of all, all the slides use timbre-corrected bending, as opposed to conventional methods of pitch bending. These slides will also realistically re-excite the strings, lengthening the sustain. Lap Steel Guitar not only gives you the ability to bend strings separately, but also allows you to set the bend range to conform to a specific key/scale.\n\nLap Steel Guitar includes five stereo cabinet impulses as well as spring reverb, tremolo, chorus, and much more. All the effects and performance settings can be stored in external preset files. That means that you don't have to reload the entire library to audition different presets, and makes it easy to share presets with other Lap Steel Guitar users.\n\nKey Features:\n\n- Chromatically, individually sampled strings\n\n- Three dynamics with 4x round-robin\n\n- Onboard Effects\n\n- Timbre-correct slides\n\n- External preset system\n\nFormat:\n\nDue to the extensive scripting, this sample library is available in KONTAKT 4 / 5 format only. The sample library requires the full retail version of KONTAKT 4 / 5, so it is not compatible with the free KONTAKT Player.\n","torrent":{"xt":"urn:btih:469ced00af0a6ddc715ea708788054880d974efa","amp;dn":"Orange+Tree+Samples+Lap+Steel+Guitar+l+Kontakt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"469ced00af0a6ddc715ea708788054880d974efa","infoHashBuffer":{"type":"Buffer","data":[70,156,237,0,175,10,109,220,113,94,167,8,120,128,84,136,13,151,78,250]},"announce":[],"urlList":[]}}