{"title":"Bashar - Jupiter, The Eye of the Storm &amp; The Watchful Father","uid":8657834,"size":2207808326,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4703d6bf3512f7ccf77ec57979017d90a8f547d3&amp;dn=Bashar+-+Jupiter%2C+The+Eye+of+the+Storm+%26amp%3B+The+Watchful+Father&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Rus099","files":2,"time":1373248955,"description":"Jupiter's energetic relationship to Earth and the expression of the father energy that guides us along our path of expanding awareness. Q&amp;A includes: How do you perceive higher dimensions? Who are the inter dimensional gate-keepers? What kind of races are the hybrid children? Could you speak more about our moon? Is it true that the one has no ability to be aware? Does the one not contain a personality construct? Can you give us a timeline for when our AI (artificial intelligence) will become the vehicle for our higher minds? Were the beings involved in the Roswell crash time-travelers? Why am I paranoid of being abducted? My husband is a reckless driver. How can we find common ground? I like to drive fast because it makes me feel at my best. How can we find common ground? Can you speak more about the Flower of Life? If you could spend one day as a human on Earth, what would you do? Can you speak more about the asteroid that will be passing close by the Earth? Can you speak about the validity of astrology? Could you speak more about the Sasquatch? Why are UFO sightings common at Joshua Tree? The trinity of the 9 powers, the teachings of the three fold flame, are those related? Do races from Myths and legends still exist? Who is now in charge of answering with health related questions? I used military night vision, and I had an interaction a few weeks ago, had a craft show up and reveal itself to me. Can you tell me more about that? Who was the being that came through in the channeling we did in the desert?","torrent":{"xt":"urn:btih:4703d6bf3512f7ccf77ec57979017d90a8f547d3","amp;dn":"Bashar+-+Jupiter%2C+The+Eye+of+the+Storm+%26amp%3B+The+Watchful+Father","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4703d6bf3512f7ccf77ec57979017d90a8f547d3","infoHashBuffer":{"type":"Buffer","data":[71,3,214,191,53,18,247,204,247,126,197,121,121,1,125,144,168,245,71,211]},"announce":[],"urlList":[]}}