{"title":"Books on world war 2 and the holocaust","uid":7662497,"size":1170667761,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47216027c4da49ae400992602713ecdd94b9e8e0&amp;dn=Books+on+world+war+2+and+the+holocaust&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"indoeuro","files":175,"time":1348347691,"description":"This is a collection of books on the first and especially the second world war, and in particular on the holocaust.  It focuses on the revisionist tradition, which as Harry Elmer Barnes put it aims &quot;to bring history into accord with the facts.&quot;  The political implications of the dominant interpretation of the second world war are also covered.\n\nThe books in this collection are generally critical of the simplistic story of the &quot;good war&quot; and the conception of the second world war as a simple struggle between good and evil.  They ask the reader to put aside the indoctrination that most of our schools and certainly the mass media promote, and to ask who benefits from the court historians' presentation of history.  Napoleon cynically called history &quot;a lie agreed upon&quot; and nowhere has that maxim held truer than in the history of the second world war.\n\nIt should be obvious to everyone at this point that believing comfortable lies about &quot;the good war&quot; has led us astray.  For instance, the tale of the &quot;appeasement&quot; of Hitler was used to sell the Iraq war - against the &quot;new Hitler.&quot;  To disarm such propaganda we need the truth.  We need to know that even Hitler wasn't &quot;Hitler&quot; - that is, that the Hitler of history was not the same as the Hitler of our historical propaganda.\n\nThe facts contained in the books in this torrent will disturb many people who have developed their national identity and pride through the lies of the traditional narrative of the second world war.  But the truth alone conquers.  Let these people reflect on the decline of America over the last several decades.  If the &quot;greatest generation&quot; was truly so great, how did they lead us so far astray, and how did they raise a generation (the baby boomers) so far removed from greatness?  More and more people in America are realizing that our country is on the wrong track, and has been for some time.  More and more people are realizing that our government does not truly serve the well being of the nation.  It is only through realizing the roots of our governing class' ideology in the second world war that we will come to understand our situation; it is only through realizing that the second world war was not &quot;our finest hour&quot; but an unmitigated disaster for western civilization and for European-derived people everywhere that we will comprehend our predicament.  And it is only then that we will be able to do something about it.","torrent":{"xt":"urn:btih:47216027c4da49ae400992602713ecdd94b9e8e0","amp;dn":"Books+on+world+war+2+and+the+holocaust","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47216027c4da49ae400992602713ecdd94b9e8e0","infoHashBuffer":{"type":"Buffer","data":[71,33,96,39,196,218,73,174,64,9,146,96,39,19,236,221,148,185,232,224]},"announce":[],"urlList":[]}}