{"title":"Saints Who Battled Satan: 17 Holy Warriors Who Can Teach How","uid":15687547,"size":2603501,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4741c081035be0e033803085563d6360c06d9414&amp;dn=Saints+Who+Battled+Satan%3A+17+Holy+Warriors+Who+Can+Teach+How&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"catholicstuff","files":3,"time":1472359073,"description":"Paul Thigpen - Saints Who Battled Satan: Seventeen Holy Warriors Who Can Teach You How to Fight the Good Fight and Vanquish Your Ancient Enemy (EPUB, MOBI, PDF)\r\n\r\nThe war is on. The Devil plots to defeat you. Meet some battle-tested warriors who fight at your side.\r\n\r\nSatan is real. He’s a formidable foe who wants to snatch us away from God, and the thought of doing battle with him can seem daunting.\r\n\r\nEven so, the saints who have gone before us have engaged the Devil, armed with the power of Christ … and emerged victorious! These fellow warriors in heaven now fight on our behalf. \r\n\r\nIn Saints Who Battled Satan, Paul Thigpen, author of Manual for Spiritual Warfare, details the heroic combat of 17 saints who defeated the Enemy.\r\n\r\nIn Saints Who Battled Satan, discover:\r\n\r\n    How Satan attacks us through extraordinary assaults and everyday temptations. \r\n    How these 17 saints used prayer, Scripture, the sacraments, and other spiritual weapons against the Enemy.\r\n    How the virtues served these saints as combat armor. \r\n    How these victorious saints now offer their aid to those of us still battling on earth.\r\n\r\nRead the inspiring and triumphant stories of Padre Pio, Francis of Assisi, Catherine of Siena, Teresa of Avila, John Vianney, and a dozen other saints who battled Satan. You’ll find the strength, the courage, and the faith to win your own war against the Enemy.\r\n\r\n---\r\n\r\nIf you enjoy this media, please seed and purchase a physical copy to support the producers and share with family and friends. \r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.org/user/catholicstuff/","torrent":{"xt":"urn:btih:4741c081035be0e033803085563d6360c06d9414","amp;dn":"Saints+Who+Battled+Satan%3A+17+Holy+Warriors+Who+Can+Teach+How","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4741c081035be0e033803085563d6360c06d9414","infoHashBuffer":{"type":"Buffer","data":[71,65,192,129,3,91,224,224,51,128,48,133,86,61,99,96,192,109,148,20]},"announce":[],"urlList":[]}}