{"title":"Sheer Terror - Standing Up For Falling Down  mp3  320k    2014","uid":11023737,"size":109770296,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4766fa8b7683949696412d4b19293ab2ad199acb&amp;dn=Sheer+Terror+-+Standing+Up+For+Falling+Down++mp3++320k++++2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"analogkid6103","files":11,"time":1410638020,"description":"Sheer Terror - Standing Up For Falling Down  mp3    2014....\nThe band first came into existence in December 1984 when former Fathead Suburbia vocalist Paul Bearer answered an ad in the Village Voice for a hardcore punk singer. Filling out the original lineup was guitarist Alan Blake, bassist Baron &quot;Barry&quot; Misuraca, and drummer Sam &quot;Reid&quot; Lohman. The band was featured on the 1985 One Big Crowd compilation, and released two cassette demos, No Grounds For Pity and Fall From Grace. Soon after the band broke up due to personality conflicts. Afterwards, Bearer would spend some time in southern California before returning to New York, where he reformed Sheer Terror with Blake, adding Mark Neuman on bass and Jason Martin on drums.\n\nThe band soon after began a longtime association with Blackout Records, who released some of their songs on the label's compilation Where The Wild Things Are, in 1989, along with a 7 inch Live At CBGB release. The following year, the band recorded their debut full length Just Can't Hate Enough. The record was engineered by Tommy Victor of Prong. As Victor also worked at CBGB, he was able to allow the band to record live at the famous bar in the morning and afternoon hours before shows were held. The record was released in Germany on Starving Missile Records, and later released stateside under the Blackout name. Just Can't Hate Enough quickly became one of the records that defined the new, heavier sound of hardcore that was emerging at the time, played by bands such as Biohazard and Killing Time, among others. The guitar tone and riffs, in particular, display a large heavy metal influence, especially from Swiss speed metallers Celtic Frost, who were allegedly one of Alan Blake's favorite bands. The band also became known for Bearer's no-nonsense stage personality, with some finding him offensive, and others enjoying his often blunt and obscenity filled humor.\n\nBlake, however, exited the band soon after the record's release. He would later form Darkside, also known as Darkside NYC, which also featured a heavy Celtic Frost influence.\n\nNeuman took the opportunity to switch to guitar, and Mike &quot;Chickie&quot; Walter, a former member of the crossover band Ludichrist, took over on bass duties. The band cut a new record in 1991 that was titled Ugly And Proud, and whose planned cover featured a bulldog belonging to Josh Silver of Type O Negative. Seeing the success of Biohazard's eponymous 1990 release, the band planned to release the LP under Maze Records. However, due to the amount of money and time spent on the Biohazard release, Maze was not in the position to release Ugly And Proud. The record was shelved by the label, much to the dismay of the band who could not convince the company to allow them to take the masters elsewhere.\n\nIn this time, the band experienced more member turnover, including an extended stint with a former glam metal drummer named Dave Todd. Paul Bearer recounts in the liner notes of a later release about his disbelief that Dave, while the band was in Europe, asked him who &quot;Anarchy&quot; was, thinking the circle-A logo he saw spray painted on walls belonged to a band. The tension of having someone in the band who did not understand punk rock ultimately led to finding a new drummer in Pat Cronin.\n\nTo make up for the lack of an album, Sheer Terror re-recorded many of the songs from Ugly And Proud, releasing the result on Blackout as Thanks Fer Nuthin, a jab at the owner of Maze Records. According to Bearer, he originally wanted to call the record Canadian Scumbag. However, upon hearing of the band's new album, Maze Records quickly, and finally, released Ugly And Proud, leading to the band having two records on the market with mostly identical songs.\n\nSome tours later, the Old, New, Borrowed, And Blue EP was released. Following the theme of the title, the tracklist included an old song, Walls, a new song, Broken, a cover (&quot;borrowed&quot; song, Everything's Fine by The Saints, and a slow ballad (&quot;blue&quot;, Goodbye, Farewell. The cover depicted an old photograph of Bearer's parents' wedding. Both Bearer and Mark Neuman have commented that due to Josh Silver's production of the EP, it remains their favorite Sheer Terror release. The band even cut the only music video of their career for Broken, which featured a live action depiction of the song's subject, a despondent, alcoholic circus clown.\n\nThis, among other things, led to interest from MCA, who signed the band for the recording of 1995's Love Songs for the Unloved. Produced by Tommy Victor, the record reflected a changing band, with slower songs and more clean, operatic singing from Bearer, rather than his usual growls. The upbeat track For Rudy The Kraut even featured an almost ska-sounding horn section. Neuman was also not particularly satisfied with the overall sound of his guitar tracks. The record did not receive the expected attention from fans, and Sheer Terror was soon dropped from MCA, who Bearer later sarcastically referred to as &quot;the Music Cemetery of America&quot;.\n\nIn the following years, Bearer's self admittedly &quot;pig-headed&quot; personality clashed with the other members of the band, leading to Cronin and Neuman's exit. Sheer Terror managed to press on with a lineup that included former Whiplash drummer Tony Scaglione, and future Cause for Alarm guitarist Jay Banks. This lineup lasted through a U.S. tour with Napalm Death. Shortly after, the band broke up, only to be revived in 1997 featuring Ex-Mind over Matter/Neglect drummer John Lafata, and current Kill Your Idols guitarist Gary Bennett. John Lafata then went on to tour and record with Madball, and Tony Scaglione was brought in once again. But eventually, Sheer Terror ended their 13 year career in 1998, immediately following a mildly successful European tour. Most members did not speak to each other for many years following the break-up.\n\nReunion\n\nIn mid-2004 it was announced that the lineup of Bearer, Neuman, Chickie, and Cronin were again rehearsing and planned on playing a show to serve both as a reunion and as the final farewell the band was never able to give. The reaction from fans led to the booking of another show the following night, and on October 9 and 10, the band played two sold out shows at CBGB, alongside opening bands such as Inhuman and Subzero. Footage from both nights, as well as an extensive documentary, was released as the Beaten By The Fists Of God DVD in 2005. Many high-profile members of the punk rock and hardcore community were featured praising the band in the documentary, including members of Dropkick Murphys, Life of Agony, North Side Kings, and Blood For Blood. Many former members were interviewed as well.\n\nFans can also get a taste of his often brutish sense of humor through a bootleg record entitled No Really, Go Fuck Yourself, credited to &quot;Reverend Paul Bearer&quot;. The record is a compilation of numerous bits of bootlegged stage banter from Bearer.\n\nReformation\nIn 2010 Sheer Terror reformed under Paul Bearer and are currently touring and writing new material. But you already know that.\n\n\n\nSheer Terror - Standing Up For Falling Down (2014)\n\nCBR @ 320kbps\n\n\n\nTracklist:\n\n01. Heartburn In G\n02. Ain't Alright\n03. Weird, Jealous And Fat\n04. Boots, Braces And Alimony\n05. Coffee, 5 Sugars\n06. Did You Just Meet Me?\n07. Love You Like A Leper\n08. Sandbox Tonka\n09. The Revenge Of Mr. Jiggs\n10. Cigarettes And Farts\n11. Singalongastupid\n\nGenre:\tHardcore\nBitrate:\t320 k","torrent":{"xt":"urn:btih:4766fa8b7683949696412d4b19293ab2ad199acb","amp;dn":"Sheer+Terror+-+Standing+Up+For+Falling+Down++mp3++320k++++2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4766fa8b7683949696412d4b19293ab2ad199acb","infoHashBuffer":{"type":"Buffer","data":[71,102,250,139,118,131,148,150,150,65,45,75,25,41,58,178,173,25,154,203]},"announce":[],"urlList":[]}}