{"title":"Nirvana MTV Unplugged in New York DTS-CD","uid":6289266,"size":702399896,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:479c030e63d66c7326259cfc233e45bbdaf8240d&amp;dn=Nirvana+MTV+Unplugged+in+New+York+DTS-CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"JaGrab3","files":1,"time":1301738994,"description":"If In Utero is a suicide note, MTV Unplugged in New York is a message from beyond the grave, a summation of Kurt Cobain's talents and pain so fascinating, it's hard to listen to repeatedly. Is it the choice of material or the spare surroundings that make it so effective? Well, it's certainly a combination of both, how the version of the Vaselines' &quot;Jesus Doesn't Want Me for a Sunbeam&quot; or the three covers of Meat Puppets II songs mean as much as &quot;All Apologies&quot; or &quot;Something in the Way.&quot; This, in many senses, isn't just an abnormal Nirvana record, capturing them in their sincerest desire to be R.E.M. circa Automatic for the People, it's the Nirvana record that nobody, especially Kurt, wanted revealed. It's a nakedly emotional record, unintentionally so, as the subtext means more than the main themes of how Nirvana wanted to prove its worth and diversity, showcasing the depth of their songwriting. As it turns out, it accomplishes its goals rather too well; this is a band, and songwriter, on the verge of discovering a new sound and style. Then, there's the subtexts, as Kurt's hurt and suicidal impulses bubble to the surface even as he's trying to suppress them. Few records are as unblinkingly bare and naked as this, especially albums recorded by their peers. No other band could have offered covers of David Bowie's &quot;The Man Who Sold the World&quot; and the folk standard &quot;Where Did You Sleep Last Night&quot; on the same record, turning in chilling performances of both -- performances that reveal as much as their original songs","torrent":{"xt":"urn:btih:479c030e63d66c7326259cfc233e45bbdaf8240d","amp;dn":"Nirvana+MTV+Unplugged+in+New+York+DTS-CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"479c030e63d66c7326259cfc233e45bbdaf8240d","infoHashBuffer":{"type":"Buffer","data":[71,156,3,14,99,214,108,115,38,37,156,252,35,62,69,187,218,248,36,13]},"announce":[],"urlList":[]}}