{"title":"Brett Dennen - Smoke and Mirrors [2013][EAC,log,cue. FLAC]","uid":9102238,"size":238660723,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:47d210ffe85f2e1d0121af5354849f9f10ec1b61&amp;dn=Brett+Dennen+-+Smoke+and+Mirrors+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"dickspic","files":13,"time":1382795262,"description":"Artist: Brett Dennen\nRelease: Smoke and Mirrors\nReleased:  2013\nLabel:   Atlantic\nCatalog#:  536186-2\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: Country,pop\n\n\n1. Sweet Persuasion 3:02 \n2. Wild Child 3:37 \n3. You Make It Easy 3:06 \n4. Only Want You 3:26 \n5. When We Were Young 4:22 \n6. Smoke and Mirrors 3:50 \n7. Don't Mess With Karma 4:09 \n8. Out Of My Head 3:41 \n9. Not Too Late 3:29 \n10. Who Am I 3:26\n\nBrett Dennen seems to be growing into his voice. High-pitched, fragile, and delicate, at times sounding eerily like Tracy Chapman or Billie Holiday, that voice, at first anyway, can be distracting, drawing attention away from his airy, melodic, and carefully written songs, although that voice hasn't kept his first four albums from drawing a lot of critical acclaim and attention. On this, his fifth full-length release, which follows the African rhythms and pop veneer of 2011's Loverboy, Dennen's vocals seem stronger and more certain, and the new songs, although well in line with what he's been writing all along, also seem to have accepted a simpler, easier template, and the sometimes ornate lyrics and phrasing that have kept a song or two from breathing in the past are largely absent here. Working with producer Charlie Peacock in Nashville, and featuring bassist Mark Hill, guitarist Jerry McPherson, drummer Aaron Sterling, and background vocalist Ruby Amanfu, Smoke and Mirrors has fewer pop touches and more of an acoustic backdrop than his previous album, all of which allows this new set of songs to breathe, and Dennen sings them well, sounding at times more like Jason Mraz and less like Jimmy Scott. The production is warm and wide, and sparse in all the right ways, giving songs like the opener, the bouncy &quot;Sweet Persuasion,&quot; and the first single, the singalong &quot;Wild Child,&quot; a sturdy feel, more joyous and feisty than fragile and delicate. Another highlight, the infectious &quot;When We Were Young,&quot; sounds like a classic Tom Petty song, albeit with a higher-pitched lead vocal. In all, this outing is perhaps Dennen's strongest so far, with a warm and easy acoustic feel to it.","torrent":{"xt":"urn:btih:47d210ffe85f2e1d0121af5354849f9f10ec1b61","amp;dn":"Brett+Dennen+-+Smoke+and+Mirrors+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47d210ffe85f2e1d0121af5354849f9f10ec1b61","infoHashBuffer":{"type":"Buffer","data":[71,210,16,255,232,95,46,29,1,33,175,83,84,132,159,159,16,236,27,97]},"announce":[],"urlList":[]}}