{"title":"Windows XP Media Center Edition 2005 OEM","uid":3580548,"size":1097999427,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:47f0817d15f652ec2f2f29925f9b6a7fe9b4f384&amp;dn=Windows+XP+Media+Center+Edition+2005+OEM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bruor","files":13,"time":1166638165,"description":"The images in this torrent were made from a 3CD set that came with an off-brand system supplier in Canada called touch systems. This is a brand sold by a distributor that simply puts systems together and sells them as a &quot;named brand&quot; for easier identification etc. \n\nThe media has been widely tested by others and is verified to take any OEM MCE2005 key (some are also reporting success with MCE2002 keys) on one of those lovely M$ stickers that are put on systems by well known OEMs such as HP, Dell, Acer, Lenovo and more. \n\nI thought these were gold when I saw them as I had never come across a set of non-branded/tainted OEM media that I could use to reload systems without using the standard &quot;ghost image&quot; sets that ship from those OEMs. It was always extremely frustrating to reload a system with tons of crapware when performing a &quot;fresh&quot; installation!\n\nI am back on the seed pool permanently for this media 24H,  I have checked in from time to time on this torrent and the comments left by others and I am pleased to see that so many appreciate this upload as much, or more than I thought it would be.  Thanks to so many for keeping this alive and putting the negative comments that noobs have left on this torrent to rest!!!\n\n","torrent":{"xt":"urn:btih:47f0817d15f652ec2f2f29925f9b6a7fe9b4f384","amp;dn":"Windows+XP+Media+Center+Edition+2005+OEM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47f0817d15f652ec2f2f29925f9b6a7fe9b4f384","infoHashBuffer":{"type":"Buffer","data":[71,240,129,125,21,246,82,236,47,47,41,146,95,155,106,127,233,180,243,132]},"announce":[],"urlList":[]}}