{"title":"Wilco - 2005 - Kicking Television: Live In Chicago [EAC - FLAC -","uid":5795138,"size":762680745,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:487798bec87e67dcea3e4983298761650d5e1da0&amp;dn=Wilco+-+2005+-+Kicking+Television%3A+Live+In+Chicago+%5BEAC+-+FLAC+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bludStain","files":-1,"time":1283010007,"description":"Wilco - 2005 - Kicking Television: Live In Chicago\n\nReview\tby Mark Deming\nWhile Yankee Hotel Foxtrot and A Ghost Is Born established Wilco's reputation as one of America's most interesting and imaginative rock bands, both albums were the product of a band in flux, and this was particularly evident to those who saw the group on-stage after the release of YHF. Yankee Hotel Foxtrot may have blazed new sonic trails for Wilco, but the departure of Jay Bennett in the latter stages of its production left the band with an audible hole when they played the new material on-stage, and while multi-instrumentalist Leroy Bach may have been a technically skilled player, he looked and sounded like a cold fish in concert, unwittingly emphasizing the cooler surfaces of Wilco's new music and negating much of the passion of Jeff Tweedy's songs. However, by the time Wilco hit the road following the release of A Ghost Is Born, the group's latest round of personnel shakeups had the unexpected but welcome effect of spawning one of the group's best lineups to date; after Bach amicably left Wilco, the addition of keyboard and guitar man Pat Sansone and especially visionary guitarist Nels Cline gave the band players whose energy and passion matched their technical skill, and suddenly the band was playing its challenging new material with the same sweaty force Tweedy and company conjured up in the band's earlier days. Thankfully, Tweedy had the good sense to document the prowess of Wilco's latest incarnation on-stage, and Kicking Television: Live in Chicago, recorded during four shows at the Windy City's Vic Theater, offers a welcome second perspective on the band's more recent work. With the exception of two numbers from Wilco's collaborative albums with Billy Bragg (in which they set Woody Guthrie's poems to music), Kicking Television focuses exclusively on their &quot;post-alt-country&quot; work, but while many of the songs featured here sounded cool and mannered in the studio, here they gain new muscle and force, not to mention a great deal of enthusiasm, and while tunes like &quot;Ashes of American Flags&quot; and &quot;Handshake Drugs&quot; are never going to be crowd-pleasers in the manner of &quot;Casino Queen,&quot; the ÃƒÂ©lan of this band in full flight shows that the fun has been put back in Wilco, albeit in a different and more angular form. Nels Cline's guitar is especially bracing in this context, and his marriage of melodic weight and joyous dissonance fits these songs while expanding on their strengths at the same time. And the title cut thankfully proves that Wilco still can (and still does) rock on out. Kicking Television is the best sort of live album -- a recording that doesn't merely retread a band's back catalog, but puts their songs in a new perspective, and in this case these performances reveal that one great band has actually been getting better.\n\n\nTracks\n01  -  Misunderstood  -  Tweedy \t6:08\n02  -  Company in My Back  -  Tweedy \t3:44\n03  -  The Late Greats  -  Tweedy \t2:40\n04  -  Hell Is Chrome \tJorgensen, Tweedy \t4:56\n05  -  Handshake Drugs  -  Tweedy \t6:23\n06  -  I Am Trying to Break Your Heart  -  Tweedy \t6:03\n07  -  Shot in the Arm  -  Bennett, Stirratt, Tweedy \t4:51\n08  -  At Least That's What You Said  -  Tweedy \t5:18\n09  -  Wishful Thinking  -  Kotche, Tweedy \t4:26\n10  -  Jesus, Etc.  -  Bennett, Tweedy \t4:00\n11  -  I'm the Man Who Loves You  -  Bennett, Tweedy \t3:58\n12  -  Kicking Television  -  Tweedy \t3:03\n13  -  Via Chicago  -  Tweedy \t5:14\n14  -  Hummingbird  -  Tweedy \t3:19\n15  -  Muzzle of Bees  -  Tweedy \t4:49\n16  -  One by One  -  Guthrie, Tweedy \t3:26\n17  -  Airline to Heaven  -  Bennett, Guthrie, Tweedy \t4:41\n18  -  Radio Cure  -  Bennett, Tweedy \t4:42\n19  -  Ashes of American Flags  -  Bennett, Tweedy \t6:03\n20  -  Heavy Metal Drummer  -  Tweedy \t3:21\n21  -  Poor Places  -  Bennett, Tweedy \t5:31\n22  -  Spiders (Kidsmoke)  -  Tweedy \t11:17\n23  -  Comment (If All Men Are Truly Brothers)  -  Rahman, Wright \t6:13\n\n\n","torrent":{"xt":"urn:btih:487798bec87e67dcea3e4983298761650d5e1da0","amp;dn":"Wilco+-+2005+-+Kicking+Television%3A+Live+In+Chicago+%5BEAC+-+FLAC+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"487798bec87e67dcea3e4983298761650d5e1da0","infoHashBuffer":{"type":"Buffer","data":[72,119,152,190,200,126,103,220,234,62,73,131,41,135,97,101,13,94,29,160]},"announce":[],"urlList":[]}}