{"title":"Sweeteners - Nutritional Aspects, Applications, and Production T","uid":15558297,"size":19846698,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4894b1a40d358e83544ff869cb85cef20e603432&amp;dn=Sweeteners+-+Nutritional+Aspects%2C+Applications%2C+and+Production+T&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1471094271,"description":"Sweeteners - Nutritional Aspects, Applications, and Production Technology - Theodoros Varzakas et al. (CRC, 2012).pdf\r\n\r\nSweeteners: Nutritional Aspects, Applications, and Production Technology explores all essential aspects of sugar-based, natural non-sugar-based, and artificial sweeteners. The book begins with an overview presenting general effects, safety, and nutrition. Next, the contributors discuss sweeteners from a wide range of scientific and lifestyle perspectives. Topics include:\r\n\r\nThe chemistry and functional properties of monosaccharides, oligosaccharides, polysaccharides, and sugar polyols\r\nAnalytical methodologies for determining low-calorie nonnutritive sweeteners\r\nHoney, syrups, and their physicochemical aspects and applications\r\nSweeteners such as &quot;sykin&quot; and raisin, prune, apple, and grape juice concentrate\r\nQuality control, production, handling, storage, safety, legislation, and risk assessment of sweeteners\r\nThe impact of sweeteners and sugar alternatives on nutrition and health\r\nEnvironmental and health concerns from the use of genetically modified (GM) herbicide-tolerant sugar beets and GM high fructose corn syrup\r\nInulin and oligofructose as soluble dietary fibers derived from chicory root\r\nAs manufacturers strive to produce healthier and safer products with better taste, new avenues of inquiry are opening up with respect to both the sources and the processing of sweeteners. This volume provides a solid starting point for researchers and product developers in the food and beverage industry","torrent":{"xt":"urn:btih:4894b1a40d358e83544ff869cb85cef20e603432","amp;dn":"Sweeteners+-+Nutritional+Aspects%2C+Applications%2C+and+Production+T","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4894b1a40d358e83544ff869cb85cef20e603432","infoHashBuffer":{"type":"Buffer","data":[72,148,177,164,13,53,142,131,84,79,248,105,203,133,206,242,14,96,52,50]},"announce":[],"urlList":[]}}