{"title":"Memory Man - David Baldacci","uid":13042044,"size":605169,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4974d349d4232bce9e0a03b18ff9cc728cfc540f&amp;dn=Memory+Man+-+David+Baldacci&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1450542129,"description":"Memory Man - David Baldacci\r\n\r\nWith over 110 million copies of his novels in print, David Baldacci is one of the most widely read storytellers in the world. Now he introduces a startling, original new character: a man with perfect memory who must solve his own family's murder.\r\n\r\nMEMORY MAN\r\n\r\nAmos Decker's life changed forever--twice.\r\n\r\nThe first time was on the gridiron. A big, towering athlete, he was the only person from his hometown of Burlington ever to go pro. But his career ended before it had a chance to begin. On his very first play, a violent helmet-to-helmet collision knocked him off the field for good, and left him with an improbable side effect--he can never forget anything.\r\n\r\nThe second time was at home nearly two decades later. Now a police detective, Decker returned from a stakeout one evening and entered a nightmare--his wife, young daughter, and brother-in-law had been murdered.\r\n\r\nHis family destroyed, their killer's identity as mysterious as the motive behind the crime, and unable to forget a single detail from that horrible night, Decker finds his world collapsing around him. He leaves the police force, loses his home, and winds up on the street, taking piecemeal jobs as a private investigator when he can.\r\n\r\nBut over a year later, a man turns himself in to the police and confesses to the murders. At the same time a horrific event nearly brings Burlington to its knees, and Decker is called back in to help with this investigation. Decker also seizes his chance to learn what really happened to his family that night. To uncover the stunning truth, he must use his remarkable gifts and confront the burdens that go along with them. He must endure the memories he would much rather forget. And he may have to make the ultimate sacrifice.\r\n\r\nMEMORY MAN will stay with you long after the turn of the final page.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:4974d349d4232bce9e0a03b18ff9cc728cfc540f","amp;dn":"Memory+Man+-+David+Baldacci","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4974d349d4232bce9e0a03b18ff9cc728cfc540f","infoHashBuffer":{"type":"Buffer","data":[73,116,211,73,212,35,43,206,158,10,3,177,143,249,204,114,140,252,84,15]},"announce":[],"urlList":[]}}