{"title":"AGGELAKAS.greek music","uid":7756619,"size":129368027,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:49ae162c22f744cb0b731af8854c5c8570cbf1d3&amp;dn=AGGELAKAS.greek+music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"maxalexath","files":19,"time":1351118479,"description":"John Angelakas is a singer, musician and poet. He became widely known as the lead singer of the rock band Hole from 1984 until 2001.\nLife\nBorn on October 30, 1959 in Thessaloniki. With the band &quot;Holes&quot; is released 7 albums. His first participation in another disk group took place in 1990 in the album &quot;Come ... and good luck guys&quot; which was recorded in memory of Paul Sidiropoulos and involve other artists.\nIn 1995, together with George Karras (band member Holes) released their album &quot;Beautiful Nothing&quot;. In this album also contained 4 songs and wrote Holes for the film &quot;The Time to Kill&quot;, this was the first time John Angelakas playing music of a film in which the band appears to play live songs they wrote about the film and their songs have been released.\nThe 1999 first tries to acting in the film &quot;Earth and Water&quot; which has a role. Also for the second time and again dealing with the music of a film but this time not with the hole but George Christianakis and Asclepius Zabeta (band member Holes).\nAfter the dissolution of the band Hole, participated in concerts together with Thanasis Papakonstantinou and cooperate with the album &quot;Vrachnos prophet&quot; circulating in 2000. Participates in the 2001 album by George Christianakis &quot;The doorman&quot; where he wrote the lyrics and sang the song &quot;Lady of the wind in me.&quot; Becomes a producer on three discs and other groups involved with acting again in the 2003 film &quot;The loser takes all&quot; starring and creates a soundtrack.\nHe also participated in the production of the double live album by Thanasis Papakonstantinou Live in 2004.\nIn 2004 he founded the record label &quot;alltogethernow&quot; which as he says &quot;is a corporation created, along with some friends, to protect our work and our internal environment.&quot; From 2004 until today, the company has released 6 albums.\nIn 2005 starts his collaboration with cellist Nick Veliotis with the album &quot;The breaths of wolves&quot;, this album is the first to be released by the company &quot;alltogethernow&quot;. Later the same year will be released the second album from alltogethernow titled &quot;John Angelakas and Visitors - from now on.&quot; That same year participate in the tray with tales for children &quot;The tickle&quot; Dimitri Baslam along with other artists.\nIn 2007 released his second album of John Angelakas with Nick Veliotis titled &quot;When we come here.&quot; In late 2007, released the record Psarandonis Na 'CWD mountains, the sea whose editing and production did Angelakas.\nTwo years after 2009 Pantelis Voulgaris empisteftai to John Angelakas the soundtrack for the movie &quot;Soul Deep&quot; and this album will be released by alltogethernow.\nHe has also published two collections of poetry (Shawls, half-truths and hole lyrics and nostalgia How dare tsoglane ;), accompanied by his own sketches. In 2000 the book about the heart of a beast 1985-2000 which contains all the lyrics, and interviews.\nIn 2005 he made his weekly radio show on 105.5 along with Dino Sadik (On Board).\nDiscography\nPersonal Album\n1993 Lovely nothing (Virgin)\n2000 &quot;Soil &amp; Water&quot;\n2003 Loser Takes All (soundtrack) (Hitch-Hyke)\n2005 The breaths of wolves (All Together Now)\n2005 From now on (All Together Now)\n2007 When we come here (All Together Now)\n2009 Soul Deep (soundtrack) (All Together Now)\nWith the band Hole [Edit]\nHoles 1984 (album) (Ano Kato Records)\n1987 Party at the 13th Floor (Virgin)\n1990 Holes in Heaven (Virgin)\n1993 Paid Nine Songs (Virgin)\n1994 Keep the show Monkey (live + unplugged) (Virgin)\n1996 Head Full of Gold (Virgin)\n1999 Into the Night of Others (Virgin)\nInvestments [Edit]\nCome 1991 and good luck guys (EMI)\n2000 Vrachnos Prophet (of Th.Papakonstantinou) (Lyra)\n2000 Soil and Water (soundtrack) (Virgin)\n2001 &quot;doorman&quot;\n2005 &quot;The tickle&quot;\nProduction [Edit]\n2000, &quot;Achaeans,&quot; the band Achaeans\n2000, &quot;Risk Log&quot; from the input assembly Risk\n2002, &quot;Kimmo&quot;, the band Kimmo\n2007, 'the CWD Sea Mountains of Psarandonis (MINOS-EMI)\nPoetry\n1988 Shawls, half-truths and hole lyrics versions Lebanon.\n1999 How dare nostalgia, tsoglane?, Publishing Lebanon.\n2000 For the heart of a beast 1985-2000, publishing Lebanon.","torrent":{"xt":"urn:btih:49ae162c22f744cb0b731af8854c5c8570cbf1d3","amp;dn":"AGGELAKAS.greek+music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49ae162c22f744cb0b731af8854c5c8570cbf1d3","infoHashBuffer":{"type":"Buffer","data":[73,174,22,44,34,247,68,203,11,115,26,248,133,76,92,133,112,203,241,211]},"announce":[],"urlList":[]}}