{"title":"War on the frontier - The Trans-Mississippi West (Time-Life)","uid":11777900,"size":31589688,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a2915aee2842f24e2b0d2efbc2dc5b74fb8d75a&amp;dn=War+on+the+frontier+-+The+Trans-Mississippi+West+%28Time-Life%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":1,"time":1427405805,"description":"Pdf / English / 1994 Time-Life / 176 pages / 34.4 MB / ISBN10 0809447800\n\nIn this volume of the Civil War series we look at the battles in the West, a largely forgotten theater of the Civil War. The territories of New Mexico, Arizona, Kansas, the Indian Territories, Colorado and Dakota, as well as the states of Minnesota, Missouri, Arkansas and Louisiana. While neither side would provide anything close to the numbers of troops seen in the East there would be a long march up and down the Rio Grande in New Mexico, Guerilla raids on both sides of the Kansas-Missouri, Indian fighting in the Dakotas and a campaign up the Red River.\n\nI read this volume primarily for the story of the Confederate Army of New Mexico. Its commander, General Sibley, planned to seize the territory with his small army, moving northward along the Rio Grande. Surprisingly, he actually managed to take Albuquerque and Sante Fe (which spoke more for the paucity of Federal frontier troops than any ingenuity on Sibley's part) but met with disaster before he could take Fort Union, a disaster which saw what was arguably the longest and hardest retreat experienced by any Confederate force.\n\nThis is one of those books you will want to read, to learn more of the characters who fought in these wide-open spaces. It includes sidebars of Indian War artwork, the Union's Pacific defenses, photos of frontier soldiers, the sketches of a Kansas volunteer, Indian weapons and fighting in Mexico. Includes maps, artwork, contemporary photos and pictures of artifacts.\n\nAmazon","torrent":{"xt":"urn:btih:4a2915aee2842f24e2b0d2efbc2dc5b74fb8d75a","amp;dn":"War+on+the+frontier+-+The+Trans-Mississippi+West+%28Time-Life%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a2915aee2842f24e2b0d2efbc2dc5b74fb8d75a","infoHashBuffer":{"type":"Buffer","data":[74,41,21,174,226,132,47,36,226,176,210,239,188,45,197,183,79,184,215,90]},"announce":[],"urlList":[]}}