{"title":"(PSX-PSP) Doom &amp; Final Doom converted properly (Kingdom-games by","uid":4552557,"size":492102470,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:4caaa15096467a59de80f5017a489a847764fa30&amp;dn=%28PSX-PSP%29+Doom+%26+Final+Doom+converted+properly+%28Kingdom-games+by&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"toxicjuggalo","files":3,"time":1228357140,"description":"DOOM:\n\nTaking no credit away from its genrepredecessor, Wolfenstein 3-D, DOOM was the breakthrough game of 1993, and the more influential of id&amp;#039;s first- person shooters. Its arsenal of powerful guns (namely the shotgun and BFG), intense level of gore and perfect balance of adrenaline-soaked action and exploration kept this gamer riveted for years. The PlayStation version comes packed with more than 50 hellish levels and two-player deathmatch and other competitive modes (via the link cable) running at 30 frames per second. The game supports 24-channel stereo sound effects, all-new secrets, triggers and switches, and more.\n\nFINAL DOOM:\n\nFINAL DOOM is the last game in the popular DOOM series. The minions of Hell are making a final attempt to take over the Earth, and once again a lone space marine is the planet&amp;#039;s last hope. Use shotguns, pistols, rocket launchers, and even the BFG 9000 to send these demons and monsters back to Hell. There are plenty of monsters to destroy in the game&amp;#039;s 40 levels that are stretched across three different worlds: the Master Levels, the Plutonia Experiment, and TNT: Evilution. It should be noted that all of the Master Levels were created by fans of the series and are included for hardcore fans. Should blasting through hoards of computer-controlled enemies become tiresome, pull out the link cable and challenge someone to a deathmatch. Only you can save the Earth from destruction in FINAL DOOM\n\nTested on Fat &amp; Slim and seem to work on all POPS but graphically 3.40 seems to work the best....KloWn","torrent":{"xt":"urn:btih:4caaa15096467a59de80f5017a489a847764fa30","amp;dn":"%28PSX-PSP%29+Doom+%26+Final+Doom+converted+properly+%28Kingdom-games+by","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4caaa15096467a59de80f5017a489a847764fa30","infoHashBuffer":{"type":"Buffer","data":[76,170,161,80,150,70,122,89,222,128,245,1,122,72,154,132,119,100,250,48]},"announce":[],"urlList":[]}}