{"title":"Ben Webster Plays Ballads(jazz)(mp3@320)[rogercc]","uid":6931520,"size":101689584,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4cbff7398638b76dea819d527ec0137df508f7a1&amp;dn=Ben+Webster+Plays+Ballads%28jazz%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rogercc1","files":8,"time":1325677532,"description":"BEN WEBSTERPLAYS BALLADS\nLabel: Storyville\nFormat: Mp3@320 cbr\n\nMany have hailed Ben Webster as one of the best instrumental balladeers in jazz history. His vibrato laden, smoky tone makes the music really sizzle. Webster's ballads are sultry and romantic, joyous and sentimental. Recorded late in his career, Plays Ballads is an album dedicated to soft, lyrical--and most of all--mellow music.\n\nMost of Plays Ballads was recorded for Danish Radio in the late '60s and early '70s just prior to the tenor legend's death. The songs selected were among Webster's favorites, including &quot;Stardust,&quot; &quot;My Romance,&quot; &quot;Willow Weep For Me,&quot; &quot;Old Folks,&quot; and others. Two of the songs, &quot;Cry Me a River&quot; and the traditional &quot;Greensleeves&quot; are heard here as full blown orchestral arrangements showcasing the skills of arranger Neils Jorgen Steen. \n\nBen Webster had a perfect tone for playing ballads, full of sentiment and emotion. On this Storyville release he caresses seven timeless melodies in a variety of settings including trios with either Teddy Wilson, Ole Kock Hansen or Kenny Drew on piano, backing by The Danish Radio Big Band (on &quot;Cry Me a River&quot;) or a version of &quot;Greensleeves&quot; with a string orchestra. Although largely forgotten in the United States (he had moved to Europe in 1965), Ben Webster was still in fine form this late in his career. ~ Scott Yanow, All Music Guide\n\nTracklist:\n\n1 Stardust 3:10 \n2 Cry Me A River 4:16 \n3 For Heavens' Sake 7:51 \n4 Greensleeves 2:27 \n5 My Romance 8:03 \n6 Willow Weep for Me 4:40 \n7 Old Folks 2:58[/size]\n\nPersonnel: \n\nBen Webster (tenor saxophone); Ole Molin (guitar, piano); Erling Christensen (strings, reeds); Borge Madsen, Hans Schwenger, Per Ludolph, Svend Blankholm, Holger Bjerre, Mogens Holm Larsen, Stanley Carlson, Anton Kontra, Aage Bertelsen, Ove Winther, Finn Ziegler (strings); Jesper Thilo, Sahib Shihab, Uffe Karskov, Flemming Madsen (reeds); Henry Henkel, Allan Botschinsky, Palle Mikkelborg, Palle Bolvig, Perry Knudsen (trumpet); Poul Jorgensen, Per Espersen, Torolf MolgÃƒÂ¥rd, Ole Kurt Jensen (trombone); Kenny Drew, Ole Kock Hansen, Teddy Wilson (piano); Bjarne Rostvold (drums, congas); Makaya Ntsoko, Albert &quot;Tootie&quot; Heath, William Schiopffe (drums); John Steffensen (congas).[/size]","torrent":{"xt":"urn:btih:4cbff7398638b76dea819d527ec0137df508f7a1","amp;dn":"Ben+Webster+Plays+Ballads%28jazz%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cbff7398638b76dea819d527ec0137df508f7a1","infoHashBuffer":{"type":"Buffer","data":[76,191,247,57,134,56,183,109,234,129,157,82,126,192,19,125,245,8,247,161]},"announce":[],"urlList":[]}}