{"title":"The Comparative Biology of Aging","uid":6556844,"size":3707844,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ce1d3ff74237579ea8f31df0ff78262a64b351a&amp;dn=The+Comparative+Biology+of+Aging&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"_F1_","files":-1,"time":1311327979,"description":"Norman S. Wolf - The Comparative Biology of Aging\nPublisher: SÃ‘â‚¬ringer | 2010-02-01 | ISBN: 9048134641 | PDF | 388 pages | 3.53 MB\n\n\nThe processes of aging and death remain one of the most fascinating, and mysterious, areas of biological research. Huge anomalies between species raise questions the answers to which could have fundamental implications for the field of medical science. As scientists unlock the secrets of the exceptionally long-lived little brown bat (up to 34 years), or the common budgerigar, for example, which despite having a metabolic rate 1.5 times that of a laboratory mouse, can live for up to 20 years, it has become more important than ever to be able to make a comparative analysis of the various species used in research.\n\nDealing with every one of the mammalian species that are employed in laboratory research, this is the first book on the subject of aging that provides detailed comparative data for age-related changes in its subjects. It does so at the level of the whole animal, its organs, organelles and molecules. The comparative data, supplied in 15 chapters by leading experts, provides information on fields as disparate as telomere function and loss, the importance of the Sirtuins and Tor, the influence of hormones on lifespans, the relationship between body size and lifespan, the effects of restricted calorific intake, age-related changes in cell replication, and DNA damage and repair. Chapters are devoted to cardiac aging, comparative skeletal muscle aging, the aging of the nervous and immune systems, the comparative biology of lyosomal function and how it is affected by age, and many other key areas of research.\n\nThis much-needed text will provide scientists working in a wide spectrum of fields with key data to aid them in their studies.","torrent":{"xt":"urn:btih:4ce1d3ff74237579ea8f31df0ff78262a64b351a","amp;dn":"The+Comparative+Biology+of+Aging","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ce1d3ff74237579ea8f31df0ff78262a64b351a","infoHashBuffer":{"type":"Buffer","data":[76,225,211,255,116,35,117,121,234,143,49,223,15,247,130,98,166,75,53,26]},"announce":[],"urlList":[]}}