{"title":"Michael Bunker - Brother, Frankenstein","uid":12250531,"size":239610235,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4d22628d6b42d5c5623c37ed4f51f77f25f834cf&amp;dn=Michael+Bunker+-+Brother%2C+Frankenstein&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Cybotage","files":33,"time":1440010734,"description":"Dr. Chris Alexander, a borderline sociopath and technological genius, has designed an advanced cybernetic life form from prototype decommissioned military drones and top-secret experimental DARPA technology. The HADroid was supposed to be a military grade robot with the transplanted heart and brain of a human donor that would transform it into a devastating state-of-the-art war machine when activated by its onboard human operator.\n\nWhen the mad doctor steals the dying child of a simple Amish couple and transplants the brain and cardiovascular system of their dying 11-year-old autistic son into the incredibly lethal robot, the dark forces of government come looking for their investment.\n\nDr. Alexander and the monster escape into another Amish community to hide among the plain folk. Frank, the autistic 11-year-old boy trapped inside the body of the world's most deadly robot, befriends another child who will help the prisoner inside the machine to leave the world of autism and understand what it means to be human and Amish. Tensions arise among the plain and pacifistic yet closed minded Amish as they begin to suspect just what kind of technological monstrosity is hiding among them. Before long, hard men who do the government's most dirty deeds will come looking for a killing machine only to find a boy named Frank who has the power to defend a closed society from the worst of the world.\n\n\nRead by Andrew McFerrin\nFormat: MP3","torrent":{"xt":"urn:btih:4d22628d6b42d5c5623c37ed4f51f77f25f834cf","amp;dn":"Michael+Bunker+-+Brother%2C+Frankenstein","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d22628d6b42d5c5623c37ed4f51f77f25f834cf","infoHashBuffer":{"type":"Buffer","data":[77,34,98,141,107,66,213,197,98,60,55,237,79,81,247,127,37,248,52,207]},"announce":[],"urlList":[]}}