{"title":"The Batman Adventures - Mad Love (1994, Dgtl, M-Phantasm)","uid":9514115,"size":30831724,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4d653186523fb27993b644389dbd674fc168e8f8&amp;dn=The+Batman+Adventures+-+Mad+Love+%281994%2C+Dgtl%2C+M-Phantasm%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1390484620,"description":"At the height of its popularity, the brilliant &quot;Batman: The Animated Series&quot; often tried tricky new interpretations of old characters - such as their remarkable, Emmy Award-winning Mr. Freeze tale &quot;Heart of Ice&quot;. Along with that, the series found great success in original characters such as Rene Montoya and Harley Quinn. Although both would find their way into the mainstream DC continuity, Harley was such a smashing success as the Joker's partner/underling/love interest that the powers-that-be wanted her to star in her own stories right away. Thus, they allowed B:TAS head writer Paul Dini the chance to write Harley in this one-off special, and naturally he knocked it out of the park. &quot;Mad Love&quot; explores the twisted relationship between the Joker and Harley, and while it is a very funny story at its core there are moments of sadness and pain, as our sympathy is drawn towards the erstwhile Dr. Harleen Qunizel in her new capacity as the Joker's pet. Of course, she only has eyes for her &quot;Mr. J&quot; and is blinded to the dangers - at first - but slowly it begins to dawn on her that being beholden to the Joker might not be all she thought it would be. Batman, of course, it caught in the middle of this madness! Thanks to Minutemen-Phantasm for this new shiny digital edition, please seed and enjoy this classic and rightfully praised tale! :-)","torrent":{"xt":"urn:btih:4d653186523fb27993b644389dbd674fc168e8f8","amp;dn":"The+Batman+Adventures+-+Mad+Love+%281994%2C+Dgtl%2C+M-Phantasm%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d653186523fb27993b644389dbd674fc168e8f8","infoHashBuffer":{"type":"Buffer","data":[77,101,49,134,82,63,178,121,147,182,68,56,157,189,103,79,193,104,232,248]},"announce":[],"urlList":[]}}