{"title":"BBC Why Poverty, 4 of 8 Park Avenue, Money, Power And The Americ","uid":7910060,"size":734809757,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4d866fc57f2663a3f5fa3b00c1ab6ea35c79aeed&amp;dn=BBC+Why+Poverty%2C+4+of+8+Park+Avenue%2C+Money%2C+Power+And+The+Americ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":2,"time":1355190212,"description":" &lt;a href=&quot;http://www.bbc.co.uk/programmes/p010jx3m&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.bbc.co.uk/programmes/p010jx3m&lt;/a&gt;\n\n740 Park Avenue - an exclusive apartment building in Manhattan - is currently \nhome to more billionaires than any other building in the United States. Less \nthan five miles to the north is another Park Avenue in the South Bronx, where \nalmost 40 per cent live in poverty and life prospects are less promising for \nthose stuck at the bottom of the American pile. As international attention \nfocuses on the US elections, Oscar-winning documentary filmmaker Alex Gibney \nlooks at inequality in the US through the prism of these two, near-adjacent \nplaces, to ask if America is still the land of opportunity. \n\n&quot;There's always been a gap between the wealthiest in our society and everyone \nelse, but in the last 30 years something changed: that gap became the Grand \nCanyon,&quot; says Gibney. Through the story of the two Park Avenues, he argues that \nthe extreme wealth of a few has been used to impose their ideas on the rest of \nAmerica. By focusing on the residents of 740 Park, he asks questions about the \ninfluence of CEOs in Washington in return for tax policies that favour the \nultra-rich. What chances do those at the bottom of the ladder have for upward \nmobility? Can someone who starts life on Park Avenue in the South Bronx end up \nliving on Park Avenue in Manhattan? \n\nThrough archive and interviews with academics, political scientists, \npsychologists, former lobbyists and even a former doorman at 740 Park, Gibney's \nfilm is a polemical look at the socio-economic political landscape of \ncontemporary USA.\n\nA BBC Storyville film, produced in partnership with the Open University, Park \nAvenue screens as part of Why Poverty? - when the BBC and the OU, in \nconjunction with more than 70 broadcasters around the world, hosts a debate \nabout contemporary poverty.","torrent":{"xt":"urn:btih:4d866fc57f2663a3f5fa3b00c1ab6ea35c79aeed","amp;dn":"BBC+Why+Poverty%2C+4+of+8+Park+Avenue%2C+Money%2C+Power+And+The+Americ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d866fc57f2663a3f5fa3b00c1ab6ea35c79aeed","infoHashBuffer":{"type":"Buffer","data":[77,134,111,197,127,38,99,163,245,250,59,0,193,171,110,163,92,121,174,237]},"announce":[],"urlList":[]}}