{"title":"Big Gods - How Religion Transformed Cooperation and Conflict (20","uid":10664268,"size":14520770,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4dce4331279fa6019a27e744c8660812ea415da9&amp;dn=Big+Gods+-+How+Religion+Transformed+Cooperation+and+Conflict+%2820&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"VikTSlick","files":-1,"time":1406775532,"description":"Title: Big Gods - How Religion Transformed Cooperation and Conflict \nAuthor: Ara Norenzayan \nCategory: Academic/Religion/Politics\nPublisher: Princeton University Press; 1 edition (August 25, 2013)\nLanguage: English\nISBN-10: 0691151210\nISBN-13: 978-0691151212\n\nPromotional info/Publisher's summary - &quot;How did human societies scale up from small, tight-knit groups of hunter-gatherers to the large, anonymous, cooperative societies of today--even though anonymity is the enemy of cooperation? How did organized religions with &quot;Big Gods&quot;--the great monotheistic and polytheistic faiths--spread to colonize most minds in the world? In Big Gods, Ara Norenzayan makes the surprising and provocative argument that these fundamental puzzles about the origins of civilization are one and the same, and answer each other.\n\nOnce human minds could conceive of supernatural beings, Norenzayan argues, the stage was set for rapid cultural and historical changes that eventually led to large societies with Big Gods--powerful, omniscient, interventionist deities concerned with regulating the moral behavior of humans. How? As the saying goes, &quot;watched people are nice people.&quot; It follows that people play nice when they think Big Gods are watching them, even when no one else is. Yet at the same time that sincere faith in Big Gods unleashed unprecedented cooperation within ever-expanding groups, it also introduced a new source of potential conflict between competing groups.\n\nIn some parts of the world, such as northern Europe, secular institutions have precipitated religion's decline by usurping its community-building functions. These societies with atheist majorities--some of the most cooperative, peaceful, and prosperous in the world--climbed religion's ladder, and then kicked it away. So while Big Gods answers fundamental questions about the origins and spread of world religions, it also helps us understand another, more recent social transition--the rise of cooperative societies without belief in gods.&quot;\n\nReviews:\n&quot;Ranging across quantitative studies, historical cross-cultural examples, theological texts, and the practices of believers, Norenzayan convincingly argues that religions with Big Gods are successful because they generate a sense of being watched and regulated, require extravagant displays of commitment that weed out religious impostors, and encourage solidarity and trust.&quot; -Publishers Weekly\n\n&quot;I found this book insightful, well-written, and to the point.&quot; -Tyler Cowen, Marginal Revolution\n\nThis torrent contains the original retail EPUB as well as conversions into MOBI, AZW3, LIT, and large print PDF formats done in Calibre. The front cover image and generated metadata.opf file are also included. Please seed, and enjoy.\n","torrent":{"xt":"urn:btih:4dce4331279fa6019a27e744c8660812ea415da9","amp;dn":"Big+Gods+-+How+Religion+Transformed+Cooperation+and+Conflict+%2820","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dce4331279fa6019a27e744c8660812ea415da9","infoHashBuffer":{"type":"Buffer","data":[77,206,67,49,39,159,166,1,154,39,231,68,200,102,8,18,234,65,93,169]},"announce":[],"urlList":[]}}