{"title":"The Evolving Self - Csikszentmihalyi - Psych Essential (ebook, A","uid":6774168,"size":168546959,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4e0b889f1145fc7c125cdf55e5464c06e3794ff1&amp;dn=The+Evolving+Self+-+Csikszentmihalyi+-+Psych+Essential+%28ebook%2C+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"UnviolentPeacemaker","files":21,"time":1319678571,"description":"Quite possibly the most important Psych book for this crucial age.  Read, Study, Ponder DEEPLY.\n &lt;a href=&quot;\nhttp://www.amazon.com/Evolving-Self-Psychology-Third-Millennium/dp/product-description/0060921927/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Evolving-Self-Psychology-Third-Millennium/dp/product-description/0060921927/&lt;/a&gt;\n\n1. URGENT, PLS, SEED, SEED, SEED ALL, ALL, ALL ...\nUnviolentPeaceMaker's TPB uploads    &lt;a href=&quot;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&lt;/a&gt; .  \nSOON I MAY BE PREVENTED.  DO IT.  \nKEEP THESE TORRENTS ALIVE.  Thanks.  All of them.\n\n2. NOTE:  High Quality ATT Voice. Dont like it?  Dont download it.  Dont complain.  Dont get in the way.\n\n------------------\n\nFrom Publishers Weekly\nIn this wise, humane inquiry, Csikszentmihalyi ( Flow: The Psychology of Optimal Experience ) argues that genetically programmed behaviors that once helped humans adapt and \n\nmultiply now threaten our survival. These traits include obsessions with food and sex, addiction to pleasure, excessive rationality and a tendency to focus on the negative. A \n\nUniversity of Chicago psychology professor, the author also believes we must free our minds of cultural illusions such as ethnocentric superiority or identification with one's \n\npossessions. He urges readers to find ways to reduce the oppression, exploitation and inequality that are woven into the fabric of society. Further, he wants us to control the \n\ndirection of human evolution by pursuing challenging activities that lead to greater complexity while opposting chaos and conformity. Each chapter concludes with self-help \n\nquestions and mental exercises designed to help readers apply the insights of this literate manifesto to their daily lives.\nCopyright 1993 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.\n\nFrom Library Journal\nThis title aims to provide 'a deeper understanding of the direction in which life on earth has been going, and hence a clearer sense of what the meaning of one's own life might \n\nbe. The author believes that becoming an active, conscious part of the evolutionary process can give our lives meaning and joy. In fact, the fate of humanity in the next \n\nmillennium depends on the kind of selves we become today. An interesting feature of this book is the space provided at the end of each chapter for readers to jot down their \n\nthoughts about the issues covered, though libraries might find this problematic. Csikszentmihalyi goes beyond the psychobabble and traces human behavior from the beginning of \n\ntime and shows with great clarity why we do the things we do. Most general readers may find it too 'deep.' Recommended for libraries with a solid psychology collection.\n- Belinda J. Pugh, Kings Bay Base Lib., Ga.\nCopyright 1993 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.\n\nFrom Booklist\nAt least since John Donne, perceptive writers have sensed a cultural crisis created through the displacement of religion by modern science. Csikszentmihalyi sees danger in this \n\ncrisis, but he also sees the opportunity for a liberating new synthesis of philosophic traditions. Electric and capacious, this synthesis draws from Confucius, Domenici, and \n\nHuxley as it opens possibilities for transcending human limits previously defined by evolutionary biology and cultural orthodoxy. The primal dissatisfaction with life that seems \n\ninherent in humankind can spur us to create a new self in harmony with an unfolding cosmos, not hemmed in by genetic laws or traditional values. The provocative questions at the \n\nend of each chapter demand of the reader active collaboration, not merely passive receptivity. Even many readers who reflect the author's optimistic pantheism will find fresh \n\ninsights into our contemporary discontents. Bryce Christensen --This text refers to an out of print or unavailable edition of this title.\n\nReview\n&quot;A book of singular importance and timeliness, one with momentous implications for the future.&quot; -- -- Howard Gardner\nProduct Description\n\nThe author of the bestselling Flow (more than 125,000 copies sold) offers an intelligent, inspiring guide to life in the future.\n\nAbout the Author\n\nMihaly Csikszentmihalyi is professor and former chairman of the Department of Psychology at the University of Chicago.\n\nHis previous books include Flow and The Evolving Self. Flow was shown on the 1993 NBC Super Bowl broadcast as the book that inspired Jimmy Johnson, then coach of the Dallas \n\nCowboys. It was also a selection of the Book-of-the-Month Club and the Quality Paperback Book Club. \n\npdf audio book mp3 download torrent","torrent":{"xt":"urn:btih:4e0b889f1145fc7c125cdf55e5464c06e3794ff1","amp;dn":"The+Evolving+Self+-+Csikszentmihalyi+-+Psych+Essential+%28ebook%2C+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e0b889f1145fc7c125cdf55e5464c06e3794ff1","infoHashBuffer":{"type":"Buffer","data":[78,11,136,159,17,69,252,124,18,92,223,85,229,70,76,6,227,121,79,241]},"announce":[],"urlList":[]}}