{"title":"[PlayBoyPlus] Khloe Terae (Cybergirl of the Year 2015) -=NEW MAR","uid":11789220,"size":286302042,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:4e7d1fa8f505aa33855aa3a697ec90ef55742bf3&amp;dn=%5BPlayBoyPlus%5D+Khloe+Terae+%28Cybergirl+of+the+Year+2015%29+-%3DNEW+MAR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"H4ckuos","files":1,"time":1427867177,"description":"[PlayBoyPlus] Khloe Terae (Cybergirl of the Year 2015) -=NEW MARCH 31,2015=-\n\nTitle: Cybergirl of the Year 2015\nReleased: 2015\nReleased: PlayBoyPlus\nGenre: Cybergirls, Solo, Dreamgirls, Shaved, Full Cups, Fetish\nStarring: Khloe Terae\nDuration: 13mn 38s\n\nYou voted, we heard you loud and clear-Khloe Terae is your Cybergirl of the Year in 2015, and she's an absolute siren in this beachfront set from photographer Holly Randall. With 100,000 followers on Twitter, almost 300,000 on Instagram and over a million likes on her Facebook page, it's safe to say that Khloe is a star in her own right-and seen here on the beach in La Paz, Mexico, shooting for Cybergirl of the Year, she shines as brightly as ever. &quot;After shooting my first pictorials in 2013, I was so excited to be a part of Playboy Plus,&quot; says Khloe, grinning from ear to ear. &quot;It never even occurred to me that one day, I'd become Cybergirl of the Year. I remember meeting Leanna Decker and Jennifer Vaughn, thinking, 'Wow, it would be awesome to be in their shoes!' &quot;For this set, Khloe's not wearing shoes-or clothes, for that matter. Italian watersports brand Cressi loaned Khloe some gear so she could explore the Mexican beach to the fullest, and scuba diving has never, ever looked so sexy. &quot;This shoot was so awesome,&quot; says Khloe. &quot;I've snorkeled before, but this was my first time going scuba diving, and I felt like a Bond girl! I'm quite the daredevil-not to mention nudist-so if PlayboyTV ever brings back Badass, I'm gonna be one of the first models they call! &quot;For now, Khloe is content to be CGOY '15 -with 10 International centerfolds to her name, she seems bent on world domination, so we're happy to catch Miss Terae while we can. &quot;With hard work, perseverance, and more importantly, patience, anything is possible,&quot; says Khloe, beaming. &quot;With Playboy Plus, I made my dreams my reality!&quot;\n\nQuality: HD\nFormat: mp4\nVideo: MPEG-4, AVC at 2600 Kbps, 1280 x 720 (1.778) at 23.976 fps\nAudio: AAC LC, 48.0 KHz, 2 ch, 192 Kbps, CBR\n &lt;a href=&quot;\nhttp://xxxhost.info/img-551b6a911485f.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.info/img-551b6a911485f.html&lt;/a&gt;","torrent":{"xt":"urn:btih:4e7d1fa8f505aa33855aa3a697ec90ef55742bf3","amp;dn":"%5BPlayBoyPlus%5D+Khloe+Terae+%28Cybergirl+of+the+Year+2015%29+-%3DNEW+MAR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e7d1fa8f505aa33855aa3a697ec90ef55742bf3","infoHashBuffer":{"type":"Buffer","data":[78,125,31,168,245,5,170,51,133,90,163,166,151,236,144,239,85,116,43,243]},"announce":[],"urlList":[]}}