{"title":"Mirror Image - Michael Scott - Melanie Ruth Rose [EN EPUB MOBI]","uid":15646097,"size":2480525,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f09f2379478a2dff00eab960fd6889f6295fbad&amp;dn=Mirror+Image+-+Michael+Scott+-+Melanie+Ruth+Rose+%5BEN+EPUB+MOBI%5D+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"perfect_stan","files":3,"time":1472053706,"description":"Mirror Image: A Novel by Michael Scott, Melanie Ruth Rose \r\nEnglish | 2016 | Horror | 3.4 MB \r\n\r\nA mirror that feeds on human souls wreaks destruction on those around it in this new novel from internationally bestselling author Michael Scott and Melanie Ruth Rose \r\nIn an auction house in London, there is a mirror no one will buy. Standing seven feet tall and reaching four feet across, its size makes it unusual. Its horrific powers make it extraordinary. For centuries, the mirror has fed off of the lives of humans, giving them agonizing deaths and sucking their souls into its hellish world. \r\nWhen Jonathan Frazer, the wealthy owner of a furniture and antiques shop in Los Angeles, buys the mirror at an auction, he believes he is getting the bargain of a lifetime. With its age and size, it is easily worth eight times what he paid for it. At this point, the mirror has sat dormant for years. But within days of Jonathan’s purchase, the deaths begin again. One employee is crushed when the mirror falls on top of him. A few days later, the corpse of another is found in front of the mirror, brutally stabbed. A third is burned beyond all recognition. All the while, an enormous man with a scarred face is following Jonathan, demanding that he give him the mirror and killing any police officer that gets in his way. \r\nThe police are becoming desperate. As the death toll rises, Jonathan himself becomes a suspect. He knows there is something wrong with the mirror. He knows it’s dangerous. But he cannot bring himself to get rid of it. Everyday he becomes more captivated by the mirror. \r\nFor the mirror is awakening, and its powers are resurfacing. \r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:4f09f2379478a2dff00eab960fd6889f6295fbad","amp;dn":"Mirror+Image+-+Michael+Scott+-+Melanie+Ruth+Rose+%5BEN+EPUB+MOBI%5D+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f09f2379478a2dff00eab960fd6889f6295fbad","infoHashBuffer":{"type":"Buffer","data":[79,9,242,55,148,120,162,223,240,14,171,150,15,214,136,159,98,149,251,173]},"announce":[],"urlList":[]}}