{"title":"[AllGirlMassage] Cassidy Klein, Jamie Langford (Never Trust Your","uid":12467041,"size":275006191,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4f234d5c86b28ca9196c04a8436914e6ee6e1f1f&amp;dn=%5BAllGirlMassage%5D+Cassidy+Klein%2C+Jamie+Langford+%28Never+Trust+Your&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"VorTeK-ET","files":1,"time":1442867101,"description":"Download my other latest torrents @  \n                            &lt;a href=&quot;\nhttps://thepiratebay.vg/user/VorTeK-ET/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.vg/user/VorTeK-ET/&lt;/a&gt;\n\n\n   \nDescription\nIt's the first time that Cassidy Klein is away from her twin sister Carmen who took a vacation with her husband. Cassidy is asked to house sit while they are gone and takes this as an opportunity to relax and help out her twin. Walking into the house, she finds a note from her sister thanking her for taking care of the place and mentions she left a check for her troubles. Cassidy searches on the table but didn't see any check, but did find a coupon for a free massage. Cassidy didn't think her twin sister wouldn't mind her taking it to be redeemed; it was going to expire anyway before she gets back...\n\nJamie Langford smiles from cheek to cheek, watching her client walk through door. Cassidy shows the coupon to Jamie, wondering if it is ok on such a short notice, but Jamie finds Cassidy's acting strange since she is the one who gave her the coupon! Jamie thinks Cassidy is her sister, and totally plays it out.\n\nShowing her downstairs to the massage room, Cassidy is asked to remove all her clothing and lie on the massage table. Even though Cassidy thought her sister had a lot of explaining to do, she didn't want her cover to be blown, so she just rolls with it. Jamie rubs Cassidy's back and ass, wanting to know if this is something Jamie does on a regular basis, but ass rubbing is Carmen's favorite part. Jamie moves her hands down towards Cassidy's feet, rubbing her toe one by one and heels. Jamie, moves her hands towards Cassidy's shaved pussy and boobs, but Cassidy even though not expecting this, kind of likes the feeling of Jamie's fingers rubbing against her twat. Cassidy needs to get her rocks off, and hey, she deserves it after all, house sitting is hard work!\n\nEnjoy!\n &lt;a href=&quot;\nhttp://imgclash.com/img-56004c5f9cdc3.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclash.com/img-56004c5f9cdc3.html&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://imgclash.com/img-56004c674a681.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclash.com/img-56004c674a681.html&lt;/a&gt;","torrent":{"xt":"urn:btih:4f234d5c86b28ca9196c04a8436914e6ee6e1f1f","amp;dn":"%5BAllGirlMassage%5D+Cassidy+Klein%2C+Jamie+Langford+%28Never+Trust+Your","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f234d5c86b28ca9196c04a8436914e6ee6e1f1f","infoHashBuffer":{"type":"Buffer","data":[79,35,77,92,134,178,140,169,25,108,4,168,67,105,20,230,238,110,31,31]},"announce":[],"urlList":[]}}