{"title":"The Bourbon Thief by Tiffany Reisz (ePub)","uid":15129755,"size":374513,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f5ae66e3863d3907693ce85b6076694d9e01a24&amp;dn=The+Bourbon+Thief+by+Tiffany+Reisz+%28ePub%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Skyeater","files":2,"time":1467142556,"description":"The Bourbon Thief\r\nby Tiffany Reisz\r\n\r\n-------------\r\n\r\nFrom the internationally celebrated author of the Original Sinners series comes a brand-new tale of betrayal, revenge and a family scandal that bore a 150-year-old mystery\r\n\r\nWhen Cooper McQueen wakes up from a night with a beautiful stranger, it's to discover he's been robbed. The only item stolen—a million-dollar bottle of bourbon. The thief, a mysterious woman named Paris, claims the bottle is rightfully hers. After all, the label itself says it's property of the Maddox family who owned and operated Red Thread Bourbon distillery since the last days of the Civil War until the company went out of business for reasons no one knows… No one except Paris. \r\n\r\nIn the small hours of a Louisville morning, Paris unspools the lurid tale of Tamara Maddox, heiress to the distillery that became an empire. But the family tree is rooted in tainted soil and has borne rotten fruit. Theirs is a legacy of wealth and power, but also of lies, secrets and sins of omission. The Maddoxes have bourbon in their blood—and blood in their bourbon. Why Paris wants the bottle of Red Thread remains a secret until the truth of her identity is at last revealed, and the century-old vengeance Tamara vowed against her family can finally be completed","torrent":{"xt":"urn:btih:4f5ae66e3863d3907693ce85b6076694d9e01a24","amp;dn":"The+Bourbon+Thief+by+Tiffany+Reisz+%28ePub%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f5ae66e3863d3907693ce85b6076694d9e01a24","infoHashBuffer":{"type":"Buffer","data":[79,90,230,110,56,99,211,144,118,147,206,133,182,7,102,148,217,224,26,36]},"announce":[],"urlList":[]}}