{"title":"Microfluidics and Microscale Transport Processes","uid":12019542,"size":8630838,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f70a39a584aa84cf4035d78d07e3f8a8a8b0927&amp;dn=Microfluidics+and+Microscale+Transport+Processes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"clouderone","files":1,"time":1434395160,"description":"ISBN 9781466501980\n\nThe advancements in micro- and nano-fabrication techniques, especially in the last couple of decades, have led research communities, over the world, to invest unprecedented levels of attention on the science and technology of micro- and nano-scale devices and the concerned applications. With an intense focus on micro- and nanotechnology from a fluidic perspective, Microfluidics and Microscale Transport Processes provides a broad review of advances in this field. A comprehensive compendium of key indicators to recent developments in some very active research topics in microscale transport processes, it supplies an optimal balance between discussions of concrete applications and development of fundamental understanding.\n\nThe chapters discuss a wide range of issues in the sub-domains of capillary transport, fluidic resistance, electrokinetics, substrate modification, rotational microfluidics, and the applications of the phenomena of these sub-domains in diverse situations ranging from non-biological to biological ones like DNA hybridization and cellular biomicrofluidics. The book also addresses a generic problem of particle transport in nanoscale colloidal suspensions and includes a chapter on Lattice-Boltzmann methods for phase-changing problems which represents a generic particle based approach that may be useful to address many microfluidic problems of interdisciplinary relevance","torrent":{"xt":"urn:btih:4f70a39a584aa84cf4035d78d07e3f8a8a8b0927","amp;dn":"Microfluidics+and+Microscale+Transport+Processes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f70a39a584aa84cf4035d78d07e3f8a8a8b0927","infoHashBuffer":{"type":"Buffer","data":[79,112,163,154,88,74,168,76,244,3,93,120,208,126,63,138,138,139,9,39]},"announce":[],"urlList":[]}}