{"title":"Rob.Papen.ConcreteFX.Blue.VSTi.v1.7.incl.KeyGen-BEAT","uid":3949173,"size":3813744,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:501b787090f10ac3a3184b2ec143d0c15fb984a3&amp;dn=Rob.Papen.ConcreteFX.Blue.VSTi.v1.7.incl.KeyGen-BEAT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"profetas","files":1,"time":1198722771,"description":"      Following the huge success of Albino, Rob Papen has teamed up\n      with music software developer Jon Ayres to bring you his\n      latest cross-fusion virtual synthesizer BLUE.\n      \n      This fresh new synth delivers FM Synthesis, Phase Distortion\n      Synthesis, Wave Shaping Synthesis and Subtractive Synthesis is\n      one creative combination! \n      \n      BLUE has six oscillators which can be connected in various\n      ways, two analogue style modelled stereo filters, an enormous\n      range of processing and modulation options and an incredibly\n      powerful sequencer, all brought together with the\n      inspirational Rob Papen presets covering a wide range of\n      musical styles. \n      Despite these heavy features, BLUE is so easy-to-use thanks to\n      its user interface and the innovative &amp;#039;easy edit&amp;#039; page for\n      quick sound changes! \n      \n      BLUE promises to exceed your expectations!\n      \n      Key features BLUE: \n      \n      - VST2.0 and AU plug-in synthesizer for PC and Mac. \n      - Six Oscillators modules which include Analogue, Additive and\n        Spectral type waveforms. Osc. A and B offer PWM modulation\n        and symmetry control. Oscillators can be combined in several\n        ways using 32 different modulation routings in the Algorithm\n        screen. Oscillators can have FM modulation or Ring\n        modulation and can be oscillator hard synced. Each\n        oscillator can be output to the filters, the effects or\n        output as dry. Dedicated screens available in the LCD screen\n        section for Algorithm selection, Phase distortion / Wave\n        shaping settings and Oscillator Envelopes. \n      - Two analogue modelled stereo Multimode filters, offering 6dB\n        LowPass/HighPass, 12dB and 24dB\n        LowPass/HighPass/BandPass/Notch, Ring, Comb and Vox\n        (formant). Filters with panning, panning modulation options\n        and pre-filtering distortion. Easy filter control by\n        pre-defined modulation controllers like Envelope, Velocity,\n        Keytrack and Modulation Wheel. \n      - Nine Envelopes, AHDSFR type. Direct connection to the\n        Oscillators volume, Filters frequency and main Volume amp to\n        make sound editing fast and easy. Graphic and fader-control\n        of Envelopes in one go. Dynamic curves and midi tempo based\n        features like delay and envelope retrigger. \n      - Four Multi-Envelopes, These free highly sophisticated\n        envelopes can be built up using up to 16 sections. Full\n        graphic control and additional menus with presets, load and\n        save functions. Dynamic curves and midi tempo based\n        functions.      \n      - Ten LFOs with various waveforms and are midi-syncable.\n        Directly connected to main targets to make sound editing\n        easy and fast. Directly connected LFO&amp;#039;s for PWM A/B, Filter\n        Frequency A/B, Tremolo (amp), Vibrato (main pitch) and Three\n        Free LFOs. LFO have adjustable, free/poly/mono modes,\n        keytracking, symmetry, smoothing, attack, decay and humanize\n        functions. \n      - Three modulation Step-sequencers with sequence loop\n        start/end, poly/mono/free play modes, speed controls and\n        step smooth function. Copy/paste/clear functions. \n      - Modulation Matrix with 2 pages of 10 slots. 12 synth sources\n        &amp; 23 midi sources and 103 synth destinations. \n      - 32 step mono sequencer, with sequencer length, speed adjust,\n        slide amount, swing amount, volume smoothing. Each step has\n        On/off, Reset, -32/+32 Semitune, Volume, Slide on/off,\n        Filter A, Filter B and Free modulation settings. Clear, load\n        and save functions to exchange sequences in between presets. \n      - Poly/Mono/Legato/Seq synthesizer play modes. Portmento\n        featuring legato, switch-able constant time/constant rate.\n        Mono unison mode. \n      - Adjustable Precision setting per oscillator to simulate the\n        instability of vintage analogue synthesizers. \n      - 16-voice polyphony. Voice amount control. \n      - Global settings save with each individual preset like:\n        keyboard velocity response curve, over-sampling settings and\n        filter control smoothing. \n      - Easy Edit page for fast new sound results or for easy access\n        tempo changes. \n      - External controller hardware (fader-box or synth) settings\n        can be saved and restored. \n      - Two effects-blocks with serial and parallel mode. Nine\n        stereo effects available including Mono Delay, Stereo Delay,\n        Chorus, Flanger, Phaser, Distortion, Low Fi, Stereo Widener\n        and Reverb. Midi tempo based settings in Delays, Phaser and\n        Flanger. \n      - Equalizer for total overall sound. \n      - Sound banks of 32 presets inside build in browser. Preset\n        handling with copy, paste, clear and compare function.\n        Preset banks are sorted into style-maps for easy search. \n      - All settings included the global settings are stored inside\n        each individual preset. \n      - Presets in clear catagories by Rob Papen.\n      \n        Version 1.7.0 (PC)\n      \n      - New features and increased audio quality\n      - Less CPU and over 400 new presets","torrent":{"xt":"urn:btih:501b787090f10ac3a3184b2ec143d0c15fb984a3","amp;dn":"Rob.Papen.ConcreteFX.Blue.VSTi.v1.7.incl.KeyGen-BEAT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"501b787090f10ac3a3184b2ec143d0c15fb984a3","infoHashBuffer":{"type":"Buffer","data":[80,27,120,112,144,241,10,195,163,24,75,46,193,67,208,193,95,185,132,163]},"announce":[],"urlList":[]}}