{"title":"Independent Film Producing: How to Produce a Low-Budget Feature ","uid":11215487,"size":2912551,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51081a00531123b088be2407fe27da21398e8dec&amp;dn=Independent+Film+Producing%3A+How+to+Produce+a+Low-Budget+Feature+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1413322492,"description":"Independent Film Producing: How to Produce a Low-Budget Feature Film - Paul Battista\n\n\nYou don't need a big studio to get on the big screen. For low-budget filmmakers, nothing is quite so terrifying as the elements of legal concerns that must be considered before the film can actually be made-at least if you want to have the ability to distribute it in any way. While Paul Battista's well-composed and necessary book won't alleviate all your fears, it does a good job of waking you up and helping you to think of things in a realistic manner, rather than in an idealistic manner that will sabotage your filmmaking efforts. \nWhile this book is specifically designed for producers, it fully realizes that, all too often, low-budget directors will find themselves as their own producers. If that's you, then you need to pick up this book. If you already have a good producer, you should definitely get them a copy! \nWhile Paul Battista is an entertainment lawyer, he's a little bit of a different beast because he's also a filmmaker that has written, produced and directed 2002's Crooks, which was released by Warner Home Video. As such, the filmmaker inside him allows him to speak more naturally to other filmmakers and does a good job of keeping the lawyer tendencies toward &quot;legalese&quot; in check-most of the time. \nBattista does a really great job with making really complicated concepts understandable. From why a casting director is important to what you need to realize about different types of distribution, the author really helps keep you in the midst of this book. \nThere's no question this is a reusable book, as you're not going to be able to retain all of the information in this book on a single read through. With that said, it's a book that you would be well advised to read while you're in pre-production on your film, because there are a number of things you should really be considering from the outset","torrent":{"xt":"urn:btih:51081a00531123b088be2407fe27da21398e8dec","amp;dn":"Independent+Film+Producing%3A+How+to+Produce+a+Low-Budget+Feature+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51081a00531123b088be2407fe27da21398e8dec","infoHashBuffer":{"type":"Buffer","data":[81,8,26,0,83,17,35,176,136,190,36,7,254,39,218,33,57,142,141,236]},"announce":[],"urlList":[]}}