{"title":"Viruses and the Lung [PDF] [StormRG]","uid":10655142,"size":23171709,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5137797df681ce091f43eca250565186976bc719&amp;dn=Viruses+and+the+Lung+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"0xmovva","files":-1,"time":1406660293,"description":"Author: Armando E. Fraire, Bruce A. Woda, Raymond M. Welsh, R L. Kradin\nHardcover: 243 pages\nPublisher: Springer; 2014 edition (February 7, 2014)\nLanguage: English\nISBN-10: 3642406041\nISBN-13: 978-3642406041\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nViruses that primarily target the lung are very significant causes of death and in the past decade have been responsible for major outbreaks of severe adult respiratory distress syndrome and H1N1 influenza. This book is distinctive in that the entire spectrum of viral disease of the lung is conveniently compiled within a single volume. The epidemiologic, ultrastructural, immunologic, and clinicopathologic features of well-known viral pathogens and newer emergent infectious agents are discussed in detail. After sections on lung defenses and the taxonomic classification of pneumotropic viruses, the various acute viral infections are considered in a standard format in the main body of the book. Subsequent sections are devoted to the human immunodeficiency virus, viral disease in the neonate and infant, viral infections in the setting of transplantation, and viral-linked tumoral and nontumoral lung conditions. The text is supplemented by numerous color images.","torrent":{"xt":"urn:btih:5137797df681ce091f43eca250565186976bc719","amp;dn":"Viruses+and+the+Lung+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5137797df681ce091f43eca250565186976bc719","infoHashBuffer":{"type":"Buffer","data":[81,55,121,125,246,129,206,9,31,67,236,162,80,86,81,134,151,107,199,25]},"announce":[],"urlList":[]}}