{"title":"Russian Folk Art (Art Ebook).pdf","uid":12257104,"size":38149998,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:516d6d3125988ce2c1b162551c4ba2c8d98d9957&amp;dn=Russian+Folk+Art+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":1,"time":1440110392,"description":"Russian Folk Art\nIndiana University Press | 1995 | ISBN 0253327539 | Eng | 408 pages | PDF | 36.4 MB\n\n&quot;Russian Folk Art&quot; describes the traditions, styles, and functions of a broad range of objects made by Russian peasant artists and artisans. Beginning with the settings in which folk artists traditionally worked - the peasant household, the village, and the local market - Alison Hilton describes the principal media they employed (wood, textiles, birch bark and bone, metal, and ceramics) and the items they produced: kitchen utensils such as bowls, goblets, dippers, and molds; tools used in making clothing; lace, embroidered linens, costumes, and everyday clothing; toys; elaborate window frames and house decorations; and colorful broadsides called lubki. The book emphasizes the cumulative originality of Russian folk art, the balance between time-honored forms and techniques, and the creativity of individual artists. It shows how images and designs evolved from ancient Slavic sources, absorbed elements of church, court, and urban arts, reflected historical events and daily life, and helped to form a Russian esthetic identity in the nineteenth and twentieth centuries. Finally, it examines the complex interaction between folk art and high culture: the role of serf artists, the preservation and reinterpretation of folk art by scholars and professional artists, and the new roles of folk art in the Soviet era. Abundantly illustrated with examples from Russian museums, &quot;Russian Folk Art&quot; is a treasure for anyone interested in Russian culture","torrent":{"xt":"urn:btih:516d6d3125988ce2c1b162551c4ba2c8d98d9957","amp;dn":"Russian+Folk+Art+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"516d6d3125988ce2c1b162551c4ba2c8d98d9957","infoHashBuffer":{"type":"Buffer","data":[81,109,109,49,37,152,140,226,193,177,98,85,28,75,162,200,217,141,153,87]},"announce":[],"urlList":[]}}