{"title":"Literacy Across The Curriculum Pocketbook [PDF] [StormRG]","uid":11256741,"size":3302480,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5187d7b57c83382fe6bf7c4da6bd0db2fb9f60a9&amp;dn=Literacy+Across+The+Curriculum+Pocketbook+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"krystine","files":-1,"time":1413909169,"description":"Literacy Across the Curriculum (Pocketbook)\nAuthor: Caroline Bentley-Davies\nPublished: 2012\nPublisher: Management Pocketbooks\nISBN: 9781906610487\nFormat: Retail PDF\n\nPM IF YOU NEED HELP WITH THE TORRENT :)\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! \n\n\nLiteracy Across the Curriculum (LAC) is high on the agenda in schools today. The Ofsted framework for inspection is littered with references to literacy, and the new teaching standards require that all teachers 'take responsibility for promoting high standards of literacy and correct use of standard English, whatever the teacher's specialism'. This cartoon-illustrated and highly practical Pocketbook is aimed at teachers across all disciplines. It is based on a few key principles: literacy is important for all learning; we owe it to our pupils to help them develop their literacy; developing strategies for LAC enhances teaching and learning across the school; teachers do not have to be literacy experts to promote LAC. Author Caroline Bentley-Davies engages her audience through a series of punchy chapters including: Speaking for Success; Write Better!; Vamp Up Your Vocab; Splendid Spelling Strategies and Raring to Read. As well as providing essential knowledge and theory, they contain case studies, examples and practical ideas for lessons. Towards the end of the book a literacy checklist allows schools and individuals to audit their literacy provision. Suggestions for a cross-curricular working party and literacy beyond the classroom are included. Caroline has been a middle leader in three schools, a Local Authority Education Adviser and an educational consultant in the UK and overseas. She has run demonstration lessons in over 80 schools and conducts training sessions for teachers across a range of subject areas. She has written several books including the best-selling Outstanding Lessons Pocketbook","torrent":{"xt":"urn:btih:5187d7b57c83382fe6bf7c4da6bd0db2fb9f60a9","amp;dn":"Literacy+Across+The+Curriculum+Pocketbook+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5187d7b57c83382fe6bf7c4da6bd0db2fb9f60a9","infoHashBuffer":{"type":"Buffer","data":[81,135,215,181,124,131,56,47,230,191,124,77,166,189,13,178,251,159,96,169]},"announce":[],"urlList":[]}}