{"title":"Phineas Newborn, Jr - 13 albums FLAC","uid":10823581,"size":3791762978,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:51d8ce8e2ca1f092aa74ebef46cf29752b18ef21&amp;dn=Phineas+Newborn%2C+Jr+-+13+albums+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"eika256","files":-1,"time":1408560464,"description":"Phineas Newborn, Jr - 13 albums FLAC\nRed book standard + one vinyl rip.\n\nOne of the most technically skilled and brilliant pianists in jazz during his prime, Phineas Newborn remains a bit of a mystery. Plagued by mental and physical problems of unknown origin, Newborn faded from the scene in the mid-'60s, only to re-emerge at irregular intervals throughout his life. Newborn could be compared to Oscar Peterson in that his bop-based style was largely unclassifiable, his technique was phenomenal, and he was very capable of enthralling an audience playing a full song with just his left hand.\nHe started out working in Memphis R&amp;B bands with his brother, guitarist Calvin Newborn, and recorded with local players including B.B. King in the early '50s. Brief stints with Lionel Hampton and Willis Jackson preceded a period in the military (1952-1954). After moving to New York in 1956, Newborn astounded fans and critics alike. Although he worked briefly with Charles Mingus (1958) and Roy Haynes, Newborn usually performed at the head of a trio or quartet. His early recordings for Atlantic (1956), Victor, Roulette, and Contemporary are quite outstanding. Unfortunately, after the mid-'60s, Newborn's profile dropped sharply, and although there were further recordings for Contemporary (1969), Atlantic (1969), Pablo (1976) and the Japanese Philips (1977) label, and although he still sounded strong when appearing in public, the pianist was in danger of being forgotten by most of the jazz world during his last decade. Spending most of his time in Memphis, he was an inspiration to many younger pianists including James Williams, Harold Mabern, Mulgrew Miller, Donald Brown, and Geoff Keezer, who after Newborn's death would dedicate their work as the Contemporary Piano Ensemble to him. Fortunately, the episode of Jazz Scene USA that features Phineas Newborn in 1962 has been made available on a video by &quot;Shanachie.&quot; (AllMusic)\n\nAlbum list:\n1956 - Phineas' Rainbow (1998)\n1957 - While My Lady Sleeps (2001)\n1958 - Fabulous Phineas (1995)\n1962 - A World of Piano (1991)\n1963 - The Great Jazz Piano of (1989)\n1963 - The Great Jazz Piano Of (vinyl 24 96)\n1964 - The Newborn Touch (1993)\n1969 - Harlem Blues (1999)\n1969 - Please Send Me Someone to Love (1997)\n1974 - Solo Piano\n1976 - Back Home (1998)\n1976 - Look Out - Phineas Is Back! (1995)\n1986 - C Jam Blues\n1999 - Here Is Phineas\n\nEnjoy and share!","torrent":{"xt":"urn:btih:51d8ce8e2ca1f092aa74ebef46cf29752b18ef21","amp;dn":"Phineas+Newborn%2C+Jr+-+13+albums+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51d8ce8e2ca1f092aa74ebef46cf29752b18ef21","infoHashBuffer":{"type":"Buffer","data":[81,216,206,142,44,161,240,146,170,116,235,239,70,207,41,117,43,24,239,33]},"announce":[],"urlList":[]}}