{"title":"Strokes of Genius 2 (ePUB,Retail){32Skulls}","uid":11095664,"size":16788288,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51e171c6be4d6b52c45d3511b4358660234d6918&amp;dn=Strokes+of+Genius+2+%28ePUB%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"32Skulls","files":-1,"time":1411591451,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\n\nCelebrate the beauty, diversity and expression of drawing with this second collection in the Strokes of Genius series - 140 examples of the finest drawing being done today. Fresh from the studios and sketchpads of 100 artists, these striking creations run the gamut from highly detailed, remarkably realistic images that were months in the making, to contour drawings, journal sketches and gestures captured in mere minutes. Selections feature original approaches to landscapes, portraits and other classic subjects, along with offbeat inspirations like vintage photos and washed-off watercolor paintings.\nIn these pages you'll find:\n\nA vast range of mediums and combinations, including charcoal, pencil, pastel, ink and more\n\nAn exciting mix of styles and techniques presented in subject-specific chapters: Portraits, Cityscapes, \n\nAnimals, the Human Figure, Landscapes and Still Life\n\nFirsthand perspective on the processes behind the work, offering expert insights on capturing atmosphere, telling a story, finding the right pose, achieving vitality of line, and much more\n\nWith a special focus on the power of light and shadow, this work has an immediacy that is honest and engaging. Filled with strokes of poetry, precision and passion, this is a memorable collection of art as well as an inspiring survey of techniques that artists use to translate impressions to paper.\n\n\nBy Rachel Rubin Wolf\nPublished by North Light Books in 2009\nEPUB, Retail, 78 pages, English ","torrent":{"xt":"urn:btih:51e171c6be4d6b52c45d3511b4358660234d6918","amp;dn":"Strokes+of+Genius+2+%28ePUB%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51e171c6be4d6b52c45d3511b4358660234d6918","infoHashBuffer":{"type":"Buffer","data":[81,225,113,198,190,77,107,82,196,93,53,17,180,53,134,96,35,77,105,24]},"announce":[],"urlList":[]}}