{"title":"Gaja Grzegorzewska - Kamienna Noc [[PL]","uid":15124643,"size":791398732,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:520ea3816d1994e867b96f2eae9a9114cecda3dc&amp;dn=Gaja+Grzegorzewska+-+Kamienna+Noc+%5B%5BPL%5D+MP3%40128&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"everdarksoul","files":52,"time":1467102453,"description":"Audiobook PL - 50 części /   \r\nrozmiar: 754 MB / czas: 13:42:24\r\nczyta: Zespół Lektorów:\r\n- Magdalena Cielecka\r\n- Afrodyta Weselak\r\n- Maciej Kowalik\r\n\r\nTa opowieść zaczyna się od winy i ucieczki przed karą.\r\nDwoje wyrzutków przemierza Europę. Nowe tożsamości, fałszywe paszporty, kolejne maski dobierane wraz ze zmieniającymi się współrzędnymi geograficznymi. Ich codzienność to przemoc, ciągłe zagrożenie, wyrzuty sumienia, namiętność, która rodzi ból oraz strach - zwłaszcza przed tym, czego nie widać...\r\nAle ich wspólna podróż ma też bardziej prozaiczną twarz: codzienna nauka bycia razem, budowanie zaufania i próba nieobwiniania się nawzajem za wspólny upadek. Oto cena miłości zakazanej...\r\n\r\nTo, że Julia Dobrowolska zniknęła z Krakowa, nie zdziwiło nikogo. Kobieta została skompromitowana po tym, jak jeden z tabloidów ujawnił kulisy jej romansu. Pikanterii całej sprawie dodaje fakt, że właśnie powstaje książka, której główną bohaterką ma być Dobrowolska, a autorką publikacji Eliza Florek - dziennikarka, która niegdyś ujawniła jej wielką tajemnicę. Policja liczy, że Florek doprowadzi ich do Dobrowolskiej, która podobno wróciła na stare śmieci, by dokończyć sprawę Marii Karo - matki zamordowanej i zgwałconej dziewczynki. To zlecenie jest dla Julii szczególnie ważne…\r\n\r\nKamienna Noc to książka, którą mógłby zekranizować Quentin Tarantino; jej fragmenty mogłaby wyśpiewać Amy Winehouse, ale napisać mogła ją jedynie Gaja Grzegorzewska. Żonglując popowymi motywami, grając konwencją literatury gatunkowej oraz igrając ze znaną jej czytelnikom tematyką tabu, Gaja wyrasta na być może najciekawszą reprezentantkę tzw. literatury środka. Wnikliwa obserwatorka, kąśliwa komentatorka, odważna konstruktorka mostu pomiędzy literaturą gatunkową a literaturą głównego nurtu. Czytelnicza jazda bez trzymanki.\r\nKamienna Noc to 6 z kolei powieść z cyklu o Julii Dobrowolskiej.\r\n\r\ncykl: Julia Dobrowolska:\r\n\r\n01 - Żniwiarz\r\n02 - Noc Z Czwartku Na Niedzielę\r\n03 - Topielica\r\n04 - Grób\r\n05 - Betonowy Pałac\r\n06 - Kamienna Noc","torrent":{"xt":"urn:btih:520ea3816d1994e867b96f2eae9a9114cecda3dc","amp;dn":"Gaja+Grzegorzewska+-+Kamienna+Noc+%5B%5BPL%5D+MP3%40128","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"520ea3816d1994e867b96f2eae9a9114cecda3dc","infoHashBuffer":{"type":"Buffer","data":[82,14,163,129,109,25,148,232,103,185,111,46,174,154,145,20,206,205,163,220]},"announce":[],"urlList":[]}}