{"title":"Dishonored.Update.2.and.Dunwall.City.Trials.DLC-RELOADED","uid":7914861,"size":1313769890,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:521879a2125db1e7e6d5c6d8c8b2d6e40f8f184b&amp;dn=Dishonored.Update.2.and.Dunwall.City.Trials.DLC-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"thenoobish","files":291,"time":1355352626,"description":"nERv\n\nDishonored Update 2 and Dunwall City Trials (c) Bethesda Softworks\n\n12/2012 :..... RELEASE.DATE .. PROTECTION .......: Steam\nDISC(S) .. GAME.TYPE ........: Action, Adventure\n\nEnter the world of the Outsider in Dishonored: Dunwall City Trials, the\nfirst add-on pack for the critically-acclaimed first-person action game by\nArkane Studios. Your combat, stealth and mobility skills will be put to the\ntest as you make your way through 10 distinct maps that feature a variety of\nchallenges. Creatively combine your supernatural abilities, weapons and\ngadgets to eliminate as many targets as possible, fight off waves of\ntallboys, guards, weepers and thugs, or take out targets in a non-stop run\nof drop assassinations. Dunwall City Trials also features a new set of\nachievements and trophies as well as a global online leaderboard.\nKey Features:\n* Ten Unique Challenges\n* Experience Dishonored's flexible combat system, stealth gameplay, and\ndistinct settings in a whole new way as you make your way through timed\nand scored challenges in Dunwall City Trials. Put your assassination\nskills to the test as you combine your supernatural powers and gadgets to\neliminate your enemies and collect clues to identify and dispatch your\ntarget. Try your hand in non-lethal challenges as you shoot down whale oil\ntanks raining from the sky or infiltrate a mansion to collect the loot\nunseen by your foes.\n* Global Online Leaderboard\n* Your high scores and rank for each trial will be recorded and displayed\nin a global online leaderboard. Every point and every second counts when\ngoing up against the best of the best.\n* New Achievements and Unlockable Gallery\n* In addition to a brand new set of achievements and trophies, an image\ngallery filled with original concept art and other surprises can be\nunlocked as you complete each trial and meet each of its various\nobjectives.\n\n1. Unrar and copy files into your &lt;install&gt; dir, overwriting existing files.\n2. Play the game.\n3. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:521879a2125db1e7e6d5c6d8c8b2d6e40f8f184b","amp;dn":"Dishonored.Update.2.and.Dunwall.City.Trials.DLC-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"521879a2125db1e7e6d5c6d8c8b2d6e40f8f184b","infoHashBuffer":{"type":"Buffer","data":[82,24,121,162,18,93,177,231,230,213,198,216,200,178,214,228,15,143,24,75]},"announce":[],"urlList":[]}}