{"title":"Whiskeytown - Strangers Almanac [1997] [EAC/FLAC]","uid":11673172,"size":351086511,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5267508528c8d24d14b55b399e0f90f4b746cf41&amp;dn=Whiskeytown+-+Strangers+Almanac+%5B1997%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":17,"time":1422741360,"description":"\n\n\nWhiskeytown - Strangers Almanac [1997] [EAC/FLAC]\n\n\n[img]http://i.imgur.com/47sMVIw.gif[/img]\n\n\n[b]Â» FLAC / Lossless / Log (100%) / Cue\n[color=Red]Label/Cat#:[/color]  Out Post #AAOPRD30005\n[color=Red]Country:[/color] USA\n[color=Red]Year:[/color]   November 4, 1997\n[color=Red]Genre:[/color] Americana\n[color=Red]Format:[/color] CD\n[/b]\n\n[img]http://i.imgur.com/lNi7gDK.png[/img]\n\n[b][color=Blue]\n\t\n\n\n01 Inn Town\n02 Excuse Me While I Break My Own Heart Tonight\n03 Yesterday's News\n04 16 Days\n05 Everything I Do\n06 Houses on the Hill\n07 Turn Around\n08 Dancing with the Women at the Bar\n09 Waiting to Derail\n10 Avenues\n11 Losering\n12 Somebody Remembers the Rose\n13 Not Home Anymore\n\n\n\n\n[/color][/b]\n\n[b][color=Green]\n\n1997's Strangers Almanac was Whiskeytown's major-label debut and the album that first introduced Ryan Adams to a wide audience, but at the same time it marked the beginning of the end for the group. When Whiskeytown went into the studio to record Strangers Almanac, the band had undergone the first of what would become a long line of personnel shakeups, and in addition to Adams, the only proper members of the group on hand for the sessions were violinist and vocalist Caitlin Cary and guitarist Phil Wandscher; session musicians filled out the lineup, while the new rhythm section, Jeff Rice (bass) and Steve Terry (drums), was hired only two weeks before recording began. Despite its chaotic creation, Strangers Almanac sounds stronger and more cohesive than its ragged but forceful indie predecessor, Faithless Street, and there's a deeper resonance in Adams' tales of wasted nights and wasted lives, such as &quot;Inn Town,&quot; &quot;Losering,&quot; and &quot;Dancing with the Women at the Bar.&quot; Strangers Almanac doesn't rock as hard as Whiskeytown's earlier material, but when the guitars kick into high gear on &quot;Yesterday's News&quot; and &quot;Waiting to Derail,&quot; it reveals just how good a match Adams and Wandscher were, and &quot;Excuse Me While I Break My Own Heart Tonight&quot; and &quot;16 Days&quot; are as strong and moving as their country gestures got. However, though Strangers Almanac starts strong, most of the best material is used up by the two-thirds mark, and editing one or two tunes from the final innings would have done this album a world of good. Regardless of its faults, Strangers Almanac captures Whiskeytown when they still had some business calling themselves a band rather than just Ryan Adams' backing musicians, and the glorious world-weariness of its best moments makes it a far more satisfying listen than most of what would follow once Adams struck out on his own.\n\n\n\n[/color][/b]","torrent":{"xt":"urn:btih:5267508528c8d24d14b55b399e0f90f4b746cf41","amp;dn":"Whiskeytown+-+Strangers+Almanac+%5B1997%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5267508528c8d24d14b55b399e0f90f4b746cf41","infoHashBuffer":{"type":"Buffer","data":[82,103,80,133,40,200,210,77,20,181,91,57,158,15,144,244,183,70,207,65]},"announce":[],"urlList":[]}}