{"title":"Developing Microservices with Node.js - David Gonzalez","uid":14550126,"size":5867126,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52683d75f6b0db588427432e583a73ed35bb82f8&amp;dn=Developing+Microservices+with+Node.js+-+David+Gonzalez&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1462641657,"description":"Key Features\r\n\r\nReal world example explained chapter after chapter with code examples.\r\nUseful concepts for other languages like Java or PHP\r\nEasy to follow by people with little to none experience in Node.js\r\nNode.js Version 0.12.2 and the latest compatible versions of Seneca and PM2\r\nBook Description\r\n\r\nMicroservices architecture is a style of software architecture. As the name suggests, microservicess refers to small services. For a large implementation, this means breaking the system into really small, independent services. Alternative to monolithic architecture (where the entire system is considered as a single big, interwoven segment), microservices approach is getting more and more popular with large, complex applications that have a very long lifecycle, which require changes at regular intervals. Microservices approach allows this type of changes with ease as only a part of the system undergoes changes and change control is easy.\r\n\r\nAn example of such large system can be an online store―includes user interface, managing product catalog, processing orders, managing customer's account. In a microservices architecture each of these tasks will be divided and into smaller services. Also, these services will be further broken down into independent services―for user interface, there will be separate services for input, output, search bar management, and so on. Similarly, all other tasks can be divided in very small and simple services.\r\n\r\nWhat you will learn\r\n\r\nIdentify where the microservice oriented architectures can tackle the most common problems in the software used by the big organisations.\r\nRe-architecture an existing monolithic system into a microservices oriented software.\r\nBuild robust and scalable microservices using Seneca and Node.js.\r\nTesting of the microservices in insolation in order to create a solid system.\r\nDeploy and manage microservices using PM2\r\nMonitoring the health of a microservice (CPU, memory, I/O...) and how the degradation of the performance in one microservice could degrade the performance of full system","torrent":{"xt":"urn:btih:52683d75f6b0db588427432e583a73ed35bb82f8","amp;dn":"Developing+Microservices+with+Node.js+-+David+Gonzalez","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52683d75f6b0db588427432e583a73ed35bb82f8","infoHashBuffer":{"type":"Buffer","data":[82,104,61,117,246,176,219,88,132,39,67,46,88,58,115,237,53,187,130,248]},"announce":[],"urlList":[]}}