{"title":"[Jazz] Stacey Kent - Close Your Eyes","uid":3553940,"size":59480755,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:527732e0a3833bac1fbcfceea5a1f7d8598249f7&amp;dn=%5BJazz%5D+Stacey+Kent+-+Close+Your+Eyes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"xenu dot net","files":11,"time":1163029391,"description":"An American language student visits Europe to study French, Italian and German for a Masters degree in comparative literature. Her life takes an unexpected twist that sees Stacey Kent become one of the world\\&amp;#039;s foremost jazz singers.\n\nStacey now boasts six best-selling albums, a string of awards, including the 2001 British Jazz Award and 2002 BBC Jazz Award for \\&amp;#039;Best Vocalist,\\&amp;#039; and the 2004 Backstage Bistro Award, a fan base that enables her to sell out concert halls around the world, as well as a voice on BBC Radio 3, as presenter of Jazz Legends.\n\nThe twist of fate that took her life in this new direction was a chance meeting in Oxford with saxophonist, Jim Tomlinson. Like Stacey, Jim was embarked on an academic path, but their meeting sparked in each other the desire to pursue their love of music together.\n\nAfter a year\\&amp;#039;s study at the Guildhall School of Music, Stacey set about honing her skills on the London jazz scene in the company of, now husband, Jim Tomlinson.\n\nA demo tape, sent simultaneously to Polygram, Candid Records and broadcaster, Humphrey Lyttelton, secured her a role in Ian McKellen\\&amp;#039;s film version of Richard III, a recording contract and national airplay and endorsement from Britain\\&amp;#039;s most respected jazz broadcaster.\n\nSince the release of Stacey\\&amp;#039;s first album, Close Your Eyes (1997), she has achieved, without compromise, both critical and popular success, with her fresh and heart-felt interpretations of the finest love songs of the twentieth century.\n\n\nKids, always remember Xenu is your friend. \nwww.xenu.net\n","torrent":{"xt":"urn:btih:527732e0a3833bac1fbcfceea5a1f7d8598249f7","amp;dn":"%5BJazz%5D+Stacey+Kent+-+Close+Your+Eyes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"527732e0a3833bac1fbcfceea5a1f7d8598249f7","infoHashBuffer":{"type":"Buffer","data":[82,119,50,224,163,131,59,172,31,188,252,238,165,161,247,216,89,130,73,247]},"announce":[],"urlList":[]}}