{"title":"Cardiac CT Made Easy, 2E [PDF] [StormRG]","uid":10080918,"size":17237323,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5309d21cedb0fc803525392f3db5a5b14de4b342&amp;dn=Cardiac+CT+Made+Easy%2C+2E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"0xmovva","files":3,"time":1399000920,"description":"Author: Paul Schoenhagen , Carl J. Schultz , Sandra S. Halliburton\nPaperback: 390 pages\nPublisher: CRC Press; 2 edition (April 15, 2014)\nLanguage: English\nISBN-10: 1482214210\nISBN-13: 978-1482214215\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\n\nObtaining and interpreting images of the heart is critical to the successful management of any cardiac disorders. Several imaging modalities are used to help cardiologists correctly diagnose these disorders and initiate the most appropriate form of treatment.\n\nSince the first publication of this book, the use of cardiovascular CT imaging has increased exponentially. Revised and updated, Cardiac CT Made Easy: An Introduction to Cardiovascular Multidetector Computed Tomography, Second Edition* captures these advances in CT scanner technology and clinical experience. For the first time, this new edition includes online access to imaging video clips.\n\nCombining the expertise of leading cardiovascular imaging groups in North America, Europe, and Asia, this second edition continues to serve as a comprehensive introduction to the field. It focuses on the principles of multidetector computed tomography (MDCT) for cardiovascular applications, practical aspects of scan acquisition and interpretation, clinical indications and imaging protocols, and clinical findings of common cardiovascular disease conditions. The book is an essential resource for those new to the field and a trustworthy reference for those needing answers to specific questions or looking to update their knowledge.","torrent":{"xt":"urn:btih:5309d21cedb0fc803525392f3db5a5b14de4b342","amp;dn":"Cardiac+CT+Made+Easy%2C+2E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5309d21cedb0fc803525392f3db5a5b14de4b342","infoHashBuffer":{"type":"Buffer","data":[83,9,210,28,237,176,252,128,53,37,57,47,61,181,165,177,77,228,179,66]},"announce":[],"urlList":[]}}