{"title":"Far.And.Away[Eng]Dvdrip.Dino.avi","uid":3804284,"size":786085888,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:530a4cb33c6bf5be820f4e7b7e36f60a8e63f1fd&amp;dn=Far.And.Away%5BEng%5DDvdrip.Dino.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"66dino66","files":1,"time":1189608208,"description":"Joseph Donnelly, a young Irishman facing property eviction after his father&amp;#039;s death, decides to take revenge on Daniel Christie, his landlord. Instead of killing Christie, however, he is injured and sentenced to a duel with Christie&amp;#039;s arrogant manager, Stephen Chase. Meanwhile, Shannon, Daniel&amp;#039;s daughter, is growing dissatisfied with the traditional views of her parents&amp;#039; generation and longs to be modern. She makes her plans to leave for America, and with her help, Joseph is able to escape. Upon arriving in Boston, Mass., they find jobs and begin saving money. Joseph becomes a local barehands boxer, while Shannon works in a chicken processing plant and then as a dancer at the social club. All goes well until Joseph loses a boxing match, after which their money is taken away. Joseph and Shannon are left to starve in the winter cold. Shannon&amp;#039;s parents, still in Ireland, face a devastating loss and decide to come to America to be with her. Chase, who joined them, has begun a campaign to find her, but his efforts are unnecessary Joseph brings Shannon to them after an accident. Joseph then heads west to work on the railroad. After many months, Joseph is confronted by his father in a dream, and is reminded of his desire to own his own land. Joseph decides to join the wagon trains and arrives in Oklahoma Territory just in time for the big land race, upon which his fate will lie. \n\nStarring:\n\nTom Cruise, Nicole Kidman,Thomas Gibson and Robert Prosky.\n\nEnjoy!\n\nPlease Seed!","torrent":{"xt":"urn:btih:530a4cb33c6bf5be820f4e7b7e36f60a8e63f1fd","amp;dn":"Far.And.Away%5BEng%5DDvdrip.Dino.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"530a4cb33c6bf5be820f4e7b7e36f60a8e63f1fd","infoHashBuffer":{"type":"Buffer","data":[83,10,76,179,60,107,245,190,130,15,78,123,126,54,246,10,142,99,241,253]},"announce":[],"urlList":[]}}