{"title":"The IDA Pro Book - 2ED - Chris Eagle - mobi &amp; epub","uid":7660198,"size":8122253,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:535e8be9a7e87dce02c6a65b8d9e44ac9ad4f64d&amp;dn=The+IDA+Pro+Book+-+2ED+-+Chris+Eagle+-+mobi+%26amp%3B+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Vanguard.","files":-1,"time":1348280398,"description":"The IDA Pro Book: The Unofficial Guide to the World's Most Popular Disassembler - 2nd Edition - Chris Eagle\n\nPrint ISBN-10: 1593272898\nPrint ISBN-13: 978-1593272890 \n\nPublication Date: June 15, 2011\n\n&quot;No source code? No problem. With IDA Pro, the interactive disassembler, you live in a source code-optional world. IDA can automatically analyze the millions of opcodes that make up an executable \n\nand present you with a disassembly. But at that point, your work is just beginning. With The IDA Pro Book, you'll learn how to turn that mountain of mnemonics into something you can actually use.\n\nHailed by the creator of IDA Pro as &quot;profound, comprehensive, and accurate,&quot; the second edition of The IDA Pro Book covers everything from the very first steps to advanced automation techniques. \n\nYou'll find complete coverage of IDA's new Qt-based user interface, as well as increased coverage of the IDA debugger, the Bochs debugger, and IDA scripting (especially using IDAPython). But because \n\nhumans are still smarter than computers, you'll even learn how to use IDA's latest interactive and scriptable interfaces to your advantage.\n\nSave time and effort as you learn to:\n\n    Navigate, comment, and modify disassembly\n    Identify known library routines, so you can focus your analysis on other areas of the code\n    Use code graphing to quickly make sense of cross references and function calls\n    Extend IDA to support new processors and filetypes using the SDK\n    Explore popular plug-ins that make writing IDA scripts easier, allow collaborative reverse engineering, and much more\n    Use IDA's built-in debugger to tackle hostile and obfuscated code\n\nWhether you're analyzing malware, conducting vulnerability research, or reverse engineering software, a mastery of IDA is crucial to your success. Take your skills to the next level with this 2nd \n\nedition of The IDA Pro Book.&quot;\n\nConverted from azw to mobi and epub using calibre.\n","torrent":{"xt":"urn:btih:535e8be9a7e87dce02c6a65b8d9e44ac9ad4f64d","amp;dn":"The+IDA+Pro+Book+-+2ED+-+Chris+Eagle+-+mobi+%26amp%3B+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"535e8be9a7e87dce02c6a65b8d9e44ac9ad4f64d","infoHashBuffer":{"type":"Buffer","data":[83,94,139,233,167,232,125,206,2,198,166,91,141,158,68,172,154,212,246,77]},"announce":[],"urlList":[]}}