{"title":"Anja Garbarek - Smiling &amp; Waving [2001] [EAC/FLAC]","uid":10580848,"size":204783671,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:547182d42527279a44646ada0951f9dab2043416&amp;dn=Anja+Garbarek+-+Smiling+%26amp%3B+Waving+%5B2001%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":-1,"time":1405680819,"description":"\nCreated by Ratio: 152.31dickthespic 2 minutes ago\nMusic : Jazz : Lossless\n \n\n\nFLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Virgin #CDVIR130\nCountry: UK\nYear: March 26, 2001\nGenre: electronic, jazz, pop\nFormat: CD\n\n\n\n[b]\n\n\n1.\tHer Room\t 2:26\n2.\tThe Gown\t3:21\n3.\tThe Context\t4:41\n4.\tStay Tuned\t4:16\n5.\tYou Know\t3:35\n6.\tBig Mouth\t3:19\n7.\tThe Diver\t3:59\n8.\tThat's All\t3:51\n9.\tAnd Then\t4:16\n10.\tIt Seems We Talk\t4:58\n\n\n\n\n\nAnja Garbarek's third album -- and her first for a major label -- is a departure from her previous efforts in that she's enlisted the help of musicians who understand how to blend her electronic textures with more organic instrumentation. The daughter of ECM jazz saxophone legend Jan Garbarek, Anja has moved far from the distorted soundscapes of her debut, the elegantly weird Balloon Mood from 1996. Here she employs the talents and tactics of musicians such as Mark Hollis (formerly of Talk Talk), Richard Barbieri and Steve Jansen from Japan and Rain Tree Crow, respectively, and the production savvy of Steve Wilson from Porcupine Tree. Her sound is all but impossible to describe, but there are moments where the wispy, almost invisible vocal style of Stina Nordenstam echoes in the mix, as the does the lyrical irony of Laurie Anderson, and the broken poetic phrasing of Bjork. But this is no comparison, as shades and specters of different music such as jazz, classical, rock, trip-hop, and even dub waft through this airy mix, through all of them appear as ghosts, musics that are what we remember them as, from some near future emptiness, rather than as current constructs from which to make music from. There is the notion of observance, Garbarek is always the outsider, witnessing small occurrences in everyday life and reading who knows what into them. There is a duet with Robert Wyatt, entitled &quot;The Diver,&quot; where besides a double bass -- present in every track -- there is little but a spare, lilting piano, some string, and an oboe. The pair's voices comment on witnessing the art of a diver's plunge. Their voices entwine and then separate, creating a view both from pool side and in Wyatt's case, distance. The up-beat trip-hop of &quot;That's All,&quot; where drum loops engage a chamber group with bass; a flute slips and slides along underneath the listener like a ball rolling under the couch, almost moving by you before it can be grasped: &quot;And he crawls to the door in a warm nurse/where he walks for the first time/surrounded by the dry clouds/he is leaving a trail/that's all we know.&quot; The next piece, the melancholy, &quot;And Then,&quot; with nothing but a bass, the London Session Orchestra, and harpist Helen Turnstall, is at once a song of absence and arrival: &quot;Unpack moments/the girl in the redcoat turns/passing. Entering. Going places/bring her name under the chain of lights/kneeling down/she throws herself into sound/passing. Entering. Going places...&quot; In the broken lyric and shimmering instrumental quality we hear an artist emerging from her influences into a music of her own creation, shedding the pop influences of her past; in the process she is unearthing a signature music which turns in on itself before slowly opening to the listener in mysterious and wonderful ways. Smiling &amp; Waving is an opaque, sensual gem.","torrent":{"xt":"urn:btih:547182d42527279a44646ada0951f9dab2043416","amp;dn":"Anja+Garbarek+-+Smiling+%26amp%3B+Waving+%5B2001%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"547182d42527279a44646ada0951f9dab2043416","infoHashBuffer":{"type":"Buffer","data":[84,113,130,212,37,39,39,154,68,100,106,218,9,81,249,218,178,4,52,22]},"announce":[],"urlList":[]}}