{"title":"The Earthsea Cycle- Ursula K. Le Guin (Epub, Mobi, Lit, Pdf)","uid":5943625,"size":11350482,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:54db8a3238986084b8c6ffa4ad55333f5e54d46a&amp;dn=The+Earthsea+Cycle-+Ursula+K.+Le+Guin+%28Epub%2C+Mobi%2C+Lit%2C+Pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"carb0nstealer","files":30,"time":1289270382,"description":"The Earthsea Cycle by Ursula K. Le Guin\n\n1. A Wizard of Earthsea \nGed is a peasant boy from Gont with a gift of magic.  He goes to the School of Wizards on Roke Island.  \nAttempting to prove his superiority with magic he recklessly brings forth a shadow being from the realm of the \ndead that he must confront. \n \n2. The Tombs of Atuan \nGed is encountered years later in an dark, underground labyrinth by the young High Priestess Arha, also called \nTenar.  She was taken from her family as a girl to become a priestess to the Nameless Ones.  Ged is a powerful \nwizard seeking the missing half of the Ring of Erreth-Akbe, on which is engraved the broken Rune of Peace.  \nShe makes him her prisoner, but sees that she is bound by meaningless ritual. \n \n3. The Farthest Shore \nGed is the older experienced Archmage of Roke investigating with young prince Arren of Enlad a mysterious \ndisappearing of magic.  Mages can no longer do spells.  They adventure far to the south, and are led to the \ndragons' islands in the west.  Ged closes the wound in the world, but it takes all his power to do so. \n Magic on Earthsea uses the power of true names.  There is a balance between light and dark, male and female, \nand life and death.\n\n4. Tehanu \nYears after the first three Earthsea books were published, Le Guin wrote a fourth Earthsea book, Tehanu: The \nLast Book of Earthsea.  It takes place immediately after events in The Farthest Shore, and features Tenar of the \nTombs, her adopted daughter Therru, and Ged.  Tehanu revisits and redefines society depicted in the previous \nEarthsea books. \n \n5.The Other Wind \nA new Earthsea cycle novel first published in 2001.  The Other Wind involves mending the boundary between \nthe living and the dead.  A humble sorcerer, Alder, makes a journey.  Ged, Tenar, and Tehanu are re-\nencountered.  There's a confrontation with dragons.\n\nTales from Earthsea \nAn Earthsea story collection first published in 2001.  Contains five stories, including &quot;Dragonfly&quot;, first \npublished in the anthology Legends (1998), which is the story of Dragonfly, also called Irian of Way, a girl with \nan unknown gift of power who travels to the School for Wizards on Roke to learn. \n \nIncludes an unofficial guide to Earthsea.\nTo Light a Candle by Rizwan Virk.\n\nEnjoy =]","torrent":{"xt":"urn:btih:54db8a3238986084b8c6ffa4ad55333f5e54d46a","amp;dn":"The+Earthsea+Cycle-+Ursula+K.+Le+Guin+%28Epub%2C+Mobi%2C+Lit%2C+Pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54db8a3238986084b8c6ffa4ad55333f5e54d46a","infoHashBuffer":{"type":"Buffer","data":[84,219,138,50,56,152,96,132,184,198,255,164,173,85,51,63,94,84,212,106]},"announce":[],"urlList":[]}}