{"title":"Mediterranean Grilling More Than 100 Recipes from Across the Med","uid":6611359,"size":4507242,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:55018f43879aef6fe98faee396b938490fa9fb65&amp;dn=Mediterranean+Grilling+More+Than+100+Recipes+from+Across+the+Med&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"lionzbay","files":1,"time":1313603747,"description":"\nAuthor(s): Diane Kochilas\nPublisher: William Morrow Cookbooks\nDate: 2007-05-29\nFormat: pdf\nLanguage: English\nISBN10: 0060556390\nPages: 208\nISBN13: 9780060556396\n\nProduct Description:\n\nMediterranean Grilling presents a collection of classic and new recipes for flame-kissed dishes from the regions surrounding the Mediterranean Sea, where the great grilling tradition dates back to ancient times, but the flavors are always fresh.  \n\nDiane Kochilas takes the familiar and much-loved cooking method of grilling and pairs it with the cuisines of the Mediterranean, introducing home cooks to a whole new world of flavors that can be created in their own backyards. From Turkish kebabs and Spanish-style grilled artichokes to French grillades and Greek vegetable kebabs, Mediterranean Grilling offers an irresistible array of contemporary and traditional grilled specialties.  \n\nEnjoy Grilled Tomato Soup with Spicy Yogurt, Greek Lamb Biftekia Stuffed with Spiced Feta, and Swordfish Souvlaki with Lemon-Olive Oil Marinade. Many dishes are simple and served right from the grill, while others are the basis for more complex soups, salads, and pastas. With recipes as varied as goat cheese appetizers and charred pita breads, fresh fish and marinated lamb, garden vegetables and juicy peaches drizzled with honey syrup, as well as dazzling full-color photographs, Mediterranean Grilling lets home cooks turn on the flame and turn up the flavor as never before. ","torrent":{"xt":"urn:btih:55018f43879aef6fe98faee396b938490fa9fb65","amp;dn":"Mediterranean+Grilling+More+Than+100+Recipes+from+Across+the+Med","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55018f43879aef6fe98faee396b938490fa9fb65","infoHashBuffer":{"type":"Buffer","data":[85,1,143,67,135,154,239,111,233,143,174,227,150,185,56,73,15,169,251,101]},"announce":[],"urlList":[]}}