{"title":"Poco - The Forgotten Trail (1969-74) (1990) (2 CDs)","uid":8686950,"size":892018596,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:554ac3ca249fb6a4621aed9588f9a3f87d3436b4&amp;dn=Poco+-+The+Forgotten+Trail+%281969-74%29+%281990%29+%282+CDs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"LochDhueDude","files":45,"time":1373823041,"description":"This is the same torrent that was uploaded to Demonoid in September 2011.\n\n\nPoco - The Forgotten Trail (1969-74) (1990) (2 CDs)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/61Ffa788WjL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/61Ffa788WjL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com) DVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by Bruce Eder):\n\nOne of the first and longest-lasting country-rock groups, Poco had their roots in the dying embers of Buffalo Springfield. After Neil Young and Stephen Stills, the co-founders of that group, exited in the spring of 1968, only guitarist/singer Richie Furay and bassist Jim Messina remained to complete the group's swan song, Last Time Around. The final Springfield track, &quot;Kind Woman,&quot; included only Furay and Messina, with a guest appearance on steel guitar by Rusty Young -- at the time, he was something of a rarity as a talented lap-steel guitarist who was comfortable working in a rock idiom, and had previously belonged to a folk-rock-turned-psychedelic band called Boenzee Cryque. Young stuck with Furay and Messina, in the process skipping a scheduled audition for a new group that ex-Byrds member Gram Parsons was putting together. Auditions followed before the fledgling group reached out, at Young's urging, to ex-Boenzee Cryque drummer/vocalist George Grantham, and also to bassist/singer Randy Meisner, who had previously played with a band called the Poor. This lineup rehearsed for four months before making their debut at the Troubadour in Los Angeles, in November of 1968. A month later, they made their first appearance at the Fillmore West on a bill with the Steve Miller Band and Sly &amp; the Family Stone.\n\nRead all of the bio at: &lt;a href=&quot; http://www.allmusic.com/artist/poco-p5156/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/poco-p5156/biography&lt;/a&gt;\n\nAll Music Album Review (by Jim Newsom):\n\nThis excellent two-disc collection captures Poco's finest moments from the days when they were laying down the template for all the country-rock music that was to follow. It's hard to remember, but when the Eagles first hit the scene, they were thought by many to be a Poco-wannabe band. Listen to this set and you'll hear why. The Forgotten Trail (1969-1974) culls tracks from Poco's first eight albums, as well as unreleased cuts and singles. From the classic anthem &quot;Pickin' Up the Pieces,&quot; which kicks things off, through &quot;You Better Think Twice,&quot; &quot;C'mon,&quot; &quot;Kind Woman,&quot; &quot;From the Inside,&quot; &quot;A Good Feelin' to Know,&quot; &quot;Crazy Eyes,&quot; and on and on, this is wonderful music, ahead of its time in many ways. If Poco had arrived on the scene in the early '90s, they would have been kings of the country charts. Of course, without Poco, country music wouldn't have taken on the rock trappings that it did in the '80s and '90s. As it was, the band was considered too country for the Top 40 rock format of the time, and too rock &amp; roll for country radio. This set is the place to start for an appreciation of the original Poco, when the group was considered to be Richie Furay's band. All the ingredients are here that made their music so delightful: the trademark high-vocal harmonies; Rusty Young's pedal steel guitar wizardry; Furay's patented juxtapositions of sad lyrics against bouncy, harmony-filled tunes; and their spirit of optimism and good feelings even in the face of hard luck and bad weather. The 36-page booklet does a fine job of telling the story in print, and the 38 songs speak volumes about the band's place and influence. Thanks to this compilation, Poco's trailblazing days need be forgotten no longer.\n\nTaken from: &lt;a href=&quot;\nhttp://www.allmusic.com/album/the-forgotten-trail-1969-1974-r15433/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/the-forgotten-trail-1969-1974-r15433/review&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B00000274H&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B00000274H&lt;/a&gt;\n\nTrack List:\n\nDisc 1:\n\n01. Pickin' Up The Pieces\n02. Grand Junction\n03. Consequently So Long\n04. First Love\n05. Calico Lady\n06. My Kind Of Love\n07. Hard Luck\n08. Last Call (Cold Enchilada #3)\n09. Honky Tonk Downstairs\n10. Hurry Up\n11. You Better Think Twice\n12. Anyway Bye Bye\n13. I Guess You Made It\n14. C'mon\n15. Hear That Music\n16. Kind Woman\n17. Just For Me And You\n18. Bad Weather\n19. You Better Think Twice\n20. Lullaby in September\n\nDisc 2:\n\n01. You Are The One\n02. From The Inside\n03. A Good Feelin' To Know\n04. I Can See Everything\n05. And Settlin' Down\n06. Blue Water\n07. Fool's Gold\n08. Nothin's Still The Same\n09. Skunk Creek\n10. Here We Go Again\n11. Crazy Eyes\n12. Get In The Wind\n13. Believe Me\n14. Rocky Mountain Breakdown\n15. Faith In The Families\n16. Western Waterloo\n17. Whatever Happened To Your Smile\n18. Sagebrush Serenade\n","torrent":{"xt":"urn:btih:554ac3ca249fb6a4621aed9588f9a3f87d3436b4","amp;dn":"Poco+-+The+Forgotten+Trail+%281969-74%29+%281990%29+%282+CDs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"554ac3ca249fb6a4621aed9588f9a3f87d3436b4","infoHashBuffer":{"type":"Buffer","data":[85,74,195,202,36,159,182,164,98,26,237,149,136,249,163,248,125,52,54,180]},"announce":[],"urlList":[]}}