{"title":"What We See When We Read","uid":10771040,"size":31369273,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5592c2ac4df8353d3945541064b05deb2d3bb538&amp;dn=What+We+See+When+We+Read&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1408074638,"description":"Peter Mendelsund, &quot;What We See When We Read&quot;\n\nISBN: 0804171637 | 2014 | EPUB | 448 pages | 30 MB\n\nA gorgeously unique, fully illustrated exploration into the phenomenology of reading--how we visualize images from reading works of literature, from one of our very best book jacket designers, himself a passionate reader.\n\nWhat do we see when we read? Did Tolstoy really describe Anna Karenina? Did Melville ever really tell us what, exactly, Ishmael looked like? The collection of fragmented images on a page--a graceful ear there, a stray curl, a hat positioned just so--and other clues and signifiers helps us to create an image of a character. But in fact our sense that we know a character intimately has little to do with our ability to concretely picture our beloved--or reviled--literary figures. In this remarkable work of nonfiction, Knopf's Associate Art Director Peter Mendelsund combines his profession, as an award-winning designer; his first career, as a classically trained pianist; and his first love, literature--he considers himself first and foremost as a reader--into what is sure to be one of the most provocative and unusual investigations into how we understand the act of reading.\n","torrent":{"xt":"urn:btih:5592c2ac4df8353d3945541064b05deb2d3bb538","amp;dn":"What+We+See+When+We+Read","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5592c2ac4df8353d3945541064b05deb2d3bb538","infoHashBuffer":{"type":"Buffer","data":[85,146,194,172,77,248,53,61,57,69,84,16,100,176,93,235,45,59,181,56]},"announce":[],"urlList":[]}}