{"title":"Encyclopedia of Endocrine Diseases","uid":15576740,"size":66226718,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:55eef7668bea1febdb25fe18fe1f94f00cf4e108&amp;dn=Encyclopedia+of+Endocrine+Diseases&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1471347826,"description":"Encyclopedia of Endocrine Diseases - Luciano Martini (Elsevier, 2004).pdf\r\n\r\nThe Encyclopedia of Endocrine Diseases is an authoritative reference developed by 16 international experts who recruited the world's top scientists for contributions. This stellar reference work focuses on nearly 500 endocrine diseases addressing everything from acromeglay, diabetes, hypertension, osteoporosis, thyroid disease, Von Hippel-Lindau Disease, unexplained weight loss, to androgen related disorders. This encyclopedia is an essential addition to any library collection written to be accessible for both the clinical and non-clinical reader. \r\n\r\nAssociate Editors include: Eli Y. Adashi, John P. Bilezikian, George P. Chrousos, Junichi Fukata, Julianne Imperato-McGinley, Hiroo Imura, Antonio Liuzzi, Frank L. Moore, Daniel Porte, Jens F. Rehfeld, Ellis Samols, Gustav Schonfeld, Pierre C. Sizonenko, Wilmar M. Wiersinga. \r\n\r\nAlso available online via ScienceDirect – featuring extensive browsing, searching, and internal cross-referencing between articles in the work, plus dynamic linking to journal articles and abstract databases, making navigation flexible and easy. For more information, pricing options and availability visit www.info.sciencedirect.com.\r\nIncludes nearly 500 entries addressing all aspects of endocrine diseases\r\nMore than 800 eminent researchers contributed from 25 different countries around the world\r\nMore than 900 figures and 450 tables displayed\r\nComprehensive glossary comprising 1500 definitions\r\nThe Editor-in-Chief is former editor of the journal Frontiers in Neuroendocrinology and has contributed to over 40 books in the field of endocrinology","torrent":{"xt":"urn:btih:55eef7668bea1febdb25fe18fe1f94f00cf4e108","amp;dn":"Encyclopedia+of+Endocrine+Diseases","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55eef7668bea1febdb25fe18fe1f94f00cf4e108","infoHashBuffer":{"type":"Buffer","data":[85,238,247,102,139,234,31,235,219,37,254,24,254,31,148,240,12,244,225,8]},"announce":[],"urlList":[]}}