{"title":"The Whore Next Door (Kylie Ireland) 2005 - AVN Top 500","uid":14619258,"size":1461219328,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:55f41816dfa88c5decba4713df0efa01df06c6a7&amp;dn=The+Whore+Next+Door+%28Kylie+Ireland%29+2005+-+AVN+Top+500&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"distinc","files":1,"time":1463247744,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=6087867431\r\n \nhttp://imagedisco.net/?g=4948216123\r\n\r\n\r\nPlot:\r\n\r\nSummary: The Whore Next Door was something a lot of people probably thought they'd never see; a gal like Kylie Ireland going literally &quot;all the way&quot; into gonzo. She may be twice the age of the current &quot;flavor of the month&quot; gals joining porn but only a fool would deny her sexual stamina, ability and determination to prove her critics wrong. For what it's worth, even a jaded old reviewer like myself found each scene enough to get me wanting some relief so I had to take a break more than a few times while watching this collection of scenes (although I'm a big fan of hers, I still think anyone would objectively see her passion, heat, and chemistry here). From beginning to end, The Whore Next Door was well worth a rating of Highly Recommended for all it had to offer. Fans of Kylie's like myself will probably consider this the holy grail of porn in some ways but I still hold out hope that she continues to make porn of all kinds and that this is just one more door she's opened to further her own sexual discovery (her parties are some of the most interesting in the porn world I'm told but maybe this will allow people to see her in yet another light). Whatever the case may be, Kylie Ireland seems to be on another path these days and I'll be watching to see what else she has in store for a demanding audience. The Whore Next Door had more fuck for the buck than a dozen of her earlier movies; making me wonder if this might become a series for all to enjoy.\r\n\r\nBody of Review: When one thinks of hot redheads in porn, there are really only a handful that come to mind from the last thirty years. One of the best in terms of her sexual energy, sheer charm, and talented sexual abilities has been the lovely Kylie Ireland; a gal who's name derived from the Australian pop star, Kylie Minogue, and the attractive model, Kathy Ireland. I've long found both of her role models extremely pleasing on the eyes but Kylie Ireland adds something special to the mix and I think anyone that's seen her in action knows exactly what I mean. These days, she directs for Platinum X Pictures, a company known to be on the cutting edge (some would say bleeding edge) of porn, offering tremendous value in their DVD releases. In the company's 128th release, The Whore Next Door, Kylie not only produces and directs, but stars in a series of ever increasingly heated hardcore gonzo scenes that forever alter this classy lady's image from the feature/couples market to the wacky world of circus act sex. As a fan of hers for over a decade, I was very uncomfortable at the prospect of seeing Kylie go to the extreme but I couldn't look away and in the end, I'm glad I didn't. If this intrigues you, read the following breakdown of the scenes by cast and action:\r\n\r\nDetailed Breakdown of Each Scene: Show\r\n\r\n\r\nKylie Ireland, Manuel Ferrara, Roxanne Hall, John Strong, Steve Holmes, Kurt Lockwood, Tee Reel, Tyler Knight, Van Damage, Kayla Marie, Katrina Kraven, Julie Night, Marcos Leon, Jason Horne, Venus","torrent":{"xt":"urn:btih:55f41816dfa88c5decba4713df0efa01df06c6a7","amp;dn":"The+Whore+Next+Door+%28Kylie+Ireland%29+2005+-+AVN+Top+500","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55f41816dfa88c5decba4713df0efa01df06c6a7","infoHashBuffer":{"type":"Buffer","data":[85,244,24,22,223,168,140,93,236,186,71,19,223,14,250,1,223,6,198,167]},"announce":[],"urlList":[]}}