{"title":"Cibola Burn: The Expanse , Book 4 - James S. A. Corey -Audiobook","uid":10462349,"size":617884335,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:560d36e323c5edfc9240682635be4b827c4eb43e&amp;dn=Cibola+Burn%3A+The+Expanse+%2C+Book+4+-+James+S.+A.+Corey+-Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1404147090,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Smart AudioBook Player or Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nCibola Burn: The Expanse, Book 4\n\nWritten by: James S. A. Corey\nNarrated by: Erik Davies\nLength: 21 hrs and 23 mins\nSeries: The Expanse, Book 4\nFormat: Unabridged\nRelease Date:06-17-14\nProgram Type: Audiobook\n\nEnter a new frontier.\n\nAn empty apartment, a missing family, that's creepy. But this is like finding a military base with no one on it. Fighters and tanks idling on the runway with no drivers. This is bad juju. Something wrong happened here. What you should do is tell everyone to leave.\n\nThe gates have opened the way to a thousand new worlds and the rush to colonize has begun. Settlers looking for a new life stream out from humanity's home planets. Ilus, the first human colony on this vast new frontier, is being born in blood and fire.\n\nIndependent settlers stand against the overwhelming power of a corporate colony ship with only their determination, courage, and the skills learned in the long wars of home. Innocent scientists are slaughtered as they try to survey a new and alien world. The struggle on Ilus threatens to spread all the way back to Earth.\n\nJames Holden and the crew of his one small ship are sent to make peace in the midst of war and sense in the midst of chaos. But the more he looks at it, the more Holden thinks the mission was meant to fail.\n\nAnd the whispers of a dead man remind him that the great galactic civilization that once stood on this land is gone. And that something killed it. ","torrent":{"xt":"urn:btih:560d36e323c5edfc9240682635be4b827c4eb43e","amp;dn":"Cibola+Burn%3A+The+Expanse+%2C+Book+4+-+James+S.+A.+Corey+-Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"560d36e323c5edfc9240682635be4b827c4eb43e","infoHashBuffer":{"type":"Buffer","data":[86,13,54,227,35,197,237,252,146,64,104,38,53,190,75,130,124,78,180,62]},"announce":[],"urlList":[]}}