{"title":"[Digital Tutors] Quick Start to Rigging in MODO (Vol.1) Video Tu","uid":11008100,"size":573145443,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:561cff2f225c7927c242a2996755e5226c44ca18&amp;dn=%5BDigital+Tutors%5D+Quick+Start+to+Rigging+in+MODO+%28Vol.1%29+Video+Tu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"xKTRx","files":14,"time":1410282810,"description":"[Digital Tutors] Quick Start to Rigging in MODO:(Vol.1) Video Tutorial-KTR\n==========================================================================\n\n(Start learning HOW TO RIG)\n\n\n\n\nPUBLISHER....: Digital Tutors\nLANGUAGE......: ENGLISH \nAUTHOR.......: Delano Athias\nLEVEL.........: BEGINNER\nRELEASE DATE..: 2014.09.09\nRUNTIME......: 1h 21m\nSOFTWARE.....: MODO 801\n\n\nAbout this course::\n\nWelcome to the Quick Start to Rigging in MODO. Quick Starts are a series of specially constructed tutorials meant to be followed in sequence and include valuable exercises to reinforce learned concepts.\n\nThe lesson format for these Quick Starts will be similar to other tutorials from Digital-Tutors. We'll go through MODO's Rigging Tools in a very methodical way, making sure to cover the tools and techniques that are most important in enabling you to get up and running quickly. Each volume of a Quick Start will build upon the previous volume, enabling us to progressively build up a complex project into a finished state. \n\nIn this initial volume, we'll cover the basics of getting started with MODO's setup process. We'll learn how to parent and freeze object transformations. We'll learn how create control objects. We'll also learn how create clean joint systems and to conclude the training, we'll explore MODO's Inverse Kinematics system and use IK effectors to control the legs of our model. \n\nWhile building a project together, you'll be provided with valuable knowledge, and the real power comes from being able to take the techniques you've learned and apply them in a different way to your own work. With this in mind, you'll be presented with an assignment immediately following each volume. These assignments will challenge you to take the skills that you've learned in a particular volume and apply them to a different asset. \n\nThese tutorials are designed to be taken in sequence so we really encourage you to start with this volume and proceed all the way through to Volume 3, all so you can take advantage of the periodic assignments along the way to get the full learning experience.\n\n\n\nTopics include:\n\n1.Introduction and project overview\n\n2.Parenting items and freezing transformations\n\n3.Parenting the rest of our model\n\n4.Creating control objects and modifying Pivots and Centers in MODO\n\n5.Designing a control to swivel the turret\n\n6.Adding a center-of-gravity control\n\n7.Building joints in MODO\n\n8.Finishing our joint systems for the turret's legs\n\n9.Connecting the model's legs to our joint chains\n\n10.Adding Inverse Kinematics to simulate the natural movements of a leg\n\n11.Creating leg controls\n\n12.Finishing our leg controls\n\n13.Adding a global control and finalizing our rig\n\n14.Volume 1 assignment","torrent":{"xt":"urn:btih:561cff2f225c7927c242a2996755e5226c44ca18","amp;dn":"%5BDigital+Tutors%5D+Quick+Start+to+Rigging+in+MODO+%28Vol.1%29+Video+Tu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"561cff2f225c7927c242a2996755e5226c44ca18","infoHashBuffer":{"type":"Buffer","data":[86,28,255,47,34,92,121,39,194,66,162,153,103,85,229,34,108,68,202,24]},"announce":[],"urlList":[]}}