{"title":"Electromagnetic, Mechanical, and Transport Properties of Composi","uid":10885975,"size":7256980,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5650c64570e6adfd28fcc820e6b0bec0feea9d2d&amp;dn=Electromagnetic%2C+Mechanical%2C+and+Transport+Properties+of+Composi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Sunghabib","files":-1,"time":1409075375,"description":"Book Description:\n\nIn the design, processing, and applications of composite materials, a thorough understanding of the physical properties is required. It is important to be able to predict the variations of these properties with the kind, shape, and concentration of filler materials. The currently available books on composite materials often emphasize mechanical properties and focus on classification, applications, and manufacturing. This limited coverage neglects areas that are important to new and emerging applications.\n\nFor the first time in a single source, this volume provides a systematic, comprehensive, and up-to-date exploration of the electromagnetic (electrical, dielectric, and magnetic), mechanical, thermal, and mass-transport properties of composite materials. The author begins with a brief discussion of the relevance of these properties for designing new materials to meet specific practical requirements. The book is then organized into five parts examining:\n\nThe electromagnetic properties of composite materials subjected to time-invariant electric and magnetic fields\n\nThe dynamic electromagnetic properties of composite materials subjected to time-varying electric and magnetic fields\n\nThe mechanical elastic and viscoelastic properties of composites\n\nHeat transfer in composites and thermal properties (thermal conductivity, thermal diffusivity, coefficient of thermal expansion, and thermal emissivity)\n\nMass transfer in composite membranes and composite materials\n\nThroughout the book, the analogy between various properties is emphasized. Electromagnetic, Mechanical, and Transport Properties of Composite Materials provides both an introduction to the subject for newcomers and sufficient in-depth coverage for those involved in research. Scientists, engineers, and students from a broad range of fields will find this book a comprehensive source of information.\n\nProduct Details:\n\nSeries: Surfactant Science\nPDF: 430 pages\nPublisher: CRC Press\nLanguage: English\nISBN-10: 1420089218\nISBN-13: 978-1420089219\n\n\n------------------------------------------------\nSeed - Share - Enjoy - Give me Thumbs Up\n------------------------------------------------","torrent":{"xt":"urn:btih:5650c64570e6adfd28fcc820e6b0bec0feea9d2d","amp;dn":"Electromagnetic%2C+Mechanical%2C+and+Transport+Properties+of+Composi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5650c64570e6adfd28fcc820e6b0bec0feea9d2d","infoHashBuffer":{"type":"Buffer","data":[86,80,198,69,112,230,173,253,40,252,200,32,230,176,190,192,254,234,157,45]},"announce":[],"urlList":[]}}