{"title":"A Brief History of Ancient Greece: Politics, Society, and Cultur","uid":11732305,"size":11211953,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:56874305e3f2e6548c75ea2b34a0b6b6f102635b&amp;dn=A+Brief+History+of+Ancient+Greece%3A+Politics%2C+Society%2C+and+Cultur&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425428780,"description":"The story of the ancient Greeks is one of the most improbable success stories in world history. A small people inhabiting a country poor in resources and divided into hundreds of quarreling states created one of the most remarkable civilizations of antiquity. Comprehensive and balanced, A Brief History of Ancient Greece: Politics, Society, and Culture, Second Edition, is a shorter version of the authors' highly successful Ancient Greece: A Political, Social, and Cultural History, Second Edition (OUP, 2007). Four leading authorities on the classical world offer a lively and up-to-date account of Greek civilization and history in all its complexity and variety, covering the entire period from the Bronze Age through the Hellenistic Era, and integrating the most recent research in archaeology, comparative anthropology, and social history. Using physical evidence from archaeology, the written testimony of literary texts and inscriptions, and anthropological models based on comparative studies, this compact volume provides an account of the Greek world that is thoughtful and sophisticated yet accessible to students and general readers with little or no knowledge of Greece","torrent":{"xt":"urn:btih:56874305e3f2e6548c75ea2b34a0b6b6f102635b","amp;dn":"A+Brief+History+of+Ancient+Greece%3A+Politics%2C+Society%2C+and+Cultur","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56874305e3f2e6548c75ea2b34a0b6b6f102635b","infoHashBuffer":{"type":"Buffer","data":[86,135,67,5,227,242,230,84,140,117,234,43,52,160,182,182,241,2,99,91]},"announce":[],"urlList":[]}}