{"title":"RealGuitar.VST.VSTI.DXI.RTAS.DjVictorValentine","uid":4547661,"size":1705605,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:56a58a71709ab5bb5b42d2fb6f6d08e56fe4db28&amp;dn=RealGuitar.VST.VSTI.DXI.RTAS.DjVictorValentine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"DJVictorValentine","files":1,"time":1228189128,"description":"The true power of RealGuitar lies in 3 brand new technologies incorporated in this innovative guitar performance tool:\n\n\nNew multi-channel layering technology, incorporating a custom library of specially recorded samples taken from every fret of all 6 strings of a real guitar. \nThe unique Floating Fret Position technology, which imitates change of fret position of a guitarist&amp;#039;s hand on the neck. This gives you the possibility of playing on up to 104 guitar frets using just 43 keys of a standard keyboard! \nOur original Guitar Touch technology letting you easily imitate basic guitar techniques (strumming, plucking, sliding, bending, muting, etc..), using standard MIDI keyboard and MIDI controllers, such as Pitch Bender, Modulation Wheel, Sustain Pedal, Aftertouch.\n\nThese technologies allow to closely emulate live guitar sound and techniques, letting you perform guitar parts with a whole new level of realistic expression. Furthermore they made it possible to get that special recognizable sound of a real 12-string guitar using samples taken from an ordinary 6 string guitar, as well as to achieve true Doubling (double track) effect.\n\nRealGuitar 2L version is equipped with powerful Pattern Manager allowing to use MusicLab Guitar Pattern Library for easily creating guitar accompaniment tracks. All you have to do is to find the appropriate rhythm pattern[s] in the Pattern Manager tree view, copy it to the needed number of measures, start your sequencer and use MIDI keyboard to play chord changes, or alternatively add chords to a MIDI track via sequencer&amp;#039;s editor.\n\n\nRealGuitar features:\n\nSound: \n\nWorld famous guitars \nHigh quality guitar samples \nEvery fret of all 6 strings including up/down/muted strokes sampled \nNew multi-channel sample layering technology \nInFace sound concept \nTrue Doubling (double track) effect \nBuilt-in EQ and FX (Stereo Tremolo, 2-way Chorus) \nCustom 32-bit sound engine\n\nPerformance: \n\nSolo, Harmony, Bass&amp;Chord, Bass&amp;Pick, and Chords modes \nAbout 2000 instant guitar chords + up strum, down strum, up/down muted strum, slow strum chords \n1-4 note chords to 6-voice guitar strums real-time translation \n26 chord types recognition, including 7th, 9th and altered chords, in any inversion and voicing \nSlash Bass Chords option - allows to perform major/minor triads with any note in the bass (including its own III, V (and Root of course)) \nLegato Chords option - allows to sustain note(s) on chord change if the same note(s)/string/fret is being triggered in the previous chord \nAutomatic Fret position change \nStrum speed adjustable \nRepeat Key zone (for performing repetitions, tremolo, up/down/muted strums) \nVelocity Switch articulations (slow strum, slide up/down, bend, reverse bend,) \nKey/Pedal Switch guitar effects (harmonics, mute, palm mute, body smacks, tremolo) \nHammer-on, Pull-off \nHammer-on with automatic Pull-off on key release \nLegato Slide (up and down) - automatic slide between any two pressed notes \nTremolo - automatically repeating the released note(s) to easily perform tremolo technique \n4 Key Switch FX keys (C1, C#1, D1, D#1) let you assign and use up to 4 various guitar effects in the same performance \nPolyphonic controllers (applying Pitch Bender, Modulation Wheel, AfterTouch to individual voices) \nAutomatic Fret Noise and Release Noise\n\nPattern Manager (available only in 2L version):\nRealGuitar is now equipped with powerful multi-functional built-in Pattern Manager letting you use RG MIDI Pattern Library for creating guitar accompaniment parts in the whole new and convenient way:\n\n\nComplete RG MIDI Pattern Library (1250 rhythm patterns) \nPattern Tree view, allowing to find/select rhythm patterns right from RealGuitar \nPattern view, graphically presenting guitar &amp;#039;Strokes&amp;#039; contained in the current rhythm pattern (differently colored &amp;#039;Piano Roll&amp;#039; type bars allow to easily visualize Up/Down, Up/Down Muted, Slow Strums, individual string Strokes, etc...) \nAuditioning selected pattern by simply pressing chord on the external keyboard without starting your host sequencer, even with RealGuitar standalone run \nTotal synchronization with host&amp;#039;s tempo, start/stop, beats, loop, time signature... \nDrag&amp;#039;n&amp;#039;Drop selected pattern from Pattern window right to your host&amp;#039;s MIDI track (pattern is automatically multiplied by the assigned number of measures) \nReal time pattern arranging (dramatic changing pattern performance on the fly): \nAdd/reduce dynamics (velo+) \nRandomize dynamics \nApply velocity of trigger chord to pattern dynamics \nContinuous dynamics changes (+/- velocity assigned to Pitch Bender controller)\n\nGuitars:\nRealGuitar includes 555 MB sample set featuring 8 Acoustic guitar patches:\n\n\nSteel Picked \nSteel Fingered \nNylon Picked \nNylon Fingered \nSteel 2 Picked \nSteel 2 (Doubling) \n12-string \nSteel Stereo 290MB","torrent":{"xt":"urn:btih:56a58a71709ab5bb5b42d2fb6f6d08e56fe4db28","amp;dn":"RealGuitar.VST.VSTI.DXI.RTAS.DjVictorValentine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56a58a71709ab5bb5b42d2fb6f6d08e56fe4db28","infoHashBuffer":{"type":"Buffer","data":[86,165,138,113,112,154,181,187,91,66,210,251,111,109,8,229,111,228,219,40]},"announce":[],"urlList":[]}}