{"title":"Pluralsight - Improving Testability Through Design","uid":10760292,"size":894309023,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:56d8a4e5c9e6187f7192b6f195606076068b075e&amp;dn=Pluralsight+-+Improving+Testability+Through+Design&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"NepsterJay","files":120,"time":1407969355,"description":"This course tackles the issues of designing a complex application so that it can be covered with high quality tests.\n\nA well designed application is not necessarily the one which has a perfect separation of layers, or the one which perfectly implements some predefined design patterns. It is certainly a plus to have these two goals met, but that is not sufficient to make the application really good. We can learn the most about one application by reading the source code of particular methods embedded deep inside of it. A common for loop often reveals more about the design than the whole diagram depicting responsibilities of an application layer in which it is located. The devil is in the details. The best of all intentions in design fails miserably when the low-profile design of small, seemingly unimportant classes is misconceived. In this course, the order of decisions is sorted bottom-up. It is the small class to which we pay attention the most. Only when all things are in place at the microscopic level can we discuss responsibilities of layers, isolation of modules and other high profile topics. The result is a well-built, easily testable and easily maintainable application.","torrent":{"xt":"urn:btih:56d8a4e5c9e6187f7192b6f195606076068b075e","amp;dn":"Pluralsight+-+Improving+Testability+Through+Design","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56d8a4e5c9e6187f7192b6f195606076068b075e","infoHashBuffer":{"type":"Buffer","data":[86,216,164,229,201,230,24,127,113,146,182,241,149,96,96,118,6,139,7,94]},"announce":[],"urlList":[]}}