{"title":"Best of Not the 9 O'Clock News (1979) BBC - Rowan Atkinson","uid":7457394,"size":2467357581,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:56db31f081cb71f5576b8a177bc6a46ba9952d9f&amp;dn=Best+of+Not+the+9+O%27Clock+News+%281979%29+BBC+-+Rowan+Atkinson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rambam1776","files":-1,"time":1342709793,"description":"Best of Not the 9 O'Clock News (1979) BBC - Rowan Atkinson\n\nFormat                                   : Matroska Version 2\nNominal bit rate                         : 1 500 Kbps\nWidth                                    : 716 pixels\nHeight                                   : 480 pixels\nDisplay aspect ratio                     : 4:3\nOriginal display aspect ratio            : 4:3\nFrame rate mode                          : Variable\nFrame rate                               : 29.970 fps\nScan type                                : Progressive\nBits/(Pixel*Frame)                       : 0.146\nWriting library                          : x264 core\nLanguage                                 : English\nDefault                                  : Yes\n &lt;a href=&quot;\nhttp://bayimg.com/EaAknaaEc&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/EaAknaaEc&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0080253/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0080253/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Not_the_Nine_O'Clock_News&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Not_the_Nine_O'Clock_News&lt;/a&gt;\n\nNot the Nine O'Clock News is a television comedy sketch show which was broadcast on BBC 2 from 1979 to 1982. Originally shown as a comedy alternative to the BBC Nine O'Clock News on BBC 1, it featured satirical sketches on current news stories and popular culture, as well as parody songs, comedy sketches, re-edited videos, and spoof television formats. The series featured Rowan Atkinson, Pamela Stephenson, Mel Smith, and Griff Rhys Jones, as well as Chris Langham in the first series. Its format was similar to Monty Python's Flying Circus, including sketches that lasted from a few seconds to several minutes. The series launched the careers of several high-profile actors and writers, and also led to other comedy series including Blackadder, Mr. Bean, and Alas Smith and Jones.\n\nThe original cast was Rowan Atkinson, Christopher Godwin, John Gorman, Chris Langham, Willoughby Goddard, and Jonathan Hyde, and the show was planned for 2 April 1979. As the show was originally scheduled to air after Fawlty Towers, John Cleese was to have introduced the first episode in a sketch referring to a technicians' strike then in progress, explaining (in character as Basil Fawlty) that there was no show that week so a &quot;tatty revue&quot; would be broadcast instead. However the 1979 general election intervened, and the show was pulled as too political.[1] The sketch with Cleese was broadcast later that year, when the final episode of Fawlty Towers went out during the broadcast run of the first series of Not the Nine O'Clock News, though the significance of the sketch was lost. This link is included on the Region 2 Fawlty Towers DVD boxset.\n\nLloyd and Hardie decided to recast the show, retaining Langham and Atkinson. They wanted to bring in a woman. Victoria Wood turned the show down. Lloyd met Pamela Stephenson at a party and she agreed to join. Atkinson, Langham, and Stephenson were joined by Mel Smith. The first series was criticised for being &quot;a poor mix of stand up, and a mild portion of sketches&quot;. This left the BBC with sketches which depended upon a second series; seven episodes were commissioned. Langham was replaced by Griff Rhys Jones, who had already appeared in minor roles. The second series won the Silver Rose at the Montreux Festival and a BAFTA award for Best Light Entertainment Programme in 1982.","torrent":{"xt":"urn:btih:56db31f081cb71f5576b8a177bc6a46ba9952d9f","amp;dn":"Best+of+Not+the+9+O%27Clock+News+%281979%29+BBC+-+Rowan+Atkinson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56db31f081cb71f5576b8a177bc6a46ba9952d9f","infoHashBuffer":{"type":"Buffer","data":[86,219,49,240,129,203,113,245,87,107,138,23,123,198,164,107,169,149,45,159]},"announce":[],"urlList":[]}}