{"title":"Hara-Kiri: Japanese Ritual Suicide (1968) epub","uid":11981890,"size":2676761,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:56db05dfd8b9b9b4c5dd544725bd5e6b243b3ac7&amp;dn=Hara-Kiri%3A+Japanese+Ritual+Suicide+%281968%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":1,"time":1433243980,"description":"Hari-Kiri is a definitive text on Japanese ritual suicide, also known as seppuku\n\n To the average westerner, the word hara-kiri conjures up an image of excruciating, self-inflicted pain; of a deep, fatal incision. To the Japanese, this kind of suicide embodies the best qualities of courage, honor, and discipline.\n\n Through extensive research, author Jack Seward brings to the English-speaking public a dissertation on the subject that is thoroughly enlightening. Fluent in speaking, reading, and writing Japanese, he was able to glean information from ancient documents many of them scrolls in the Japanese archives that few foreigners have seen. The earliest writings on hara-kiri (known more formally as seppuku) are thus revealed, as are the intricate rituals surrounding the ceremony.\n\n &quot;The major purpose of this book,&quot; says the author, &quot;is to clarify the historical and sociological significance of a unique method of self-destruction.&quot; In fulfilling this purpose, author Seward has come up with a definitive work that is sure to arouse interest both as a scholarly effort and as simple, fascinating reading","torrent":{"xt":"urn:btih:56db05dfd8b9b9b4c5dd544725bd5e6b243b3ac7","amp;dn":"Hara-Kiri%3A+Japanese+Ritual+Suicide+%281968%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56db05dfd8b9b9b4c5dd544725bd5e6b243b3ac7","infoHashBuffer":{"type":"Buffer","data":[86,219,5,223,216,185,185,180,197,221,84,71,37,189,94,107,36,59,58,199]},"announce":[],"urlList":[]}}