{"title":"A Bridge Not Attacked: Chemical Warfare Civilian Research During","uid":8621913,"size":17808891,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:56ddfaf68694e49c73c1bf2ea20733f632e38067&amp;dn=A+Bridge+Not+Attacked%3A+Chemical+Warfare+Civilian+Research+During&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"blackatk","files":-1,"time":1372394436,"description":"\nThis volume tells the novel true stories concerning highly talented civilian scientists in some unusual places and situations during World War II. The purpose of the work is to present an almost forgotten history of secret war research in universities. The focus is on the narrow subject of chemical warfare research and on a small number of individuals, but with in-depth study of these individuals and what they did. Mostly graduate students and young instructors, they were working under the direction of professors at the California Institute of Technology (Caltech) and the University of California (Berkeley). Action took place in California, Florida and the jungles of Panama. This history touches on the work of four senior Nobel Prize winners and eight junior, future Nobel Prize winners at Caltech and Berkeley.\n\nReview\n... the book is engaging and well written. -- The Journal of Military History\n\nAlthough aimed primarily at the general reader, chemists and historians of chemistry will find a great deal of interest. -- AMBIX\nFrom the Publisher\nScholars in the field of history of science and general readers of science magazines. \n\n# Hardcover: 276 pages\n# Publisher: World Scientific Pub Co Inc (February 21, 2003)\n# Language: English\n# ISBN-10: 981238152X\n# ISBN-13: 978-9812381521\n\n","torrent":{"xt":"urn:btih:56ddfaf68694e49c73c1bf2ea20733f632e38067","amp;dn":"A+Bridge+Not+Attacked%3A+Chemical+Warfare+Civilian+Research+During","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56ddfaf68694e49c73c1bf2ea20733f632e38067","infoHashBuffer":{"type":"Buffer","data":[86,221,250,246,134,148,228,156,115,193,191,46,162,7,51,246,50,227,128,103]},"announce":[],"urlList":[]}}