{"title":"Archimedes: Mathematical Genius of the Ancient World","uid":9766282,"size":20914977,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5722721c0fbeb7d3197999fc2ed5522b564db9e0&amp;dn=Archimedes%3A+Mathematical+Genius+of+the+Ancient+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"sidmal","files":-1,"time":1394883017,"description":"\n\nArchimedes: Mathematical Genius of the Ancient World (Great Minds of Science) by Mary Gow\n 2005 | ISBN: 0766025020 | English | 128 pages | PDF | 20 MB\n\n Because more information has survived about Archimedes's contributions than about his life, most of this book wisely focuses on his mathematical observations 22 centuries ago. Descriptions of Syracuse and Alexandria, cities that influenced his social and educational development, introduce readers to ancient Greek society and give them a fuller understanding of the importance of Archimedes's discoveries. The next chapters describe the significance of his work regarding levers, buoyancy, geometry, and pi; and of such inventions as the pulley and Archimedes's screw. The legendary Eureka! moment involving the metallic composition of the king's crown and a chapter devoted to the man's fondness for mathematical puzzles enliven text, which is composed mainly of short, declarative sentences. Footnotes are appropriately referenced, and citations from primary sources include the writings of Plutarch and Cicero. Differentiation is made between factually recorded accounts and those attributed to legend. Good-quality, black-and-white illustrations add information to the clear text, which is presented in large font. Three activities encourage student inquiry. With few other titles available for this audience, this entry in the series could be especially useful for students requesting books about ancient history or mathematicians. \n","torrent":{"xt":"urn:btih:5722721c0fbeb7d3197999fc2ed5522b564db9e0","amp;dn":"Archimedes%3A+Mathematical+Genius+of+the+Ancient+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5722721c0fbeb7d3197999fc2ed5522b564db9e0","infoHashBuffer":{"type":"Buffer","data":[87,34,114,28,15,190,183,211,25,121,153,252,46,213,82,43,86,77,185,224]},"announce":[],"urlList":[]}}