{"title":"Body &amp; Brain Connection (Kinect)","uid":6194342,"size":7838695424,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:5744242428ffb9c72b7980d20d95fc1d5c793558&amp;dn=Body+%26+Brain+Connection+%28Kinect%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"tim23","files":1,"time":1298407205,"description":"Developed under the supervision of renowned Japanese neuroscientist Dr. Ryuta Kawashima, Body and Brain Connection revolutionizes the mega-popular Brain Training genre he helped originate with an all-new, unique blend of physical and cerebral challenges. With Dr. Kawashima\\'s latest research proving that brain activity is augmented by physical movement, Body and Brain Connection challenges players to exercise both their minds and bodies with fun, fast-paced mini-games ranging from math, logic and memory to reflex and physical-orientation exercises. Exclusively available for Xbox 360Ã‚Â® with Kinect, Body and Brain Connection is the first Brain Training game available on Xbox 360 with Kinect, and the only game worldwide to integrate cerebral and physical challenges for the optimal gaming experience. And given its multiplayer mode and ease of use, whole families can enjoy and receive the benefits of Body and Brain Connection\\'s myriad of mini-games, challenges and exercises.\n\n    * Fun For All Ages and Brains - With no controllers necessary and an E-for-Everyone rating, Body and Brain Connection brings whole families together regardless of age or skill level!\n    * Doctor Approved - Dr. Kawashima, originator of the Brain Training genre, has supervised and approved every aspect of Body and Brain Connection, guaranteeing it\\'s as fun and challenging as it is cutting-edge!\n    * Unparalleled Replay Value - Combining 4-player competition and 20 exercises with the full-motion capabilities of the Xbox 360Ã‚Â® Kinect Sensor, Body and Brain Connection ensures hours of replayability!\n    * Optimized Brain Training - Scientists recently confirmed that brain activity is augmented by physical movement - beyond fun for the whole family; Body and Brain Connection provides an optimized Brain Training experience too!\n    * First Brain Training Title on Xbox 360 with Kinect - Body and Brain Connection is the only game of its kind on Xbox 360 with Kinect and the first Xbox 360 with Kinect release for Namco, delivering a wholly unique experience to an entirely new audience!\n    * Robust In-Game Tracking - Body and Brain Connection boasts persistent data tracking and exercises that can be customized for individuals as well as groups, ensuring a fun, engaging experience for all!\n\n","torrent":{"xt":"urn:btih:5744242428ffb9c72b7980d20d95fc1d5c793558","amp;dn":"Body+%26+Brain+Connection+%28Kinect%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5744242428ffb9c72b7980d20d95fc1d5c793558","infoHashBuffer":{"type":"Buffer","data":[87,68,36,36,40,255,185,199,43,121,128,210,13,149,252,29,92,121,53,88]},"announce":[],"urlList":[]}}