{"title":"The Profit (2001) BANNED MOVIE","uid":8279950,"size":485148299,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5759ee22aa35ceb721d9cf3040ebd158556b5ee6&amp;dn=The+Profit+%282001%29+BANNED+MOVIE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":-1,"time":1363808992,"description":"THE MOVIE THE CHURCH OF SCIENTOLOGY DOESN'T WANT YOU TO SEE! THIS MOVIE WAS BANNED IN THE UNITED STATES SHORTLY AFTER IT WAS MADE!\n\nThe Profit is a feature film written and directed by Peter N. Alexander. The film premiered at the Cannes Film Festival in France in 2001. Distribution of the film was prohibited by an American court order which was a result of a lawsuit brought by the Church of Scientology, although the filmmaker says that the film is not about Scientology. The Disinformation Book Of Lists and The Times have characterized The Profit as a banned film in the United States.\n\nThe film was described by its producers as a work of fiction, meant to educate the public about cults and con men. It was widely seen, however, as a parody of the Church of Scientology and its founder, L. Ron Hubbard. The main character L. Conrad Powers leads an organization called the &quot;Church of Scientific Spiritualism&quot;, and many elements about both the Church portrayed in the film, and Powers' life have been compared to Scientology and Hubbard. The film was mainly produced and shot in Tampa Bay, Florida, and the cast included actors from the area and cameos from a few Scientology critics.\n\nEric Rath as L. Conrad Powers\nChristine Eads as Helen Hughes\nJeff Hughes as Zack Carson\nCliff Roca as Mitchell Cabot\nJane Eaton as Babs Lewis\nMargaret Mary Bastick as Dr. Mary Kimbrough\n\nWritten and Directed by Peter N. Alexander\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0277255/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0277255/&lt;/a&gt;\n\n\nThis is a low budget film and is VHS quality, as it was never released on DVD. This is a decent .mp4 copy - about as good as you're likely to find.\n\nPLEASE DOWNLOAD AND SHARE THIS IMPORTANT FILM! DON'T LET CoS CENSOR THEIR CRITICS!\n\n\n\nWe are Legion.","torrent":{"xt":"urn:btih:5759ee22aa35ceb721d9cf3040ebd158556b5ee6","amp;dn":"The+Profit+%282001%29+BANNED+MOVIE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5759ee22aa35ceb721d9cf3040ebd158556b5ee6","infoHashBuffer":{"type":"Buffer","data":[87,89,238,34,170,53,206,183,33,217,207,48,64,235,209,88,85,107,94,230]},"announce":[],"urlList":[]}}