{"title":"Other People's Money: The Real Business of Finance by John Kay","uid":13859664,"size":6988400,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:577ea712abe7d5a3331be8079580b47ddeec50d4&amp;dn=Other+People%27s+Money%3A+The+Real+Business+of+Finance+by+John+Kay&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Dr.Soc","files":2,"time":1458022004,"description":"Other People's Money: The Real Business of Finance by John Kay\r\nEnglish | 2015 | ISBN: 1610396030 | 352 pages | EPUB, True PDF | 7 MB\r\n\r\nA Financial Times’ Book of the Year, 2015\r\nAn Economist Best Book of the Year, 2015\r\nA Bloomberg Best Book of the Year, 2015\r\n\r\nThe finance sector of Western economies is too large and attracts too many of the smartest college graduates. Financialization over the past three decades has created a structure that lacks resilience and supports absurd volumes of trading. The finance sector devotes too little attention to the search for new investment opportunities and the stewardship of existing ones, and far too much to secondary-market dealing in existing assets. Regulation has contributed more to the problems than the solutions.\r\n\r\nWhy? What is finance for? John Kay, with wide practical and academic experience in the world of finance, understands the operation of the financial sector better than most. He believes in good banks and effective asset managers, but good banks and effective asset managers are not what he sees.\r\n\r\nIn a dazzling and revelatory tour of the financial world as it has emerged from the wreckage of the 2008 crisis, Kay does not flinch in his criticism: we do need some of the things that Citigroup and Goldman Sachs do, but we do not need Citigroup and Goldman to do them. And many of the things done by Citigroup and Goldman do not need to be done at all. The finance sector needs to be reminded of its primary purpose: to manage other people’s money for the benefit of businesses and households. It is an aberration when the some of the finest mathematical and scientific minds are tasked with devising algorithms for the sole purpose of exploiting the weakness of other algorithms for computerized trading in securities. To travel further down that road leads to ruin","torrent":{"xt":"urn:btih:577ea712abe7d5a3331be8079580b47ddeec50d4","amp;dn":"Other+People%27s+Money%3A+The+Real+Business+of+Finance+by+John+Kay","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"577ea712abe7d5a3331be8079580b47ddeec50d4","infoHashBuffer":{"type":"Buffer","data":[87,126,167,18,171,231,213,163,51,27,232,7,149,128,180,125,222,236,80,212]},"announce":[],"urlList":[]}}