{"title":"Boomeranal (Coast To Coast, 1992) Chelly Supreme, Domonique Simo","uid":15585933,"size":785305120,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:57f77c79454a76acc2b33720f823a63b2a18fed2&amp;dn=Boomeranal+%28Coast+To+Coast%2C+1992%29+Chelly+Supreme%2C+Domonique+Simo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"distinc","files":10,"time":1471464084,"description":"Boomeranal (Coast To Coast, 1992) Chelly Supreme, Domonique Simone, Sheila Stone (480p)\r\n\r\n...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=1834408986\r\n \nhttp://imagedisco.net/?g=2670333474\r\n\r\n\r\nPlot:\r\n\r\nLength: 1:11:29\r\nFilesize: 747 MB\r\nFormat: WMV\r\nRez: 640x480\r\nBitrate: 1271kbps\r\n\r\n\r\nHey all, here's a blast from the past featuring some of the classic ladies and studs of the early 1990s. I guess, judging by the title, that this is supposed to evocative of the 1992 Eddie Murphy film &quot;Boomerang&quot;, but having never seen that movie and having my doubts as to how closely a cheap porn film will even try to hew to the spirit of a mainstream flick, I'm pretty sure it doesn't reflect it at all.\r\n\r\nScene one is a gangbang featuring big titty tanlined redhead Chelly Supreme with the studs above. She services all five of them with her mouth, pussy, and ass, and takes cumshots on her stomach, ass, and tits. This is the good type of gangbang scene, in my book - a bimbo pleasurably giving and getting it from a bunch of dudes, rather than being some messy piece of fuckmeat.\r\n\r\nThe next scene has &quot;The Gentleman Neanderthal&quot; Randy West fucking on a boat with blonde star Sheila Stone. She sucks Randy's roger and then has her pussy eaten out by him. He then fucks her from behind and missionary style, and cums on her foot at the end.\r\n\r\nScene three is a lez scene between Sheila and ebony porn star Domonique Simone, again on a boat. Both ladies get naked, Sheila fetchingly so with her blonde hair in a ponytail and wearing nothing but white sneakers and socks. It's a look that is shit on dudes but hot on ladies. Sheila eats out Domonique's pussy, and then Domonique reciprocates. The ladies then have a sideways 69 to eat each other out simultaneously. \r\n\r\nThe last scene is a one-on-one hardcore scene between Domonique and Randy, again on a boat. You rent it for the day, you make the most of it! Domonique sucks Randy, Randy licks her pussy, and the two fuck missionary style on a boatseat, then cowgirl style. The cumshot at the end is Randy jerking and spurting off into the air. Maybe he was trying for Domonique's ass, but he missed by a mile.\r\n\r\nSo there you have it! Wank it, thank it, and leave a comment! Peace!\r\n\r\nGenre:Anal , DP , Hardcore","torrent":{"xt":"urn:btih:57f77c79454a76acc2b33720f823a63b2a18fed2","amp;dn":"Boomeranal+%28Coast+To+Coast%2C+1992%29+Chelly+Supreme%2C+Domonique+Simo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57f77c79454a76acc2b33720f823a63b2a18fed2","infoHashBuffer":{"type":"Buffer","data":[87,247,124,121,69,74,118,172,194,179,55,32,248,35,166,59,42,24,254,210]},"announce":[],"urlList":[]}}