{"title":"The Best of Sade 320cbr (Big Papi) 1994 R&amp;B","uid":9367116,"size":179883988,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:583b7a6cef69dc0f093d53979834a1a063e49b3d&amp;dn=The+Best+of+Sade+320cbr+%28Big+Papi%29+1994+R%26amp%3BB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1387452968,"description":"Source:  1994 CD\n \nSolid 5 star release and performer.  Even if you don't care for R&amp;B you will still love Sade.  Such a beautiful and soulful voice - Big Papi\n\n\nBy Lonnie E. Holder HALL OF FAMETOP 500 REVIEWERVINE VOICE\n\nSade's voice should be in the dictionary as a definition of sultry. When she sings in the style she does best she is absolutely phenomenal. Her voice is the ultimate in romantic music and is suitable for darkened restaurants, living rooms (a fireplace would be good) and even bedrooms. Her music can make you feel mellow and cozy and is great music to fall into the eyes of your significant other.\nAt least one other reviewer has commented that Sade is a one-trick pony because her vocal talent is generally limited to one style. On the flip side, she sings best when she sings in the style that is her trademark. As an example, in the song &quot;Nothing Can Come Between Us&quot; Sade tries a bit faster pace and a different style, and the music overruns her vocals. I listen to Sade's music to listen to her, and when the instruments become the primary voice in a song then I feel as though I am not listening to Sade. This particular song is also very derivative and somewhat lackluster as compared to most of her other songs.\n\nSade's voice is well exploited and at its best in songs such as &quot;Smooth Operator,&quot; &quot;The Sweetest Taboo,&quot; and the emotional, heartfelt &quot;Jezebel.&quot; But the examples on this CD are numerous extend well beyond these songs. &quot;No Ordinary Love&quot; is powerful, Sade sings from some deep place inside of her that connects you to her soul. This song is more than seven minutes of passion and beauty. Try listening to this song in a completely dark room, preferably holding your significant other, and keeping your eyes closed. The power of this song will flow through you and give you a most amazing feeling.\n\nThere are so many other wonderful songs on this CD that I could easily extol the virtues of nearly all of them.\nSade is difficult to categorize, because she brings so many influences to her music. Some have classified her music as Jazz, and some of her music is Jazz-influenced. In some places she shows up as soft rock or easy listening, and both would be at least partially correct. However, in the end what matters is the music; classifications are merely a way of organizing, and we know that art sometimes defies organization because it goes where it will","torrent":{"xt":"urn:btih:583b7a6cef69dc0f093d53979834a1a063e49b3d","amp;dn":"The+Best+of+Sade+320cbr+%28Big+Papi%29+1994+R%26amp%3BB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"583b7a6cef69dc0f093d53979834a1a063e49b3d","infoHashBuffer":{"type":"Buffer","data":[88,59,122,108,239,105,220,15,9,61,83,151,152,52,161,160,99,228,155,61]},"announce":[],"urlList":[]}}