{"title":"Analytical Chemistry of Uranium","uid":12204425,"size":15527363,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58879fc5642a030364a3bedab8d41afeb46dcc83&amp;dn=Analytical+Chemistry+of+Uranium&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1438897531,"description":"Analytical Chemistry of Uranium - Environmental, Forensic, Nuclear, and Toxicological Applications (CRC).pdf\n\nISBN 9781482220605\n\nAccurate uranium analysis, and particularly for isotope measurements, is essential in many fields, including environmental studies, geology, hydrogeology, the nuclear industry, health physics, and homeland security. Nevertheless, only a few scientific books are dedicated to uranium in general and analytical chemistry aspects in particular. Analytical Chemistry of Uranium: Environmental, Forensic, Nuclear, and Toxicological Applications covers the fascinating advances in the field of analytical chemistry of uranium.\n\nExploring a broad range of topics, the book focuses on the analytical aspects of industrial processes that involve uranium, its presence in the environment, health and biological implications of exposure to uranium compounds, and nuclear forensics.\n\nTopics include:\n\nExamples of procedures used to characterize uranium in environmental samples of soil, sediments, vegetation, water, and air\n\nAnalytical methods used to examine the rigorous specifications of uranium and its compounds deployed in the nuclear fuel cycle\n\nHealth aspects of exposure to uranium and the bioassays used for exposure assessment\n\nUp-to-date analytical techniques used in nuclear forensics for safeguards in support of non-proliferation, including single particle characterization\n\nEach chapter includes an overview of the topic and several examples to demonstrate the analytical procedures. This is followed by sample preparation, separation and purification techniques where necessary. The book supplies readers with a solid understanding of the analytical chemistry approach used today for characterizing the different facets of uranium, providing a good starting point for further investigation into this important element","torrent":{"xt":"urn:btih:58879fc5642a030364a3bedab8d41afeb46dcc83","amp;dn":"Analytical+Chemistry+of+Uranium","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58879fc5642a030364a3bedab8d41afeb46dcc83","infoHashBuffer":{"type":"Buffer","data":[88,135,159,197,100,42,3,3,100,163,190,218,184,212,26,254,180,109,204,131]},"announce":[],"urlList":[]}}