{"title":"Hughes: The Private Diaries, Memos, and . Richard Hack Audiobook","uid":11693666,"size":518850057,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:58a1fd176155c4f4b0683c029bc3daaded7c2c59&amp;dn=Hughes%3A+The+Private+Diaries%2C+Memos%2C+and+.+Richard+Hack+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Squiddy82","files":23,"time":1423627201,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nHughes: The Private Diaries, Memos and Letters: The Definitive Biography of the First American Billionaire\n\nWritten by: Richard Hack\nNarrated by: Dan Cashman\nLength: 18 hrs and 2 mins\nUnabridged Audiobook\nRelease Date:06-21-02\n\n&quot;Howard Hughes would have hated this book...because he never wanted the truth to be told. As the man who knew Hughes best for 17 years and to whom he referred publicly as his alter-ego, I now believe that the entire story has finally been told.&quot; (Robert Maheu)\nHoward Hughes was a true American original: legendary lover, record-setting aviator, award-winning film producer, talented inventor, ultimate eccentric, and, for much of his lifetime, the richest man in the United States.\nHis desire for privacy was so fierce and his isolation so complete that even now, 25 years after his death, inaccurate stories continue to circulate, and many have been published as fact. Hughes explodes the illusion of his life and exposes the man behind the myth. He was a playboy whose sexual exploits with Hollywood stars were legendary. He was a man without compassion; an entrepreneur without ethics; an explorer without maps; and ultimately, an eccentric trapped by his own insanity, sealed off from reality, who died a lonely and - until now - mysterious death.\nNewly uncovered personal letters, over 110,000 pages of sealed court testimony, recently declassified FBI files, never-before-published autopsy reports and exclusive interviews reveal a man so devious in his thinking, so perverse in his desires, and so influential that his impact continues to be felt even today. From entertainment to politics, aviation to espionage, the influence and manipulation of this billionaire has left an indelible and unique mark on the American cultural landscape","torrent":{"xt":"urn:btih:58a1fd176155c4f4b0683c029bc3daaded7c2c59","amp;dn":"Hughes%3A+The+Private+Diaries%2C+Memos%2C+and+.+Richard+Hack+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58a1fd176155c4f4b0683c029bc3daaded7c2c59","infoHashBuffer":{"type":"Buffer","data":[88,161,253,23,97,85,196,244,176,104,60,2,155,195,218,173,237,124,44,89]},"announce":[],"urlList":[]}}