{"title":"Urban Forms - The Death and Life of Urban Block (Architecture Ar","uid":9760069,"size":10015933,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:596f12379c3c88c29f8438905b9f458a03ac4682&amp;dn=Urban+Forms+-+The+Death+and+Life+of+Urban+Block+%28Architecture+Ar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1394756912,"description":"Urban Forms by Ivor Samuels, Phillippe Panerai, Jean Castex and Jean Charles Depaule\nEnglish | 2004-06-15 | ISBN: 0750656077 | 240 pages | PDF | 9,6 MB\n\nThis popular and influential work, translated here into English for the first time, argues that modern urbanism has upset the morphology of cities, abolished their streets and isolated their buildings. \n\nIn tracing the stages of this transformation, this book presents the view that the urban tissue, the intermediate scale between the architecture of buildings and the diagrammatic layouts of town planning, is the essential framework for everyday life. Only by investigating the urban tissue will it be possible to understand the complex relationships between plot and built form, between streets and buildings and between these forms and design practices.\n\nThe chosen trail of the first French edition - Paris, London, Amsterdam, Frankfurt - is one of continuously evolving modernity. It outlines a history, which, in one century (1860-1960), completely changed the aspect of our towns and cities and transformed our way of life. The shock has been such that we are still looking for answers, still attempting to find urban forms that can accommodate present day ways of life and at the same time maintain the qualities of the traditional town.\n\nThis English edition brings the story forward to the present day and considers the impact of the New Urbanism in the United States, which, over the last decade, has sought to re-establish former relationships within the urban tissue.\n\n* Internationally influential and highly respected French urban design theory translated into English for the first time\n* Both students and lecturers, of architecture and urban design, will find the theories and case studies informative and thought provoking\n* Features new up to date chapter focusing on US and New Urbanism","torrent":{"xt":"urn:btih:596f12379c3c88c29f8438905b9f458a03ac4682","amp;dn":"Urban+Forms+-+The+Death+and+Life+of+Urban+Block+%28Architecture+Ar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"596f12379c3c88c29f8438905b9f458a03ac4682","infoHashBuffer":{"type":"Buffer","data":[89,111,18,55,156,60,136,194,159,132,56,144,91,159,69,138,3,172,70,130]},"announce":[],"urlList":[]}}