{"title":"Love, Dishonor, Marry, Die, Cherish, Perish - David Rakoff.epub","uid":8962921,"size":1216909,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5996895e8556b2dc6ed3549c0b1e5153c99131fe&amp;dn=Love%2C+Dishonor%2C+Marry%2C+Die%2C+Cherish%2C+Perish+-+David+Rakoff.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1380151837,"description":"From the incomparable David Rakoff, a poignant, beautiful, witty, and wise novel in verse whose scope spans the twentieth century\n\nThrough his books and his radio essays for NPR's This American Life, David Rakoff has built a deserved reputation as one of the finest and funniest essayists of our time. Written with humor, sympathy, and tenderness, this intricately woven novel proves him to be the master of an altogether different art form.\n\nLOVE, DISHONOR, MARRY, DIE; CHERISH, PERISH leaps cities and decades as Rakoff sings the song of an America whose freedoms can be intoxicating, or brutal.\n\nThe characters' lives are linked to each other by acts of generosity or cruelty. A daughter of Irish slaughterhouse workers in early-twentieth-century Chicago faces a desperate choice; a hobo offers an unexpected refuge on the rails during the Great Depression; a vivacious aunt provides her clever nephew a path out of the crushed dream of postwar Southern California; an office girl endures the casually vicious sexism of 1950s Manhattan; the young man from Southern California revels in the electrifying sexual and artistic openness of 1960s San Francisco, then later tends to dying friends and lovers as the AIDS pandemic devastates the community he cherishes; a love triangle reveals the empty materialism of the Reagan years; a marriage crumbles under the distinction between self-actualization and humanity; as the new century opens, a man who has lost his way finds a measure of peace in a photograph he discovers in an old box-an image of pure and simple joy that unites the themes of this brilliantly conceived work.\n\nRakoff's insistence on beauty and the necessity of kindness in a selfish world raises the novel far above mere satire. A critic once called Rakoff &quot;magnificent,&quot; a word that perfectly describes this wonderful novel in verse.","torrent":{"xt":"urn:btih:5996895e8556b2dc6ed3549c0b1e5153c99131fe","amp;dn":"Love%2C+Dishonor%2C+Marry%2C+Die%2C+Cherish%2C+Perish+-+David+Rakoff.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5996895e8556b2dc6ed3549c0b1e5153c99131fe","infoHashBuffer":{"type":"Buffer","data":[89,150,137,94,133,86,178,220,110,211,84,156,11,30,81,83,201,145,49,254]},"announce":[],"urlList":[]}}