{"title":"Tony Bennett 24 Bit Vinyl Pack","uid":9605506,"size":3919285633,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:599ac79af49c55d1b838d194162d59bcb6fdee0e&amp;dn=Tony+Bennett+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1392216561,"description":"\n  Tony Bennett 24 Bit Vinyl Pack\n\n  Genres: Jazz, Vocal, Stage &amp; Screen\n  Styles: Traditional Pop, Vocal Jazz, Vocal Pop, Show Tunes\n  Source: vinyl\n  Codec: FLAC\n  Bitrate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96 KHz\n\n  1955 Alone at Last with Tony Bennett (Mono, 1st US)\n  1955 Cloud 7 (Mono, 1st US)\n  1957 The Beat of My Heart (Mono, 1st US)\n  1957 Tony (Mono, 1st US)\n  1958 Blue Velvet (Mono, 1st US)\n  1958 Long Ago and Far Away (Mono, 1st US)\n  1958 Tony's Greatest Hits (Mono, 1st US)\n  1959 Hometown, My Town (1st US)\n  1961 My Heart Sings (Mono, 1st US)\n  1963 Tony Bennett &amp; Count Basie - Strike Up the Band (Mono, 1st US)\n  1968 Snowfall: The Tony Bennett Christmas Album (1st US)\n\n  Tony Bennett's career has enjoyed three distinct phases, each of them very successful. In the early '50s, he scored a series of major hits that made him one of the most popular recording artists of the time. In the early '60s, he mounted a comeback as more of an adult-album seller. And from the mid-'80s on, he achieved renewed popularity with generations of listeners who hadn't been born when he first appeared. This, however, defines Bennett more in terms of marketing than music. He himself probably would say that, in each phase of his career, he has remained largely constant to his goals of singing the best available songs the best way he knows how. Popular taste may have caused his level of recognition to increase or decrease, but he continued to sing popular standards in a warm, husky tenor, varying his timing and phrasing with a jazz fan's sense of spontaneity to bring out the melodies and lyrics of the songs effectively. By the start of the 21st century, Bennett seemed like the last of a breed, but he remained as popular as ever.\n\n  Bennett grew up in the Astoria section of the borough of Queens in New York City under the name Anthony Dominick Benedetto. His father, a grocer, died when he was about ten after a lingering illness that had forced his mother to become a seamstress to support the family of five. By then, he was already starting to attract notice as a singer, performing beside Mayor Fiorello La Guardia at the opening of the Triborough Bridge in 1936. By his teens, Bennett had set his sights on becoming a professional singer. After briefly attending the High School of Industrial Arts (now known as the High School of Art and Design), where he gained training as a painter, he dropped out of school at 16 to earn money to help support his family, meanwhile also performing at amateur shows. Upon his 18th birthday in 1944, he was drafted into the Army, and he saw combat in Europe during World War II. Mustered out in 1946, he went back to trying to make it in music, and he attended the American Theater Wing on the GI Bill. By the end of the 1940s, he had acquired a manager and was working regularly around New York. He got a break when Bob Hope saw him performing with Pearl Bailey in Greenwich Village and put him into his stage show, also suggesting a name change to Tony Bennett. In 1950, Columbia Records A&amp;R director Mitch Miller heard his demonstration recording of &quot;The Boulevard of Broken Dreams&quot; and signed him to the label.\n\n  Bennett's first hit, &quot;Because of You,&quot; topped the charts in September 1951, succeeded at number one by his cover of Hank Williams' &quot;Cold, Cold Heart.&quot; Following another five chart entries over the next two years, he returned to number one in November 1953 with &quot;Rags to Riches.&quot; Its follow-up, &quot;Stranger in Paradise&quot; from the Broadway musical Kismet, was another chart-topper, and in 1954 Bennett also reached the Top Ten with Williams' &quot;There'll Be No Teardrops Tonight&quot; and &quot;Cinnamon Sinner.&quot; The rise of rock &amp; roll in the mid-'50s made it more difficult for Bennett to score big hits, but he continued to place singles in the charts regularly through 1960, and even returned to the Top Ten with &quot;In the Middle of an Island&quot; in 1957. Meanwhile, he was developing a nightclub act that leaned more heavily on standards and was exploring album projects that allowed him to indulge his interest in jazz -- notably 1957's The Beat of My Heart, on which he was accompanied mainly by jazz percussionists, and 1959's In Person! With Count Basie and His Orchestra. By the early '60s, although he had faded as a singles artist, he had built a successful career making personal appearances and recording albums of well-known songs in the manner of Frank Sinatra.\n\n  In 1962, Bennett introduced &quot;I Left My Heart in San Francisco,&quot; a ballad written by two unknown songwriters, George Cory and Douglass Cross, who had pitched it to his pianist, Ralph Sharon. Released as a single, the song took time to catch on, and although it peaked only in the Top 20, it remained on one or the other of the national charts for almost nine months. It became Bennett's signature song and pushed his career to a higher level. The I Left My Heart in San Francisco album reached the Top Five and went gold, and the single won Bennett Grammy Awards for Record of the Year and Best Solo Vocal Performance, Male. Bennett's next studio album, 1963's I Wanna Be Around..., also made the Top Five, and its title track was another Top 20 hit, as was his next single, &quot;The Good Life,&quot; also featured on the album. For the next three years, his albums consistently placed in the Top 100, along with a series of charting singles that included the Top 40 hits &quot;Who Can I Turn To (When Nobody Needs Me)&quot; (from the Broadway musical The Roar of the Greasepaint, the Smell of the Crowd) and &quot;If I Ruled the World&quot; (from the Broadway musical Pickwick).\n\n  By the late '60s, Bennett's record sales had cooled off as the major record labels turned their attention to the lucrative rock market. Just as Mitch Miller had encouraged Bennett to record novelty songs over his objections in the 1950s, Clive Davis, head of Columbia parent CBS Records, encouraged him to record contemporary pop/rock material. He acquiesced on albums such as Tony Sings the Great Hits of Today!, but his sales did not improve. In 1972, he left Columbia for the Verve division of MGM Records, but by the mid-'70s he was without a label affiliation, and he decided to found his own record company, Improv, to record the way he wanted to. He made several albums for Improv, including one with jazz pianist Bill Evans (following a disc they made for Fantasy Records), but the label eventually foundered. (Concord Records released the box set The Complete Improv Recordings in 2004.)\n\n  By the late '70s, however, Bennett did not need hit records to sustain his career, and he worked regularly in concert halls around the world. By the mid-'80s, there was a growing appreciation of traditional pop music, as performers such as Linda Ronstadt recorded albums of standards. In 1986, Bennett re-signed to Columbia and released The Art of Excellence, his first album to reach the pop charts in 14 years. Now managed by his son Danny, Bennett shrewdly found ways to attract the attention of the MTV generation without changing his basic style of singing songs from the Great American Songbook while wearing a tuxedo. By the early '90s, he was as popular as he had ever been. The albums Perfectly Frank (1992, a tribute to Frank Sinatra) and Steppin' Out (1993, a tribute to Fred Astaire) went gold and won Bennett back-to-back Grammys for Best Traditional Pop Vocal Performance. But his comeback was sealed by 1994's MTV Unplugged, featuring guest stars Elvis Costello and k.d. lang, which went platinum and won the Grammy for Album of the Year as well as another award for Best Traditional Pop Vocal Performance.\n\n  Bennett became a Grammy perennial, also taking home Best Traditional Pop Vocal Performance awards for Here's to the Ladies (1995) and On Holiday: A Tribute to Billie Holiday (1997). Bennett Sings Ellington: Hot &amp; Cool (1999) was another Grammy winner in the retitled Best Traditional Pop Album category, as was Playin' with My Friends: Bennett Sings the Blues, an album of duets released in 2001. One year later, Bennett paired off with a single duet partner, recording A Wonderful World with k.d. lang. The Art of Romance followed in 2004. Both albums won the Best Traditional Pop Album Grammy for their respective years. In August 2006, Bennett reached his 80th birthday, and his record label marked the occasion with a series of reissues and compilations. The next month brought Duets: An American Classic, another collection of pairings with other singers on re-recordings of some of Bennett's best-known songs that reached number three in the Billboard chart, the highest placing for an album in Bennett's career. It also won him another Grammy for Best Traditional Pop Album. A second installment of Duets was released in 2011, and the Latin version (Viva Duets) followed in time for Christmas 2012.","torrent":{"xt":"urn:btih:599ac79af49c55d1b838d194162d59bcb6fdee0e","amp;dn":"Tony+Bennett+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"599ac79af49c55d1b838d194162d59bcb6fdee0e","infoHashBuffer":{"type":"Buffer","data":[89,154,199,154,244,156,85,209,184,56,209,148,22,45,89,188,182,253,238,14]},"announce":[],"urlList":[]}}