{"title":"UnReal World v3.30","uid":13723505,"size":34343454,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5a03b152b489ed0666310f0e33c92c93c8cc2f69&amp;dn=UnReal+World+v3.30&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dauphong","files":1,"time":1456960056,"description":"About This Game\r\nInto the Far North we shall take you -- as far as we can by the means of computer role playing...\r\n\r\nUnReal World is a unique combination of roguelike roleplaying game and survival simulation set in the Far North long, long ago. Throughout the years, UnReal World has been praised for its depth, realism, atmosphere and immersion. The game is completely open-ended and you decide whether you wish to lead a life of a fisherman, a hermit searching for the peace, a brave adventurer, a rough hunter, a trapper or a tradesman.\r\n\r\nAs a member of one of the nine different cultures you'll enter a detailed and enchanting iron-age game world in which northern folklore, knowledge and way of life play an important part. The world and mechanics of the game are highly realistic, rich with historical atmosphere and emphasized on survival in the harsh ancient wilderness.\r\n\r\nA wide world with vast forests, mires and mountains to roam and watercourses to row is randomly and procedurally generated - and you can live off the land and explore it on very detailed level. Track animals, set traps, hunt with bows and spears, tan hides, go fishing, pick berries, cook food, sleep in a temporary shelter or build a log cottage, trade with the villagers, craft items, interact with cultures near and far -- and so much more","torrent":{"xt":"urn:btih:5a03b152b489ed0666310f0e33c92c93c8cc2f69","amp;dn":"UnReal+World+v3.30","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a03b152b489ed0666310f0e33c92c93c8cc2f69","infoHashBuffer":{"type":"Buffer","data":[90,3,177,82,180,137,237,6,102,49,15,14,51,201,44,147,200,204,47,105]},"announce":[],"urlList":[]}}