{"title":"Internet Explorer 9","uid":6303897,"size":481584,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5a11e822038e455564fca61e304e1d71868fa89e&amp;dn=Internet+Explorer+9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rbrtsmith","files":1,"time":1302257198,"description":"Windows Internet Explorer 9 (abbreviated as IE9) is the current version of the Internet Explorer web browser from Microsoft. \nIt was released to the public on March 14, 2011 at 21:00 PDT.[2] Internet Explorer 9 supports several CSS 3 properties, embedded ICC v2 or v4 color profiles support via Windows Color System, and has improved JavaScript performance. It also features hardware-accelerated graphics rendering using Direct2D, hardware-accelerated text rendering using DirectWrite, hardware-accelerated video rendering using Media Foundation, imaging support provided by Windows Imaging Component, and high fidelity printing powered by the XPS print pipeline.\nInternet Explorer 9 also supports the HTML5 video and audio tags and the Web Open Font Format. Microsoft has released Internet Explorer 9 as a major out-of-band version that is not tied to the release schedule of any particular version of Windows, unlike previous versions.\n\nThe system requirements for Internet Explorer 9 are Windows 7, Windows Server 2008 R2, Windows Vista Service Pack 2 or Windows Server 2008 SP2 with the Platform Update.[7] Windows XP is not supported.[8][9][10] Both 32-bit and 64-bit builds are available.\n\nDevelopment of Internet Explorer 9 began shortly after IE8 was released. Microsoft began taking features suggestions through Microsoft Connect soon after IE8 was released.] The IE team focused on improving support for HTML5, CSS3, SVG, XHTML, and the user interface featuring agility and a clean new design.\n\nInternet Explorer 9 implements the new W3C Navigation Timings format. Microsoft has been a part of creating this format during the development of Internet Explorer 9.\n\n\nInternet Explorer 9 includes significant alterations to its user interface when compared with previous versions. ","torrent":{"xt":"urn:btih:5a11e822038e455564fca61e304e1d71868fa89e","amp;dn":"Internet+Explorer+9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a11e822038e455564fca61e304e1d71868fa89e","infoHashBuffer":{"type":"Buffer","data":[90,17,232,34,3,142,69,85,100,252,166,30,48,78,29,113,134,143,168,158]},"announce":[],"urlList":[]}}