{"title":"Beachbody 10 Minute Trainer Workout (HEVC x265)","uid":15339675,"size":720603215,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:5abc8aea21473ad72a7e52199424545c0f3286c7&amp;dn=Beachbody+10+Minute+Trainer+Workout+%28HEVC+x265%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MrTVGuy","files":13,"time":1468817637,"description":"In 10-Minute Trainer, Tony put his most effective moves into a series of power-packed total-body workouts. His breakthrough Super Stacking Technique combines fat-burning cardio, body toning and sculpting, and ab moves, adding resistance bands for even faster results. With just 10 minutes of Tony's Super Stacking you can burn as many calories as 30 minutes of jogging. With 10-Minute Trainer, you have no more excuses! Your kit includes everything you need to get better results in less time. 10-Minute Trainer comes with six amazing workouts on 2 DVDs including Tony's On-the-Go Workout Cards, Pro-Grade Resistance Band Kit, Cardio Belt, Customized Workout Calendar, Rapid Results Guidebook, Tony's 10-Minute Recipe Guide, and 2-Day Jump Start Plan.\r\n\r\nDoes finding time to lose weight seem nearly impossible? Are you too busy to get to the gym? Try 10-Minute Trainer and get it done in just 10-minutes! This program is designed with one thing in mind: better results in less time. Give superstar trainer Tony Horton just 10 minutes, he'll give you the body you want. Don't let the 10-minutes fool you - you will work!\r\n\r\nIn 10-Minute Trainer, Tony put his most effective moves into a series of power-packed total-body workouts. His breakthrough Super Stacking Technique combines fat-burning cardio, body toning and sculpting, and ab moves, adding resistance bands for even faster results. In just 10 minutes of Tony's Super Stacking you can burn as many calories as 30 minutes of jogging. With 10-Minute Trainer, you have no more excuses!","torrent":{"xt":"urn:btih:5abc8aea21473ad72a7e52199424545c0f3286c7","amp;dn":"Beachbody+10+Minute+Trainer+Workout+%28HEVC+x265%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5abc8aea21473ad72a7e52199424545c0f3286c7","infoHashBuffer":{"type":"Buffer","data":[90,188,138,234,33,71,58,215,42,126,82,25,148,36,84,92,15,50,134,199]},"announce":[],"urlList":[]}}