{"title":"The Swarm by Frank Schatzing","uid":8346796,"size":1031984,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ae3fb591e5670847d81e9f3f06ab1589deaff06&amp;dn=The+Swarm+by+Frank+Schatzing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"NewSky000","files":2,"time":1365229330,"description":"Title: The Swarm\n\nAuthor: Frank Schatzing\n\nBook(s): 1\n\nFormat: eBook (.epub)\n\nAdditional Info: Readme File\n\n*Calibre is a great free tool for managing ebooks. Link: http://www.calibre-ebook.com/\n\nGenres: Sci-Fi, Thriller, Horror, Mystery\n\nSummary:\n\nFor more than two years, one book has taken over Germany's hardcover and paperback bestseller lists, reaching number one in Der Spiegel and setting off a frenzy in bookstores: The Swarm. Whales begin sinking ships. Toxic, eyeless crabs poison Long Island's water supply. The North Sea shelf collapses, killing thousands in Europe. Around the world, countries are beginning to feel the effects of the ocean's revenge as the seas and their inhabi-tants begin a violent revolution against mankind. In this riveting novel, full of twists, turns, and cliffhangers, a team of scientists discovers a strange, intelligent life force called the Yrr that takes form in marine animals, using them to wreak havoc on humanity for our ecological abuses. Soon a struggle between good and evil is in full swing, with both human and suboceanic forces battling for control of the waters. At stake is the survival of the Earth's fragile ecology -- and ultimately, the survival of the human race itself. The apocalyptic catastrophes of &quot;The Day After Tomorrow&quot; meet the watery menace of &quot;The Abyss&quot; in this gripping, scientifically realistic, and utterly imaginative thriller. With 1.5 million copies sold in Germany -- where it has been on the bestseller list without fail since its debut -- and the author's skillfully executed blend of compelling story, vivid characters, and eerie locales, Frank Schatzing's The Swarm will keep you in tense anticipation until the last suspenseful page is turned. - Goodreads Summary\n\nNote: Written by a German author, so please pardon grammatical differentiations and such. Recommendable for those who enjoy marine life and apocalyptic events. Enjoy!\n\nCompatibility: Most eReaders\n\nCovers: Yes\n\nMetadata: Yes\n\nAny requests? Concerns? Comments? Anything of the sort? Then plz view readme for support link.\n\n\nPlease seed and thanks for downloading!\n\n\n\nBy: MastermindTTA ~ Thanks for the support!","torrent":{"xt":"urn:btih:5ae3fb591e5670847d81e9f3f06ab1589deaff06","amp;dn":"The+Swarm+by+Frank+Schatzing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ae3fb591e5670847d81e9f3f06ab1589deaff06","infoHashBuffer":{"type":"Buffer","data":[90,227,251,89,30,86,112,132,125,129,233,243,240,106,177,88,157,234,255,6]},"announce":[],"urlList":[]}}