{"title":"Warhammer 40K 7th Tanith First and Only (2014 V2)","uid":10512470,"size":11439043,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b3904d733203080d38983b7679afba5599024f3&amp;dn=Warhammer+40K+7th+Tanith+First+and+Only+%282014+V2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Chaos_Seer","files":1,"time":1404863353,"description":"Welcome\n\nThis is the updated torrent for the 87 page Tanith First and Only fan codex!\n\nI have designed this to the high visual standard of 6e codecies and fully in line with 7e rules. It's fully formatted. It includes:\n\n - History of the Sabbat Worlds Crusades\n \n - A full force organization slot of units unique to the Tanith First and Only, set apart from choices in Codex: Astra Militarum. The changes to the Tanith First and Only vanilla list makes it so you don't even need to rely on special characters to have a completely different flavor of gameplay.\n \n - All your favorite characters and very specific, detailed and well-considered rules for their use. Many different kinds of character combinations to suit any players preferred style of play, from simple to complex.\n\n - Crusade allies - field Narmenian armour, Vitrian Dragoons, Phantine Thunderbolts and the Risen Saint herself!\n\nI hope you guys enjoy! I put a LOT of hard work into making this to a standard of excellence. I think I can safely say this is the BEST Gaunts Ghosts codex ever made.\t\n\nThe updated version has on top of the original version many, many fixed errors as well as some refined balancing to rules and pts costs throughout the army. If you have downloaded the original version, I highly suggest deleting it and re-downloading this one. On top of that it is 6 megs smaller!","torrent":{"xt":"urn:btih:5b3904d733203080d38983b7679afba5599024f3","amp;dn":"Warhammer+40K+7th+Tanith+First+and+Only+%282014+V2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b3904d733203080d38983b7679afba5599024f3","infoHashBuffer":{"type":"Buffer","data":[91,57,4,215,51,32,48,128,211,137,131,183,103,154,251,165,89,144,36,243]},"announce":[],"urlList":[]}}