{"title":"Pearl Jam - Ten [24 bit FLAC] vinyl","uid":8197754,"size":1225199145,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5b7ff094be743af3fa4e9de57c687f1035ac3ff1&amp;dn=Pearl+Jam+-+Ten+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"24.96","files":-1,"time":1361950856,"description":"  Pearl Jam - Ten (1991) [24 bit FLAC] vinyl\n\n  Released: 1991\n  Genre: Pop/Rock\n  Style: Alternative\n  Codec: FLAC\n  Bit Rate: ~ 3,000 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  01. Once (3:51)\n  02. Even Flow (4:53)\n  03. Alive (5:40)\n  04. Why Go? (3:19)\n  05. Black (5:44)\n  06. Jeremy (5:18)\n  07. Oceans (2:41)\n  08. Porch (3:30)\n  09. Garden (4:59)\n  10. Deep (4:18)\n  11. Release (5:20)\n  12. Master/Slave (3:39)\n\n  Nirvana's Nevermind may have been the album that broke grunge and alternative rock into the mainstream, but there's no underestimating the role that Pearl Jam's Ten played in keeping them there. Nirvana's appeal may have been huge, but it wasn't universal; rock radio still viewed them as too raw and punky, and some hard rock fans dismissed them as weird misfits. In retrospect, it's easy to see why Pearl Jam clicked with a mass audience -- they weren't as metallic as Alice in Chains or Soundgarden, and of Seattle's Big Four, their sound owed the greatest debt to classic rock. With its intricately arranged guitar textures and expansive harmonic vocabulary, Ten especially recalled Jimi Hendrix and Led Zeppelin. But those touchstones might not have been immediately apparent, since -- aside from Mike McCready's Clapton/Hendrix-style leads -- every trace of blues influence has been completely stripped from the band's sound. Though they rock hard, Pearl Jam is too anti-star to swagger, too self-aware to puncture the album's air of gravity. Pearl Jam tackles weighty topics -- abortion, homelessness, childhood traumas, gun violence, rigorous introspection -- with an earnest zeal unmatched since mid-'80s U2, whose anthemic sound they frequently strive for. Similarly, Eddie Vedder's impressionistic lyrics often make their greatest impact through the passionate commitment of his delivery rather than concrete meaning. His voice had a highly distinctive timbre that perfectly fit the album's warm, rich sound, and that's part of the key -- no matter how cathartic Ten's tersely titled songs got, they were never abrasive enough to affect the album's accessibility. Ten also benefited from a long gestation period, during which the band honed the material into this tightly focused form; the result is a flawlessly crafted hard rock masterpiece.","torrent":{"xt":"urn:btih:5b7ff094be743af3fa4e9de57c687f1035ac3ff1","amp;dn":"Pearl+Jam+-+Ten+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b7ff094be743af3fa4e9de57c687f1035ac3ff1","infoHashBuffer":{"type":"Buffer","data":[91,127,240,148,190,116,58,243,250,78,157,229,124,104,127,16,53,172,63,241]},"announce":[],"urlList":[]}}