{"title":"Structured Finance and Collateralized Debt Obligations: New Deve","uid":10426784,"size":5506715,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b9068bd3af43ebc64452b164ca07b5b466ba944&amp;dn=Structured+Finance+and+Collateralized+Debt+Obligations%3A+New+Deve&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1403714777,"description":"ABOUT THIS BOOK\nIn this fully updated Second Edition, financial expert Janet Tavakoli provides readers with a comprehensive look at the CDO and structured credit products market amid recent developments. In addition to a detailed overview of the market, this book presents key issues in valuing structured financial products and important quality control issues. Tavakoli shares her experiences in this field, as she examines important securitization topics, including the huge increase in CDO arbitrage created by synthetics, the tranches most at risk from new technology, dumping securitizations on bank balance sheets, the abuse of offshore vehicles by companies, the role of hedge funds, critical issues with subprime, Alt-A, and prime mortgage securitizations, and securitizations made possible by new securitization techniques and the Euro. While providing an overview of the market and its dynamic growth, Tavakoli takes the time to explore the types of products now offered, new hedging techniques, and valuation and risk/return issues associated with investment in CDOs and synthetic CDOs.\n\n\nTABLE OF CONTENTS\nPreface.\nAcronym Key.\n\nCHAPTER 1: Securitization Terminology.\n\nCHAPTER 2: Structured Finance and Special Purpose Entities.\n\nCHAPTER 3: Credit Derivatives and Total Rate of Return Swaps.\n\nCHAPTER 4: CDOs and the Global Capital Markets.\n\nCHAPTER 5: Risk and Valuation Issues.\n\nCHAPTER 6: Early CDO Technology.\n\nCHAPTER 7: Early Warning Commercial Financial Services.\n\nCHAPTER 8: Subprime and Alt-A Mortgages: Collateral Damage.\n\nCHAPTER 9: Cash versus Synthetic Arbitrage CDOs.\n\nCHAPTER 10: CDO Equity Structures.\n\nCHAPTER 11: CDO Managers.\n\nCHAPTER 12: Balance-Sheet CLOs and CDOs.\n\nCHAPTER 13: Super Senior Sophistry.\n\nCHAPTER 14: Synthetics and Mark-to-Market Issues.\n\nCHAPTER 15: Comments on Selected Structured Finance Products.\n\nCHAPTER 16: Credit Funds.\n\nCHAPTER 17: The Credit Crunch and CDOs.\n\nCHAPTER 18: Future Developments in Structured Finance.\n\nAPPENDIX: Interesting Web Sites.\n\nBibliography.\n\nIndex.\n\n\nABOUT THE AUTHOR\nJanet M.Tavakoli is the President of Tavakoli Structured Finance, a Chicago-based consulting firm to financial institutions, institutional investors, and hedge funds. She gave advance warning of major collapses regarding Long-Term Capital Management, First Alliance Mortgage, the thrift industry, and the current credit bubble. Business-Week's profile called Tavakoli &quot;The Cassandra of Credit Derivatives.&quot; She has over twenty years of experience trading, structuring, and marketing derivatives and structured products. Tavakoli is a former adjunct associate professor in the Finance Department of the University of Chicago's Graduate School of Business, where she taught derivatives. She is also the author of the first edition of Collateralized Debt Obligations and Structured Finance and Credit Derivatives and Synthetic Structures, now in its second edition. Tavakoli is frequently published and quoted in numerous financial publications including the Wall Street Journal, the Financial Times, BusinessWeek, Journal of Structured Finance, Derivatives Week, and many others. She also appears frequently on CNN, CNBC, CBS Evening News, Bloomberg TV, and First Business Morning News.","torrent":{"xt":"urn:btih:5b9068bd3af43ebc64452b164ca07b5b466ba944","amp;dn":"Structured+Finance+and+Collateralized+Debt+Obligations%3A+New+Deve","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b9068bd3af43ebc64452b164ca07b5b466ba944","infoHashBuffer":{"type":"Buffer","data":[91,144,104,189,58,244,62,188,100,69,43,22,76,160,123,91,70,107,169,68]},"announce":[],"urlList":[]}}