{"title":"Dune 1984 The Complete Saga Fanedit by Michael Warren x264 480p","uid":12311438,"size":1607795595,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5bf9d2d0b2638d70d8cf86becbc0e228dbf77fb5&amp;dn=Dune+1984+The+Complete+Saga+Fanedit+by+Michael+Warren+x264+480p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":null,"files":3,"time":1440923453,"description":"Note from the original uploader:\n\nI made four changes (mostly technical) to the version posted by Michael Warren.\n\n1. I downloaded the 3.77GB version that is at 1080p29.97. Yes that's right 29.97 fps. I have reduced the framerate back to 23.976.\n2. Warren's titles (&quot;Book 1&quot; ... &quot;3&quot;) fell outside the aspect ratio. I have moved the text without resizing it into the 2.35:1 aspect ratio.\n3. I downscaled the video to 480p (because frankly it is not even near 1080p quality - in fact even the Bluray downscaled to 480p is better quality). With that said it's still decent video quality.\n4. I removed David Lynch's name from the credits and replaced it with Alan Smithee (director) and Judas Booth (screenplay). Lynch has disowned the film he does not want his name in the credits, especially in a version that is based on the TV cut of the film. I understand that Warren chose to leave Lynch's name in the edit but I think that was an oversight and I couldn't let it slide. It isn't a statement of the quality of this fanedit, it's just my belief that Lynch would not approve of this edit any more than the TV edit.\n\nAudio is untouched\n\n----------------------------------------------\n\nInfo from editor:\n\nThis 3 hour version of David Lynch's Dune (1984) integrates footage from the original Theatrical Cut, the Extended TV Cut, and deleted scenes to make the most complete version of the film as of 2012. I have done this as a labor of love to give fans of this under-appreciated gem an alternative version to the two flawed cuts currently available on the DVD.\n\nI only acted as a fan editor and did not originate the content of this movie. MCA Universal and its associated parent companies own all rights to this material. They have released a beautiful Blu-Ray and DVD of David Lynch's classic movie, which I highly recommend you buy to demonstrate to the studio that there is market for this movie to be fully restored one day, ideally with a new master cut of the film to restore as much of the story as possible with the utmost attention to detail that I could never hope to match in this good-spirited fan effort.\n\nViewers will notice the footage from David Lynch's Theatrical Cut is expertly edited, color corrected, and sound designed better than the far poorer extended TV Cut, which was originally created without the director's authorization or oversight when the movie was prepared to air as a reconstructed mini-series for television in the late 1980's.\n\nFor this reason, the elements culled from the extended TV cut are inferior, more poorly edited, not color corrected well, and are lacking certain basic special effects (such as the Fremen's lack of blue eyes). The sound design was also of poorer quality in the TV cut, which was was particularly egregious since this film's original sound editing and design were nominated for the Oscar.\n\nIf I had the resources, time, and equipment necessary to correct these issues in a thorough re-edit of the original material, then I would gladly do so. And I would offer my services to MCA Universal free of charge to help see the project come to fruition.\n\nAs is, I only had the material available on the DVDs to work with, and used the most basic of editing software suites available. For this reason, this particular cut of the film is unavoidably choppy and rough at times. But I meticulously reconstructed Dune with nearly all the available footage of the film, with an entirely new structure differing from both the Theatrical and Extended TV Cuts to better preserve story continuity and improve the dramatic flow.\n\nDavid Lynch's efforts in bringing this film to life have been often criticized in the past, and I believe is his most unfairly maligned film. My only intention in creating this cut of Dune (1984) is to show a sliver more of his amazing directorial efforts and show more of what the film could have been were it given more time to run than the too short Theatrical Cut and if it had been edited with just a bit more care when it was released as a mini-series. Thank you.\n\nI also created an original trailer for Dune, which you can find here:\n\n- Michael Warren\n\n----------------------------------------------\n\nThe trailer is included in this torrent.\n\nTechnical:\n\n\nRuntime: 03:03:08\n\nVideo: 720 x 480 16:9 (2.35:1)\nFramerate: 23.976\nFormat: x264\nBit rate: 0.91 Mbps\n\nAudio:\nFormat: AAC 48000Hz 2.0\nBit rate: 258 Kbps","torrent":{"xt":"urn:btih:5bf9d2d0b2638d70d8cf86becbc0e228dbf77fb5","amp;dn":"Dune+1984+The+Complete+Saga+Fanedit+by+Michael+Warren+x264+480p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bf9d2d0b2638d70d8cf86becbc0e228dbf77fb5","infoHashBuffer":{"type":"Buffer","data":[91,249,210,208,178,99,141,112,216,207,134,190,203,192,226,40,219,247,127,181]},"announce":[],"urlList":[]}}