{"title":"House Season 1","uid":3678082,"size":8049299456,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5c41f4441a5f5530c43cb96abc5fdfae33e8625d&amp;dn=House+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":4,"uploader":"joyvandruff","files":22,"time":1178045663,"description":"Season 1 \n\n--------------------------------------------------------------------------------\n\nSeason 1, Episode 1: Pilot\nOriginal Air Date: 16 November 2004\nYoung kindergarten teacher Rebecca Adler collapses in her classroom after uncontrolled gibberish slips out of her mouth while she is about to teach students.\n\n\nSeason 1, Episode 2: Paternity\nOriginal Air Date: 23 November 2004\nThe team help a high school boy (16) who has double vision and night terrors. (Clinic Cases: Unvaccinated baby, man with boil on leg.)\n\n\nSeason 1, Episode 3: Occam&amp;#039;s Razor\nOriginal Air Date: 30 November 2004\nA college boy whose low blood pressure does not respond with IV fluids piques House&amp;#039;s curiosity. Clinic Cases: A woman who had a cold last week, man with a sore throat, woman whose leg hurts after running 6 miles, a boy and his MP3 Player.\n\n\nSeason 1, Episode 4: Maternity\nOriginal Air Date: 7 December 2004\nA nightmare scenario hits Princeton Plainsboro when babies in the maternity ward are hit by a potentially fatal epidemic. Clinic Cases: Woman with a parasite!\n\n\nSeason 1, Episode 5: Damned If You Do\nOriginal Air Date: 14 December 2004\nDr. House&amp;#039;s approach raises questions when he treats a nun for what he believes to be an allergy, not realizing that her past is coming back to haunt her.\n\n\nSeason 1, Episode 6: The Socratic Method\nOriginal Air Date: 21 December 2004\nWhen it appears that Lucy Palmeiro, a schizophrenic mom with deep vein thrombosis, is lying about her alcohol intake, Dr. House is the lone voice of reason. Under the scrutiny of her hyper-vigilant teenage son, House takes Lucy off all her medication and secretly sends Foreman and Chase to search her apartment for clues.\n\n\nSeason 1, Episode 7: Fidelity\nOriginal Air Date: 28 December 2004\nA woman comes down with symptoms of African sleeping sickness, but there seems to be no way she could have contracted it. House and his aides must ask a few tough questions and make some tough decisions in order to try to save her.\n\n\nSeason 1, Episode 8: Poison\nOriginal Air Date: 25 January 2005\nA high school boy has hallucinations and collapses during an exam. When he does not respond to treatments, and the normal tests are negative Foreman presents the case to House. Clinic Cases: A happy old lady.\n\n\nSeason 1, Episode 9: DNR\nOriginal Air Date: 1 February 2005\nA famous and paralyzed jazz musician has trouble breathing and passes out during a session, but it is his unexplained paralysis that concerns him most. The team&amp;#039;s job is made more complicated by a DNR order that House thinks is a mistake. Clinic Cases: A diabetic man in denial.\n\n\nSeason 1, Episode 10: Histories\nOriginal Air Date: 8 February 2005\nA homeless woman collapses at an illegal rave house. Foreman blows off the consult that Wilson asks for, and House is intrigued by Foreman&amp;#039;s and Wilson&amp;#039;s reactions. Clinic Cases: A mother with lots of kids; House pretends to be ill so he ends up teaching med students about taking histories.\n\n\nSeason 1, Episode 11: Detox\nOriginal Air Date: 15 February 2005\nA girl crashes a Porsche after her boyfriend starts coughing up blood and continues to have unexplained bleeds. Clinic Cases: Cuddy give House a month off clinic duties if he can spend a week off his pain meds.\n\n\nSeason 1, Episode 12: Sports Medicine\nOriginal Air Date: 22 February 2005\nA detoxed sports star about to make his comeback breaks his arm due to brittle bones. Clinic Cases: Woman with leg pain; man trying to remove his contact lenses; a dentist with various issues and a hung over teenager; all in 70 seconds.\n\n\nSeason 1, Episode 13: Cursed\nOriginal Air Date: 1 March 2005\nA young boy has a fever for over a week after a Ouija board predicts he will die. Clinic Cases: Chase&amp;#039;s case of a man with numb fingers.\n\n\nSeason 1, Episode 14: Control\nOriginal Air Date: 15 March 2005\nCould House save a high powered female executive from the same problem that left him in constant pain? A new head of the hospital board could cause problems. Clinic Cases: A boy and his mute dad.\n\n\nSeason 1, Episode 15: Mob Rules\nOriginal Air Date: 22 March 2005\nA Mob informer collapses before trial. Is he faking or is he really in a coma? Clinic Cases: A pair of brothers come in when the youngster gets toys stuck up his nose.\n\n\nSeason 1, Episode 16: Heavy\nOriginal Air Date: 29 March 2005\nA morbidly obese ten-year-old girl has a heart attack, and her mother insists that House and his team look past her weight to find the diagnosis. Meanwhile, Vogler pressures House to fire a member of his staff. Clinic Patients: Unidentified man with an infected pierced scrotum; overweight woman with a 30-pound tumor on her ovaries who refuses to have it removed, because she worries she will be unattractive.\n\n\nSeason 1, Episode 17: Role Model\nOriginal Air Date: 12 April 2005\nHouse treats a Black presidential candidate, whom House is convinced has AIDS, but the Senator&amp;#039;s passion convinces him otherwise. Also, Vogler forces House to give a speech endorsing a new drug from Vogler&amp;#039;s company, but House has plans of his own.\n\n\nSeason 1, Episode 18: Babies &amp; Bathwater\nOriginal Air Date: 19 April 2005\nWhile House and his team scramble to discover what&amp;#039;s causing brain and kidney dysfunction in a pregnant woman, Vogler is on the warpath to get House fired.\n\n\nSeason 1, Episode 19: Kids\nOriginal Air Date: 3 May 2005\nDuring an meningitis outbreak which overwhelms the clinic, House is drawn to a single patient: a 12-year-old competitive diver whose symptoms don&amp;#039;t quite match everyone else&amp;#039;s.\n\n\nSeason 1, Episode 20: Love Hurts\nOriginal Air Date: 10 May 2005\nHouse apparently triggers a stroke in a clinic patient, but the major topic of discussion is House&amp;#039;s imminent date with Cameron. The team must deal with the patient&amp;#039;s odd lifestyle, overbearing &quot;friend&quot;, and reluctant parents in order to stop the strokes and try to save his life.\n\n\nSeason 1, Episode 21: Three Stories\nOriginal Air Date: 17 May 2005\nHouse&amp;#039;s ex Stacy Warner asks him to treat her husband. House takes over a diagnostics class for a day and presents the class with three case studies of leg pain. As House tells his story and the class gradually fills up with listeners, the class learns a lot about how to be better doctors, and Chase, Foreman and Cameron learn some important details of House&amp;#039;s past.\n\n\nSeason 1, Episode 22: The Honeymoon\nOriginal Air Date: 24 May 2005\nIn the season one finale, House doses his ex-girlfriend&amp;#039;s husband in order to get him into hospital after she begs House to treat him. Is House treating Mark differently in order to get back at Stacy for his leg?\n","torrent":{"xt":"urn:btih:5c41f4441a5f5530c43cb96abc5fdfae33e8625d","amp;dn":"House+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c41f4441a5f5530c43cb96abc5fdfae33e8625d","infoHashBuffer":{"type":"Buffer","data":[92,65,244,68,26,95,85,48,196,60,185,106,188,95,223,174,51,232,98,93]},"announce":[],"urlList":[]}}