{"title":"Corel Digital Studio 2010 Multilingual","uid":5080220,"size":1351039797,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5c912d59d990b732460eb980aa02be3a14080c8b&amp;dn=Corel+Digital+Studio+2010+Multilingual&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"extremezone","files":-1,"time":1252234035,"description":"Corel Digital Studio 2010 Multilingual\n\n\nOperating Systems: Windows XP, Windows Vista, Windows 7\nLanguages: EN, FR, IT, DE, ES, NL, JP, CT\n\nIntroducing Corel Digital Studio 2010, the PC's first fully\nintegrated multimedia software for today's digital lifestyle\nPhoto editing, video editing, DVD burning, DVD playback and\ncreative projects. All the applications you need in one box - and\nthey all work together!\n\nMake every picture perfect with Corel Digital Studio's easy\ntouch-up tools and fun effects. The best photo-editing software\nfor beginners, it helps you turn your ordinary photos into\nstunning keepsakes you'll be proud to share. Fix common problems\nlike red-eye and color in seconds. Add artistic photo edges and\npicture frames with a single click. Play with cool effects to give\nyour photos more impact. Then share your photos with friends and\nfamily any way you like. Print them, put them online or create\nprofessional-looking DVDs - all right from the suite\n\nLooking for a simple way to clean up and share your videos?\nDigital Studio's video-editing software turns your home video into\na quality movie in just minutes. Just choose the video clips\nphotos and music you want to use, pick a movie style, then sit\nback and watch as Digital Studio adds Hollywood-style openings\ntransitions and credits to create a polished movie. It practically\nmakes itself! So grab your family and friends, and get ready to\nrelive your favorite moments over and over again\n\nBy combining the easiest photo-editing and video-editing software\nwith the fastest DVD burning tools you'll ever use, Corel Digital\nStudio wraps all your multimedia software into one great\nexperience. Now you can preserve and share your movies, music\nphotos and TV shows any way you like - all from the same suite you\nused to create them. Digital Studio's DVD Factory helps you create\nprofessional-quality DVDs in just minutes, complete with\nHollywood-style menus and special effects\n\nWatch your favorite movies in true cinematic style with Digital\nStudio's WinDVD - the world's #1 video and DVD player software\nWhether you're sitting in your home theater or taking the show on\nthe road with your laptop, WinDVD makes your movies look and sound\nsuperior. Heighten your viewing experience with one-click\nHollywood-quality color enhancements. Add immersive surround sound\neffects. Plus, enjoy the latest digital technologies, including\nWindows 7 touch-screen features and full AVCHD support\n\nThe Corel Digital Studio multimedia suite includes:\n* PaintShop Photo Express 2010 - easy photo-editing software\n* VideoStudio Express 2010 - simple video-editing software\n* DVD Factory 2010 - one-stop DVD burning and converting software\n* WinDVD 2010 - the world's best video and DVD player software\n\n\n","torrent":{"xt":"urn:btih:5c912d59d990b732460eb980aa02be3a14080c8b","amp;dn":"Corel+Digital+Studio+2010+Multilingual","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c912d59d990b732460eb980aa02be3a14080c8b","infoHashBuffer":{"type":"Buffer","data":[92,145,45,89,217,144,183,50,70,14,185,128,170,2,190,58,20,8,12,139]},"announce":[],"urlList":[]}}