{"title":"[HandsOnHardcore / DDFNetwork] Christen Courtney aka Christen (R","uid":14236821,"size":229536715,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5c9b3f913ccfc5a06362fcd57719e1a911d883d9&amp;dn=%5BHandsOnHardcore+%2F+DDFNetwork%5D+Christen+Courtney+aka+Christen+%28R&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"UniX","files":1,"time":1460098688,"description":"[HandsOnHardcore / DDFNetwork] Christen Courtney aka Christen (Ready To Order? - Intense Double Penetration For Dinner) SD **NEW APRIL 8,2016**\r\n\r\nSCREENS;\r\n \nhttp://imgurx.net/share-C825_5707372B.html\r\n \nhttp://imgurx.net/share-ADE7_5707372B.html\r\n\r\nWhen Thomas Stone and Mugur ask Christen Courtney aka Christen if she is ready to order, the scene quickly heats up and turns into an intense double penetration threesome for dinner! The blonde sex goddess sits on the couch and waits for the two studs to get ready. When both sit down next to her, the tantalizing attraction becomes rampant. Within seconds, Mugur licks her right nipple and sucks in that tasty natural tit while Thomas satisfies her other lovely boob. The two men massage her clit and start fingering her box while she gives Mugur a blowjob and wanks the Stone cock with her hand, while sitting on him! A few moments later, that hard rod slides into her wet box and the sexy young babe spreads her legs wide open to receive Mugur’s dong as well! Thomas shifts his rod up her butthole for some ass fucking, while Mugur bangs her snatch from above. The intense double penetration leads to one orgasm after the other and Christen can’t wait to get fucked doggy style while blowing Mugur’s boner! They switch position and it’s Mugur’s turn to cram her tight anus with his thick prick. The dirty blonde helps him come by squeezing his hard cock with her strong hands until he blow a fat load of jizz all over her butt crack! The athletic hottie then blows Thomas and fills up her mouth with his juice, when the scene comes to an end","torrent":{"xt":"urn:btih:5c9b3f913ccfc5a06362fcd57719e1a911d883d9","amp;dn":"%5BHandsOnHardcore+%2F+DDFNetwork%5D+Christen+Courtney+aka+Christen+%28R","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c9b3f913ccfc5a06362fcd57719e1a911d883d9","infoHashBuffer":{"type":"Buffer","data":[92,155,63,145,60,207,197,160,99,98,252,213,119,25,225,169,17,216,131,217]},"announce":[],"urlList":[]}}