{"title":"Railworks TS2016 DTG Mosel Valley Koblenz -Trier Route Add-On","uid":13170281,"size":1327640658,"categoryP":"porn","categoryS":"games","magnet":"?xt=urn:btih:5cf656eca88fb38f20016b9c53ffbf5ad3e0fb42&amp;dn=Railworks+TS2016+DTG+Mosel+Valley+Koblenz+-Trier+Route+Add-On&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"TS2015","files":1,"time":1452239043,"description":"One of Germany’s most beautiful and romantic landscapes, and one of Europe’s most charming river valleys, the Mosel Valley, is the location for the Aerosoft’s latest route for Train Simulator, the Mosel Valley (Koblenz-Trier). \r\n\r\nThis stunning river valley spreads across north-eastern France, south-western Germany and eastern Luxembourg, and is most famous for its spectacular scenery, wine industry and 113km (70 mile) rail line, first opened more than 130 years ago. \r\n\r\nAs part of the Kanonenbahn (Cannons Railway), the Koblenz to Trier line was built between 1874 and 1879 and has been operated by various state railways, including the Saarbrücken Railway, Deutsche Reichsbahn, Deutsche Bundesbahn and most recently, the Deutsche Bahn. \r\n\r\nDeparting Koblenz Hauptbahnhof, the line is quick to cross the Mosel River for the first at the Gülser Bridge, shortly after Moselweiß, which itself is home to a large freight yard. The line then follows the left bank of the Mosel to Cochem, all the while passing well-known wine villages such as Winningen and Löf. \r\n\r\nAfter Cochem, the line runs through the most important structure found on the route, the Kaiser Wilhelm Tunnel – at 4,205 metres long, it was once Germany’s longest railway tunnel until 1985. \r\n\r\nAfter the Kaiser Wilhelm Tunnel, the line once again crosses the Mosel River near Ediger-Eller on a 281 metre long, five-span steel plate girder bridge. From Bullay, trains cross the well-known dual deck bridge and then the railway viaduct near Pünderich. It is here where the route branches off towards Traben-Trarbach, while the main route leaves the Mosel Valley and proceeds to Trier through to Wittlich. \r\n\r\nJust a short distance from Trier, the route meets the Mosel River for the penultimate time, before passing Ehrang with its large depot and goods station, Pfalzel and finally Trier, where a large industrial area and harbour dominate the landscape. \r\n\r\nThe route today is heavily used by freight traffic crossing Germany onto their final destinations across Europe. A major freight user is the continual flow of heavy iron ore trains from the North Sea ports to the Dillinger Hütte steelworks in the Saarland. Regionalbahn and Regional-Express trains form the majority of passenger trains and until 2014, InterCity services from Trier to Berlin. \r\n\r\nIncluded in the Mosel Valley (Koblenz-Trier) route for Train Simulator, developed by Aerosoft, is the BR 189 electric locomotive in DB livery and a BR 628/928 diesel railcar\r\n\r\n\r\n\r\nTHIS ADDON WILL WORK ON LEGIT AND PIRATED VERSION OF TRAIN SIMULATOR 2015!!!","torrent":{"xt":"urn:btih:5cf656eca88fb38f20016b9c53ffbf5ad3e0fb42","amp;dn":"Railworks+TS2016+DTG+Mosel+Valley+Koblenz+-Trier+Route+Add-On","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cf656eca88fb38f20016b9c53ffbf5ad3e0fb42","infoHashBuffer":{"type":"Buffer","data":[92,246,86,236,168,143,179,143,32,1,107,156,83,255,191,90,211,224,251,66]},"announce":[],"urlList":[]}}