{"title":"The Crisis Of Civilization (2011) 720p 2ch","uid":11730800,"size":1257848857,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:5d89db3a4062396a44ebb0309404596009a44696&amp;dn=The+Crisis+Of+Civilization+%282011%29+720p+2ch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bsg4you","files":3,"time":1425397391,"description":"The.Crisis.Of.Civilization.2011.720p.2ch.mp4\n\nThe Crisis of Civilization (2011) \nvideo: 1280x720 AVC 2000Kbps 2-pass/turbo preset=9(very slow)\naudio: 2.0 AAC 160Kbps\n1hour17min29sec 1,257,785,618bytes\nIMDB 7.8 http://www.imdb.com/title/tt1970039/  \n\nIMDB:\nThe Crisis Civilization is a documentary feature film investigating how global crises like ecological disaster, financial meltdown, dwindling oil reserves, terrorism and food shortages are converging symptoms of a single, failed global system. Proving that 'another world' is not merely possible, but on its way.\n\nWIkipedia:\nThe Crisis Of Civilization, based on the book of the same name by Nafeez Mosaddeq Ahmed. Which was exhibited at film festivals around the world including the Leeds International Film Festival who selected the film as a 'Festival Favourite' calling it &quot;a powerful critique of a failed global system and a manifesto for constructive social change.&quot; It has also been broadcast on television in conjunction with the distributor Mercury Media including a three-week run on Link TV in the USA. Renowned documentary filmmaker Nick Broomfield said that it was &quot;A unique film. Everyone should see it..&quot;\nThe Crisis of Civilization has been received positively by viewers. Hitcham Yezza, editor of Ceasefire Magazine, found &quot;the film's aesthetic delightful, the result of film-maker Dean Puckett and animator Lucca Benney's artful concoction of clips from 40s commercials, B-movies, quirky animation, and more familiar images of Bush, Bin Laden and Brzezinski.&quot; He also wrote, &quot;this film is necessary viewing, not just for activists but for anyone who's planning to hang around this planet for the foreseeable future. Yes, I'm looking at you.&quot; Elsewhere, Richard Heinberg of the Post Carbon Institute said of the film, &quot;a really fantastic overview of the global situation. I don't think I've seen a more comprehensive 'welcome to the 21st century'&quot;. The Leeds International Film Festival selected the film as a 'Festival Favourite' calling it &quot;a powerful critique of a failed global system and a manifesto for constructive social change&quot;.\n\nAwards:\nPortobello Film Festival (Best Director)\nLondon Independent Film Festival (Best UK Documentary)\n\nPlease check out other posts of documentaries, Rifftrax, Star Trek Enterprise, Battlestar Galactica, DC Comics and more at:\n &lt;a href=&quot; https://thepiratebay.se/user/bsg4you/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/bsg4you/&lt;/a&gt;  \n &lt;a href=&quot; https://kickass.so/user/bsg4you/uploads/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://kickass.so/user/bsg4you/uploads/&lt;/a&gt;  \nand leave any corrections, criticism, comments and requests.\n\nThanks, bsg4you","torrent":{"xt":"urn:btih:5d89db3a4062396a44ebb0309404596009a44696","amp;dn":"The+Crisis+Of+Civilization+%282011%29+720p+2ch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d89db3a4062396a44ebb0309404596009a44696","infoHashBuffer":{"type":"Buffer","data":[93,137,219,58,64,98,57,106,68,235,176,48,148,4,89,96,9,164,70,150]},"announce":[],"urlList":[]}}