{"title":"Jesus Walks.   Kanye West","uid":7852878,"size":4654173,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5da04e958afd5c1ff61bdb34bc3a147e9d487ebe&amp;dn=Jesus+Walks.+++Kanye+West&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"fempo","files":-1,"time":1353664496,"description":" &lt;a href=&quot;http://mp3skull.com/mp3/jesus_walks.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://mp3skull.com/mp3/jesus_walks.html&lt;/a&gt;\n\n\nThe song is essentially a spiritual exultation, wherein West discusses how Jesus &quot;walks&quot; with all manner of people, from the sinner to the saint. Towards this end, the first conceptual verse of the song is told through the eyes of a drug dealer contemplating his relationship with God. It reportedly took over six months for West to draw inspiration for the second verse.[3][4] West also uses the song to express his critical views on how the media seem to shy away from songs that address matters of faith, while embracing songs discussing violence, sex, and illegal drugs. He rhymes, &quot;So here go my single, dog, radio needs this/They say you can rap about anything except for Jesus/That means guns, sex, lies, video tapes/But if I talk about God my record won't get played, huh?&quot; This is directly taken from West's experiences when he was struggling to get signed onto a record label; many executives turned him down after he played a &quot;Jesus Walks&quot; demo for them.[5] They reasoned that he did not conform to the stereotypes associated with mainstream hip-hop and therefore was not easily marketable. Many of his friends in the music industry also warned him that while the song was outstanding, it would never make it to radio","torrent":{"xt":"urn:btih:5da04e958afd5c1ff61bdb34bc3a147e9d487ebe","amp;dn":"Jesus+Walks.+++Kanye+West","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5da04e958afd5c1ff61bdb34bc3a147e9d487ebe","infoHashBuffer":{"type":"Buffer","data":[93,160,78,149,138,253,92,31,246,27,219,52,188,58,20,126,157,72,126,190]},"announce":[],"urlList":[]}}