{"title":"Bliss: Season 3 (2004, Canadian TV anthology)","uid":6271873,"size":2101828930,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5dce7fc546f59e7d5e59d291423da6c8197f41d2&amp;dn=Bliss%3A+Season+3+%282004%2C+Canadian+TV+anthology%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":4,"uploader":"Albeda74","files":-1,"time":1301131950,"description":"This is the third and final season of Bliss, originally aired in 2004.\n\nBliss is a Canadian erotic anthology TV series, adapting short stories written by women, and directed by women. Like a true anthology series, the episodes are completely standalone, with no continuing characters (or even themes beyond simple erotica). Each season contains eight episodes.\n\nThe series is unique in one regard: unlike other erotic TV series, Bliss was designed for, and aired on, network TV (and basic cable in America); naughty modesty is the aim of the show, with no content that would be considered pornographic. Created in Canada, the show meets the broadcast standards of Canadian TV, with brief toplessness being shown occasionally; Oprah Winfrey's Oxygen Network aired the show in the US.\n\nThe original broadcast order for season three is as follows:\n\n1. &quot;Tango&quot; 15 February 2004 - Guest stars: Larissa Gomes, Victor Gomez\n2. &quot;Penelope and Her Suitors&quot; 23 February 2004 - Guest stars: Stephanie Morgenstern, Sebastian Spence\n3. &quot;Tying Up Gerald&quot; 1 March 2004 - Guest stars: Shary Guthrie, Peter Wingfield, Katya Gardner\n4. &quot;Badness&quot; 8 March 2004 - Guest stars: Zoie Palmer, Jason Pollard, Andrew Airlie\n5. &quot;Amazon&quot; 15 March 2004 - Guest stars: Jessica Greco, James Gallanders\n6. &quot;The Arrangement&quot; 22 March 2004 - Guest stars: Pamela Sinha, Cas Anvar\n7. &quot;Les Petits Mots&quot; 29 March 2004 - Guest stars: Patricia McKenzie, Michel Francoeur\n8. &quot;Steph's Life&quot; 5 April 2004 - Guest stars: Robin BrÃƒÂ»lÃƒÂ©, Allan Hawco\n\nEach episode is encoded as a separate MKV file, with full episode title. Episode number was not placed in the filename, as the Canadian broadcast order, US airing order, and DVD order all differ... and as an anthology series, this is one case where it doesn't matter in which order you watch the show.\n\nSeeding on basic DSL, so this one will take a while to fully seed. Please be patient with me!\n\nThat said...\n\nI'm going to be interested to see how popular this season is in relation to the prior two. The series seems to be mostly known/notorious for the lesbian content of the first-season episode &quot;Leaper.&quot; Since the series avoids graphic material, preferring suggestiveness, the gauzy girl/girl scene in that episode seemed for many to be an attempt to pander to male fantasy, rather than being the woman-friendly erotica originally promised. Criticism was also made of the relative &quot;safety&quot; of that first season, questioning why the stories were mostly about relatively normal topics.\n\nThe seasons are short, however, and if season one seemed to avoid some topics, those questions and concerns were answered in seasons two and three. Episode titles like &quot;Three&quot; or &quot;Tying Up Gerald&quot; give some idea of their themes, multiracial relationships are shown... and, since it's a Canadian series, they finally worked in some ice hockey in &quot;Amazon.&quot; Girl/girl scenes tapered off, and the third season had none whatsoever. Overall, the three seasons explore a number of topics, and represent an interesting collection of short tales of both safe and slightly kinky erotica.\n\nOf course, the popularity of the series dropped off dramatically after the first season; critics were right, after all-- the girl/girl scenes in &quot;Leaper&quot; really had drawn a lot of interest from the male demographic, but that viewership left shortly after. (It's notable that three episodes contain lesbian content, but only &quot;Leaper&quot; is listed in 'The Encyclopedia of Lesbian Movie Scenes,' attesting to its appeal to male viewers.) That pattern seems to have carried over to the torrents; looking at availability statistics on my client, &quot;Leaper&quot; is the most popular file in season one, and season one had more downloads in the first three days than season two has had in a week.\n\nSeason three, both in original broadcast and on DVD, seems to be almost an afterthought to viewers, who seem surprised to know that it exists. I'll be really curious to see how this one stacks up in comparison to the previous two...","torrent":{"xt":"urn:btih:5dce7fc546f59e7d5e59d291423da6c8197f41d2","amp;dn":"Bliss%3A+Season+3+%282004%2C+Canadian+TV+anthology%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dce7fc546f59e7d5e59d291423da6c8197f41d2","infoHashBuffer":{"type":"Buffer","data":[93,206,127,197,70,245,158,125,94,89,210,145,66,61,166,200,25,127,65,210]},"announce":[],"urlList":[]}}