{"title":"Lonely Planet - Estonia, Latvia and Lithuania (2016) Gooner","uid":14739563,"size":54099064,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5df25110a3fc2c604e9ce3cfe4d64bbca278898a&amp;dn=Lonely+Planet+-+Estonia%2C+Latvia+and+Lithuania+%282016%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1464659984,"description":"Lonely Planet - Estonia, Latvia &amp; Lithuania (Travel Guide) - 7th Edition (2016).pdf Gooner\r\n\r\nPublisher: Lonely Planet; 7 edition (13 May 2016)\r\nLanguage: English\r\nISBN-10: 174220757X\r\nISBN-13: 978-1742207575\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nLonely Planet Estonia, Latvia &amp; Lithuania is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Soak up history in Estonia's Old Towns, enjoy a midsummer bonfire and beer in Lithuania and take a traditional sauna and spa in Latvia; all with your trusted travel companion. Get to the heart of Estonia, Latvia &amp; Lithuania and begin your journey now!\r\n\r\nInside the Lonely Planet Estonia, Latvia &amp; Lithuania Travel Guide:\r\n\r\n* Colour maps and images throughout\r\n\r\n* Highlights and itineraries help you tailor your trip to your personal needs and interests\r\n\r\n* Insider tips to save time and money and get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices\r\n\r\n* Honest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss\r\n\r\n* Cultural insights give you a richer, more rewarding travel experience - history, people, landscape, architecture, greetings, etiquette\r\n\r\n* Over 70 maps\r\n\r\n* Covers Estonia, Tallinn, Lahemaa National Park, Rakvere, Narva, Tartu, Valga, Muhu, Saaremaa, Helsinki, Latvia, R?ga, Kurzeme, J?rmala, Kemeri National Park, Talsi, Lithuania, Vilnius, Paneriai, Trakai, Kalingrad and more\r\n\r\nThe Perfect Choice: Lonely Planet Estonia, Latvia &amp; Lithuania, our most comprehensive guide to the region, is perfect for both exploring top sights and taking roads less travelled.\r\n\r\n* Looking for more extensive coverage? Check out Lonely Planet Eastern Europe for a comprehensive look at all these countries have to offer\r\n\r\nAuthors: Written and researched by Lonely Planet.\r\n\r\nAbout Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveller community. Lonely Planet covers must-see spots but also enables curious travellers to get off beaten paths to understand more of the culture of the places in which they find themselves.\r\n\r\nTripAdvisor Travelers' Choice Awards winner in Favorite Travel Guide category for 2012, 2013, 2014 and 2015","torrent":{"xt":"urn:btih:5df25110a3fc2c604e9ce3cfe4d64bbca278898a","amp;dn":"Lonely+Planet+-+Estonia%2C+Latvia+and+Lithuania+%282016%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5df25110a3fc2c604e9ce3cfe4d64bbca278898a","infoHashBuffer":{"type":"Buffer","data":[93,242,81,16,163,252,44,96,78,156,227,207,228,214,75,188,162,120,137,138]},"announce":[],"urlList":[]}}