{"title":"Eric Rohmer -- CONTE DE PRINTEMPS (1990)","uid":3792016,"size":1041558900,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5e5d003247848999d52ae049d3f83a38597cece1&amp;dn=Eric+Rohmer+--+CONTE+DE+PRINTEMPS+%281990%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ceroklis","files":4,"time":1188676938,"description":"Eric Rohmer -- CONTE DE PRINTEMPS (1990)\n\n\nFile Size (in bytes) ..: 1041398667\nRuntime (# of frames) .: 01:42:41 (154,048 frames)\n\nVideo Codec ...........: H264\nFrame Size ............: 720x576\nFPS ...................: 25\nVideo Bitrate .........: 1352 kb/s\n\nAudio Codec ...........: AAC\nSample Rate ...........: 48000 Hz\nAudio bitrate .........: 128 kb/s 2 channels CBR audio\nNo. of audio streams ..: 1\n\n\nJeanne, a charming woman in her thirties, meets Natasha, a college student at a party and they strike up an unlikely friendship Bored with the party, they return to Natasha&amp;#039;s apartment in Paris where her father&amp;#039;s frequent absence allows her to invite Jeanne to stay for a week. While some thoughts may run to deviance or intrigue, A Tale of Springtime is Eric Rohmer territory and that means sparkling conversation, complex characters, and a slowly unfolding plot in which everyone discovers something new about themselves. Springtime is the first of Rohmer&amp;#039;s Four Seasons series and, while we may not always be sure where we are going, we are always sure that there is an artist in firm control.\n\nBoth Jeanne and Natasha are smart and well spoken but each seems vaguely dissatisfied with their life. Jeanne (Anne Teyssedre), a philosophy teacher in high school, has lent her apartment to her cousin but refuses to stay at her boyfriend&amp;#039;s place because of his inclination toward disorder and cannot quite come to terms with the question of whether or not she is in love with him. Natasha (Florence Darel) is a very talented pianist with romance and matchmaking on her mind; however, she is resentful of her divorced father&amp;#039;s girlfriend Eve (Eloise Bennett), and has some serious thoughts about lining her father Igor (Hugues Quester) up with Jeanne.\n\nOutwardly sweet but inwardly manipulative, Natasha suspects that Eve has stolen a family necklace that her father promised to her and tells the story to Jeanne, hoping to turn the teacher against her father&amp;#039;s lover. When Igor shows up for a rare family dinner, all four participate in a philosophical conversation that leads to a clash of personalities. Each tries to impress the other with their knowledge and engage in some banter about Kantian philosophy, and it is easy to get lost among all the priori&amp;#039;s and the posteriori&amp;#039;s. The scene, however, is not really about philosophy but about how each character is revealed through their reactions and responses. Igor and Jeanne are attracted to each other but are leery of being manipulated. They cannot really be with each other because of that little voice chattering away in the back of their minds telling them to be cautious. As Jeanne says, &quot;I spend too much time thinking about thought&quot;.\n\nUnlike most Rohmer works, music is very much a part of this film, and the use of Beethoven&amp;#039;s lilting Spring Sonata provides just the right touch. Though not on the top rung of Rohmer&amp;#039;s films, A Tale of Springtime is a wonderfully entertaining way to spend two hours. It stands as a perfect example of how our considerations can sometimes get in the way of our aliveness and true self-interest. Characteristic of Rohmer, while each character is flawed and a bit lacking in self-awareness, they are very human and we identify their foibles as our own. By the end of the film, they have become a part of our lives.\n &lt;a href=&quot;\nhttp://imdb.com/title/tt0097106/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0097106/&lt;/a&gt;\n\n\n******************************* FREAKYFLICKS ********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\nwww.freakyflicks.tk\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;\n","torrent":{"xt":"urn:btih:5e5d003247848999d52ae049d3f83a38597cece1","amp;dn":"Eric+Rohmer+--+CONTE+DE+PRINTEMPS+%281990%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e5d003247848999d52ae049d3f83a38597cece1","infoHashBuffer":{"type":"Buffer","data":[94,93,0,50,71,132,137,153,213,42,224,73,211,248,58,56,89,124,236,225]},"announce":[],"urlList":[]}}