{"title":"Gemma Halliday - High Heels Mystery Series (1-8)","uid":10157911,"size":2889559,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e834ad23ea6aeae21a21d58a4439630297417de&amp;dn=Gemma+Halliday+-+High+Heels+Mystery+Series+%281-8%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1400192303,"description":"Gemma Halliday started writing fiction in 2002 and after winning several awards as an unpublished writer, her career kicked into high gear in 2005 when she won RWA's prestigious Golden Heart Award. One month later she was offered her first book contract, saving her from adding another dead-end to her eclectic employment history. Gemma's books have received numerous other awards-a National Reader's Choice award and three RITA nominations. After stints in Portland and Los Angeles, Gemma now makes her home in the San Francisco Bay Area where she is hard at work on her next book.\n\n1 - Spying in High Heels: L.A. shoe designer, Maddie Springer, lives her life by three rules: Fashion. Fashion. Fashion. But when she stumbles upon the work of a brutal killer, her life takes an unexpected turn from Manolos to murder. And things only get worse when her boyfriend disappears--along with $20 million in embezzled funds--and her every move is suddenly under scrutiny by LAPD's sexiest cop. With the help of her post-menopausal bridezilla of a mother, a 300-pound psychic and one seriously oversexed best friend, Maddie finds herself stepping out of her stilettos and onto the trail of a murderer. But can she catch a killer before the killer catches up to her?\n\n2 - Killer in High Heels: When shoe designer Maddie Springer heads to Vegas to search for her missing father, she finds a world of show girls, dead bodies, and a sexy undercover cop who looks mighty familiar.\n\n3 - Undercover in High Heels: Secret affairs, hunky gardeners, and housewives desperate enough to bare it all... welcome to Magnolia Lane, TV's newest hit show. As the new wardrobe assistant, shoe designer Maddie Springer is in fashion heaven. But then a young starlet is found dead. Now it's up to Maddie to sift through a secretive leading lady, an actor on the verge of a nervous breakdown, a sexy cyber scandal, and one tabloid reporter who'll stop at nothing to get the story of the century. Not to mention her tangles with the infuriatingly sexy lead detective, Jack Ramirez....\n\n3.5 - Christmas in High Heels: Fashion designer turned amateur sleuth Maddie Springer can't wait to spend the holidays with her boyfriend, LAPD Detective Jack Ramirez. It's their first Christmas together, and Maddie wants it to be perfect. But between her zany family and wacky friends, Maddie's having a hard time finding alone time with her man. But come Christmas morning, this is one holiday she'll be sure remember... naughty or nice! \n\n4 - Alibi in High Heels: When Europe's designer du jour, Jean Luc LeCroix, invites Maddie to show her creations at Paris Fashion Week, Maddie's sure she's died and gone to heaven. That is, until Jean Luc's top model is found dead on the runway, stabbed with a familiar stiletto heel. Sure someone is trying to frame her, Maddie enlists the help of her friends, including the sexy Detective Jack Ramirez, to uncover a daring jewel heist, a devious blackmailer, and even a few skeletons lurking in the closets of those closest to her. \n\n5 - Mayhem in High Heels: Maddie's planning a wedding, but with a killer on the loose, --til death do you part- might come a lot sooner than she thinks!\n\n6 - Fearless in High Heels: Morning sickness sucks. Which is why fashion designer turned amateur sleuth Maddie Springer has spent the last six weeks being a couch potato and Moonlight vampire movie devotee. But when Maddie's best friends finally convince her to venture out, Maddie stumbles on a dead body of a girl who has been bitten on the neck, and life suddenly imitates art in the most deadliest of ways. Now Maddie is smack in the middle of a murder investigation involving a deadly dance club and a coven of Hollywood &quot;vampires&quot;. Not to mention navigating the world of baby showers, diaper genies and Lamaze classes with her LAPD Homicide detective husband who would rather his pregnant wife not continue popping up in his murder investigation. Between the hormones, the homicides, and a flurry of fangs, Maddie and her gang work to track down the deadly truth... before the killer bites again!\n\n7 - Danger in High Heels: Maddie Springer is all about fashion. So when her best friend Dana's movie star boyfriend, Ricky Montgomery, becomes a contestant on the ballroom dance reality hit, 'Dancing with Celebrities', she is over the moon at the thought of visiting the sparkly, spandexy costumes on the set. That is until Ricky's dance partner is found dead in his dressing room... in the nude!\nSuddenly the police suspect him of murder, Dana suspects him of cheating on her, and the reporters at the 'L.A. Informer', Hollywood's most notorious tabloid, have dubbed him &quot;Dancing Death&quot;. Now it's up to Maddie to clear his name as she wades through a misfit cast of reality show dancers to find out just who has a grudge against the show's star... and who is in danger of taking their final bow next!\n\n8 - Homicide In High Heels: It's springtime in California! The flowers are in bloom, the fashion week runways are fierce, and fans of America's favorite pastime are filling the baseball stadiums to root for their favorite team. But when the girlfriend of the L.A. Stars rookie MVP winds up dead at a chic Beverly Hills salon, it's suddenly up to fashion designer Maddie Springer to track down the &quot;Tanning Salon Killer.&quot; Armed with the help of her wacky cast of friends and family, Maddie finds herself with a list of suspects that includes the cast of the reality TV show Baseball Wives, a desperate blackmail victim, and an entire baseball team! If Maddie can brave the hot dogs and cat fights, she just might be able to catch a killer...before he strikes again!","torrent":{"xt":"urn:btih:5e834ad23ea6aeae21a21d58a4439630297417de","amp;dn":"Gemma+Halliday+-+High+Heels+Mystery+Series+%281-8%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e834ad23ea6aeae21a21d58a4439630297417de","infoHashBuffer":{"type":"Buffer","data":[94,131,74,210,62,166,174,174,33,162,29,88,164,67,150,48,41,116,23,222]},"announce":[],"urlList":[]}}