{"title":"Paulo Coelho-Eleven Minutes","uid":4006235,"size":359997983,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5ea5a821193a7b5ffc3e901e94f008c5b12773be&amp;dn=Paulo+Coelho-Eleven+Minutes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"chimmychanga","files":89,"time":1201837784,"description":"ELEVEN MINUTES [Abridged edition] by Paulo Coelho, Read by Derek Jacobi and Emilia Fox\n\n&amp;#039;His books have had a life-enhancing impact on millions of people.&amp;#039; THE TIMES \n\nThis is the story of Maria, a young girl from a Brazilian village, whose first innocent brushes with love leave her heart-broken and believing that &amp;#039;Love is a terrible thing that makes you suffer ?&amp;#039; When a chance meeting in Rio takes her to Geneva, she dreams of finding fame and fortune yet ends up working as a prostitute.\n\nAs Maria drifts further away from love, she develops a fascination with sex. But when she meets a handsome young painter she finds she must choose between pursuing a dark path of sexual pleasure for its own sake, or risking everything for the possibility of sacred sex; sex in the context of love.\n\nEleven Minutes is a gripping and daring novel, which sensitively explores the sacred nature of sex and love, inviting us to confront our own prejudices and embrace our &amp;#039;inner light&amp;#039;.\n\nPAULO COELHO was born in Brazil and has become one of the most widely read authors in the world today. Renowned for his best-loved work, The Alchemist, he has sold more than 43 million books worldwide and has been translated into 56 languages. The recipient of numerous prestigious international awards, amongst them the Crystal Award by the World Economic Forum and France&amp;#039;s Legion d&amp;#039;Honneur, Paulo Coelho is a writer with the power to inspire nations.\n\n\nAudio CD (June 7, 2004) \nPublisher: Thorsons \nLanguage: English \nISBN: 0007190131 \n\n\n\n\npiratecoelho . wordpress . com","torrent":{"xt":"urn:btih:5ea5a821193a7b5ffc3e901e94f008c5b12773be","amp;dn":"Paulo+Coelho-Eleven+Minutes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ea5a821193a7b5ffc3e901e94f008c5b12773be","infoHashBuffer":{"type":"Buffer","data":[94,165,168,33,25,58,123,95,252,62,144,30,148,240,8,197,177,39,115,190]},"announce":[],"urlList":[]}}