{"title":"LAOS - Ethnic Minority Music of Southern Laos","uid":4435034,"size":124793647,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:601d67271f6073d1cad4e2d84ecd29789a414198&amp;dn=LAOS+-+Ethnic+Minority+Music+of+Southern+Laos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starinar","files":21,"time":1223495439,"description":"CLICK ON starinar TO GET MORE TRIBAL AND INDIGENOUS MUSIC. \nBE A MEMBER OF A GLOBAL SeeDeRS TRIBE. MoRE CoMING SooN. ENJoY! \n\n\n\nThis is a collection of landmark recordings by Laurent Jeanneau \ndocumenting music created by the Harak and various Brao ethnic \ngroups in Southern Laos. Here you can hear the true historic roots \nof Molam music (now a venerable popular music style in Laos and \nThailand) played on the Khaen along with vocal styles from this \nregion. Also featured here are Gong ensembles, various stringed \ninstruments, cymbals, drums, and sung poetry all captured live on \nlocation with the ambient sounds of the surrounding villages. \nThese recordings were made in Xekong, Champasak and Attapeu provinces \nand because much of this music is unknown, this is probably the first \ntime recordings have ever been released of indigenous music from \nthese remote areas of Southern Laos. This is the second release in a \nseries of spectacular field recordings from some of the more remote \nethnic minority communities in Southeast Asia. Features insightful \nliner notes by Laurent Jeanneau and extended track listing with added \ninformation about each track recorded. \n\nQuality: mp3/variable 192-320Kbps","torrent":{"xt":"urn:btih:601d67271f6073d1cad4e2d84ecd29789a414198","amp;dn":"LAOS+-+Ethnic+Minority+Music+of+Southern+Laos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"601d67271f6073d1cad4e2d84ecd29789a414198","infoHashBuffer":{"type":"Buffer","data":[96,29,103,39,31,96,115,209,202,212,226,216,78,205,41,120,154,65,65,152]},"announce":[],"urlList":[]}}