{"title":"Project Camelot Interviews 2009 [UFO ET alien 2012 illuminati]","uid":4970895,"size":3471665710,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:60417c4b72270c44b6ab1609e25160901b9894d4&amp;dn=Project+Camelot+Interviews+2009+%5BUFO+ET+alien+2012+illuminati%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"zahg","files":39,"time":1245763634,"description":"ProjectCamelot.org is a website run by Kerry Cassidy and Bill Ryan. The website serves to host testimonial on-record interviews with whistle blowers revealing insider information about classified projects, UFO/alien contact and earth changes.\nAll video interviews are available individually from www.projectcamelot.org and Google Video. This torrent contains the MOV format interviews from April 2008 to June 2009. \n\nThe information discussed in these interviews is not for the faint hearted or closed minded. At the very least, treat this as great sci-fi.\n\nProject Camelot Interviews 2008 torrent: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4218073/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4218073/&lt;/a&gt;\nProject Camelot Interviews 2007 torrent:   &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3854267/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3854267/&lt;/a&gt;\n\nProject Camelot Interviews... \n------------------------------- \n\nMiriam Blue Star\nMiriam Delicado was contacted at an early age by benevolent, tall blond extraterrestrials, apparently singled out specifically for a very special role. She was advised by them to keep a low profile for many years, and finally last year, 2007, she was told by them that it was time for her to write her book: Alien Blue Star.\nGoogle Video: http://video.google.com/videoplay?docid=-4764035695404064654\n\nBill Homann : Journeys with the Crystal Skull\nThere are a number of known crystal skulls in existence, but of these the Mitchell-Hedges skull is unique in its extraordinary craftsmanship. It has been studied by both scientists and psychics with no conclusive proof as to how old it is or even how it could possibly have been crafted from a single large crystal. Many, including Bill Homann, believe it to be a relic from Atlantean times, and the story he tells of what occurred when it was reunited with the Crystal Orb (recovered from a cavity in an undersea pyramid in 1970) is highly intriguing.\nGoogle Video: http://video.google.com/videoplay?docid=5746570759735143030\n\nBob Dean : The Coming of Nibiru\nWhen we asked Bob what he wanted to discuss, he told us that he had important news, from his own inside sources, about Nibiru: the highly controversial Planet X. This video contains extremely important information for all students of Planet X to consider.\nGoogle Video: http://video.google.com/videoplay?docid=4832882379486309215\n\nMarcia Schafer : Ground Crew 101\nMarcia told us about the growing awareness of what she calls the swing vote: those who are becoming aware of the new paradigm and the ET connection, and what this all means when applied to the real world.\nGoogle Video: http://video.google.com/videoplay?docid=-6980772630052792845\n\nBill Deagle : Prognosis for Planet Earth\nFew in the UFO/ Conspiracy/ Disclosure movement are as controversial as Dr Bill Deagle. Outspoken, brilliant and passionate, he has generated as many critics as he has made committed friends. We're well aware of this controversy. This three hour video is essential viewing - we suggest - for anyone who has criticised this man. We stand behind his testimony: inasmuch as there's nothing we know which contradicts anything he has said. On the other hand, the more we learn, the more we find we're able to validate the whistleblower testimony that Bill Deagle reports.\nGoogle Video 1: http://video.google.com/videoplay?docid=-7485407309834840400 \nGoogle Video 2: http://video.google.com/videoplay?docid=-696137776275027274\nGoogle Video 3: http://video.google.com/videoplay?docid=3123288920053117888\n\nValery Uvarov :Pyramid Power and 2012\nDr Valery Uvarov is the head of the Department of UFO Research, Palaeosciences and Palaeotechnology of the National Security Academy of Russia, and has devoted more than 15 years to ufology as well as to the study of the legacy of ancient civilizations.\nValery speaks excellent English and is well-known in the west, having been asked to speak at a number of American UFO conferences. Notably, he was invited to attend the very exclusive 1995 Rockefeller-sponsored Alisal Ranch event which we first learned about from Bill Holden.\nGoogle Video 1: http://video.google.com/videoplay?docid=-7172394297245066952\nGoogle Video 2: http://video.google.com/videoplay?docid=919461223976666681\n\nJessica Schab : A Crystal Child Speaks Out\nIn this 50 minute video Jessica speaks openly and emotionally about her personal journey, her family, and some of the bewildering experiences she has encountered. Her weaknesses are her dyslexia, and that she has not yet fully integrated her many experiences and perceptions; her strengths are her openness and her determination to bring a message to those who can hear it from her. She sees herself as a newly-arrived teacher and a messenger, and she probably is both of those things.\nGoogle Video: http://video.google.com/videoplay?docid=-1535408063271630133\n\nJim Humble : The story behind Miracle Mineral Supplement\nCharming, engaging and passionate, Jim reveals his most interesting background in aerospace and mining engineering - careers few users of MMS will be aware of - and then goes into detail about how MMS works, his experience successfully treating not only malaria but hepatitis, cancer and AIDS, and his personal spiritual and philosophical perspective on everything he does.\nGoogle Video: http://video.google.com/videoplay?docid=948284113233997302\n\nDr Brian O'Leary : The Energy Solution Revolution\nDr Brian O'Leary suffered the ridicule of his schoolfriends when - several years before Sputnik - he announced his intention to go to the moon. Yet by the age of 27 he was a member of NASA's astronaut program, slated to be one of the first to visit Mars. Several years later, he resigned (for various reasons) and took up a career in academia where he rubbed shoulders with - among many others - Carl Sagan at Cornell and the pioneering psi investigator Robert Jahn at the physics department at Princeton.\nGoogle Video: http://video.google.com/videoplay?docid=4297527694046984090\n\nProject Camelot : Live at Vilcabamba\nAs many of you know, Project Camelot made a recent trip to Ecuador to speak at a two-day conference hosted by Dr Brian O'Leary, ex-NASA astronaut and prominent Free Energy activist. This is one of the few times Project Camelot's Bill Ryan and Kerry Cassidy have appeared on stage together to present their research. Other conferences where we have appeared are: the NEXUS Conference in Australia, October 2008, where we have been invited back this year; the Crash Retrieval Conference, November 2008; and also at the Alamo Conference, March 2008, where we will be appearing there again this coming May.\nGoogle Video: http://video.google.com/videoplay?docid=1734461475541227747\n\nIn Conversation with David Icke\nDavid Icke, one of the most visible, outspoken and controversial speakers and writers about the Illuminati and the New World Order control agenda, will need practically no introduction to most readers of this page. We've been in touch with David since November 2006, when Camelot was relatively young. We had an interview arranged then, but David had to cancel due to an emergency; and several later attempts to reschedule it all met with logistical problems. Finally - over two years later! - we caught up with him in Sedona, and were able to sit down for a long conversation with him about his life and his work.\nGoogle Video: http://video.google.com/videoplay?docid=-2901551106819918394\n\nJim Marrs : The Rise of the Fourth Reich in America\nJim Marrs - an amiable Texan with twinkling eyes and a mind like a steel trap - is a veteran researcher and speaker on all topics connected with the agenda of the New World Order. Project Camelot is proud to add him to our strong cadre of witnesses.\nThe books that Jim has authored represent his range of interests clearly: Crossfire (about JFK), Alien Agenda, Rule by Secrecy, The Terror Conspiracy, PSI Spies, The Rise of the Fourth Reich, and Above Top Secret. Jim's broad span of research encompasses Egyptian and Sumerian mythology, Nazi technology, the ET presence, modern geopolitical analysis, the power of the military-industrial complex, the Illuminati, and what one might call the real history of the twentieth century.\nGoogle Video: http://video.google.com/videoplay?docid=-8084932639517966828\n\nDr. Joseph Farrell : Nazi International\nThe title of this interview, Nazi International, refers to Joseph Farrell's latest book, in which he details - as do Camelot witnesses Jim Marrs and Peter Levenda, and many other researchers (including Jim Keith, who died in unusual circumstances and to whom we pay tribute here) - how the Nazis were experimenting with technology extremely advanced for their time, and how many Nazi scientists, evaluated as being valuable resources for post-war America, were repatriated to the US under Project Paperclip.\nYouTube: http://youtube.com/watch?v=1wJboIFKCFU\n\n------------------------------------------------------------ \nProject Camelot Homepage: http://www.projectcamelot.org\n------------------------------------------------------------\t","torrent":{"xt":"urn:btih:60417c4b72270c44b6ab1609e25160901b9894d4","amp;dn":"Project+Camelot+Interviews+2009+%5BUFO+ET+alien+2012+illuminati%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60417c4b72270c44b6ab1609e25160901b9894d4","infoHashBuffer":{"type":"Buffer","data":[96,65,124,75,114,39,12,68,182,171,22,9,226,81,96,144,27,152,148,212]},"announce":[],"urlList":[]}}