{"title":"Hiroshima mon amour (1959) MP4 Eng sub - velvetfog","uid":8407190,"size":525200538,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:604981b556e4c3715161508e4186b0ebd8ec0980&amp;dn=Hiroshima+mon+amour+%281959%29+MP4+Eng+sub+-+velvetfog&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"velvetfog","files":-1,"time":1366827166,"description":"Hiroshima mon amour concerns a series of conversations (or one enormous conversation) over a 36-hour long period between a French actress (Emmanuelle Riva), referred to as She, and a Japanese architect (Eiji Okada), referred to as He. They have had a brief relationship, and are now separating. The two debate memory and forgetfulness as She prepares to depart, comparing failed relationships with the bombing of Hiroshima and the perspectives of people inside and outside the incidents. The early part of the film recounts, in the style of a documentary but narrated by the so far unidentified characters, the effects of the Hiroshima bomb on August 6, 1945, in particular the loss of hair and the complete anonymity of the remains of some victims. He had been conscripted into the Japanese army and his family was in Hiroshima on that day.\nThe film uses highly structured repetitive dialogue, mostly consisting of Her narration, with Him interjecting to say she is wrong, lying, confused, or to deny and contradict her statements with the film's famous line &quot;You are not endowed with memory&quot;. Although He disagrees and rejects many of the things She says, he pursues her constantly. The film is peppered with dozens of brief flashbacks to Her life; in her youth in the French town Nevers, she was shamed and had her head shaved as punishment for having a love affair with a German soldier, which she juxtaposes with the loss of the hair &quot;which the women of Hiroshima will find has fallen out in the morning.&quot;\n\n\n90 minutes\nB/W\nH.264 encoded MP4 format with hard coded English subtitles\n","torrent":{"xt":"urn:btih:604981b556e4c3715161508e4186b0ebd8ec0980","amp;dn":"Hiroshima+mon+amour+%281959%29+MP4+Eng+sub+-+velvetfog","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"604981b556e4c3715161508e4186b0ebd8ec0980","infoHashBuffer":{"type":"Buffer","data":[96,73,129,181,86,228,195,113,81,97,80,142,65,134,176,235,216,236,9,128]},"announce":[],"urlList":[]}}