{"title":"Practical Sensory Programmes - For Students With Autism Spectrum","uid":11686778,"size":2367438,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:60addac8e93f5f6b05fb659c46e6940608585456&amp;dn=Practical+Sensory+Programmes+-+For+Students+With+Autism+Spectrum&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1423347022,"description":"Publisher: Jessica Kingsley Pub; 1 edition (October 15, 2006)\nLanguage: English\nISBN-10: 1843104792\nISBN-13: 978-1843104797\n\nChildren with autistic spectrum disorders (ASD) often have sensory processing difficulties. They may be very sensitive to particular sounds or materials, or unresponsive to injuries most children would find painful. This practical book offers a six-step approach to developing a successful programme to help children cope with sensory input they find overwhelming, and to identify activities they may find relaxing or rewarding. Sue Larkey draws on her experience of working with children with autism to offer more than 30 activities using touch, sound, taste, vision and movement, and gives advice on how to use these activities as opportunities to improve children's communication skills. She provides detailed photocopiable checklists to assess children's sensory reactions, sleep patterns, sense of movement and use of eye contact. Parents, occupational therapists and educational professionals will find this workbook to be a rich source of fun ideas for improving sensory processing in autism, and easily adaptable for children with other special needs.\n\nAbout the Author\n\nSue Larkey is Director of Autism Consulting &amp; Educational Services in southern Australia. She has taught both as a primary school teacher and as a special education teacher - teaching students with ASD in a mainstream and at a specialist autism school. She combines this practical experience with extensive research, having completed a Masters in Special Education and currently undertaking a Doctorate in Education. Sue has spoken at the World Autism Congress and regularly runs workshops on educational strategies for children with ASD. She is author of Making it a Success: Practical Strategies and Worksheets for Teaching Students with Autism Spectrum Disorder, also published by Jessica Kingsley Publishers","torrent":{"xt":"urn:btih:60addac8e93f5f6b05fb659c46e6940608585456","amp;dn":"Practical+Sensory+Programmes+-+For+Students+With+Autism+Spectrum","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60addac8e93f5f6b05fb659c46e6940608585456","infoHashBuffer":{"type":"Buffer","data":[96,173,218,200,233,63,95,107,5,251,101,156,70,230,148,6,8,88,84,86]},"announce":[],"urlList":[]}}