{"title":"Civ4 + Warlords + Beyond the Sword + Colonizations + Patches","uid":5341590,"size":4253577320,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:60dd487690089ec7b6528639881e7bc6e9c1ed42&amp;dn=Civ4+%2B+Warlords+%2B+Beyond+the+Sword+%2B+Colonizations+%2B+Patches&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"metera","files":-1,"time":1265498238,"description":"Sid Meier's Civilization IV (also known as Civilization 4 or Civ4) is a turn-based strategy computer game released in 2005 and developed by lead designer Soren Johnson under the direction of Sid Meier and Meier's studio Firaxis Games. It is the fourth installment of the Civilization series. Civilization IV was released between October 25 and November 4, 2005 in North America, Europe, and Australia. The game's first expansion, Warlords, was released on July 24, 2006 in North America and July 28, 2006 in the European Union. A second expansion, Beyond the Sword, was released worldwide between July 18 and July 30, 2007. A remake of Sid Meier's Colonization, based on a total conversion of the Civilization IV engine, Colonization, was released on September 23, 2008. As of March 26, 2008, Civilization IV has sold 3 million copies according to Take-Two Interactive.[2] The game was re-released along with both of its expansions in 2007 in an edition entitled Sid Meier's Civilization IV: Complete; the North American version of this compilation was released on May 12, 2009 in a DRM free package that contains the core game, the two expansions, and the 2008 Colonization remake. Civilization IV was released in Chinese, German, French, Spanish, Italian, Japanese, and English.\n\nCivilization IV is a turn-based game in which the player builds an empire from very limited initial resources. All standard full-length games begin in 4000 BC with a settler who builds a single city. From there, the player expands an empire while contending with rival nations, using the geography, developing infrastructure, and encouraging scientific and cultural progress. By default, players can win the game by accomplishing one of five goals: conquering all other civilizations, controlling a supermajority of the world's land and population, being the first to land a sleeper ship in the Alpha Centauri star system, increasing the Culture ratings of three different cities to &quot;legendary&quot; levels, or by being declared &quot;World Leader&quot; by winning a popularity election through the United Nations. If the game's clock runs out (by default in the year 2050 AD) with none of these goals fulfilled by any nation, the nation with the highest score is declared the winner.\n\n\n\nust use the setup.exe located inside each folder.  Colonization is a stand-alone expansion, but you want to install 1-3 in order to play the original game.  The available patches are in the patch folder (duh).  After installation, replace the .exe file from the install directories with the corresponding .exe file in the GameCopyWorld folders.\n\n If you like it, buy it! support a game makers . if you wanna see civ 5 fucking do it","torrent":{"xt":"urn:btih:60dd487690089ec7b6528639881e7bc6e9c1ed42","amp;dn":"Civ4+%2B+Warlords+%2B+Beyond+the+Sword+%2B+Colonizations+%2B+Patches","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60dd487690089ec7b6528639881e7bc6e9c1ed42","infoHashBuffer":{"type":"Buffer","data":[96,221,72,118,144,8,158,199,182,82,134,57,136,30,123,198,233,193,237,66]},"announce":[],"urlList":[]}}