{"title":"Night Train to Munich 1940 BrRip Mp4 Lee1001","uid":10095729,"size":898921918,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:60f20fe6817d7cc27b7fb8d32547e57ec90b3eea&amp;dn=Night+Train+to+Munich+1940+BrRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"xultfoad","files":2,"time":1399289968,"description":"Night Train to Munich 1940 BrRip Mp4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0032842/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0032842/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Night_Train_to_Munich&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Night_Train_to_Munich&lt;/a&gt;\nJust before his country is annexed by Nazi Germany, the Czech inventor Axel Bomasch manages to escape to England, but his daughter Anna is arrested and sent to a concentration camp. With the help of another prisoner, Karl Marsen, Anna breaks out of the camp and arrives safely in England. Anna does not know that Marsen is a Nazi agent and before she knows it she and her father on their way to Germany. During her brief stay in England, Anna made contact with Gus Bennett, a British spy posing as a music hall singer. Assuming the identity of a Gestapo officer, Bennett contrives to get Anna and her father out of Germany, but the plan goes awry when a man who knew him at Oxford blows his cover... \n\nNight Train to Munich is another sterling effort from the great writing team Sidney Gilliat and Frank Launder, evoking memories of their earlier train-based thriller, The Lady Vanishes (1938), directed by Alfred Hitchcock. Carol Reed may have directed this later film, but it is the mischievous Gilliat-Launder imprint that is more noticeable, particularly in the comic incursions into what is otherwise a serious thriller plot. \n\nAlthough Margaret Lockwood received top billing, she has very little to do in the film other than be ferried about from one location to another like a misplaced item of luggage. It is her two co-stars - Rex Harrison and Paul Henreid - who give most value. Only ten years into his film career, Harrison is already sending himself up, apparently mocking his deficiencies as a singer and his limitations as an actor. Meanwhile, as the villainous yet strangely likeable Nazi agent Marsen, Henreid gives a skilfully judged performance that surpasses his more famous turn as Humphrey Bogart's rival in Casablanca (1942).\n\nThe film's most enjoyable scenes are those in which Naunton Wayne and Basil Radford appear, in a reprise of their roles of cricketing fanatics Caldicott and Charters, last seen in The Lady Vanishes. Their presence - as a pair of bumbling cricket-obsessed Englishmen who bravely put on their pads and knock out a six when the opposing team throws a googly (whatever that means) - makes the film an effective call to arms, far more subtle that what we find in the plethora of wartime propaganda films that followed.\n\nVIDEO\nSize.... 857mb\nDuration.... 01:35:19\nCodec....... avc1\nFrame Width.... 640\nFrame Height.... 480\nData Rate.... 1087kbps\nFrame Rate.... 23 F/S\nAUDIO\nBit Rate.... 164kbps\n1 Channel Mono\nAudio Sample Rate.... 48KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:60f20fe6817d7cc27b7fb8d32547e57ec90b3eea","amp;dn":"Night+Train+to+Munich+1940+BrRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60f20fe6817d7cc27b7fb8d32547e57ec90b3eea","infoHashBuffer":{"type":"Buffer","data":[96,242,15,230,129,125,124,194,123,127,184,211,37,71,229,126,201,11,62,234]},"announce":[],"urlList":[]}}