{"title":"Will Grayson, Will Grayson","uid":7739554,"size":198487153,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:610947a71e971107f22367f315688a2220c87b25&amp;dn=Will+Grayson%2C+Will+Grayson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"zachestel","files":2,"time":1350590609,"description":"Will Grayson, Will Grayson is a novel by John Green and David Levithan, published in April 2010 by Dutton Juvenile. The book's narrative is divided evenly between two boys named Will Grayson, with Green having written all of the chapters for one, and Levithan having written the chapters for the other, presented in an alternating chapter fashion.\n\nThe novel follows two boys who both go by the name Will Grayson. The first Will, whose name is always correctly capitalized, is described as trying to live his life without being noticed. This is complicated by the fact that his best friend, Tiny Cooper, described as &quot;the world's largest person who is really, really gay&quot; and &quot;the world's gayest person who is really, really large&quot;, is not the type to go around unnoticed. Tiny is also, throughout the novel, trying to create an autobiographical musical, which further draws attention to himself and everyone around him.\n\nThe other will grayson, whose name is never capitalized, goes through his life without anything good to hold onto besides an online friendship with someone who goes by the name Isaac. Intent on meeting up with Isaac, will grayson sets up an encounter one night in Chicago but eventually finds out that Isaac was invented by a girl named Maura. What ensues brings both characters together and changes both of their lives forever in ways they could never have guessed or imagined.\n","torrent":{"xt":"urn:btih:610947a71e971107f22367f315688a2220c87b25","amp;dn":"Will+Grayson%2C+Will+Grayson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"610947a71e971107f22367f315688a2220c87b25","infoHashBuffer":{"type":"Buffer","data":[97,9,71,167,30,151,17,7,242,35,103,243,21,104,138,34,32,200,123,37]},"announce":[],"urlList":[]}}