{"title":"The Quest by Nelson DeMille (ePub Retail)","uid":8929125,"size":619922,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:610c4d1c88b9459b92ccb9dc07d90679f93483bc&amp;dn=The+Quest+by+Nelson+DeMille+%28ePub+Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TxJag","files":3,"time":1379433609,"description":"A sweeping adventure that's equal parts thriller and love story, Nelson DeMille's newest novel takes the reader from the war torn jungles of Ethiopia to the magical city of Rome.\n\nWhile the Ethiopian Civil War rages, a Catholic priest languishes in prison. Forty years have passed since he last saw daylight. His crime? Claiming to know the true location of Christ's cup from the Last Supper. Then the miraculous happens - a mortar strikes the prison and he is free! \n\nOld, frail, and injured, he escapes to the jungle, where he encounters two Western journalists and a beautiful freelance photographer taking refuge from the carnage. As they tend to his wounds, he relates his incredible story. \n\nMotivated by the sensational tale and their desire to find the location of the holiest of relics, the trio agrees to search for the Grail. \n\nThus begins an impossible quest that will pit them against murderous tribes, deadly assassins, fanatical monks, and the passions of their own hearts.\n\nTHE QUEST is suspenseful, romantic, and filled with heart-pounding action. Nelson DeMille is at the top of his game as he masterfully interprets one of history's greatest mysteries.\n\nFull Retail. ePub and Calibre Reader ready. Metadata is complete and up to date.","torrent":{"xt":"urn:btih:610c4d1c88b9459b92ccb9dc07d90679f93483bc","amp;dn":"The+Quest+by+Nelson+DeMille+%28ePub+Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"610c4d1c88b9459b92ccb9dc07d90679f93483bc","infoHashBuffer":{"type":"Buffer","data":[97,12,77,28,136,185,69,155,146,204,185,220,7,217,6,121,249,52,131,188]},"announce":[],"urlList":[]}}