{"title":"Supreme Commander Complete (patches maps and mods included)","uid":8602795,"size":12161050199,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6145d03f20ae34ac513432be22121add45df4303&amp;dn=Supreme+Commander+Complete+%28patches+maps+and+mods+included%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":null,"files":44,"time":1371926933,"description":"Supreme Commander and Supreme Commander: Forged Alliance\n\nFor single player, install Supreme Commander.  For multiplayer only, install Forged Alliance.  Forged Alliance is a stand-alone expansion that focuses on rebalancing multiplayer more than offering a solid single-player campaign expereince.\n\n1.  Mount or burn the .ISO files\n2.  Install the games.  CD keys are included in the .txt file.  Should you need it, there is a keygen in the supcom.iso for supcom only.\n3.  Run the patches.  DO NOT install the cracks.  The patches No-CD hack the game for you\n4.  Run the games\nDone\n\n\n\nOptional addons for Forged Alliance:\nPut the contents (00_AIFix.scd through 03_lobbyenhancement.scd. 7 total files) of the AI folder in the game installation directory under Gas Powered GamesSupreme Commander - Forged Alliancegamedata\n\nThis is a set of user mods and enhancements that you will want to use to control the AI better.  It does nothing to change the vanilla game, but it adds more options.  If playing multiplayer, everyone will need to have these files in their directory.\n\n-----\n\nOnce the game has been run and a profile has been set up in-game, put the Maps folder in My DocumentsMy GamesGas Powered GamesSupreme Commander Forged Alliance.  Several of the custom maps from GPG are in there.  Black Sun Defense is a great multiplayer map with lots of options.\n\nAll thanks goes to the teams and people that brought these downloads to me, because I sure as hell didn't make them myself.","torrent":{"xt":"urn:btih:6145d03f20ae34ac513432be22121add45df4303","amp;dn":"Supreme+Commander+Complete+%28patches+maps+and+mods+included%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6145d03f20ae34ac513432be22121add45df4303","infoHashBuffer":{"type":"Buffer","data":[97,69,208,63,32,174,52,172,81,52,50,190,34,18,26,221,69,223,67,3]},"announce":[],"urlList":[]}}