{"title":"Guns N' Roses 24 Bit Vinyl Pack","uid":8784536,"size":13244525574,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:615df39b75f6ae92d121fdec88bdf249a8f24909&amp;dn=Guns+N%27+Roses+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":8,"uploader":"politux","files":-1,"time":1375797801,"description":"\n  Guns N' Roses 24 Bit Vinyl Pack\n  \n  Genre: Pop/Rock\n  Styles: Album Rock, Hard Rock, Heavy Metal\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,900 - 3,100 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  1986 Live Like a Suicide EP\n  1987 Appetite for Destruction\n  1988 G N' R Lies EP\n  1988 Live from the Jungle\n  1991 Use Your Illusion I\n  1991 Use Your Illusion II\n  1993 The Spaghetti Incident\n  1999 Live Era '87-'93\n  2008 Chinese Democracy\n\n  At a time when pop was dominated by dance music and pop-metal, Guns N' Roses brought raw, ugly rock &amp; roll crashing back into the charts. They were not nice boys; nice boys don't play rock &amp; roll. They were ugly, misogynistic, and violent; they were also funny, vulnerable, and occasionally sensitive, as their breakthrough hit, &quot;Sweet Child O' Mine,&quot; showed. While Slash and Izzy Stradlin ferociously spit out dueling guitar riffs worthy of Aerosmith or the Stones, Axl Rose screeched out his tales of sex, drugs, and apathy in the big city. Meanwhile, bassist Duff McKagan and drummer Steven Adler were a limber rhythm section who kept the music loose and powerful. Guns N' Roses' music was basic and gritty, with a solid hard, bluesy base; they were dark, sleazy, dirty, and honest -- everything that good hard rock and heavy metal should be. There was something refreshing about a band that could provoke everything from devotion to hatred, especially since both sides were equally right. There hadn't been a hard rock band this raw or talented in years, and they were given added weight by Rose's primal rage, the sound of confused, frustrated white trash vying for his piece of the pie. As the '80s became the '90s, there simply wasn't a more interesting band around, but owing to intra-band friction and the emergence of alternative rock, Rose's supporting cast gradually disintegrated, as he spent years in seclusion.\n\n  Guns N' Roses released their first EP in 1986, which led to a contract with Geffen; the following year, the band released its debut album, Appetite for Destruction. They started to build a following with their numerous live shows, but the album didn't start selling until almost a year later, when MTV started playing &quot;Sweet Child O' Mine.&quot; Soon, both the album and single shot to number one, and Guns N' Roses became one of the biggest bands in the world. Their debut single, &quot;Welcome to the Jungle,&quot; was re-released and shot into the Top Ten, and &quot;Paradise City&quot; followed in its footsteps. By the end of 1988, they released G N' R Lies, which paired four new, acoustic-based songs (including the Top Five hit &quot;Patience&quot;) with their first EP. G N' R Lies' inflammatory closer, &quot;One in a Million,&quot; sparked intense controversy, as Rose slipped into misogyny, bigotry, and pure violence; essentially, he somehow managed to distill every form of prejudice and hatred into one five-minute tune.\n\n  Guns N' Roses began work on the long-awaited follow-up to Appetite for Destruction at the end of 1990. In October of that year, the band fired Adler, claiming that his drug dependency caused him to play poorly; he was replaced by Matt Sorum from the Cult. During recording, the band added Dizzy Reed on keyboards. By the time the sessions were finished, the new album had become two new albums. After being delayed for nearly a year, the albums Use Your Illusion I and Use Your Illusion II were released in September 1991. Messy but fascinating, the albums showcased a more ambitious band; while there were still a fair number of full-throttle guitar rockers, there were stabs at Elton John-style balladry, acoustic blues, horn sections, female backup singers, ten-minute art rock epics with several different sections, and a good number of introspective, soul-searching lyrics. In short, they were now making art; amazingly, they were successful at it. The albums sold very well initially, but while they had seemed destined to set the pace for the decade to come, that turned out not to be the case at all.","torrent":{"xt":"urn:btih:615df39b75f6ae92d121fdec88bdf249a8f24909","amp;dn":"Guns+N%27+Roses+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"615df39b75f6ae92d121fdec88bdf249a8f24909","infoHashBuffer":{"type":"Buffer","data":[97,93,243,155,117,246,174,146,209,33,253,236,136,189,242,73,168,242,73,9]},"announce":[],"urlList":[]}}