{"title":"Montrose - 'Montrose' [320k MP3]","uid":4696900,"size":77614692,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:61835effd6560cb287700ea2adebf3560cf81e74&amp;dn=Montrose+-+%5C%27Montrose%5C%27+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"smbdownload","files":-1,"time":1233588838,"description":"Montrose is the debut album by the band Montrose in 1973 which was produced by Ted Templeman. After having done sessions work for various musicians including Van Morrison, Herbie Hancock and Edgar Winter, this was Ronnie Montrose's first record leading his own band. It featured then little known Sammy Hagar (then known as Sam Hagar) on vocals. While considered a classic by many hard rock fans, tracks from the album have received scant airplay on the radio with &quot;Bad Motor Scooter&quot; being the only possible exception. It has been said that Warner Bros. Records did not know how to market Montrose, the band or album and the band eventually went under as a result. But the album has undergone a renaissance since then, eventually going platinum.\n\nVan Halen (which Hagar would eventually join) had used this album as a blueprint for their own debut and there are some similarities in the sound of the Montrose album to early Van Halen. Ronnie Montrose mainly used a Gibson Les Paul and a Fender Bandmaster and a Big Muff to record the Montrose album [1]. Eddie Van Halen himself considered Ronnie Montrose to be an influence and &quot;Make It Last&quot; was covered by Van Halen in their early club concerts and is available on Van Halen bootlegs. There are at least two, slightly different, versions of the album cover. Also, the tracks are in a different order on different copies, again with at least two versions. The album was voted as the 4th best Metal Album of All Time by Kerrang! Magazine in 1989\n\nTrack listing [320k MP3]\n\n01 &quot;Rock the Nation&quot; - 3:03 \n02 &quot;Bad Motor Scooter&quot; - 3:41 \n03 &quot;Space Station #5&quot; - 5:18 \n04 &quot;I Don't Want It&quot; - 2:58 \n05 &quot;Good Rockin' Tonight&quot; (Roy Brown cover) - 2:59 \n06 &quot;Rock Candy&quot; - 5:05 \n07 &quot;One Thing on My Mind&quot; - 3:41 \n08 &quot;Make It Last&quot; - 5:31 \n","torrent":{"xt":"urn:btih:61835effd6560cb287700ea2adebf3560cf81e74","amp;dn":"Montrose+-+%5C%27Montrose%5C%27+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61835effd6560cb287700ea2adebf3560cf81e74","infoHashBuffer":{"type":"Buffer","data":[97,131,94,255,214,86,12,178,135,112,14,162,173,235,243,86,12,248,30,116]},"announce":[],"urlList":[]}}