{"title":"Soft Places (1977) XXX","uid":11822178,"size":1004450665,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:61eaf618b44b61db56e90204a2973ec43a77f7b4&amp;dn=Soft+Places+%281977%29+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"HighCode","files":2,"time":1429303468,"description":"Scene 1. Annette Haven, Carl Regal--Annette kneels and gives a hearty blowjob to completion. Wouldn't call it a facial though-more of just a backlit slo-mo spurting, 70s style.\n\nScene 2. Annette Haven--solo standing masturbation. Afterward, she calls a friend &amp; tells him what she's done while using the candlestick phone to rub her clit then goes back to masturbating on the bed.\n\nScene 3. Annette Haven, faceless guy--in a dreamlike state, Annette kneels in front of a man in shadows &amp; gives him an enthusiastic BJ. Better than the first scene! He jizzes in her champagne glass &amp; she has a drink.\n\nScene 4. Annette Haven--pulling her panties aside, Annette rubs her pussy while being driven in her car.\n\nScene 5. Carrie Cohen, Brice Taylor--Annette disrobes, &amp; afterward a guy masturbates with her panties &amp; dildo, eventually grappling with a middle-aged latina BBW. Surreal.\n\nScene 6. guy, Terri Middleton--Dude eats out a girls pussy &amp; ass, eventually fucking her between her thighs &amp; cumming on her tummy.\n\nScene 7. Miki Star, Cris Cassidy--in a high class salon, a massage becomes a lesbian pussyeating festival, culminating in a 69. The action continues in the background as the next two scenes also take place in the salon.\n\nScene 8. Annette Haven, China Leigh--similar to above, but there is only fascination with the pussy laying before China. Eventually the two end up strap-on fucking.\n\nScene 9. Christine Kelly, John Seeman--another blowjob for a guy standing. It is taken to completion &amp; is quite sexy, as we see women pleasuring each other in the background.\n\nScene 10. Elaine Wells, John Seeman--In a back room of a bar, the couple have fully clothed sex when she flips up her skirt &amp; he unzips, not even bothering to unbutton his fly. After a bit he pulls out &amp; she jerks him onto the floor.\n\nScene 11. Annette Haven, John Rolling, Rock Steadie--Right *at* the bar with people on all sides, including one guy's wife, Annette gives handjobs to the two guys on either side of her until a fight breaks out.\n\nScene 12. Dolores Prissington, guy, Rock Steadie--Dolores begins to blow first one, then a second guy. The guys use her until sated, including at one point fucknig both her cunt &amp; mouth while she lays on her back.\n\nScene 13. Annette Haven, Paul Thomas--One of the most traditional scenes in the film, Paul spoons &amp; fucks Annette from behind. The scene extensively uses the monster shots then in fashion, focusing on the penetration of his cock into her pussy. Finishes with a thick creamy load on her pussy.\n\n  Screenshots: &lt;a href=&quot;\nhttp://imgclover.com/image/2q&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/2q&lt;/a&gt; &lt;a href=&quot;\nhttp://imgclover.com/image/22&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/22&lt;/a&gt;","torrent":{"xt":"urn:btih:61eaf618b44b61db56e90204a2973ec43a77f7b4","amp;dn":"Soft+Places+%281977%29+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61eaf618b44b61db56e90204a2973ec43a77f7b4","infoHashBuffer":{"type":"Buffer","data":[97,234,246,24,180,75,97,219,86,233,2,4,162,151,62,196,58,119,247,180]},"announce":[],"urlList":[]}}