{"title":"The Creativity Crisis: Reinventing Science to Unleash Possibilit","uid":11405475,"size":1805638,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6206c0ea0f702ec4b021a5b814d0cf1a9ea4d8ac&amp;dn=The+Creativity+Crisis%3A+Reinventing+Science+to+Unleash+Possibilit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":1,"time":1415472931,"description":"Every day we hear about some fascinating new discovery. Yet anemic progress toward addressing the greatest risks to humankind -- clean energy, emerging infections, and cancer -- warns us that science may not be meeting its potential. Indeed, there is evidence that advances are slowing. Science is costly and can hurt people; thus it must be pursued with caution. Yet, excessive caution stifles the very thing that powers inventiveness: creation. In her boldest book yet, Roberta Ness argues that the system of funding agencies, universities, and industries designed to promote innovation has come to impede it.\n\n The Creativity Crisis strips away the scientific enterprise's veil of mystique to reveal the gritty underbelly of university research. America's economic belt-tightening discourages long-term, risky investments in revolutionary advances and elevates short-term projects with assured outcomes. The pursuit of basic research insights, with the greatest power to transform but little ability to enrich, is being abandoned. The social nature of academia today also contributes to the descent of revolutionary discovery. In academia, which tends to be insular, hierarchical, and tradition-bound, research ideas are &quot;owned&quot; and the owners gain enormous clout to decide what is accepted. Communalism is antithetical to idea ownership. Thus science has not embraced the Web-based democratic sharing of ideas called crowdsourcing, one of the greatest tools for creativity and social change in our age. A final battleground between creation and caution is within the sphere of ethics. Scientists are typically altruistic but sometimes have all-too-human inclinations toward avarice and conceit. The most original thinkers are most likely to flout convention. This tendency can pull them across the lines of acceptable behavior. Caution is a necessary check on the destructive potential of amoral creation. Yet, when every individual and institution is considered a priori to be a threat, adventuresome invention is squelched. \n\n Creation and caution in science should be in balance, but they are not. For possibilities to unlock, the ecosystem in which science is done must be fundamentally rebalanced","torrent":{"xt":"urn:btih:6206c0ea0f702ec4b021a5b814d0cf1a9ea4d8ac","amp;dn":"The+Creativity+Crisis%3A+Reinventing+Science+to+Unleash+Possibilit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6206c0ea0f702ec4b021a5b814d0cf1a9ea4d8ac","infoHashBuffer":{"type":"Buffer","data":[98,6,192,234,15,112,46,196,176,33,165,184,20,208,207,26,158,164,216,172]},"announce":[],"urlList":[]}}