{"title":"Z.Steel.Soldiers.Remastered-TiNYiSO","uid":10677098,"size":783549604,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:623f3cf385387c9cae354c65c9d13d8e192e59cd&amp;dn=Z.Steel.Soldiers.Remastered-TiNYiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1406976392,"description":"\n-=- Proudly Presents -=-\n\nZ: Steel Soldiers Remastered (c) KISS ltd &amp; Kavcom\n\nRelease On   : 2 august 2014              Disk Amount/Format : 1 DVD ISO\nType of Game : Strategy                   Media Protection   : Steam\n\nLead your Z: Steel Soldiers into the next century rebooted for the\nrocket fuelled fans of the classic hard-core strategy game.\n\nIn the bloody aftermath of Z comes Z: Steel Soldiers. All your\nfavourite strategies and gameplay from the classic version, with graphics\nthat have powered into the 21st century, vivid 3D landscapes, and a state\nof the art engine that brings your game to life. Meet the new breed of\nrobots, with a taste for war and a warped sense of humour. Z: Steel\nSoldiers  youve never had it so good\n\nWhen you take control of your Steel Soldiers unit, youd better hit the\nground running, as you take some superb war machinery straight into the\nheat of battle. You can start to build up your forces when this firefight\nis over. Right now youd better just dig in\n\nEvery theatre of the war is intertwined with the non-linear plot,\nrevealing more twists and turns than a roller coaster, this is no\nordinary battle, and these are no ordinary troops. They are fearless\ntroops who drink rocket fuel and pick fights with saber-tooth snow slugs\njust for fun. Youve never met robots quite this screwed-up before...\n\nFeatures\n\n30 Distinct, lush levels spread across 6 unique worlds.\n\nAir, ground and sea units ranging from WW2 based vehicles through to\nmodern jet fighters.\n\nSignificantly enhanced 3D Graphics packed full of scalable features such\nas reflections and particle systems providing intense and rich landscapes.\n\nReal-time environment forces, both local and world forces affect the\nenvironment to such detail that even plumes of smoke are split as\nhelicopters come soaring through.\n\n9 different robots each with unique abilities.\n\nRevolutionary fast-resource style gameplay The more territories you take,\nthe larger the resource flag in that territory and the faster and more\nyou can build leaving you to deal with the real objective  all-out\nwarfare\n\nOur most advanced AI yet, that will stop at nothing to rid the universe\nof Zod and his band of space renegades...\n\nGET READY TO KISS YOUR SHINY METAL BUTT GOODBYE\n\nBurn/mount, install, copy crack, play\n\nNOTE: This edition of Z: Steel Soldiers is remastered with Windows 7 &amp; 8\nsupport, new menus and higher resolution graphics\n\nGreetz: LARGEiSO and MEDIUMiSO\n\n(C) E/dfs\n&quot; SIZE DOES NOT MATTER\n","torrent":{"xt":"urn:btih:623f3cf385387c9cae354c65c9d13d8e192e59cd","amp;dn":"Z.Steel.Soldiers.Remastered-TiNYiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"623f3cf385387c9cae354c65c9d13d8e192e59cd","infoHashBuffer":{"type":"Buffer","data":[98,63,60,243,133,56,124,156,174,53,76,101,201,209,61,142,25,46,89,205]},"announce":[],"urlList":[]}}