{"title":"Sotto il Vestito Niente 1985 - Carlo Vanzina [XviD - Ita Mp3]","uid":5204328,"size":734746624,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:626b2eb1c1f042ab5191654a5780086f1bc074d0&amp;dn=Sotto+il+Vestito+Niente+1985+-+Carlo+Vanzina+%5BXviD+-+Ita+Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Duracell72","files":1,"time":1260303158,"description":"Sotto il Vestito Niente 1985 - Carlo Vanzina [XviD - Ita\n\n\nTitolo originale: Sotto il vestito niente\nPaese: Italia\nAnno: 1985\nDurata: 88 min\nGenere: thriller\nRegia: Carlo Vanzina\nSoggetto:\tMarco Parma\nSceneggiatura: Franco Ferrini\nProduttore: Achille Manzotti\nFotografia: Giuseppe Maccari\nMontaggio: Raimondo Crociani\nEffetti speciali: Ditta Corridori\nMusiche: Pino Donaggio\n\nInterpreti e personaggi\n\nRenÃƒÂ©e Simonsen: Barbara\nTom Schanley: Bob Crane\nDonald Pleasence: Commissario Danesi\nNicola Perring: Jessica Crane\nCyrus Elias: Giorgio Zanoni\nAnna Galiena: Diana\nMaria McDonald: Margot Wilson\nCatherine Noyes: Carrie\nSonia Raule: Cristina\n\nTRAMA\n\nBob Crane, ranger del Wyoming, si reca a Milano in quanto sente che la sua sorella gemella, top model, si trova in pericolo. Infatti Bob ha sognato che sua sorella Jessica ÃƒÂ¨ stata assassinata selvaggiamente con un paio di forbici. Bob decide di partire immediatamente per Milano, ed effettivamente al suo arrivo scopre che la sorella ÃƒÂ¨ scomparsa nel nulla. \nNon avendo avuto molto aiuto dalla polizia, Bob inizia ad investigare negli ambienti frequentati dalla sorella, che abitava in un palazzo in cui abitano anche altre tre modelle Carrie, Margot e Barbara. Soprattutto quest'ultima si mostra \nparticolarmente disposta ad aiutare Bob, anche in nome dell'amicizia che la legava a Jessica, e Bob inizia a maturare un forte sentimento nei suoi confronti.\nBob conosce diversi personaggi che ruotano intorno al mondo di Jessica, come &quot;Porcellone&quot;, il lascivo portiere dello stabile in cui abitano le ragazze o l'ambiguo fotografo orientale. Ma ÃƒÂ¨ soltanto quando anche Carrie viene uccisa con un paio di forbici, che il commissario Danesi decide di prendere sul serio il caso ed aiutare Bob a trovare sua sorella. In breve tempo viene uccisa con le medesime modalitÃƒÂ  anche Margot, mentre Bob sorprendentemente riceve una lettera da parte di sua sorella Jessica. A dare una svolta alle indagini ÃƒÂ¨ la figura di Giorgio Zanoni, ricco imprenditore nel campo dei gioielli che aveva avuto a che fare con il gruppo di modelle. Infatti Zanoni durante un festino privato aveva invitato \nJessica, Margot, Carrie ed un'altra modella di nome Cristina, morta in un tragico incidente durante il gioco della roulette russa. Per &quot;comprare&quot; il silenzio delle tre testimoni, Zanoni aveva regalato una considerevole quantitÃƒÂ  di diamanti, che \nperÃƒÂ² erano spariti dopo gli omicidi delle ragazze. La polizia arresta Giorgio Zanoni ed il caso sembra chiuso.\nTuttavia Bob non ÃƒÂ¨ ancora sicuro di quanto accaduto, anche perchÃƒÂ© non ÃƒÂ¨ stata trovata alcuna traccia di Jessica. Tramite una serie di indizi, Bob risale ad un misterioso appartamento in cui il giovane fa una scoperta agghiacciante: il cadavere di Jessica mummificato ed inchiodato ad un sedia. Responsabile del suo omicidio ÃƒÂ¨ Barbara che ha ucciso anche le altre due modelle per far cadere i sospetti su Zanoni. Barbara aveva una relazione con Jessica, che perÃƒÂ² turbata dopo il festino a casa Zanoni, era completamente cambiata al punto di voler lasciare Barbara. Disperata, Barbara era riuscita a fermare Jessica soltanto uccidendola, per poi conservare il cadavere e trattarlo come una persona vera. Messa alle strette Barbara tenta di uccidere anche Bob, ma viene fermata appena in tempo dall'arrivo del commissario Danesi. In preda ad un raptus, Barbara prende il cadavere di Jessica e si lancia giÃƒÂ¹ da una finestra, uccidendosi.\n\nInformazioni sul File\n\nTitolo: Sotto il vestito niente.avi \nDimensione File [in bytes]: 734,746,624\nDurata [hh:mm:ss]: 1:30:14\nNumero di tracce Audio: 1\n\nInformazioni Video\n\nNome Codec Video: XviD ISO MPEG-4\nNumero Frame: 135325\nLarghezza Frame [pixels]: 560\nAltezza frame [pixels]: 304 \nDisplay Aspect Ratio [DAR]: 1.842\nFPS: 25.000 \nVideo Bitrate [kbps]: 975\nQF: 0.229\n\nInformazioni Audio Traccia 1\n\nCodec audio: 0x0055 MPEG-1 Layer 3\nFrequenza audio [Hz]: 44100\nBitrate [kbps]: 98\nTipo: VBR\nCanali: 2","torrent":{"xt":"urn:btih:626b2eb1c1f042ab5191654a5780086f1bc074d0","amp;dn":"Sotto+il+Vestito+Niente+1985+-+Carlo+Vanzina+%5BXviD+-+Ita+Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"626b2eb1c1f042ab5191654a5780086f1bc074d0","infoHashBuffer":{"type":"Buffer","data":[98,107,46,177,193,240,66,171,81,145,101,74,87,128,8,111,27,192,116,208]},"announce":[],"urlList":[]}}