{"title":"D3DGear v4 91 1893-BRD","uid":11099056,"size":17382903,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6280ea8376d40e0fe9bb98502cf730bc152e2158&amp;dn=D3DGear+v4+91+1893-BRD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TeX","files":4,"time":1411642109,"description":"i'm the black rider, always faster than you\n\n|\n\njer^dfs\n\nD3DGear.v4.91.1893-BRD\n\nCracked by: BRD Cult Size: 4\nSuplied: BRD Cult Date: 09/23/2014\nPackaged: BRD Cult Type: Retail\nProtection: Serial Os: WinALL\n\n|\n\nDESCRiPTiON\n\nWhat is D3DGear?\n\nD3DGear is very fast game recording software and game\nbroadcasting software for PC. It captures gameplay video to\nmovie with high speed, high quality, very small file size\nVideo Recording Software\n\nD3DGear is a very fast game video recording software. D3DGear\nallows users to capture game play to movie without slowing\ndown the game. D3DGear has very minimal performance impact on\nthe game and may not cause a game to lag or drop frame rate\n\nD3DGear recording produces high quality video with small file\nsize, and it supports microphone recording, Push-To-Talk\nrecording and face camera overlay. D3DGear is a perfect video\ngame recorder for users who want to record game play with\ncommentary to a movie and upload it YouTube\n\nD3DGear recording performance is superior among other similar\nsoftware such as Fraps software. Visit our Fraps Alternative\npage for detail comparison between D3DGear and Fraps\nLive Streaming Software\n\nD3DGear is also a very fast game broadcasting software\nD3DGear allows users to live stream game play to web without\naffecting game performance. D3DGear broadcasting function is\nvery fast and very easy to use, and it works with slow upload\nspeed, and it is compatible with twitch.tv and all other live\nstream web sites\n\nD3DGear broadcasting function also supports microphone\nrecording Push-To-Talk recording and face camera overlay\nD3DGear is a perfect game broadcaster for live streaming game\nplay to web\n\nD3DGear broadcasting performance is superior among other\nsimilar software such as XSplit software. Visit our XSplit\nAlternative page for detail comparison between D3DGear and\nXSplit\nScreen Capture Software\n\nD3DGear also allows user to capture video game screenshot\nwith a press of hotykey and save it as image file. D3DGear\nsupports most popular image formats such as BMP, JPG, PNG and\nGIF; and user has option to add time stamp into screen shot\n\nHow does D3DGear work?\n\nD3DGear works as a universal video game plugin/add-on, it\nwill automatically attach to a game when it starts. Simply\nlaunching D3DGear prior to start a video game, recording or\nbroadcasting video game is as simple as pressing a hot key\nVisit Products page for more details on D3DGear features\n\nD3DGear supports PC video games that use DirectX8, DirectX9\nDirectX9Ex, DirectX10, DirectX10.1, DirectX11, DirectX11.1 or\nOpenGL API. D3DGear runs on 32 and 64 bit of Windows XP\nVISTA, Windows 7, Windows 8 and Windows 8.1\n\nD3DGear is shareware. After a 15 day trial period, user needs\npurchase a license to continue use it. Visit Purchase page\nfor more details\n\nD3DGear has passed Microsoft designed tests for software\ncompatibility and reliability on Windows 8 and Windows 7\nD3DGear has passed Windows 8 Compatible and Windows 7\nCompatible Logo Certification\n\nURL: http://d3dgear.com/home.htm\n\n|\n\niNSTALL NOTES\n\nInstall the program\nEnjoy!\n\n|\n\nGROUP NOTES\n\nTeam BRD is not responsible for the bad usage of this product\nThis release is for EVALUATION PURPOSES ONLY\nif you like it, u MUST buy it, Software Authors deserve support!\n\nRemember, this is an INTERNAL SCENE RELEASE, we DONT support\nthe spread of this rls over web or p2p networks\n\nThe Black Riders Cult is looking for:\n\n&lt;.&gt; Experienced Crackers, Unpackers and keygenners\n&lt;.&gt; Software Suppliers\n\nt h e b r d [at] m a i l [dot] r u\n\n|\n\njer^dfs\n\nyou will never defeat the riddle of the black riders\n\nD3DGearSetupFull.exe:F97CEB1C","torrent":{"xt":"urn:btih:6280ea8376d40e0fe9bb98502cf730bc152e2158","amp;dn":"D3DGear+v4+91+1893-BRD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6280ea8376d40e0fe9bb98502cf730bc152e2158","infoHashBuffer":{"type":"Buffer","data":[98,128,234,131,118,212,14,15,233,187,152,80,44,247,48,188,21,46,33,88]},"announce":[],"urlList":[]}}