{"title":"Heat Exchangers - Selection, Rating, and Thermal Design 2nd ed","uid":12028020,"size":23948985,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6287ccc5155607e548a68d00945bb52474e420b0&amp;dn=Heat+Exchangers+-+Selection%2C+Rating%2C+and+Thermal+Design+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1434560639,"description":"ISBN 0849309026\n\nResearchers, practitioners, instructors, and students all welcomed the first edition of Heat Exchangers: Selection, Rating, and Thermal Design for gathering into one place the essence of the information they need-information formerly scattered throughout the literature. While retaining the basic objectives and popular features of the bestselling first edition, the second edition incorporates significant improvements and modifications.\n\nNew in the Second Edition:\n\nIntroductory material on heat transfer enhancement\nAn application of the Bell-Delaware method\nNew correlation for calculating heat transfer and friction coefficients for chevron-type plates\nRevision of many of the solved examples and the addition of several new ones\n\nThe authors take a systematic approach to the subject of heat exchanger design, focusing on the fundamentals, selection, thermohydraulic design, design processes, and the rating and operational challenges of heat exchangers. It introduces thermal design by describing various types of single-phase and two-phase flow heat exchangers and their applications and demonstrates thermal design and rating processes through worked examples, exercises, and student design projects. Much of the text is devoted to describing and exemplifying double-pipe, shell-and-tube, compact, gasketed-plate heat exchanger types, condensers, and evaporators","torrent":{"xt":"urn:btih:6287ccc5155607e548a68d00945bb52474e420b0","amp;dn":"Heat+Exchangers+-+Selection%2C+Rating%2C+and+Thermal+Design+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6287ccc5155607e548a68d00945bb52474e420b0","infoHashBuffer":{"type":"Buffer","data":[98,135,204,197,21,86,7,229,72,166,141,0,148,91,181,36,116,228,32,176]},"announce":[],"urlList":[]}}