{"title":"The Way We Work by David Macaulay","uid":9488534,"size":134255934,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:632201bad86c9022d9cc254eddfe1be509f6e9fa&amp;dn=The+Way+We+Work+by+David+Macaulay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mrdude42","files":-1,"time":1389952823,"description":"This is an outstanding guide to the human body from one of the world's great illustrators! Ever wondered how we breathe, or why? Or what happens to broccoli once your teeth have finished with it? Or how your eyes turn at the same time and in the same direction? Most of us don't stop to think about the countless everyday tasks our bodies perform automatically while we get on with our lives. And yet of all the complex things we encounter as we go through life, our bodies are probably the most remarkable of all...Explore everything from bones to bronchioles, noses to neurons in this clear, comprehensive and utterly engaging guide to the human body from award-winning author-illustrator David Macaulay, creator of the bestselling &quot;The New Way Things Work&quot;. David Macaulay's research took several years, during which he sat in on anatomy classes, dissections and numerous operations. &quot;The New Way Things Work&quot; has enjoyed phenomenal global success, selling millions of copies worldwide, spending fifty weeks on the &quot;New York Times&quot; bestseller list, and being translated into dozens of languages.","torrent":{"xt":"urn:btih:632201bad86c9022d9cc254eddfe1be509f6e9fa","amp;dn":"The+Way+We+Work+by+David+Macaulay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"632201bad86c9022d9cc254eddfe1be509f6e9fa","infoHashBuffer":{"type":"Buffer","data":[99,34,1,186,216,108,144,34,217,204,37,78,221,254,27,229,9,246,233,250]},"announce":[],"urlList":[]}}