{"title":"Bill Callahan - Apocalypse [2011][FLAC]","uid":8985976,"size":224049919,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:632bd77c8eea3d858cea85c92e4ce0e86f8993ba&amp;dn=Bill+Callahan+-+Apocalypse+%5B2011%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"dickspic","files":10,"time":1380668677,"description":"Artist: Bill Callahan\nRelease: Apocalypse\nReleased:  2011\nLabel:   Drag City\nCatalog#:  DC 450CD\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:  Americana\n\n1. Drover - 5:24\n2. Baby's Breath - 5:30\n3. America! - 5:33\n4. Universal Applicant - 5:53\n5. Riding for the Feeling - 6:05\n6. Free's - 3:13\n7. One Fine Morning - 8:45\n\nThose looking for a logical musical follow-up to Bill Callahan's surprisingly accessible Sometimes I Wish I Were an Eagle from 2009 might scratch their heads at the sound on Apocalypse. The musical reference point in his catalog is, perhaps, A River Ain't Too Much to Love, under the Smog moniker. It's not that this recording resembles that one musically, so much as it employs outsider takes on American roots traditions to get its seven songs across. Apocalypse is a song cycle that places the usually extremely inward-looking Callahan in the unlikely role of observer and interpreter of various American myths; myths both externally held and culturally self-referential, that inform the interior world of the protagonist. Recorded and mixed in Texas and adorned by Paul Ryan's iconic painting Apocalypse at Mule Ears Peak, Big Bend National Park in West Texas, the album portrays America in all its complexity from the vantage point of an empathic yet wryly humorous narrator. On album-opener &quot;Drover,&quot; Callahan plays a minor-key, two-chord vamp on a nylon-string guitar, offering a fragmented narrative on a cattle drive. Backed by a full-on rock band led by Matt Kinsey's reverb-laden electric guitar, and colored by Gordon Butler's fiddle, it begs the question: do these cattle actually exist or are they metaphorical elements in the protagonist's psyche? The chorus is the hint as it introduces a lovely second melody and turns the song back on the listener as Callahan sings: &quot;One thing about this wild, wild country/It takes a strong, strong it breaks a strong, strong mind...&quot; &quot;Baby's Breath&quot; is more fractured and rockist, with a taut balance of acoustic and knife-edged electric guitars populating the musical space. Callahan's protagonist found the right place, the right woman, and lost the latter. He has questions but no answers. &quot;America&quot; is the set's hinge piece. A repetitive, electric, pulsing, hypontic distorted blues--a la R.L. Burnside--that examines America's mythical past and its tarnished present. Callahan name checks songwriting heroes -- Kris Kristofferson, Mickey Newbury, George Jones, and Johnny Cash -- by their actual ranks and branches in the armed forces while admitting he's never served, as if that might be the problem; then amid the din to make things more complex, he names our greatest national failures and dirty conquests. The album's most melodic and utterly beautiful song is the confessional waltz &quot;Riding for the Feeling,&quot; with glistening electric piano and Wurlitzer played by Jonathan Meiburg. Closer &quot;One Fine Morning&quot; is a nearly nine-minute, lilting ballad that turns on a couple of chords, some pastoral yet jarring lyrics, and a gospel piano atop strummed guitars, which transmute the listener to another place and time. Apocalypse is a deceptively complex gem.","torrent":{"xt":"urn:btih:632bd77c8eea3d858cea85c92e4ce0e86f8993ba","amp;dn":"Bill+Callahan+-+Apocalypse+%5B2011%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"632bd77c8eea3d858cea85c92e4ce0e86f8993ba","infoHashBuffer":{"type":"Buffer","data":[99,43,215,124,142,234,61,133,140,234,133,201,46,76,224,232,111,137,147,186]},"announce":[],"urlList":[]}}