{"title":"Philosophy of Teachings of Islam","uid":11899264,"size":2941487,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63f217d7155b8e1db3924c5900b6d10dc0a2eb1d&amp;dn=Philosophy+of+Teachings+of+Islam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"r0cxy","files":4,"time":1431217357,"description":"The essay entitled The Philosophy of the Teachings of Islam was written in Urdu by Hadrat Mirza Ghulam Ahmad, the Promised Messiah and Mahdi(as) at the invitation of Swami Shugan Chandar Sahib under whose auspicious the conference of Great Religions was held in Lahore Town Hall from 26th to 29th December 1896. The scholars of Muslims, Christians, Arya Samaj and other religions were invited to represent their religions at the conference of Great Religion. They were required to write on the following five topics on the basis of their Holy Books.\n\n1. The physical, moral and spiritual states of man\n2. What is the state of man after death?\n3. The object of man's life and the means of its attainment,\n4. The operation of the practical ordinances of the Law in this life and the next\n5. Sources of Divine knowledge.\n\nAllah revealed to the Promised Messiah(as) that his essay will be declared supreme over all other essays. And so it was. For instance the Civil and Military Gazette, Lahore, wrote that Hadrat Ahmad's essay was the only one worth mentioning and the only one paper which was commended highly. The essay has been published in several languages in different countries.\n\nIt is the best and most comprehensive introduction to Islam within the scope of the above five questions. The book was translated into English by Sir Muhammad Zafrulla Khan Sahib.\n\n-----------------------------------------------------------------------------------\n\nAn Overview of The Ahmadiyya Muslim Community:\n\nThe Ahmadiyya Muslim Community is a dynamic, fast growing international revival movement within Islam. Founded in 1889, it spans over 206 countries with membership exceeding tens of millions. Its current headquarters are in the United Kingdom.\n\nAhmadiyya Muslim Community is the only Islamic organization to believe that the long-awaited Messiah has come in the person of Mirza Ghulam Ahmad(as) (1835-1908) of Qadian. Ahmad(as) claimed to be the metaphorical second coming of Jesus(as) of Nazareth and the divine guide, whose advent was foretold by the Prophet of Islam, Muhammad(sa).\n   &lt;a href=&quot;\nhttp://www.alislam.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.alislam.org/&lt;/a&gt;   &lt;a href=&quot;\nhttp://www.mta.tv/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mta.tv/&lt;/a&gt;","torrent":{"xt":"urn:btih:63f217d7155b8e1db3924c5900b6d10dc0a2eb1d","amp;dn":"Philosophy+of+Teachings+of+Islam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63f217d7155b8e1db3924c5900b6d10dc0a2eb1d","infoHashBuffer":{"type":"Buffer","data":[99,242,23,215,21,91,142,29,179,146,76,89,0,182,209,13,192,162,235,29]},"announce":[],"urlList":[]}}