{"title":"Autodesk Inventor Professional 2013 SP1.1 Update 1","uid":8010654,"size":5804372293,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:64aa750934f36e1e4cf09603dfa02ed854fc352a&amp;dn=Autodesk+Inventor+Professional+2013+SP1.1+Update+1+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"PhineasTPhogg","files":-1,"time":1357987591,"description":"Autodesk Inventor software includes comprehensive tools to generate accurate engineering and manufacturing documentation directly from the 3D model and makes it easy for AutoCAD software users to realize the benefits of Digital Prototyping by taking full advantage of their investments in DWG design data and AutoCAD software expertise. \n\nThe Autodesk Inventor 3D model is an accurate 3D digital prototype that enables users to validate the form, fit, and function of a design; minimize the need for physical prototypes; and reduce costly engineering changes that are discovered only after the design is sent to manufacturing.\n\nAbout Autodesk Inc.\n\nAutodesk, Inc., is a leader in 3D design, engineering and entertainment software. Customers across the manufacturing, architecture, building, construction, and media and entertainment industries-including the last 16 Academy Award winners for Best Visual Effects-use Autodesk software to design, visualize, and simulate their ideas before they're ever built or created. From blockbuster visual effects and buildings that create their own energy to electric cars and the batteries that power them, the work of our 3D software customers is everywhere you look.\n\nThrough our apps for iPhone, iPad, iPod, and Android, we're also making design technology accessible to professional designers as well as amateur designers, homeowners, students, and casual creators. Whether it's a kid looking to build a new contraption, a seasoned pro sketching out a great new idea, or someone who just wants to amp up their creative output, we're taking technology originally built for movie studios, automakers, and architectural firms, and making it available to anyone who wants to create and share their ideas with the world.\n\nSince its introduction of AutoCAD software in 1982, Autodesk continues to develop the broadest portfolio of state-of-the-art 3D software for global markets.","torrent":{"xt":"urn:btih:64aa750934f36e1e4cf09603dfa02ed854fc352a","amp;dn":"Autodesk+Inventor+Professional+2013+SP1.1+Update+1+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64aa750934f36e1e4cf09603dfa02ed854fc352a","infoHashBuffer":{"type":"Buffer","data":[100,170,117,9,52,243,110,30,76,240,150,3,223,160,46,216,84,252,53,42]},"announce":[],"urlList":[]}}