{"title":"Never Have I Ever: My Life (So Far) Without a Date - Katie Heane","uid":10122888,"size":947256,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64e2542501e6c0fdcc6dbbaf02b4f8642a4df5f1&amp;dn=Never+Have+I+Ever%3A+My+Life+%28So+Far%29+Without+a+Date+-+Katie+Heane&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"laaddict","files":1,"time":1399706478,"description":"&quot;I've been single for my entire life. Not one boyfriend. Not one short-term dating situation. Not one person with whom I regularly hung out and kissed on the face.&quot;\n\nSo begins Katie Heaney's memoir of her years spent looking for love, but never quite finding it. By age 25, equipped with a college degree, a load of friends, and a happy family life, she still has never had a boyfriend...and she's barely even been on a second date.\n\nThroughout this laugh-out-loud funny book, you will meet Katie's loyal group of girlfriends, including flirtatious and outgoing Rylee, the wild child to Katie's shrinking violet, as well as a whole roster of Katie's ill-fated crushes. And you will get to know Katie herself -- a smart, modern heroine relaying truths about everything from the subtleties of a Facebook message exchange to the fact that &quot;Everybody who works in a coffee shop is at least a little bit hot.&quot;\n\nFunny, relatable, and inspiring, this is a memoir for anyone who has ever struggled to find love, but has also had a lot of fun in the process.","torrent":{"xt":"urn:btih:64e2542501e6c0fdcc6dbbaf02b4f8642a4df5f1","amp;dn":"Never+Have+I+Ever%3A+My+Life+%28So+Far%29+Without+a+Date+-+Katie+Heane","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64e2542501e6c0fdcc6dbbaf02b4f8642a4df5f1","infoHashBuffer":{"type":"Buffer","data":[100,226,84,37,1,230,192,253,204,109,187,175,2,180,248,100,42,77,245,241]},"announce":[],"urlList":[]}}