{"title":"Jeffrey Archer - Mightier Than the Sword (Clifton Chronicles #5)","uid":14632861,"size":373789241,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:652c4da47ea6766e9f7932d72336de2b7724ca24&amp;dn=Jeffrey+Archer+-+Mightier+Than+the+Sword+%28Clifton+Chronicles+%235%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Cybotage","files":13,"time":1463373168,"description":"A bomb goes off, but how many passengers on the MV Buckingham have lost their lives? You will find out only if you read the opening chapter of Mightier than the Sword.\r\n\r\nWhen Harry arrives in New York, his publisher Harold Guinzberg tells him he has been elected as the next president of English PEN, which will give him the opportunity to launch a campaign for the release of a fellow author, Anatoly Babakov, who is languishing in a Russian Gulag in Siberia. His crime, writing a book Uncle Joe, which gives an insight into what it was like to work for Josef Stalin. So determined is he to see Babakov released, Harry puts his own life in danger.\r\n\r\nEmma Clifton, now Chairman of Barrington Shipping, is having to face the repercussions of the IRA bombing her ship. Some board members feel she should resign while others, including Sebastian Clifton, newly elected to the board, are determined to see she remains as Chairman.\r\n\r\nGiles Barrington is now a Minister of the Crown, and looks set for high office, but a trip to East Germany does not end as a diplomatic success, and once again Giles' political career is thrown off balance by none other than Major Alex Fisher. Fisher decides to stand against Giles at the forthcoming general election. But this time who wins?\r\n\r\nSebastian Clifton asks his girlfriend Samantha to marry him. She happily accepts, but then later changes her mind after she discovers what Seb has been up to behind her back.\r\n\r\nThe book ends with two court trials: one at the high court in London, a libel case pitting Emma Clifton against Lady Virginia Fenwick; while another, a show trial, takes place in Russia after Harry has been arrested as a spy. Thus continues book five of the Clifton Chronicles, Jeffrey Archer's most accomplished work to date, with all the trademark twists and turns that have made him one of the most successful authors in the world","torrent":{"xt":"urn:btih:652c4da47ea6766e9f7932d72336de2b7724ca24","amp;dn":"Jeffrey+Archer+-+Mightier+Than+the+Sword+%28Clifton+Chronicles+%235%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"652c4da47ea6766e9f7932d72336de2b7724ca24","infoHashBuffer":{"type":"Buffer","data":[101,44,77,164,126,166,118,110,159,121,50,215,35,54,222,43,119,36,202,36]},"announce":[],"urlList":[]}}