{"title":"Packet Monitoring and Internet Hacking, Brute Force and Cracker","uid":6302847,"size":27636815,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:65c6c1c7061da5e57bf110f4ec9b6a91abddf6b1&amp;dn=Packet+Monitoring+and+Internet+Hacking%2C+Brute+Force+and+Cracker+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Junto1","files":1,"time":1302214832,"description":"Inside is a self-extracting 7-zip files that contains three files:\n\n1. Wireshark\n\nA flexible packet monitoring system that allows anyone to save, sift, filter, arrange, and categorize packets through a LAN Network.\n\nWireshark's purpose is to capture network traffic and put it in a format that humans can read.\n\nHere is more on this great tool: \n &lt;a href=&quot;\nhttp://wiresharkdownloads.riverbed.com/video/wireshark/introduction-to-wireshark/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wiresharkdownloads.riverbed.com/video/wireshark/introduction-to-wireshark/&lt;/a&gt;\n\n2. Cain \n\n&quot;Cain &amp; Abel is a password recovery tool for Microsoft Operating Systems. It allows easy recovery of various kind of passwords by sniffing the network, cracking encrypted passwords using Dictionary, Brute-Force and Cryptanalysis attacks, recording VoIP conversations, decoding scrambled passwords, recovering wireless network keys, revealing password boxes, uncovering cached passwords and analyzing routing protocols. The program does not exploit any software vulnerabilities or bugs that could not be fixed with little effort. It covers some security aspects/weakness present in protocol's standards, authentication methods and caching mechanisms; its main purpose is the simplified recovery of passwords and credentials from various sources, however it also ships some &quot;non standard&quot; utilities for Microsoft Windows users.\n\nCain &amp; Abel has been developed in the hope that it will be useful for network administrators, teachers, security consultants/professionals, forensic staff, security software vendors, professional penetration tester and everyone else that plans to use it for ethical reasons. The author will not help or support any illegal activity done with this program. Be warned that there is the possibility that you will cause damages and/or loss of data using this software and that in no events shall the author be liable for such damages or loss of data. Please carefully read the License Agreement included in the program before using it.\n\nThe latest version is faster and contains a lot of new features like APR (Arp Poison Routing) which enables sniffing on switched LANs and Man-in-the-Middle attacks. The sniffer in this version can also analyze encrypted protocols such as SSH-1 and HTTPS, and contains filters to capture credentials from a wide range of authentication mechanisms. The new version also ships routing protocols authentication monitors and routes extractors, dictionary and brute-force crackers for all common hashing algorithms and for several specific authentications, password/hash calculators, cryptanalysis attacks, password decoders and  some not so common utilities related to network and system security.&quot; \n\n3. The last program is a driver, or WinPcap that allows packet injecting.","torrent":{"xt":"urn:btih:65c6c1c7061da5e57bf110f4ec9b6a91abddf6b1","amp;dn":"Packet+Monitoring+and+Internet+Hacking%2C+Brute+Force+and+Cracker+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65c6c1c7061da5e57bf110f4ec9b6a91abddf6b1","infoHashBuffer":{"type":"Buffer","data":[101,198,193,199,6,29,165,229,123,241,16,244,236,155,106,145,171,221,246,177]},"announce":[],"urlList":[]}}