{"title":"Little Willie John - The Early King Sessions 1955 57 - eac, flac","uid":9463878,"size":229263400,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:661f5a5d049ea644de69194ae4abd68fb43cf675&amp;dn=Little+Willie+John+-+The+Early+King+Sessions+1955+57+-+eac%2C+flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"johnny39","files":36,"time":1389409766,"description":"I was first alerted to the excellence of Little Willie John's early King sides by the 1985 Bill Millar/Cliff White-compiled LP &quot;Grits And Soul&quot;. Unfortunately, that album - like all CD reissues to date - only included a selection of these prime Rhythm &amp; Blues cuts, the balance comprising later recordings which tend to be sweeter, more pop-oriented, and which just don't have the same appeal for this listener. Therefore this 24 track CD is more than welcome, as it avoids the syrup and just offers us a straight reissue of Little Willie John's first twelve singles for King. The one minor qualification is I'm Sticking With You Baby where compiler John Broven has chosen the LP version with its gutsy sax solo - the 45rpm version having been much reissued anyway. Willie John was of course a magnificent singer, and he is well-served here both by the strength of the material, and the first class musicianship of the New York and Cincinnati studio bands. The songs are a mixture of mid-tempo items and stunning blues ballads and it is their sheer strength (and the quality of the song-writing) to which I would draw particular attention. The best known song is Fever, which gave John his biggest R&amp;B hit (#1 R&amp;B in May 1956): it was most famously covered by the late Peggy Lee (what a pity that none of the obituaries I read mentioned Willie's original) and was co-written for John by Otis Blackwell under the pseudonym John Davenport. However, the excellent blues ballad Need Your Love So Bad, penned by Willie's brother, Mertis, and covered in the UK by Fleetwood Mac, runs it close. Accomplished writers Rose Marie McCoy and Rudy Toombs both feature strongly, and it was particularly interesting to re-acquaint myself with the original of the McCoy and Charlie Singleton Letter From My Darling - another big seller - having become much more familiar with Kip Anderson's later 'deep soul' rendition. There is no doubt that for these early sessions, veteran King producer Henry Glover fed Willie songs which matched and suited his talent. The nicely presented package is completed by a well researched sleevenote from Bill Dahl who interviewed both Mable and Mertis John before writing it - there are good illustrations too which include some fascinating memorabilia. And full marks to the re-mastering engineer who has really captured that rich King studio ambience. This is a CD of great R&amp;B songs by a great singer. By Richard Tapp (Juke Blues Magazine) - See more at: http://acerecords.co.uk/the-early-king-sessions#sthash.HIE5vVct.dpuf","torrent":{"xt":"urn:btih:661f5a5d049ea644de69194ae4abd68fb43cf675","amp;dn":"Little+Willie+John+-+The+Early+King+Sessions+1955+57+-+eac%2C+flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"661f5a5d049ea644de69194ae4abd68fb43cf675","infoHashBuffer":{"type":"Buffer","data":[102,31,90,93,4,158,166,68,222,105,25,74,228,171,214,143,180,60,246,117]},"announce":[],"urlList":[]}}