{"title":"Adam Phillips - On Kissing, Tickling, and Being Bored [1993][A]","uid":10099116,"size":2724414,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66a3cbfc4d34cd5b1790ce989c907bbc16cf1a52&amp;dn=Adam+Phillips+-+On+Kissing%2C+Tickling%2C+and+Being+Bored+%5B1993%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Anette14","files":-1,"time":1399357527,"description":"Description\nProduct Details\nBook Title: On Kissing, Tickling, and Being Bored: Psychoanalytic Essays on the Unexamined Life\t\nBook Author: Adam Phillips (Author)\nHardcover: 160 pages\nPublisher: Harvard University Press (February 1993)\nLanguage: English\nISBN-10: 0674634624\nISBN-13: 978-0674634626\nThis book is scanned, so not at its best, but a very interesting book that deserves to be uploaded.:)\n\n===================================================================================\nBook Description\nIn a style that is writerly and audacious, Adam Phillips takes up a variety of seemingly ordinary subjects underinvestigated by psychoanalysis--kissing, worrying, risk, solitude, composure, even farting as it relates to worrying.\nHe argues that psychoanalysis began as a virtuoso improvisation within the science of medicine, but that virtuosity has given way to the dream of science that only the examined life is worth living. Phillips goes on to show how the drive to omniscience has been unfortunate both for psychoanalysis and for life. He reveals how much one's psychic health depends on establishing a realm of life that successfully resists examination.\n\n===================================================================================\nReviews\nAdam Phillips...writes about magnificently light subjects (kissing, tickling and, best of all, worrying) with a great deal of insight...He writes with farsighted equanimity about everything from solitude to spiders. In this regard, he's a bit like an Oliver Sacks of psychoanalysis, both affable and unalarmed.\n--Gail Caldwell (Boston Sunday Globe)\n\nA childlike freshness of vision informs these essays, which are at once compact, sophisticated, sharply knowing, yet almost provocatively casual, relaxed, amusing...[Phillips] is strikingly original and suggestive as a wry observer of psychoanalysis...[A] telling, engaging, brilliantly amusing and unsettling book.\n--Robert Coles (Raritan)\n\nIn three superb books, On Kissing, Tickling, and Being Bored; On Flirtation; and Terrors and Experts...[Phillips] has endorsed pleasure as a laudable goal (imagine!) and enshrined narrative as a form of soul making. In the process, he's punched lovely skylights into the gloomy Freudian edifice and in general done much to rehabilitate the psychoanalytic enterprise by honoring the idiosyncrasy of human experience and by wielding method lightly, playfully, humanely.\n--Will Blythe (Esquire)\n\nLike Chekhov, Phillips writes as well as he doctors, and his fascination with the subtleties of human behavior makes him a good storyteller...He has a welcome openness to the essential strangeness of every person; this alone is reason enough to read him.\n--Jane Mendelsohn (Guardian)\n\nThese are extremely insightful psychoanalytic essays on things like worry and solitude, which are of much more concern to me than issues like wanting to sleep with your closest relatives\n--Anne Enright (Irish Times)\n\n===================================================================================\nAbout the Author\nAdam Phillips is Principal Child Psychotherapist in the Wolverton Gardens Child and Family Consultation Centre, London.\n===================================================================================","torrent":{"xt":"urn:btih:66a3cbfc4d34cd5b1790ce989c907bbc16cf1a52","amp;dn":"Adam+Phillips+-+On+Kissing%2C+Tickling%2C+and+Being+Bored+%5B1993%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66a3cbfc4d34cd5b1790ce989c907bbc16cf1a52","infoHashBuffer":{"type":"Buffer","data":[102,163,203,252,77,52,205,91,23,144,206,152,156,144,123,188,22,207,26,82]},"announce":[],"urlList":[]}}