{"title":"Robert Plant - Nine Lives (Box Set 9CD) (FLAC)","uid":5176911,"size":3729546302,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:66b02fd7af4f90ede7c7cb1e18a08ab3eec923f4&amp;dn=Robert+Plant+-+Nine+Lives+%28Box+Set+9CD%29+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"black mamba TNT","files":-1,"time":1259022154,"description":"Year: 2006\nCodec: Flac Level 8 (Lossless)\n\n\nDescription:\n\nDriven by an insatiable artistic curiosity, Robert Plant has spent his life as a singer and songwriter chasing new sounds, rediscovering ancient ones and bringing them both together to create something original. Throughout his career - first as a member of Led Zeppelin and then as a solo artist for the past 25 years Plant has tapped a multifarious array of inspirations that span the globe and the ages including Celtic and English folk, American blues, early rock 'n' roll, psychedelic rock and jazz as well as Arabic, Moroccan, West African and Indian music. After nine acclaimed solo albums - seven with Atlantic Records - Plant remains a restless spirit destined to a life of musical wanderlust.\n\nRhino Records captures each of Plant's musical reincarnations with Nine Lives. The boxed set features all nine of Plant's solo albums remastered and expanded with bonus tracks that include previously unreleased material.\n\nPlant began his solo career in 1982 with Pictures At Eleven. Backed by a group that included guitarist Robbie Blunt and drummer Phil Collins Plant created an eclectic mix of soundscapes that openly eschewed rehashing Led Zeppelin's hard rock legacy. Peaking at #5 on the Billboard Album chart, Plant's debut featured the single &quot;Burning Down One Side.&quot; Playing with new musicians after 12 years with Led Zeppelin was hard at first, &quot;but it turned out to be a lot easier than I had envisioned,&quot; Plant explains in the liner notes. &quot;I found I wanted to pour out my soul once the door was open. From then on I was ready to work with anybody.&quot; The expanded version includes a pair of bonus songs: &quot;Far Post&quot; and a live version of the album track &quot;Like I've Never Been Gone,&quot; recorded in Houston in 1983.\n\nThe Principle Of Moments, Plants' sophomore solo album, refined the sound of its predecessor and built on the group's songwriting chemistry to create a personal and intense collection of songs. The single, &quot;Big Log,&quot; cracked Billboard's Top 20 and became Plant's first solo hit. The album also featured the songs &quot;In The Mood,&quot; &quot;Other Arms&quot; and &quot;Horizontal Departure.&quot; The expanded version includes live performances of &quot;In The Mood&quot; and &quot;Thru' With The Two Step,&quot; a cover of Bob Marley's &quot;Lively Up Yourself&quot; and the previously unreleased track &quot;Turnaround.&quot;\n\nPlant changed pace completely in 1984 with The Honeydrippers: Volume One, an EP that celebrated Plant's first musical love with covers of rock from of the '50s and '60s featuring guest appearances by Jeff Beck and Jimmy Page. A tantalizingly small collection of gems, the album featured five tracks including Ray Charles' &quot;I Got A Woman,&quot; Roy Brown's &quot;Rockin' At Midnight&quot; and a song that became an international hit for Plant, a cover of &quot;Sea Of Love.&quot; The expanded version includes a live version of &quot;Rockin' At Midnight.&quot;\n\nPlant returned in 1985 with another sonic departure, Shaken 'N' Stirred. Joined by former Little Feat drummer Ritchie Hayward, Plant recorded an album that was both musically innovative and yet of its time. &quot;It was important to get away from the standard idea of rock,&quot; Plant writes in the liner notes. &quot;It's the feel of the time, it's the adventure of music at the time, and the adventure of the technology.&quot; The album, which reached Billboard's Top 20, includes the hit singles &quot;Little By Little&quot; and &quot;Sixes And Sevens.&quot; The expanded version includes a remixed version of &quot;Little By Little.&quot;\n\nNow And Zen - Plant's 1988 album - marked a new beginning that saw him embracing his musical past while moving forward. Inspired by his powerhouse band - including keyboardist and songwriting partner Phil Johnstone, drummer Chris Blackwell, bassist Phil Scragg and guitarist Doug Boyle - Plant recorded a passionate album filled with attitude. Titled after a 1959 Wailers instrumental, the smash single &quot;Tall Cool One&quot; featured a cameo by Zep guitarist Jimmy Page, whose dive-bombing guitar provided the song's signature lick. Peaking at #6 on Billboard's Album chart, Now And Zen also features &quot;Heaven Knows,&quot; &quot;Dance On My Own,&quot; and the moody &quot;Ship Of Fools.&quot; The expanded version includes live versions of several album cuts.\n\nManic Nirvana, released in 1990, built on Plant's harder edge for much of the album before giving way - on the second half - to a reflective, symphonic sound. The album's stylistic dichotomy is embodied by the album opener-the rocking &quot;Hurting Kind (I've Got My Eyes On You)&quot;-and the album closer &quot;Watching You,&quot; which includes Moroccan chromatics and West African drumming. The album also includes &quot;Tie Dye On The Highway,&quot; &quot;Big Love&quot; and &quot;I Cried.&quot; The expanded version features &quot;One Love&quot; and &quot;Don't Look Back&quot; as well as &quot;Oompa (Watery Bint),&quot; which was released as a promo single B-side.\n\nRobert Plant released in 1993, Fate Of Nations marks another shift in Plant's musical palette. For this album, Plant returned to the folk origins that ran quietly beneath much of Led Zeppelin's music while incorporating the more mystical roots of bands like Traffic, Fairport Convention and especially Tim Hardin, who Plant covers with &quot;If I Were A Carpenter.&quot; The result is a collection of songs that mix acoustic and natural-sounding instruments to create music that is epic, adventurous and deeply challenging. The album features the songs &quot;Calling To You,&quot; &quot;29 Palms&quot; and a pair of overtly political tracks, &quot;Network News&quot; and &quot;Great Spirit,&quot; an anthemic prayer that calls out for healing. The expanded version includes &quot;Dark Moon,&quot; &quot;8:05,&quot; a demo version of &quot;Rollercoaster&quot; culled from Plant's archives, the B-side version of &quot;Great Spirit&quot; and &quot;Colours Of A Shade,&quot; a song previously unreleased in the UK and Japan.\n\nAfter collaborating with Jimmy Page on several projects, Plant returned in 2002 on Universal Records with the Grammy nominated Dreamland, a collection of covers - plus two originals - that are as compelling as they are idiosyncratic. For the first album with his new band Strange Sensation, Plant brings together songs that inspired him over the years including Tim Buckley's &quot;Song To The Siren,&quot; bluesman Bukka White's &quot;Funny In My Mind (I Believe I'm Fixin' To Die),&quot; &quot;One More Cup Of Coffee&quot; by Bob Dylan and &quot;Skip's Song&quot; by Skip Spence, the enigmatic member of Moby Grape. The expanded version includes a remix of the original track &quot;Last Time I Saw Her,&quot; and &quot;Dirt In A Hole,&quot; a song previously only available in the UK, Japan and Australia.\n\nMighty Rearranger, this twice Grammy nominated album was released last year on Sanctuary Records and is Plant's first album of original material with Strange Sensation. The album represents a culmination of Plant's experience and contains songs imbued with a quarter century of his musical vision. The music is instantly infectious and dynamic with shimmering Indo-Arabic accents. Cracking the Top 25 of Billboard's Album chart, the album featured the hit single &quot;Shine It All Around,&quot; the rockabilly-inflected &quot;Freedom Fries,&quot; and &quot;Brother Ray,&quot; a bluesy piano tribute to Ray Charles. The expanded version includes &quot;Red, White And Blue,&quot; &quot;All The Money In The World,&quot; remixes of &quot;Tin Pan Valley,&quot; &quot;Shine It All Around,&quot; and &quot;The Enchanter&quot; remixed by James Lavelle.\n\n\n\nDisc 1 - Pictures at Eleven\n\n01. Burning Down One Side\n02. Moonlight In Samosa\n03. Pledge Pin\n04. Slow Dancer\n05. Worse Than Detroit\n06. Fat Lip\n07. Like I've Never Been Gone\n08. Mystery Title\n09. Far Post\n10. Like I've Never Been Gone (Live)\n\n\n\nDisc 2 - The Principle of Moments\n\n01. Other Arms\n02. In The Mood\n03. Messin' With The Mekon\n04. Wreckless Love\n05. Thru With The Two Step\n06. Horizontal Departure\n07. Stranger Here Than Over There\n08. Big Log\n09. In The Mood (Live)\n10. Thru With The Two Step (Live)\n11. Lively Up Yourself (Live)\n12. Turnaround\n\n\n\nDisc 3 - The Honeydrippers - Volume 1\n\n01. I Get A Thrill\n02. Sea Of Love\n03. I Got A Woman\n04. Young Boy Blues\n05. Rockin' At Midnight\n06. Rockin' At Midnight (Live)\n\n\n\nDisc 4 - Shaken 'N' Stirred\n\n01. Hip To Hoo\n02. Kallalou Kallalou\n03. Too Loud\n04. Trouble Your Money\n05. Pink And Black\n06. Little By Little\n07. Doo Doo A Do Do\n08. Easily Lead\n09. Sixes And Sevens\n10. Little By Little (Long Version remix)\n\n\n\nDisc 5 - Now and Zen\n\n01. Heaven Knows\n02. Dance On My Own\n03. Tall Cool One\n04. The Way I Feel\n05. Ship Of Fools\n06. Helen Of Troy\n07. Billy's Revenge\n08. Why\n09. White, Clean And Neat\n10. Walking Towards Paradise (bonus track)\n11. Billy's Revenge (Live)\n12. Ship Of Fools (Live)\n13. Tall Cool One (Live)\n\n\n\nDisc 6 - Manic Nirvana\n\n01. Hurting Kind (I've Got My Eyes On You)\n02. Big Love\n03. S S S &amp; Q\n04. I Cried\n05. She Said\n06. Nirvana\n07. Tie Dye On The Highway\n08. Your Ma Said You Cried In Your Sleep Last Night\n09. Anniversary\n10. Liars Dance\n11. Watching You\n12. Oompa (Watery Bint)\n13. One Love\n14. Don't Look Back\n\n\n\nDisc 7 - Fate of Nations\n\n01. Calling To You\n02. Down To The Sea\n03. Come Into My Life (with Richard Thompson &amp; Marie Brennan)\n04. I Believe\n05. 29 Palms\n06. Memory Song (Hello, Hello)\n07. If I Were A Carpenter\n08. Promised Land\n09. The Greatest Gift\n10. Great Spirit\n11. Network News\n12. Colours Of A Shade\n13. Great Spirit (Acoustic mix)\n14. Rollercoaster (Demo)\n15. Dark Moon (Acoustic)\n\n\n\nDisc 8 - Dreamland\n\n01. Funny In My Mind (I Believe I'm Fixin' To Die)\n02. Morning Dew\n03. One More Cup Of Coffee\n04. Last Time I Saw Her\n05. Song To The Siren\n06. Win My Train Fare Home\n07. Darkness, Darkness\n08. Red Dress\n09. Hey Joe\n10. Skip's Song\n11. Dirt In A Hole\n12. Last Time I Saw Her (remix)\n\n\n\nDisc 9 - Mighty Rearranger\n\n01. Another Tribe (with Strange Sensation)\n02. Shine It All Around (with Strange Sensation)\n03. Freedom Fries (with Strange Sensation)\n04. Tin Pan Valley (with Strange Sensation)\n05. All The King's Horses (with Strange Sensation)\n06. The Enchanter (with Strange Sensation)\n07. Takamba (with Strange Sensation)\n08. Dancing In Heaven (with Strange Sensation)\n09. Somebody Knocking (with Strange Sensation)\n10. Let The Four Winds Blow (with Strange Sensation)\n11. Mighty Rearranger (with Strange Sensation)\n12. Brother Ray (with Strange Sensation)\n13. Red, White And Blue\n14. All The Money In The World\n15. Shine It All Around Tin Pan Valley (Girls remix)\n16. Tin Pan Valley (Girls remix)\n17. The Enchanter (Unkle Reconstruction)","torrent":{"xt":"urn:btih:66b02fd7af4f90ede7c7cb1e18a08ab3eec923f4","amp;dn":"Robert+Plant+-+Nine+Lives+%28Box+Set+9CD%29+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66b02fd7af4f90ede7c7cb1e18a08ab3eec923f4","infoHashBuffer":{"type":"Buffer","data":[102,176,47,215,175,79,144,237,231,199,203,30,24,160,138,179,238,201,35,244]},"announce":[],"urlList":[]}}