{"title":"Extreme Prejudice by Susan Lindauer","uid":9661792,"size":9198617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66f150f0b269be50516779e8b66b149b043c052f&amp;dn=Extreme+Prejudice+by+Susan+Lindauer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"PirateBook","files":3,"time":1393295914,"description":"\nWhat if the government decided to invent a great lie to justify a disastrous war? What would happen to the people who know the truth? EXTREME PREJUDICE delivers an explosive, high tension expose of the real facts surrounding the CIA's advance warning of 9/11 and an insider's look at Iraqi Pre-War Intelligence, told by one of the very few U.S. Assets covering Iraq before the War. It reveals the depths of deception by leaders in Washington and London to promote a successful image of their terrorism policy, and the shocking brutality to suppress the truth of their failures from Americans and the world community.\n\nFormer Congressional staffer Susan Lindauer covered Iraq and Libya at the United Nations, as a U.S. Intelligence Asset and back door channel on anti-terrorism from 1993 to 2003. Most notoriously, in the summer of 2001, her team warned about a major terrorist attack involving airplane hijackings and a strike on the World Trade Center. Lindauer also campaigned heavily against the War in Iraq, and developed a comprehensive peace framework through her back-channel in the run up to War.\n\nThis is the story of what happened when Lindauer tried to disclose the true facts of Iraqi Pre-War Intelligence and the 9/11 warning to Congress and the American people. It details the nightmare of her arrest on the Patriot Act and her imprisonment without a trial at the notorious prison inside Carswell Air Force Base in Texas. EXTREME PREJUDICE is a true life spy thriller.\n\nGenre: Non Fiction | Politics / American History ","torrent":{"xt":"urn:btih:66f150f0b269be50516779e8b66b149b043c052f","amp;dn":"Extreme+Prejudice+by+Susan+Lindauer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66f150f0b269be50516779e8b66b149b043c052f","infoHashBuffer":{"type":"Buffer","data":[102,241,80,240,178,105,190,80,81,103,121,232,182,107,20,155,4,60,5,47]},"announce":[],"urlList":[]}}