{"title":"The Editor's Eye (Writing) [Epub &amp; Mobi] [StormRG]","uid":10287683,"size":1662320,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6840758003f0d43db889d59e445c8ebedebd898a&amp;dn=The+Editor%27s+Eye+%28Writing%29+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"krystine","files":-1,"time":1401812341,"description":"The Editor's Eye: A Practical Guide to Transforming Your Book from Good to Great (Author Education Series)\nAuthor: Stacy Ennis\nPublished: 2013\nPublisher: Night Owls Press LLC\nISBN: 9781937645052\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\nEditing is integral to the writing process, but its role is often misunderstood. What if editing could make writing less stressful and more enjoyable? What if it could help you write sharper, more compelling prose?\n\nThe Editor's Eye: A Practical Guide to Transforming Your Book from Good to Great shows you how editing can help you write your best book. In this no-nonsense guide, book coach and editor Stacy Ennis takes you through the ins and outs of the often bewildering book-editing process. As you begin to understand how writing and editing complement each other, you'll become more confident as a writer, finish your book faster, and move toward the ultimate goal: publication.\n\nSeasoned and would-be authors will discover how to: \nMaster the basics: Understand the four core editing stages and when they should take place.\nWrite with an editor's eye: Streamline your writing with self-editing tips.\nHire and work with editors: Learn where to look, what you can expect to pay, and how to collaborate.\nRevise painlessly: Implement editor and reader feedback with ease.\nLearn from the pros: Get advice from 20 publishing experts, fiction and nonfiction authors, and editors.\n\nTo learn more about 'The Editor's Eye' and to download free resources, such as a sample style guide, sample letter of agreement, manuscript review form, editing checklist, visit www.stacyennis.com.\n","torrent":{"xt":"urn:btih:6840758003f0d43db889d59e445c8ebedebd898a","amp;dn":"The+Editor%27s+Eye+%28Writing%29+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6840758003f0d43db889d59e445c8ebedebd898a","infoHashBuffer":{"type":"Buffer","data":[104,64,117,128,3,240,212,61,184,137,213,158,68,92,142,190,222,189,137,138]},"announce":[],"urlList":[]}}