{"title":"U2 - 18 Singles (Greatest Hits) 2006 [FLAC] - Kitlope","uid":5578666,"size":536305445,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:687631d457e43e538035e41d16112989e1d37b96&amp;dn=U2+-+18+Singles+%28Greatest+Hits%29+2006+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Kitlope","files":21,"time":1274461298,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nCd Hardware: Plextor PX-716SA \nPlextor Firmware: 1.11 (Final)\nCd Software: Exact Audio Copy V0.99 prebeta 5\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tracker.openbittorrent.com/announce;\nTorrent Hash: 687631D457E43E538035E41D16112989E1D37B96\nFile Size: 511.46 MB\nYear: 2006\nLabel: Universal Island Records\nCatalog #: 0251713542\n\n\n\n\nPlease help seed these FLACs! \n\n\n\n\n\n\n\nFrom Wiki:\n\n\n\nU2 are a rock band from Dublin, Ireland. The group consists of Bono (vocals and guitar), The Edge (guitar, keyboards, and vocals), Adam Clayton (bass guitar), and Larry Mullen, Jr. (drums and percussion).\n\nThe band formed at Mount Temple secondary school in 1976 when the members were teenagers with limited musical proficiency. Within four years, they signed to Island Records and released their debut album Boy. By the mid-1980s, they had become a top international act. They were more successful as a live act than they were at selling records, until their 1987 album The Joshua Tree,[1] which, according to Rolling Stone, elevated the band's stature &quot;from heroes to superstars&quot;.[2]\n\nTheir 1991 album Achtung Baby and the accompanying Zoo TV Tour were a musical and thematic reinvention for the band. Reacting to their own sense of musical stagnation and a late-1980s critical backlash, U2 incorporated dance music and alternative rock influences into their sound and performances, abandoning their earnest image for a more ironic, self-deprecating tone. Similar experimentation continued for the remainder of the 1990s. Since 2000, U2 have pursued a more conventional sound, while maintaining influences from their previous musical explorations.\n\nU2 have released 12 studio albums and are among the most critically and commercially successful groups in popular music. They have won 22 Grammy Awards,[3] more than any other band,[4] and they have sold more than 150 million records.[3][5] In 2005, the band were inducted into the Rock and Roll Hall of Fame in their first year of eligibility. Rolling Stone magazine listed U2 at #22 in its list of the 100 greatest artists of all time.[6] Throughout their career, as a band and as individuals, they have campaigned for human rights and philanthropic causes, including Amnesty International, the ONE/DATA campaigns, Product Red, and The Edge's Music Rising.\n\n\n\n\n\n\n\n18 Singles 2006\n\n\nU218 Singles is a greatest hits-style compilation album by the Irish rock band U2, released in November 2006. It contains eighteen songs: sixteen of their most successful and popular singles, &quot;The Saints Are Coming&quot; (a cover version in collaboration with Green Day of a song by The Skids) and &quot;Window in the Skies&quot; (a new song). U218 Videos, a DVD featuring music videos from throughout U2's career, was released concurrently.\n\nThe album debuted on the Billboard 200 album chart on December 9, 2006 at number 12 with sales of 134,000 copies. It spent 45 weeks on the chart. As of January 24, 2008[dated info], it has sold 847,490 copies in the US. Despite not being released until November 2006, it was the seventh highest-selling album in the world that year[1]\n\n\n\nTracks: \n\n\n1.\t&quot;Beautiful Day&quot;  \n2.\t&quot;I Still Haven't Found What I'm Looking For&quot;  \n3.\t&quot;Pride (In the Name of Love)&quot;  \n4.\t&quot;With or Without You&quot;  \n5.\t&quot;Vertigo&quot; (single version)\n6.\t&quot;New Year's Day&quot; (Japanese single version)\n7.\t&quot;Mysterious Ways&quot;  \n8.\t&quot;Stuck in a Moment You Can't Get Out Of&quot;  \n9.\t&quot;Where the Streets Have No Name&quot; (U218 edit)\n10.\t&quot;Sweetest Thing&quot; (single mix)\n11.\t&quot;Sunday Bloody Sunday&quot;  \n12.\t&quot;One&quot;  \n13.\t&quot;Desire&quot;  \n14.\t&quot;Walk On&quot; (Canadian single version)\n15.\t&quot;Elevation&quot; (album version)\n16.\t&quot;Sometimes You Can't Make It on Your Own&quot;  \n17.\t&quot;The Saints Are Coming&quot; (featuring Green Day)\n18.\t&quot;Window in the Skies&quot; (album version)\n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:687631d457e43e538035e41d16112989e1d37b96","amp;dn":"U2+-+18+Singles+%28Greatest+Hits%29+2006+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"687631d457e43e538035e41d16112989e1d37b96","infoHashBuffer":{"type":"Buffer","data":[104,118,49,212,87,228,62,83,128,53,228,29,22,17,41,137,225,211,123,150]},"announce":[],"urlList":[]}}