{"title":"TOS CORE v2.0 for Pathfinder RPG + D&amp;D3.5","uid":9490752,"size":7445579,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6889f1d8bd24597a826264d5c66786801f01a895&amp;dn=TOS+CORE+v2.0+for+Pathfinder+RPG+%2B+D%26amp%3BD3.5+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mikkie98","files":-1,"time":1389990615,"description":"TOS CORE\n========\nTOS CORE is a FREE excel based Character Sheet that is very powerful. It will allow you to create and manage any 'core' characters and either print them on paper, or play dynamically with them.\n\nFEATURES\n========\nSome of its main features include:\n* Dynamic Play through the Laptop worksheet (view the Dynamic Play video)\n* It has a full implementation of the Stacking Rules\n*Contains all the content from the PathfinderÂ® Roleplaying Game Core Rulebookâ„¢\n* Contains all the content from the System Reference Document (D&amp;D3.5), including the Psionic rules and the Epic rules (exception: the Divine rules)\n* Integrates the rules so you can focus on playing, and not adding numbers\n* Has a community forum where users can share ideas, suggestions and report issues\n\nREQUIREMENTS\n============\n* On PC: Microsoft Excel 2007+ (with the latest service packs)\n* On Mac: Microsoft Excel 2011 v14.1+\n* Macros: Macros must be activated\n* Does not work on clones of Excel \n\nFAQ\n===\nQ) I am unable to create a character. It says that the workbook is &quot;locked&quot;?\nA) TOS CORE will allow you to enter information in the appropriate sections only (usually white cells): The protection prevents the formulas from being changed. For examples of usage, check out the tutorials in the Video Library at http://theonlysheet.com/video/howto_index.htm\n\nQ) What is Dynamic Play?\nA) Dynamic Play is when you use TOS CORE during a gaming session. For instance, if your character receives the Haste spell, you can just add it to your character on the LapTop sheet, and ALL the effects of the haste spell will be applied to your character on the fly. Check the Video Library for a video about Dynamic Play.\n\nQ) Can this be used on a Tablet/iPad device?\nA) TOS CORE requires Microsoft Excel, which is usually not available on tablets. But you can run TOS CORE on your desktop, and remote login from your tablet to your desktop using an application like TeamViewer, thus allowing you to control TOS CORE remotely on your tablet.\n\nQ) I have a question, where do I ask?\nA) You can post questions on the community forum or contact admin.\n\nQ) I would like to modify TOS CORE for my own needs. Can i do that?\nA) No, you are not permitted to modify the workbook for your own designs. All formulas and code remain the sole property of the author.","torrent":{"xt":"urn:btih:6889f1d8bd24597a826264d5c66786801f01a895","amp;dn":"TOS+CORE+v2.0+for+Pathfinder+RPG+%2B+D%26amp%3BD3.5+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6889f1d8bd24597a826264d5c66786801f01a895","infoHashBuffer":{"type":"Buffer","data":[104,137,241,216,189,36,89,122,130,98,100,213,198,103,134,128,31,1,168,149]},"announce":[],"urlList":[]}}