{"title":"The Who and Elton John - Pinball Wizard [Elton John version prom","uid":10726525,"size":326930432,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:68cac42a903e2cc6aa3bc05e6b10bd643925a739&amp;dn=The+Who+and+Elton+John+-+Pinball+Wizard+%5BElton+John+version+prom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1407573975,"description":"The Who and Elton John - Pinball Wizard [promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Pinball Wizard&quot; is a song written by Pete Townshend and performed by the English rock band The Who, and featured on their 1969 rock opera album Tommy. The original recording was released as a single in 1969 and reached No. 4 in the UK charts and No. 19 on the U.S. Billboard Hot 100.\n\nThe B-side of the Pinball Wizard single is an instrumental credited to Keith Moon, titled &quot;Dogs (Part Two)&quot;. Despite similar titles it has no musical connection to The Who's 1968 UK single &quot;Dogs&quot;.\n\nThe lyrics are written from the perspective of a pinball champion, called &quot;Local Lad&quot; in the Tommy libretto book, astounded by the skills of the opera's eponymous main character, Tommy Walker: &quot;What makes him so good?; He ain't got no distractions; Can't hear those buzzers and bells; Don't see lights a flashin'; Plays by sense of smell.; Always has a replay; Never tilts at all; That deaf dumb and blind kid; Sure plays a mean pin ball.&quot;, and &quot;I thought I was the Bally table king, but I just handed my pinball crown to him&quot;.\n\nTownshend once called it &quot;the most clumsy piece of writing [he'd] ever done&quot; nevertheless, the song was a commercial success and one of the most recognised tunes from the opera. It was a perpetual concert favourite for Who fans due to its pop sound and familiarity.\n\n\nElton John version:\nThe song was performed by Elton John in Ken Russell's 1975 film adaptation of Tommy. This version was released as a single in 1975 in the US, and in 1976 in the UK, where it reached number 7. John's version uses a piano as the song's centerpiece in place of the acoustic guitar in the original (in the film, John's character is shown playing his pinball machine via a small piano keyboard), and features additional lyrics specially written by Townshend for the movie version, as well as a subtle inclusion of musical phrases from The Who's 1960s hit &quot;I Can't Explain&quot; during the outro (similarly, The Who's later cover of John's &quot;Saturday Night's Alright for Fighting&quot; included parts of &quot;Take Me to the Pilot&quot;). Unlike most of the soundtrack's music, which featured various combinations of The Who and some of the era's best session players, John used his own band (Dee Murray, Nigel Olsson, Davey Johnstone and Ray Cooper) and producer Gus Dudgeon for the track. John has performed the song as part of his Las Vegas Red Piano Show, as well as on various tours. To date, it is the only cover of a Who song to reach the top 10.\n\nTommy is the fourth studio album by English rock band The Who. It was first released in the United Kingdom by Track Records on 23 May 1969. On 31 May, the album was released in the United States by Decca Records. Tommy was mostly composed by the band's guitarist Pete Townshend as a double album that tells the story about a &quot;deaf, dumb and blind kid&quot;. The album was the first musical work to be billed overtly as a rock opera.\n\nTommy was acclaimed upon its release by critics, who hailed it as the Who's breakthrough, although its critical standing diminished slightly in later years. Nonetheless, it has since been viewed by several writers as an important and influential rock album. In 1998, the album was inducted into the Grammy Hall of Fame for &quot;historical, artistic and significant value&quot;. Tommy has sold over 20 million copies worldwide.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Pinball_Wizard&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Pinball_Wizard&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/MApJEaaFL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/MApJEaaFL&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 29.97fps 7781kbps\n   Audio: MPEG Digital Audio 48000Hz stereo 320kbps\n   Duration: 00:05:16\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.6\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:68cac42a903e2cc6aa3bc05e6b10bd643925a739","amp;dn":"The+Who+and+Elton+John+-+Pinball+Wizard+%5BElton+John+version+prom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68cac42a903e2cc6aa3bc05e6b10bd643925a739","infoHashBuffer":{"type":"Buffer","data":[104,202,196,42,144,62,44,198,170,59,192,94,107,16,189,100,57,37,167,57]},"announce":[],"urlList":[]}}