{"title":"Chick Corea and Gary Burton - Live at Montreux 1997","uid":5627513,"size":87789478,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:690c9693e3e04fdf6ffd9ae08987037bbee51409&amp;dn=Chick+Corea+and+Gary+Burton+-+Live+at+Montreux+1997&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mouahaha","files":9,"time":1276536708,"description":"Audio tracks extracted from the great dvd Chick Corea and Gary Burton : Live at Montreux 1997.\n\n\nMP3 160kbps\n\nTrack list :\n\n01 - Love Castle   10'14\n02 - Native Sense   7'00\n03 - No Mystery   10'20\n04 - Tango '92   5'42\n05 - Rhumbata   11'03\n06 - Four in One   6'53\n07 - La Fiesta   9'34\n\n\n\n\nReview from dvdverdict.com :\n\n\n\n&quot;Renowned jazz pianist and nine-time Grammy award-winner Chick Corea jams with vibes master Gary Burton on another beautifully produced DVD from the Montreux Jazz Festival series. Eagle Rock continues to deliver superb and attractively priced music discs drawn from the famous jazz festival in Switzerland.\n\nCorea and Burton have collaborated both on albums and in concert for nearly 40 years. This DVD showcases their 1997 gig at Montreux, highlighting the album Native Sense. They close the show with a crowd-pleasing rendition of &quot;La Fiesta,&quot; a Corea standard.\n\nCorea has worked with many of the titans of jazz, beginning nearly half a century ago with Cab Calloway and continuing with Sarah Vaughan, Stan Getz, Dizzy Gillespie, and, perhaps most memorably, with trumpeter Miles Davis. Corea worked with Davis on five albums in three years (1968-70 with the Bitches Brew group), culminating with a gig at the legendary 1970 Isle of Wight Festival (a superb DVD document of The Who performing at the festival that year is also available and comes highly recommended). Through the '70s Corea collaborated frequently with Burton and fusion master Herbie Hancock (known among film buffs for composing the memorable scores to Blowup and Death Wish).\n\nWhen it's time to chill and enjoy a little mellow jazz, this is the disc to spin. Burton's exquisite skill on the vibraphones beautifully complements Corea's intricate melodies on piano. Their interplay is inspired and easily represents some of the best work either musician has produced.\n\nCorea is a crossover jazz artist who has evolved through be-bop and &quot;cool&quot; styles, into free jazz and jazz-rock fusion. In later years he would return to Latin and classical influences that marked his early career in the late 1950s. This disc features lean and precise piano playing, with less emphasis on the extended, indulgent noodling that plagues some of Corea's older recordings. Improvisation can be magical or maddening; it's all a matter of degrees.&quot;\n\n\n\nEnjoy ! :D\n\n\n(... and don't forget to SEED ! )","torrent":{"xt":"urn:btih:690c9693e3e04fdf6ffd9ae08987037bbee51409","amp;dn":"Chick+Corea+and+Gary+Burton+-+Live+at+Montreux+1997","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"690c9693e3e04fdf6ffd9ae08987037bbee51409","infoHashBuffer":{"type":"Buffer","data":[105,12,150,147,227,224,79,223,111,253,154,224,137,135,3,123,190,229,20,9]},"announce":[],"urlList":[]}}