{"title":"The Oxford Book of English Detective Stories (gnv64)","uid":7765646,"size":18036344,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:694dbaf98a05772c35cabb6acef7c7a7fd583351&amp;dn=The+Oxford+Book+of+English+Detective+Stories+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gnv65","files":1,"time":1351366110,"description":"The Oxford Book of English Detective Stories \nby Patricia Craig\nOxford University Press | August 1990 | ISBN-10: 0192141872 | PDF | xxi+554 pages | 17.2 mb &lt;a href=&quot;\nhttp://www.amazon.com/Oxford-Book-English-Detective-Stories/dp/0192141872&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Oxford-Book-English-Detective-Stories/dp/0192141872&lt;/a&gt;\nscanned to PDF by me.\n\nThe scene: a sleeping car on the North-Western express, somewhere between Preston and Carlisle. The weapon: a small-caliber revolver. The victims: two young newlyweds, with little money and no known enemies. The puzzle: everyone in the car has an alibi, and no one was seen to leave. Here are all the ingredients for another gripping detective story.\nThe Oxford Book of English Detective Stories gathers 33 engrossing tales of crime, ranging from the birth of the genre to the present day. Arthur Conan Doyle, G.K. Chesterton, Agatha Christie, Dorothy Sayers, Margery Allingham, P.D. James, Ruth Rendell, Robert Barnard, and Simon Brett--all the giants of English mystery are here, as well as Christianna Brand, Ngaio Marsh, Michael Innes, Reginald Hill, Nicholas Blake, Michael Underwood, and many more. Editor Patricia Craig treats us to Sherlock Holmes, indefatigably tracking the details of the theft of Colonel Ross's prize horse, Silver Blaze, and the murder of its trainer. In &quot;The Oracle of the Dog,&quot; G.K. Chesterton's Father Brown sits calmly in his study, solving at a distance the perplexing murder of Colonel Druce: was it the foreign Dr. Valentine, the foppish lawyer Traill, or Floyd, the exuberant American secretary? P.D. James sends Chief Superindentant Dalgliesh on the trail of a mysterious death from some seventy years before--a case with a final, darkly ironic twist. And Robert Barnard grimly lampoons English academe in &quot;The Oxford Way of Death.&quot; In addition to this dazzling array of stories, Craig provides a concise introduction which surveys the origins and development of this enduring genre.\nIngenious, gothic, morbid, satirical--the English detective story ranks among the most dynamic and gripping fiction. In The Oxford Book of English Detective Stories, Patricia Craig presents some of the best ever written, in an absorbing tour of the world of crime, detection, and retribution.\n\ncover &lt;a href=&quot; http://img9.imageshack.us/img9/2879/englishdetectivestories.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://img9.imageshack.us/img9/2879/englishdetectivestories.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:694dbaf98a05772c35cabb6acef7c7a7fd583351","amp;dn":"The+Oxford+Book+of+English+Detective+Stories+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"694dbaf98a05772c35cabb6acef7c7a7fd583351","infoHashBuffer":{"type":"Buffer","data":[105,77,186,249,138,5,119,44,53,202,187,106,206,247,199,167,253,88,51,81]},"announce":[],"urlList":[]}}