{"title":"Inside the Machine: An Illustrated Introduction to Microprocess","uid":9220956,"size":5872633,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69bc19c24a4fc002a61b4020db796b7d3f9bef9f&amp;dn=+Inside+the+Machine%3A+An+Illustrated+Introduction+to+Microprocess&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"vreyhr676y","files":-1,"time":1384936608,"description":"Computers perform countless tasks ranging from the business critical to the recreational, but regardless of how differently they may look and behave, they're all amazingly similar in basic function. Once you understand how the microprocessor-or central processing unit (CPU)-works, you'll have a firm grasp of the fundamental concepts at the heart of all modern computing.\n\nInside the Machine, from the co-founder of the highly respected Ars Technica website, explains how microprocessors operate-what they do and how they do it. The book uses analogies, full-color diagrams, and clear language to convey the ideas that form the basis of modern computing. After discussing computers in the abstract, the book examines specific microprocessors from Intel, IBM, and Motorola, from the original models up through today's leading processors. It contains the most comprehensive and up-to-date information available (online or in print) on Intel's latest processors: the Pentium M, Core, and Core 2 Duo. Inside the Machine also explains technology terms and concepts that readers often hear but may not fully understand, such as &quot;pipelining,&quot; &quot;L1 cache,&quot; &quot;main memory,&quot; &quot;superscalar processing,&quot; and &quot;out-of-order execution.&quot;\n\nIncludes discussion of:\nParts of the computer and microprocessor Programming fundamentals (arithmetic instructions, memory accesses, control flow instructions, and data types) Intermediate and advanced microprocessor concepts (branch prediction and speculative execution) Intermediate and advanced microprocessor concepts (branch prediction and speculative execution) Intermediate and advanced computing concepts (instruction set architectures, RISC and CISC, the memory hierarchy, and encoding and decoding machine language instructions) 64-bit computing vs. 32-bit computing Caching and performance\n\nInside the Machine is perfect for students of science and engineering, IT and business professionals, and the growing community of hardware tinkerers who like to dig into the guts of their machines.\n\n\nProduct Details\n\n    Hardcover: 320 pages\n    Publisher: No Starch Press; 1 edition (November 30, 2006)\n    Language: English\n    ISBN-10: 1593271042\n    ISBN-13: 978-1593271046\n    Product Dimensions: 9.3 x 7.1 x 0.9 inches\n","torrent":{"xt":"urn:btih:69bc19c24a4fc002a61b4020db796b7d3f9bef9f","amp;dn":"+Inside+the+Machine%3A+An+Illustrated+Introduction+to+Microprocess","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69bc19c24a4fc002a61b4020db796b7d3f9bef9f","infoHashBuffer":{"type":"Buffer","data":[105,188,25,194,74,79,192,2,166,27,64,32,219,121,107,125,63,155,239,159]},"announce":[],"urlList":[]}}