{"title":"Sin City","uid":5011582,"size":296188386,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6a2cf200efaec29baf72d5a493902fd1fd9bbdb1&amp;dn=Sin+City&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ParrowJack","files":29,"time":1248021832,"description":"Sin City is the title for a series of comics by Frank Miller, told in a film noir-like style (now known as Neo noir). The first story originally appeared in &quot;Dark Horse's Fifth Anniversary Special&quot; (April, 1991), and continued in Dark Horse Presents #51-62 from May 1991 to June 1992, under the title of Sin City, serialized in thirteen parts. Several other stories of variable lengths have followed. All stories take place in Basin City, with frequent recurring characters and intertwining stories.\n\nSin City is famous for its artwork, which draws heavily from film noir, including its use of shadow and stark backgrounds. Miller's artistic style transitions between reality and graphic design. He uses notan - areas of light and dark purely for design where they have no logic in regards to light and shadow. Black and white are the sole colors most of the time with exception of red, yellow and blue in some stories. Partial color usage is designed to draw attention to a certain character in the story.\n\nThe writing style also draws heavily on detective and crime pulp fiction. Strange metaphors and similes are often used. This gives the narration a very &quot;pulpy&quot; feel.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:6a2cf200efaec29baf72d5a493902fd1fd9bbdb1","amp;dn":"Sin+City","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a2cf200efaec29baf72d5a493902fd1fd9bbdb1","infoHashBuffer":{"type":"Buffer","data":[106,44,242,0,239,174,194,155,175,114,213,164,147,144,47,209,253,155,189,177]},"announce":[],"urlList":[]}}