{"title":"Creative Black and White Digital Photography - Tips and Techniqu","uid":5682518,"size":11470528,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a42ea72db6eb08f9dfe7ce12dfef7d5068c781f&amp;dn=Creative+Black+and+White+Digital+Photography+-+Tips+and+Techniqu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"malestrom_HH","files":2,"time":1278864032,"description":"Harold Davis, &quot;Creative Black and White: Digital Photography Tips and Techniques&quot;\nWiley | 2010 | ISBN: 0470597755 | 240 pages | PDF\n\nBlack-and-white photography poses unique challenges; without color to guide the eye, contrast, lighting, and composition take on even more importance. Renowned photographer Harold Davis explains these elements and demonstrates the basic rules of black and white photography as well as when and how to break them. He breaks through the complexity of this photographic medium, explores opportunities for black-and-white imagery, and shows how to capitalize on every one.\n\nRichly illustrated with the author's own images, this beautiful guide presents the skills needed for great black-and-white photos while encouraging your confidence and creativity.\n\n* Goes beyond basics to teach photographers how to conquer the challenges posed by black-and-white photography\n* Appeals to professionals and serious amateurs who are interested in exploring creative black-and-white imagery\n* Presents photography fundamentals and shows how black and white requires some of the rules to be bent\n* Encourages creative thinking and confidence\n* Lavishly illustrated with Harold Davis's outstanding monochromatic photos\n\nWhether you're a professional just venturing into black and white or a serious amateur, Creative Black &amp; White will both educate and inspire you.","torrent":{"xt":"urn:btih:6a42ea72db6eb08f9dfe7ce12dfef7d5068c781f","amp;dn":"Creative+Black+and+White+Digital+Photography+-+Tips+and+Techniqu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a42ea72db6eb08f9dfe7ce12dfef7d5068c781f","infoHashBuffer":{"type":"Buffer","data":[106,66,234,114,219,110,176,143,157,254,124,225,45,254,247,213,6,140,120,31]},"announce":[],"urlList":[]}}