{"title":"Poul Anderson - Tau Zero &amp; The Boat of a Million Years","uid":11491472,"size":434312906,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6a7578d5de85421c8be37a812fe7dffe12485641&amp;dn=Poul+Anderson+-+Tau+Zero+%26amp%3B+The+Boat+of+a+Million+Years&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Cybotage","files":2,"time":1416263369,"description":"1970 - Tau Zero\n\nPoul Anderson's Tau Zero is an outstanding work of science fiction, in part because it combines two qualities that are often at odds in this genre: an interest in the emotional lives of its characters and a fascination with all things technological and scientific. In Tau Zero these components are not merely fused; they work together with a remarkable synergy that makes the novel much more than just a deep space adventure story.\n\nThe novel centers on a ten-year interstellar voyage aboard the spaceship Leonora Christine, and it opens with members of the crew preparing for their departure from earth. It is an especially moving departure because they know that while they are aboard the ship and traveling close to the speed of light, time will be passing much more quickly back home. As a result, by the time they return everyone they know will have long since died. From practically the very first page, therefore, Tau Zero sets the scientific realities of space travel in dramatic tension with the no-less-real emotional and psychological states of the travelers. This is a dynamic Anderson explores with great success over the course of the novel as fifty crewmembers settle in for the long journey together. They are a highly-trained team of scientists and researchers, but they are also a community of individuals, each trying to make a life for him or herself in space.\n\nThis is the background within which the action of the novel takes place. Anderson carefully depicts the network of relationships linking these people before the real plot begins to unfold. The voyage soon takes a unexpected and disastrous turn for the worse. The ship passes through a small, uncharted, cloudlike nebula that makes it impossible for the crew to decelerate the ship. The only hope, in fact, is for the ship to speed up.\n\n-=-\n\n\n1989 - The Boat of a Million Years\n\n\nOthers have written SF on the theme of immortality, but in The Boat of a Million Years, Poul Anderson made it his own. Early in human history, certain individuals were born who live on, unaging, undying, through the centuries and millenia. We follow them through over 2000 years, up to our time and beyond-to the promise of utopia, and to the challenge of the stars.\n\nA milestone in modern science fiction, a New York Times Notable Book on its first publication in 1989, this is one of a great writer's finest works","torrent":{"xt":"urn:btih:6a7578d5de85421c8be37a812fe7dffe12485641","amp;dn":"Poul+Anderson+-+Tau+Zero+%26amp%3B+The+Boat+of+a+Million+Years","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a7578d5de85421c8be37a812fe7dffe12485641","infoHashBuffer":{"type":"Buffer","data":[106,117,120,213,222,133,66,28,139,227,122,129,47,231,223,254,18,72,86,65]},"announce":[],"urlList":[]}}