{"title":"Blade.Kitten.Re-Release.Edition-TiNYiSO","uid":10517612,"size":731460500,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6adab8f18c8262ee603cdfd67bc73c5c3c00a928&amp;dn=Blade.Kitten.Re-Release.Edition-TiNYiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1404927244,"description":"\n                         -=- Proudly Presents -=-\n\n            Blade Kitten: Re-Release Edition (c) Krome Studios\t\n\n\nRelease On   : 9 july 2014              Disk Amount/Format : 1 DVD ISO\nType of Game : Action                   Media Protection   : Steam\n\n\nWelcome to Hollow Wish... On the surface, it s your typical lawless\nfrontier. Yet this mysterious shell planetoid is filled with dark secrets\nand cloaked figures. It s here Kit Ballard, aka Blade Kitten, works as\none of the best bounty hunters in the business. Don t let her pink hair\nfool you, Kit is part cat, part girl, and wholly lethal. She is one of\nthe last of her species, having fled her homeland after the genocide of\nher people at the hands of the ancient and mystical race known as the\nDarques.\n\nKit has since made a name for herself rounding up some of the most deadly\nscum in the galaxy. With her unique Darque Blade hovering at her side and\nobeying her every command, Kit can cut through even the toughest rogue\ndrone while hunting down soft targets to make the planet a safer place to\nlive. Also along for the ride is Skiffy, Kit s laid-back little sidekick\nwho, when needed, serves as her protector.\n\nFeatures:\n\nAn epic  tail  like no other\n\nFollow Kit through 13 levels including 2 exploration levels with her\nrideable alien mount Noot, as she travels around the colorful, frenetic\nworld of Hollow Wish.\n\nIntuitive  scramble style exploration\n\nKit s innate feline abilities enable her to easily traverse environments\nand find hidden areas.\n\nPick-up-and-play arcade action\n\nJump right in and easily begin exploring and fighting your way through\nmultiple levels loaded with secret areas and hidden collectibles.\n\nFully voiced dialogue\n\nFeaturing a cast of 9 professional voice actors playing a total of 23\ncharacters.Join Kit, Skiffy and the Darque Blade in this all new action\nadventure game!\n\nRe-Release Edition:\n\nPlayers can expect more responsive controls in the re-released PC version\nof Blade Kitten, along with improved enemy AI to make combat more\nchallenging. The update also introduces the new Night Breaker and Strike\nArmor character skins in addition to the Steam-exclusive Gothique costume.\n\n\nBurn/mount, install, copy crack, play!\n\nGreetz: LARGEiSO and MEDIUMiSO\n\n\n                                                                  (C) E/dfs\n                         &quot; SIZE DOES NOT MATTER! &quot;\n","torrent":{"xt":"urn:btih:6adab8f18c8262ee603cdfd67bc73c5c3c00a928","amp;dn":"Blade.Kitten.Re-Release.Edition-TiNYiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6adab8f18c8262ee603cdfd67bc73c5c3c00a928","infoHashBuffer":{"type":"Buffer","data":[106,218,184,241,140,130,98,238,96,60,223,214,123,199,60,92,60,0,169,40]},"announce":[],"urlList":[]}}