{"title":"Graphite, Graphene and Their Polymer Nanocomposites","uid":15390281,"size":29990493,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6aea16c0bad19b81fabb16691c5b881ded4945fe&amp;dn=Graphite%2C+Graphene+and+Their+Polymer+Nanocomposites&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1469329477,"description":"Graphite, Graphene and Their Polymer Nanocomposites - Prithu Mukhopadhyay, Rakesh K. Gupta (CRC, 2013).pdf\r\n\r\nGraphite, Graphene, and Their Polymer Nanocomposites presents a compilation of emerging research trends in graphene-based polymer nanocomposites (GPNC). International researchers from several disciplines share their expertise about graphene, its properties, and the behavior of graphene-based composites. Possibly the first published monograph of its kind, this book provides a comprehensive snapshot of graphite, graphene, and their PNCs, including the underlying physics and chemistry, and associated applications. Beginning with an introduction to natural and synthetic graphite, the precursors to graphene, the text describes their properties, characterization techniques, and prominent commercial applications.\r\n\r\nThe focus then moves to graphene and its unique features, and techniques for its characterization. The chapters cover advances in electrochemical exfoliation of graphite, as well as exfoliation routes to produce graphene and graphite nanoplatelets for polymer composites. They also explore commercial use of graphene-based materials, such as emerging clean energy and pulse laser applications, and use as nanofillers in epoxy-based composites. The authors provide an overview of nanofillers and address two methods for GPNC preparation as well as specialized properties of GPNC. With its multidisciplinary approach, this book provides a broader scientific and engineering perspective necessary for meaningful advancements to take place","torrent":{"xt":"urn:btih:6aea16c0bad19b81fabb16691c5b881ded4945fe","amp;dn":"Graphite%2C+Graphene+and+Their+Polymer+Nanocomposites","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6aea16c0bad19b81fabb16691c5b881ded4945fe","infoHashBuffer":{"type":"Buffer","data":[106,234,22,192,186,209,155,129,250,187,22,105,28,91,136,29,237,73,69,254]},"announce":[],"urlList":[]}}