{"title":"NTI Dragon Burn v4.5.0.5 OSX (Last Release) + BD Driver + SN","uid":4807832,"size":21514930,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:6b2df214c7d2e0877945817993eee3b1f24a9483&amp;dn=NTI+Dragon+Burn+v4.5.0.5+OSX+%28Last+Release%29+%2B+BD+Driver+%2B+SN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"BleaneBWT","files":-1,"time":1238259804,"description":"Overview of Dragon Burn\n\nDragon Burn enables Macintosh computer users to quickly and easily begin producing audio, data, mixed-mode CDs, DVDs, and BDs (Blu-ray Discs). Dragon Burn's Multi-Burning engine allows users to simultaneously write multiple CDs, DVDs, and BDs from single or multiple sorces. It also fully supports the newest internal and external drives.\n\nUsing Dragon Burn, Macintosh users can easily produce their own audio and data CDs, DVDs, and BDs; mixed-mode and CD extra discs; and VCD and SVCD video discs. Users can mix and match AIFF, CDDA, MP3 or Wave files to produce custom audio CDs. For CD, DVD, and BD data mastering applications, Dragon Burn fully supports ISO 9660 MS-DOS and Joliet, HFS (Mac OS) and HFS+ (Mac OS Extended) file systems. For Hybrid CDs and DVDs, users can select Mac OS and ISO 9660 file system combinations including data from previous ISO 9660 sessions.\n\nFor complete data protection and recovery, users can burn layouts to a disc or save them as complete disc image files. Using similar creation techniques, users can quickly and easily produce a backup copy of any CD or non-copy protected DVD. To ensure that users always produce quality discs, Dragon Burn supports BurnProof and other buffer-underrun protection technologies. For maximum throughput performance, the mastering software also supports USB 2.0 and FireWire CD/DVD/BD burners.\nFull Featured Creativity Suite for Music, Photos, Movies, Sharing &amp; Backup!\n\nNew Features in Version 4.5!\n\n    * Universal Binary!\n          o Now runs natively on PPC and Intel Macs.\n    * Blu-ray Data!\n          o Supports burning data to BD-R and BD-RE medias in 25 or 50 GB capacities.\n    * Blu-ray read driver for Tiger\n          o Allows Mac OS X 10.4 users to read Blu-ray discs.\n            (Not required for Mac OS X 10.5 Leopard)\n","torrent":{"xt":"urn:btih:6b2df214c7d2e0877945817993eee3b1f24a9483","amp;dn":"NTI+Dragon+Burn+v4.5.0.5+OSX+%28Last+Release%29+%2B+BD+Driver+%2B+SN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b2df214c7d2e0877945817993eee3b1f24a9483","infoHashBuffer":{"type":"Buffer","data":[107,45,242,20,199,210,224,135,121,69,129,121,147,238,227,177,242,74,148,131]},"announce":[],"urlList":[]}}