{"title":"Frank Turner - England Keep My Bones (2011)(Deluxe Edition / 3 B","uid":6462530,"size":375747362,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6bb50a7796f332f90d09915e915da340d4ecff20&amp;dn=Frank+Turner+-+England+Keep+My+Bones+%282011%29%28Deluxe+Edition+%2F+3+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"SoundbaronPirateBay","files":25,"time":1307825608,"description":"Music : Indie : Lossless\n\n\n\n\n\n\nFrank Turner - England Keep My Bones (2011)(Deluxe Edition / 3 Bonus Tracks(FLAC)\n\n\n\n\n\n\n\n\n\nFrank Turner (born 28 December 1981) is an English folk/punk singer-songwriter from Meonstoke, Winchester, who was born in Manama, Bahrain. Initially the vocalist of post-hardcore band Million Dead, Turner embarked upon a primarily acoustic-based solo career following the band's split in 2005. To date, Turner has released four solo albums, a rarities compilation album and four EPs. Turner began recording for his new album &quot;England Keep My Bones&quot;, in January 2011. It was released on June 6, 2011 in the UK, and June 7, 2011 worldwide.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Frank_Turner&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Frank_Turner&lt;/a&gt;\n\n\nEngland Keep My Bones is the fourth studio album by London-based singer-songwriter Frank Turner, released on June 6, 2011 in the UK and June 7, 2011 worldwide. The album will be released on Xtra Mile Recordings in the UK and Epitaph Records worldwide. The album was produced and mixed by Tristan Ivemy, who had previously mixed the Rock &amp; Roll EP, Campfire Punkrock EP and the album Love, Ire and Song.\n\nThe title &quot;England Keep My Bones&quot; is taken from Shakespeare's The Life and Death of King John. Album track &quot;I Am Disappeared&quot; was prematurely released through Xtra Mile Recordings on March 29, 2011 and uploaded to YouTube on the same date. &quot;Peggy Sang the Blues&quot;, written in tribute to Turner's grandmother, Peggy, was the first single to be released from the album on April 25, 2011. Frank revealed on his May 2010 live tour that Franz Nicolay features on the song &quot;Wessex Boy&quot; and one other song on the album. As well as the iTunes version of the album having 3 additional acoustic tracks it also contains music videos for &quot;I Still Believe&quot; and &quot;Peggy Sang The Blues&quot;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/England_Keep_My_Bones&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/England_Keep_My_Bones&lt;/a&gt;\n\n\n\n\n\n\n\n\n\n\nReview from AllMusic:\n\nBy Thom Jurek.\n\nAnyone who plugged into last year's Rock &amp; Roll EP or the advance singles &quot;Peggy Sang the Blues&quot; and &quot;I Am Disappeared&quot; will understand that Frank Turner has become a songwriter of uncommon depth and variety. England Keep My Bones is a quintessentially British album, its title taken from Shakespeare's The Life and Death of King John, but that shouldn't put Americanskis off. Turner's record is a giant step from Poetry of the Deed; it contains far better production, expert sequencing and balance, and the best batch of songs he's written to date. &quot;Peggy Sang the Blues&quot; (dedicated to the memory of his grandmother) begins with an acoustic guitar but admits the band before the first verse starts. Its infectious, nearly funky bassline stands out against the ringing electric guitar chords. Keyboards grace the background, as does a layered vocal chorus. Turner half sings and half shouts his poignant tome in his best &quot;raise your beer style,&quot; he sounds like a dead cross between Billy Bragg and Stiff Little Fingers' Jake Burns. In &quot;I Still Believe,&quot; one of the album's numerous barroom anthems, Turner testifies that &quot;Right here, right now, Elvis brings his children home/You never have to feel alone/Teenage kicks and gramophones, we hold them in our hearts/Now who would have thought, that after all/Something as simple as rock and roll would save us all?&quot; Guitars blast and drums crackle and it's a truth party all around. He reveals a growing knowledge of British traditional folk that shines through in &quot;Rivers&quot; and the a cappella &quot;English Curse.&quot; Skiffle-style country shows itself in the drinking song &quot;If I Ever Stray,&quot; but Turner gets heavy, too: &quot;One Foot in Front of the Other&quot; roars with a punk rock energy he's not unleashed since his days in Million Dead, though it's not punk. &quot;Wessex Boy&quot; is a largely acoustic update of &quot;To Take You Home&quot; from Love, Ire &amp; Song. Turner's a political songwriter to be sure, all of his material here is rooted in an innate understanding of class struggle, but he never takes himself too seriously. &quot;Redemption&quot; is a confessional and vulnerable rocker about his side of the street in the end of a relationship which claims his redemption from his mistakes as his own responsibility. This sets up the closer, the scathing yet hilarious &quot;Glory, Hallelujah.&quot; A church organ intros an evangelical British back country paean to the glories of atheism, personal responsibility, and morality. Taken as a whole, England Keep My Bones is evidence that Turner is an artist who has fully arrived and knows it. And that's no sin.\n\n &lt;a href=&quot;\nhttp://www.allmusic.com/album/england-keep-my-bones-r2184212/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/england-keep-my-bones-r2184212/review&lt;/a&gt;\n\n\n\n\n\n\n\n\nTracklist:\n\n01. Eulogy (1:34)\n02. Peggy Sang The Blues (3:33)\n03. I Still Believe (3:45)\n04. Rivers (4:34)\n05. I Am Disappeared (4:47)\n06. English Curse (2:17)\n07. One Foot Before The Other (3:26)\n08. If Ever I Stray (2:54)\n09. WessexBoy (3:34)\n10. Nights Become Days (4:26)\n11. Redemption (4:48)\n12. Glory Hallelujah (4:30)\n\n\nDeluxe Edition Bonus Tracks:\n\n13. Song For Eva Mae (3:43)\n14. Wanderlust (3:13)\n15. Balthazar, Impresario (4:01)\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/England_Keep_My_Bones&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/England_Keep_My_Bones&lt;/a&gt;\n\n\n\n\n\n\n\n\n\nENJOY &amp; AS ALWAYS: REMEMBER TO KEEP SEEDING FOR OTHERS!!!\nTHANKS!!\n\n","torrent":{"xt":"urn:btih:6bb50a7796f332f90d09915e915da340d4ecff20","amp;dn":"Frank+Turner+-+England+Keep+My+Bones+%282011%29%28Deluxe+Edition+%2F+3+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bb50a7796f332f90d09915e915da340d4ecff20","infoHashBuffer":{"type":"Buffer","data":[107,181,10,119,150,243,50,249,13,9,145,94,145,93,163,64,212,236,255,32]},"announce":[],"urlList":[]}}