{"title":"Jens Lapidus - STHLM Delete - Svensk","uid":12537684,"size":403300846,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6be44b44ac5f82b30e1729d47fff27641b231ef0&amp;dn=Jens+Lapidus+-+STHLM+Delete+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"devilinred","files":231,"time":1444343494,"description":"Jens Lapidus - STHLM DELETE\r\n\r\nLapidus i explosiv högform!\r\n\r\nPå nytt möter vi Emelie och Teddy, det ofrivilliga paret från Jens Lapidus storsäljande Vip-rummet. Hon: nybliven advokat på glassiga byrån. Han: kåkfararen som försöker leva på rätt sida lagen, numera som advokatbyråns fixare och specialutredare. I STHLM DELETE dras de in en härva med djupa förgreningar i Stockholms olika världar, där historien lever i nuet och hotar alla inblandade.\r\n\r\nEtt larm går och en väktare blir kallad till ett hus ute på Värmdö.\r\nDär väntar inget vanligt inbrott utan ett lik: en människa som blivit massakrerad.\r\nEn ung man påträffas svårt skadad i närheten av brottsplatsen. Han häktas som skäligen misstänkt för mordet. Emelie Jansson åtar sig i hemlighet att vara hans försvarare, trots att hennes arbetsgivare på byrån är emot det.\r\nVem är den mördade på Värmdö? Och varför leder så många spår till Mats Emanuelsson, mannen som Teddy kidnappade för länge sedan? Medan Emelie i hemlighet börjar nysta i fallet tvingas Teddy konfrontera sitt förflutna, samtidigt som hans vilsne systerson Nikola är på väg att göra om alla hans misstag. Snart är de indragna i ett spel med galet höga insatser som får våldsamma konsekvenser för dem alla.\r\n\r\nSTHLM DELETE handlar om människor som försöker utplåna sin bakgrund, som gör vad som helst för att ömsa skinn när de satt allt på spel. Den berättar om en värld som raderar chanserna för vissa och ger andra enorma fördelar. Det här är Jens Lapidus i explosiv högform.\r\n\r\n&quot;Hos Lapidus möter vi ett Sverige där de starka har makt att ändra alla spelregler, ett moraliskt och politiskt ruinlandskap där solidaritet är ett livsfarligt tecken på svaghet. Att Vip-rummet i likhet med sina föregångare är en bladvändare, gör inte saken sämre.&quot; Göteborgs-Posten om Vip-rummet","torrent":{"xt":"urn:btih:6be44b44ac5f82b30e1729d47fff27641b231ef0","amp;dn":"Jens+Lapidus+-+STHLM+Delete+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6be44b44ac5f82b30e1729d47fff27641b231ef0","infoHashBuffer":{"type":"Buffer","data":[107,228,75,68,172,95,130,179,14,23,41,212,127,255,39,100,27,35,30,240]},"announce":[],"urlList":[]}}