{"title":"REM - Automatic for the People [FLAC] - Kitlope","uid":4121000,"size":330836138,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6c2b71cbb7de653cf1c6a4e394d1b2e639c65d6a&amp;dn=REM+-+Automatic+for+the+People+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Kitlope","files":15,"time":1207548211,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: EAC 0.99 prebeta 3\nEAC Log: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce \nTorrent Hash: 6C2B71CBB7DE653CF1C6A4E394D1B2E639C65D6A\nFile Size: 315 Mb\nYear: 1992\nLabel: Warner Bros\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\n[quote]Automatic for the People is the eighth album by the American alternative rock band R.E.M., released in 1992. The album was a critical and commercial success, with three top 40 hits in the U.S.\n\n\n&amp;#039;Automatic for the People&amp;#039; continues the folk/country rock/classical pop elements of Green and Out of Time but with fewer pop elements and a generally more sombre tone overall. U2&amp;#039;s Bono called it &amp;#039;the greatest country record never made&amp;#039;.[1]\n\nThe album name refers to the motto of Athens, Georgia eatery &quot;Weaver D&amp;#039;s Delicious Fine Foods.&quot; The photograph on the front cover is not related to the restaurant: it shows a sign on a motel in Miami, where part of the album was recorded. The album was also recorded in New Orleans.\n\nArriving on the heels of the previous year&amp;#039;s breakthrough album Out of Time, Automatic for the People entered the United States charts at #2, selling over four million copies there, and spent several weeks at #1 in the United Kingdom. Despite the new album&amp;#039;s success, R.E.M. declined to tour in support of Automatic for the People, just as it had for Out of Time the previous year.\n\nAutomatic for the People had six singles released, tied with Monster for the most from any R.E.M. album. Many of Automatic for the People&amp;#039;s songs proved to be very popular: &quot;Drive&quot;, &quot;The Sidewinder Sleeps Tonite&quot;, &quot;Everybody Hurts&quot;, &quot;Nightswimming&quot;, &quot;Find the River&quot;, and the Andy Kaufman tribute &quot;Man on the Moon&quot;, which would become the title of the comedian&amp;#039;s 1999 biographical movie starring Jim Carrey. &quot;Drive&quot;, the album&amp;#039;s opening track and first single, was not included on the band&amp;#039;s hits collection In Time: The Best of R.E.M. 1988-2003, nor was final single (and final track) &quot;Find the River&quot;. However, four tracks from Automatic for the People were included, more songs than from any of their other albums.\n\nJohn Paul Jones, formerly the bassist for Led Zeppelin, in his second career string arrangement, scored the strings for &quot;Drive,&quot; &quot;The Sidewinder Sleeps Tonite,&quot; &quot;Everybody Hurts&quot; and &quot;Nightswimming.&quot;\n\nIt has been revealed that Kurt Cobain was likely listening to Automatic for the People sometime before his death on April 5, 1994.[2] The song &quot;Everybody Hurts&quot; had in fact been composed by Michael Stipe (its music was written by Bill Berry) as a reaction to an epidemic of suicides among young people. Stipe, a friend of Cobain&amp;#039;s, later wrote the song &quot;Let Me In&quot; about Cobain&amp;#039;s death.[3] It has been speculated that before his death, Cobain was looking to develop his own music in a more acoustic direction due partly to the influence of Automatic for the People and his contact with Stipe. Nirvana&amp;#039;s 1993 unplugged performance later released on CD has been cited as evidence for this.\n\nIn 2005, Warner Brothers Records issued a two-disc edition of Automatic for the People which includes a CD, a DVD-Audio disc containing a 5.1-channel surround sound mix of the album done by Elliot Scheiner, and the original CD booklet with expanded liner notes. The CD (as with all in this series) is not remastered.\n\n[b]Critical acclaim[/b]\n\nMostly acoustic and typified by its dark lyrics (many of which ruminate on mortality, death and those departed), Automatic for the People is generally considered to be among R.E.M.&amp;#039;s best albums, and one of the finest releases of the 1990s. It is the 44th greatest album of all time according to the website Acclaimedmusic.net and 4th best of the 1990s. It was nominated for Album of the Year at the Grammy Awards of 1993.\n\nIn 1997 Automatic for the People was named the 18th greatest album of all time in a &amp;#039;Music of the Millennium&amp;#039; poll conducted by HMV, Channel 4, The Guardian and Classic FM. In 2006, Q magazine readers placed it at number 7. In 2003, the album was ranked number 247 on Rolling Stone magazine&amp;#039;s list of the 500 greatest albums of all time.\n\n[/quote]\n\n\nTracks:\n\n&quot;Drive&quot; ? 4:31 \n&quot;Try Not to Breathe&quot; ? 3:50 \n&quot;The Sidewinder Sleeps Tonite&quot; ? 4:06\n&quot;Everybody Hurts&quot; ? 5:17 \n&quot;New Orleans Instrumental No. 1&quot; ? 2:13 \n&quot;Sweetness Follows&quot; ? 4:19\n&quot;Monty Got a Raw Deal&quot; ? 3:17 \n&quot;Ignoreland&quot; ? 4:24\n&quot;Star Me Kitten&quot; ? 3:15 \n&quot;Man on the Moon&quot; ? 5:13 \n&quot;Nightswimming&quot; ? 4:16 \n&quot;Find the River&quot; ? 3:50 \n\nEnjoy :)\n","torrent":{"xt":"urn:btih:6c2b71cbb7de653cf1c6a4e394d1b2e639c65d6a","amp;dn":"REM+-+Automatic+for+the+People+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c2b71cbb7de653cf1c6a4e394d1b2e639c65d6a","infoHashBuffer":{"type":"Buffer","data":[108,43,113,203,183,222,101,60,241,198,164,227,148,209,178,230,57,198,93,106]},"announce":[],"urlList":[]}}