{"title":"Surgical Technology Principles and Practice, 6E &amp; Workbook [","uid":11438504,"size":185193238,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ce46a5fe9e4129486dbaa5f3c2d8e1c8647c6ca&amp;dn=Surgical+Technology+Principles+and+Practice%2C+6E+%26amp%3B+Workbook+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"0xmovva","files":4,"time":1415774349,"description":"TITLE/EDITION Surgical Technology: Principles and Practice, 6e and Workbook for Surgical Technology: Principles and Practice, 6e \nAuthor: Joanna Kotcher Fuller\nTextbook \nSeries: Surgical Technology Principles and Practice\nHardcover: 1136 pages\nPublisher: Saunders; 6 edition (November 21, 2012)\nLanguage: English\nISBN-10: 1455725064\nISBN-13: 978-1455725069\nWorkBook\nPaperback: 343 pages\nPublisher: Saunders; 6 edition (November 30, 2012)\nLanguage: English\nISBN-10: 1455725072\nISBN-13: 978-1455725076\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n__________________________________________________________________________________\n\n\n\nTextbook\nDeliver the best patient care before, during, and after surgery with this straightforward, step-by-step guide to surgical skills and operating room procedures. It provides comprehensive coverage of all the updated AST Core Curriculum, 6th Edition components - health care sciences, technological sciences, patient care concepts, surgical technology, and surgical procedures. A mentoring approach makes even complex skills and techniques easy to understand. User-friendly features such as full-color illustrations, chapter outlines and summaries, review questions, critical thinking exercises, and technique boxes help you focus on the most important concepts and make it easier to retain and recall critical information.\n\nChapter objectives correspond to the latest AST Core Curriculum objectives to ensure you have access to the most reliable information in the operating room.\nEnhanced critical thinking scenarios at the end of each chapter help you strengthen your critical thinking and clinical decision-making skills and highlight practical applications of key concepts.\nAdditional information on special populations, including bariatric, pregnant, physically or mentally challenged, isolation, trauma, language barrier, and substance abuse patients, highlights important considerations for the surgical technologist regarding transfer, preparation, and procedure set up.\nExpanded coverage of surgical lasers keeps you up to date with the latest technology so you can effectively assess the function, assembly, use, and care of equipment in the surgical suite.\nUPDATED! Coverage reflects the new AST Core Curriculum, 6th Edition to keep you current.\nNEW! Chapters on Disaster Preparedness and Response and Transplant Surgery offer cutting-edge information on these key topics.\nCoverage of the Assistant Circulator role, as well as a break down of first and second scrub roles, help you better understand the responsibilities of each member of the surgical team.\n\nWorkBook\n\nSpecially designed to parallel the material in Surgical Technology: Principles and Practice, 6th Edition, this helpful workbook provides in-depth study and review of the most important surgical technology concepts. Its user-friendly format offers more practical application and critical thinking exercises than other workbooks, allowing you to apply your knowledge to real-world scenarios.\n\nRecall questions and application and critical thinking exercises help you master key concepts and prepare for exams.\nCase studies present realistic scenarios that challenge you to expand your critical thinking skills.\nInternet research activities encourage you to search online for evidence-based information.\nPreclinical checklists for all skills/procedures allow you to assess your own skills, as well as be assessed by other students","torrent":{"xt":"urn:btih:6ce46a5fe9e4129486dbaa5f3c2d8e1c8647c6ca","amp;dn":"Surgical+Technology+Principles+and+Practice%2C+6E+%26amp%3B+Workbook+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ce46a5fe9e4129486dbaa5f3c2d8e1c8647c6ca","infoHashBuffer":{"type":"Buffer","data":[108,228,106,95,233,228,18,148,134,219,170,95,60,45,142,28,134,71,198,202]},"announce":[],"urlList":[]}}