{"title":"Il Buio nell'Anima [DVD5 - Ita Eng - Sub Ita Eng] [Tntvillage","uid":5162114,"size":4561303552,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6cfdf03f788ab89d9a91ce463a126d2f695b448e&amp;dn=Il+Buio+nell%5C%27Anima+%5BDVD5+-+Ita+Eng+-+Sub+Ita+Eng%5D+%5BTntvillage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"maxmalu6601","files":20,"time":1258208558,"description":"Il Buio nell'Anima\n\nErica Bain (Jodie Foster)\nPerchÃƒÂ© quando ami una cosa, ogni volta che ne perdi una piccola parte perdi un pezzo di te stesso.\n\n.::.Scheda.::.\n\nLa vendetta giusta di una donna ambientata nel terrore delle strade buie di New York\n--Marzia Gandolfi--\n\nErica Bain vive a New York, che registra e racconta via etere nel programma radiofonico Street Walk. Spento il microfono e conclusa la giornata si rifugia nell'abbraccio dell'amato David, il compagno che avrebbe sposato se due balordi non lo avessero massacrato a Central Park. Sopravvissuta all'aggressione, Erica compra illegalmente una pistola per affrontare la strada e la paura. Un nuovo trauma, l'assassinio di una donna in un drugstore, scatena la sua rabbia e il desiderio di vendetta. Sui marciapiedi di New York incontrerÃƒÂ  il senso del dovere del detective Mercer, che la costringerÃƒÂ  a riflettere sulla legittimitÃƒÂ  della vendetta.\nDopo la parabola favolistica di Breakfast on Pluto, che affrontava il problema identitario di un uomo e di una nazione, Neil Jordan lascia l'Irlanda alla volta degli Stati Uniti, volgendo al femminile la vendetta &quot;giusta&quot; alla Charles Bronson. Il suo biondo giustiziere, come ogni eroe jordiano, si trova nell'impossibilitÃƒÂ  di sottrarsi alla propria indole ma se il giovane travestito di Cillian Murphy intraprendeva un viaggio esistenziale nel proprio Paese per riconquistare se stessa, la Erica di Jodie Foster attraversa le strade buie di New York e i tunnel di Central Park, perdendosi e perdendo la propria umanitÃƒÂ .\nLontana dallo spirito borghese di Allen, la cittÃƒÂ  americana diventa lo spazio della paura della violenza intesa come catastrofe morale. Dentro le vedute aeree e notturne di Manhattan, Jordan procede a investigare i misteri del cuore umano e il desiderio, radicato negli States, di farsi giustizia da soli. Dopo la perdita del fidanzato, la protagonista assume su di sÃƒÂ© la volontÃƒÂ  di riparare il torto, spogliandosi progressivamente della pietÃƒÂ  e del filantropismo.\nPur dichiarando di aver voluto lasciare fuori la politica e di avere evitato qualunque tentativo di analisi dell'evento (il 9/11), Jordan mette in scena (indirettamente?) il vuoto lasciato dal trauma dell'aggressione, che ha sconvolto definitivamente il concetto di giustizia. Per la protagonista la rieducazione ai valori della civiltÃƒÂ  passa attraverso la vendetta portata alle estreme conseguenze. Per superare lo shock e la grave crisi d'identitÃƒÂ  sociale, il cantastorie irlandese sa che occorre innanzitutto restituire la memoria attraverso la narrazione, facendo riemergere i fantasmi e liberando la nostra paura. Il dolore diventa il motore dell'azione, la crisi individuale di Erica diventa crisi sociale e poi culturale.\nJodie Foster, che dagli anni Novanta incarna sullo schermo la decenza morale e la disponibilitÃƒÂ  caratteriale, fa i conti questa volta con un soggetto critico. Nell'America di Jordan, il mondo preme da fuori finendo per tracimare nel territorio piÃƒÂ¹ prezioso: il privato. CosÃƒÂ¬ la resistenza di Erica si gioca in chiave privatistica e coscenziale.\n\n.::.Commenti.::.\n\nIl film merita.  Visit this link: http://www.mymovies.it/pubblico/?id=49567\n\n.::.Dati DvD.::.\n\nLingue..............: Italiano, Inglese\nLingue sub.......: Italiano, Inglese\nCompressione...: 95%\nProgramma usato: CloneDVD2\nMenu (si/no)....: Si\nExtra (si/no).....: Si\n\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:6cfdf03f788ab89d9a91ce463a126d2f695b448e","amp;dn":"Il+Buio+nell%5C%27Anima+%5BDVD5+-+Ita+Eng+-+Sub+Ita+Eng%5D+%5BTntvillage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cfdf03f788ab89d9a91ce463a126d2f695b448e","infoHashBuffer":{"type":"Buffer","data":[108,253,240,63,120,138,184,157,154,145,206,70,58,18,109,47,105,91,68,142]},"announce":[],"urlList":[]}}