{"title":"Iron Maiden - Piece Of Mind [320k MP3]","uid":11451244,"size":150106475,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6d0d8352b8b363c5e8df7831e80273920924e740&amp;dn=Iron+Maiden+-+Piece+Of+Mind+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"smbdownload","files":-1,"time":1415888863,"description":"Piece of Mind is the fourth studio album by British heavy metal band Iron Maiden, originally released in 1983 by EMI, and by Capitol in the US, where it was reissued later by Sanctuary/Columbia Records. It was the first album to feature drummer Nicko McBrain, who had recently left the Paris-based band Trust and has been Iron Maiden's drummer ever since.\n\nPiece of Mind was a critical and commercial success, reaching No. 3 in the UK Albums Chart and achieving platinum certification in the UK and North America. At the beginning of the sixth track, &quot;Still Life&quot;, the band included a hidden message which could only be understood by playing the song backwards. This was a joke and an intended swing back at the critics who had accused Iron Maiden of being Satanic. The backwards-message features McBrain mimicking actor John Bird's impression of Idi Amin, uttering the following phrase &quot;What ho said the t'ing with the three 'bonce', do not meddle with things you don't understand...&quot;, followed by a belch. The phrase itself is taken from the satirical album The Collected Broadcasts of Idi Amin (1975) by Bird and Alan Coren. &quot;What ho&quot; and &quot;What ho said the t'ing&quot; are phrases that also crop up regularly on McBrain's &quot;Listen With Nicko!&quot; tracks from The First Ten Years collection.\n\nAccording to McBrain, &quot;We were sick and tired of being labelled as Devil worshippers and all this bollocks by these fucking morons in the States, so we thought, 'Right, you want to take the piss? We'll show you how to take the bleeding piss, my son!' And one of the boys taped me in the middle of this Idi Amin routine I used to do when I'd had a few drinks. I remember it distinctly ended with the words, 'Don't meddle wid t'ings yo don't understand.' We thought, if people were going to be stupid about this sort of thing, we might as well give them something to be really stupid about, you know?&quot; \n\nTrack Listing [320k MP3]\n\n1. \t&quot;Where Eagles Dare&quot;   \tSteve Harris \t6:08\n2. \t&quot;Revelations&quot;   \tBruce Dickinson \t6:51\n3. \t&quot;Flight of Icarus&quot;   \tAdrian Smith, Dickinson \t3:49\n4. \t&quot;Die with Your Boots On&quot;   \tSmith, Dickinson, Harris \t5:22\n5. \t&quot;The Trooper&quot;   \tHarris \t4:10\n6. \t&quot;Still Life&quot;   \tDave Murray, Harris \t4:27\n7. \t&quot;Quest for Fire&quot;   \tHarris \t3:40\n8. \t&quot;Sun and Steel&quot;   \tDickinson, Smith \t3:25\n9. \t&quot;To Tame a Land&quot;   \tHarris \t7:26\n\nBonus Disc [320k MP3]\t\n\n1. \t&quot;I've Got the Fire&quot; (Montrose cover) \tRonnie Montrose \t2:38\n2. \t&quot;Cross-Eyed Mary&quot; (Jethro Tull cover) \tIan Anderson \t3:55","torrent":{"xt":"urn:btih:6d0d8352b8b363c5e8df7831e80273920924e740","amp;dn":"Iron+Maiden+-+Piece+Of+Mind+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d0d8352b8b363c5e8df7831e80273920924e740","infoHashBuffer":{"type":"Buffer","data":[109,13,131,82,184,179,99,197,232,223,120,49,232,2,115,146,9,36,231,64]},"announce":[],"urlList":[]}}