{"title":"Thomas De Quincey - -On Murder (Oxford World's Classics)","uid":9027223,"size":891565,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d784397c035b32c020a35ad6e9872b1a2d29b5d&amp;dn=Thomas+De+Quincey+-+-On+Murder+%28Oxford+World%27s+Classics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1381383300,"description":"On Murder (Oxford World's Classics) \nby Thomas De Quincey\n\nhe titular essay in this volume of work by Thomas De Quincey centers on the notorious career of the murderer John Williams, who in 1811 brutally killed seven people in London's East End. De Quincey's response to Williams's attacks turns morality on its head, celebrating and coolly dissecting the art of murder and its perfections. This volume also contains De Quincey's best-known piece of literary criticism, &quot;On the Knocking at the Gate in Macbeth,&quot; and his finest tale of terror, &quot;The Avenger,&quot; a disturbing exploration of violence, vigilantism, and religious persecution. Ranging from gruesomely vivid reportage and brilliantly funny satiric high jinks to penetrating literary and aesthetic criticism, these essays had a remarkable impact on crime, terror, and detective fiction. They are also a key contribution to the satiric tradition, as well as on the rise of nineteenth-century decadence. The bibliography is the most extensive available on critical responses to De Quincey's essays on murder and violence, and the essays included here have never been annotated so thoroughly before. They reveal--often for the first time--De Quincey's debts, remarkable erudition, and encyclopedic knowledge of contemporary crime","torrent":{"xt":"urn:btih:6d784397c035b32c020a35ad6e9872b1a2d29b5d","amp;dn":"Thomas+De+Quincey+-+-On+Murder+%28Oxford+World%27s+Classics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d784397c035b32c020a35ad6e9872b1a2d29b5d","infoHashBuffer":{"type":"Buffer","data":[109,120,67,151,192,53,179,44,2,10,53,173,110,152,114,177,162,210,155,93]},"announce":[],"urlList":[]}}