{"title":"A Short History of Atheism by Gavin Hyman (2010) [PDF]","uid":10566974,"size":2104749,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6db16c264b185649f80af2ec0480af443c104f84&amp;dn=A+Short+History+of+Atheism+by+Gavin+Hyman+%282010%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1405533945,"description":"Title: A Short History of Atheism\nAuthor: Gavin Hyman\nCategory: Academic/Religion\nSeries: Library of Modern Religion (Book 13)\nPublisher: I. B. Tauris (October 15, 2010)\nLanguage: English\nISBN-10: 1848851367\nISBN-13: 978-1848851368\n\nPromotional info/Publisher's summary - &quot;The last few years have seen a remarkable surge of popular interest in the topic of atheism. Books about atheism by writers like Richard Dawkins and Christopher Hitchens have figured prominently in bestseller lists and have attracted widespread discussion in the media. The ubiquity of public debates about atheism, especially in conscious opposition to the perceived social threat posed by faith and religion, has been startling. However, as Gavin Hyman points out, despite their prevalence and popularity, what often characterizes these debates is a lack of nuance and sophistication. They can be shrill, ignorant of the historical complexity of debates about belief, and tend to lapse into caricature. What is needed is a clear and well informed presentation of how atheistic ideas originated and developed, in order to illuminate their contemporary relevance and application. That task is what the author undertakes here. Exploring the rise of atheism as an explicit philosophical position (notably in the work of Denis Diderot), Hyman traces its development in the later ideas of Descartes, Locke, and Berkeley. Drawing also on the work of contemporary scholars like Amos Funkenstein and Michael J Buckley, the author shows that, since in recent theology the concept of God which atheists negate is changing, the triumph of its advocates may not be quite as unequivocal as Hitchens and Dawkins would have us believe.&quot;\n\nReview:\n&quot;Gavin Hyman offers a much needed analysis and evaluation of the atheism that arose during the Enlightenment and extended itself into the modern and contemporary periods. He does so with a fairness and balance that illumines the subject rather than obfuscates it. Avoiding the supercilious polemic which has recently and regrettably marked the subject, Hyman's introductory history of atheism is honest in its assessment of the evidence and careful in its argumentation, taking up an issue that has preoccupied Western civilization since the ancient Greeks. The integrity of his inquiry and of his discourse have left us very much in his debt.' - Michael J Buckley, SJ, Augustin Cardinal Bea, SJ, Professor of Theology, Santa Clara University, and author of At the Origins of Modern Atheism; 'In this meticulous anatomy of modern atheism, Gavin Hyman pursues the idea that we get the atheism we deserve: that modern atheism is a function of the modern idea of God, and nothing more. Accordingly, as the author shows, the very idea of the post-modernA&quot; spells trouble for the atheism that is built into modernity. The alternatives that post-modernity presents, Hyman argues, are whether to retrieve the pre-modern traditions of Augustine and Aquinas or to press on toward a thinking that moves beyond and displaces the distinction between theism and atheism. This is a lucid, engaging and astute work of historical and philosophical analysis.&quot; - John D Caputo, Thomas J Watson Professor of Religion and Humanities and Professor of Philosophy, Syracuse University\n\nThis torrent contains an excellent HQ scan of the book in PDF form, from a digital source. The front cover image is also included. Please seed, and enjoy.\n\nPlease visit and support my Suprbay release thread here, I would appreciate it:       &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;","torrent":{"xt":"urn:btih:6db16c264b185649f80af2ec0480af443c104f84","amp;dn":"A+Short+History+of+Atheism+by+Gavin+Hyman+%282010%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6db16c264b185649f80af2ec0480af443c104f84","infoHashBuffer":{"type":"Buffer","data":[109,177,108,38,75,24,86,73,248,10,242,236,4,128,175,68,60,16,79,132]},"announce":[],"urlList":[]}}