{"title":"Kenny Chesney - Life on a Rock (2013) [FLAC]","uid":8521324,"size":263143975,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6de6079e22d307ebb92732fb5b404e5d6342a7d0&amp;dn=Kenny+Chesney+-+Life+on+a+Rock+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1369925098,"description":"\n  Kenny Chesney - Life on a Rock (2013) [FLAC]\n\n  Released: 2013\n  Duration: 42:29\n  Genre: Country\n  Styles: Contemporary Country, New Traditionalist\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 800 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Pirate Flag \n  02 When I See This Bar \n  03 Spread The Love (Feat. The Wailers with Elan) \n  04 Lindy \n  05 Coconut Tree (With Willie Nelson) \n  06 It's That Time Of Day \n  07 Life On A Rock \n  08 Marley \n  09 Must Be Something I Missed\n  10 Happy On The Hey Now (A Song For Kristi)\n\n  Life on a Rock follows its 2012 predecessor Welcome to the Fishbowl quickly -- very quickly, appearing a mere ten months later. Why did Chesney rush out this record? It could be a tacit acknowledgment that Chesney wasn't entirely engaged on Welcome to the Fishbowl, an album that was thoroughly professional not only in its production but in its construction: Chesney barely wrote a thing on the record, choosing to slide into the role of superstar singer, acting like a rock star and living under a spotlight. It was fine but slight, somewhat lost in its own gleaming reflection, leaving little lasting impression. Life on a Rock is similarly light but it's not overly polished. It's breezy, music made for an afternoon at the beach -- a return to the sun-and-sand anthems that Chesney has had as a sideline for about a decade now. \n\n  At times, he accentuates his good times in the sun just a bit too heavily, inviting the Wailers in so they can give &quot;Spread the Love&quot; a genuine reggae bounce and also writing an ode to &quot;Marley&quot; somewhat in the vein of Eric Church's &quot;Springsteen,&quot; but this is the mildest form of overreaching; he's trying just a little bit too hard to chill out. Apart from that, Life on a Rock flows sweetly and easily, the tunes gently drifting between strummed ballads and shimmering low-key pop, with the opening song (and first single) &quot;Pirate Flag&quot; being the only song here with a hard pulse. Chesney never sounds like he's trying too hard but, the thing of it is, he wrote all but three of the songs here, so this represents a considerable uptick in effort from its predecessor. That effort pays off: this feels fuller, richer than any Chesney album in recent memory, but it's also unhurried and light, an ideal soundtrack for a long, lazy summer.","torrent":{"xt":"urn:btih:6de6079e22d307ebb92732fb5b404e5d6342a7d0","amp;dn":"Kenny+Chesney+-+Life+on+a+Rock+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6de6079e22d307ebb92732fb5b404e5d6342a7d0","infoHashBuffer":{"type":"Buffer","data":[109,230,7,158,34,211,7,235,185,39,50,251,91,64,78,93,99,66,167,208]},"announce":[],"urlList":[]}}