{"title":"Assault on the Liberty - Israeli Attack on USS Liberty Coverup","uid":4393126,"size":12529242,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6df9a1fa881fb8987cbbf1e176f84e433a2800f2&amp;dn=Assault+on+the+Liberty+-+Israeli+Attack+on+USS+Liberty+Coverup&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"CuriousGeorge","files":-1,"time":1221296588,"description":"Assault on the Liberty - The True Story of the Israeli Attack on an American Intelligence Ship\nAuthor James M. Ennes Jr.\n288 Pages\n\n\nThis book was one of a few that former Representative of the U.S. House, Paul Findley, read. Every American should read this book. There has never been a real congressional investigation into this deliberate attack on a U.S. ship by Jewish terrorists.\n\n\n Israel's False Flag Attack on the USS Liberty, 1967\n\n &quot;We had been surveilled all morning and part of the afternoon by Israeli forces. They knew who we were. We heard them reporting over radio who we were and how we were sailing and where we were sailing. They saw the flag and everything else. We were in international waters.&quot;\n\nAdlai Stevenson supported USS Liberty\n\nSenator Adlai Stevenson III in 1980, his last year as a United States Senator from Illinois, invited Jim Ennes to his Senate office for a private, two hour meeting to discuss the USS Liberty attack and coverup. Following the private meeting, Ennes was invited back the next day to discuss the attack with members of Stevenson's staff, along with members of the staff of Senator Barry Goldwater and members of the Senate Select Committee on Intelligence.\n\nIn that meeting, staff members told Ennes that they found his story convincing, but that they would recommend to both senators that they not pursue an investigation because an investigation would only antagonize Israeli interests while &quot;nothing good could come of it.&quot; Goldwater accepted that staff recommendation. Stevenson did not. Instead, Stevenson called a news conference in which he announced that he was convinced that the attack was deliberate and that the survivors deserved an investigation. He would, he said, spend the remaining few weeks of his Senate term attempting to arrange for an inquiry.\n\nAlmost immediately, the government of Israel contacted the White House and offered to settle the outstanding $40 million damage claims for $6 million, an amount equal to one dollar for each Jewish victim of the Holocaust. Vice President Walter Mondale quickly agreed to that offer just before Christmas while Congress and President Carter were on vacation. The Department of State followed immediately with a press release, reported on the front page of the New York Times, which announced, &quot;The book is now closed on the USS Liberty.&quot;\n\nIndeed, from that point on, it was impossible to generate any congressional interest in the Liberty at all. Senator Stevenson's staff told me later that they felt the settlement was directly related to Senator Stevenson's announced plan to hold an inquiry, and was engineered to block forever any inquiry plans. Israel did subsequently pay $6 million in three annual installments of $2 million each. Secretary of State Dean Rusk said later that he considered the payments meaningless, as Congress merely increased the annual Israeli allotment by that amount.\n\nAdlai Stevenson later ran for Governor of Illinois. He was strongly opposed by Israeli and Jewish interests. He lost. Many feel it was his support for the Liberty that cost him the election. Many also feel it was Stevenson's experience with the Liberty that has intimidated other Members of Congress who might otherwise support the survivors.\n\nCover Up Claimed In Attack: Ex-Admiral Questions Facts of Liberty Raid","torrent":{"xt":"urn:btih:6df9a1fa881fb8987cbbf1e176f84e433a2800f2","amp;dn":"Assault+on+the+Liberty+-+Israeli+Attack+on+USS+Liberty+Coverup","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6df9a1fa881fb8987cbbf1e176f84e433a2800f2","infoHashBuffer":{"type":"Buffer","data":[109,249,161,250,136,31,184,152,124,187,241,225,118,248,78,67,58,40,0,242]},"announce":[],"urlList":[]}}