{"title":"A Smoky Mountain Christmas (Christian Movie)","uid":9024658,"size":737435432,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6e3336a15c299108e3e34b0f8e681de682664882&amp;dn=A+Smoky+Mountain+Christmas+%28Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"IndianChristian","files":3,"time":1381343799,"description":"A Smoky Mountain Christmas (Christian Movie)\n\n\nCountry music superstar Lorna Davis (Dolly Parton) is overwhelmed and disillusioned by her career and loneliness. She plans a trip to a friend's cabin in Tennessee's Smoky Mountains to escape and recuperate during the Christmas season.\n\nUpon arriving there, Lorna finds it has become the impromptu home of seven orphans who are hiding from the orphanage in town. They actually discover her sleeping in one of the beds, (an allusion to the Seven Dwarfs finding Snow White) to which the youngest proclaims: &quot;I know who she is. She's the Angel.&quot;\n\nBecause they both have secrets to keep - the children don't want to be found by the orphanage and Lorna doesn't want to be found by anyone from L.A. - they agree to keep each other's presence at the cabin a secret. She then quickly builds strong friendships with them, although it takes a while to win over cautious Jake, the eldest.\n\nLittle does she know, Lorna has been followed there by Harry (Dan Hedaya), a sleazy and enterprising paparazzo who is determined to reveal her hidden location. In addition to him, she faces Jezebel (Anita Morris), a mountain &quot;witch woman&quot; who is determined to kill her for attracting the eye of her lover, John Jensen (Bo Hopkins), the sheriff of the nearby town. She is saved from Jezebel's first attempt on her life by Mountain Dan (Lee Majors), a wandering mountain man who is wise to the ways of &quot;mountain folk.&quot;\n\nAfter Harry reveals Lorna's identity to John, she is arrested and the children are taken back to the orphanage. Jezebel, disguised as an old woman, delivers a poisoned pie to her in prison, but is tricked into eating it herself and falls into an endless sleep. Lorna is freed by Jake, Dan, and Harry and they formulate a plan to free the children from the orphanage.\n\nDressed as Santa Claus and a helper elf, Dan and Lorna are able to get into there and free them, only to be stopped by John while trying to escape.\n\nThey are taken before extremely uninterested Judge Harold Benton (John Ritter) who eventually dismisses all charges against Lorna and Dan and grants custody of the children to her.\n\nThis is one great Christmas movie that all will enjoy, especially kids.\n \nRuntime: 95 mins\nLanguage: English\nYear: 1986\nQuality: 7/10\nFormat: avi format \n\nSee reviews here,  &lt;a href=&quot;\nhttp://www.amazon.com/A-Smoky-Mountain-Christmas-VHS/dp/6301802705&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/A-Smoky-Mountain-Christmas-VHS/dp/6301802705&lt;/a&gt;\n\nI would ask every Christian to do 2 things.\n\n1. If possible please buy this movie. Do you know that there are 2.2 billion Christians on earth today. But only a privileged few, around 12% have the means and the accessibility to buy Christian films. Many Christians are too poor to buy movies or live in places where Christian films are not available. \nThat's not all. Out of the 12% who have the means and accessibility to buy Christian media, only around 0.5% ever buys a Christian movie. In other words only 1 out of 200 Christians ever buys a Christian movie. Pathetic isn't it?\nPlease buy the movies to keep Christian films in business. And please do pray for the Christian movie makers and their families.\n\n2. Please seed the movies for as long as possible. If possible make copies and distribute to your poor neighbors. And please do pray for the movie makers and their families. Remember the Kingdom of Heaven is in you and so is the choice of Heaven/Hell. \n\nPS: If you need any specific Christian movie or have something to say then kindly send a mail to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;2841464c4149464b405a415b5c4149461a181811685149404747064b47064146&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nKindly mention the subject as Christian Movies or something similar. \n\n&quot;Don't ask me what Christ can do for you! He has done all he could. Tell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\n","torrent":{"xt":"urn:btih:6e3336a15c299108e3e34b0f8e681de682664882","amp;dn":"A+Smoky+Mountain+Christmas+%28Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e3336a15c299108e3e34b0f8e681de682664882","infoHashBuffer":{"type":"Buffer","data":[110,51,54,161,92,41,145,8,227,227,75,15,142,104,29,230,130,102,72,130]},"announce":[],"urlList":[]}}