{"title":"Standup Comedy - Tim Wilson - But I May Be Wrong","uid":4319082,"size":66898978,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6e6ceab22b44d3473fc6d6e8aa8c68b585b40764&amp;dn=Standup+Comedy+-+Tim+Wilson+-+But+I+May+Be+Wrong&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"rambam1776","files":23,"time":1217286168,"description":"I finally got an invitation to join Demonoid, where my Google searches for torrents I cannot find here keep showing great stuff. I spent all last week grabbing comedy albums which I am now going to upload here. Other than going to the trouble of fixing tags and getting artwork and details, these torrents are as the original posters seeded them. I am not endorsing or recommending all of these. In fact, I think some of them suck. However, there is a major lack of well seeded comedy torrents here, and I hope to encourage more people to post new ones. Also, who says *MY* taste matches somebody elses? The reviews are from ALLMUSIC or from AMAZON. As usual, much thanks to the OPs who put these out and about.\n\nRambam1776\n\n\n\nTIM WILSON ? BUT I COULD BE WRONG\n\nBiography\tby Jason Ankeny\nGeorgia-born country comedian Tim Wilson was a born funnyman, delivering dead-on impressions of his teachers while still in elementary school; he later emceed his high school&amp;#039;s talent shows, but after taking up guitar as a teen he instead aspired to a career in music. While in college he accepted a job as a sportswriter, later convincing his editors to allow him to review local concerts as well; at an Atlanta Rhythm Section date, Wilson passed along his demo tape to the group&amp;#039;s drummer Roy Yaeger, who agreed to produce a session at his Georgia studio. The resulting demo went nowhere, however, and so Wilson instead turned to comedy; immediately he earned a devoted local following, and soon after won a Cinemax stand-up competition. A series of television spots followed, including an appearance on The Tonight Show with Jay Leno; in 1990, he also teamed with the duo of Pinkard &amp; Bowden to write the song &quot;Arab, Alabama,&quot; and its success convinced him to include music in his stand-up act. In addition to a series of LPs for the independent Southern Tracks label including Tough Crowd, Waking Up the Neighborhood, Low-Class Love Affair and Tuned Up, Wilson scored a hit single with his &quot;Garth Brooks Ruined My Life,&quot; also co-writing Jeff Foxworthy&amp;#039;s smash &quot;The Redneck Twelve Days of Christmas.&quot; Upon signing to Capitol, he released his major-label debut It&amp;#039;s a Sorry World in early 1999; Gettin&amp;#039; My Mind Right followed later that same year. In 2000 he issued Hillbilly Homeboy which was helped by the success of its first single, &quot;The Ballad of John Rocker&quot; and waited three years to follow it up with his first funk concept album, Super Bad Sounds of the &amp;#039;70s. \n\n\n\nReview\tby David Jeffries\nComedian Tim Wilson&amp;#039;s discography is a strange mix of seemingly tossed-off efforts and ambitious projects. His loyal fan base has had to hang on tight with twists and turns like his Soul Train inspired concept album Super Bad Sounds of the 70s. His 2007 album But I Could Be Wrong is bound to shake off another batch of fans since it proudly wears a Parental Advisory sticker and Wilson&amp;#039;s material is now closer to Chinga Chavin territory than it&amp;#039;s ever been. The good news is it suits him just fine, and there&amp;#039;s plenty of A-list material that doesn&amp;#039;t rely on cussing, like the bitter and smart &quot;Way out in the Country&quot; or better yet, &quot;Deddy Worked,&quot; which must have been stolen when Kinky Friedman wasn&amp;#039;t looking. The populist stuff made for morning radio jocks is still here (&quot;Disco Ball&quot; which focuses on football) and politically incorrect moments like &quot;Pork Rind Airlines&quot; (as in &quot;the terrorists won&amp;#039;t be ridin&amp;#039; no...&quot;) are still impossible to defend. Even harder to explain is the allure of his standup which is casual, messy, and built more for chuckling that laughing. Still there&amp;#039;s a homemade and rebel charm to it all and the serious filth, wrier lyrics, and new Brooks &amp; Dunn look suit Wilson better than expected. He may be getting older, but he&amp;#039;s definitely not clamping down, making this generally tossed-off effort more appealing than it has any right to be. \n &lt;a href=&quot;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:apfoxzt5ldte&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:apfoxzt5ldte&lt;/a&gt;\n","torrent":{"xt":"urn:btih:6e6ceab22b44d3473fc6d6e8aa8c68b585b40764","amp;dn":"Standup+Comedy+-+Tim+Wilson+-+But+I+May+Be+Wrong","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e6ceab22b44d3473fc6d6e8aa8c68b585b40764","infoHashBuffer":{"type":"Buffer","data":[110,108,234,178,43,68,211,71,63,198,214,232,170,140,104,181,133,180,7,100]},"announce":[],"urlList":[]}}