{"title":"Holy Fuck - Congrats (2016) [16.44 CD FLAC]","uid":14735785,"size":267724749,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6ef01fb0dacea46d4806a622c3a1a75f0c2a1c7d&amp;dn=Holy+Fuck+-+Congrats+%282016%29+%5B16.44+CD+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":12,"time":1464634510,"description":"\n  Holy Fuck - Congrats (2016) [16.44 CD FLAC]\r\n\r\n  Genre: Electronic\r\n  Styles: Indie, Experimental\r\n  Source: CD \r\n  Codec: FLAC\r\n  Bit rate: ~ 1,000 kbps\r\n  Bit depth: 16\r\n  Sample rate: 44.1 kHz\r\n\r\n  01 Chimes Broken\r\n  02 Tom Tom\r\n  03 Shivering\r\n  04 Xed Eyes\r\n  05 Neon Dad\r\n  06 House of Glasses\r\n  07 Sabbatics\r\n  08 Shimmering\r\n  09 Acidic\r\n  10 Caught Up\r\n\r\n  Emerging after a six-year hiatus, Toronto-based electro-rock band Holy Fuck return with Congrats, an album that refines their junk store aesthetic into their most cohesive, accessible tunes yet. The group's songs still sound rough and chaotic, but they've come a long distance from the sprawling, messy jams of their 2005 debut. Subsequent albums LP and Latin sharpened their melodic inclinations considerably and had much tighter song structures, but on Congrats, they patch more vocals into the mix. While this certainly provides more of a human element to their music, the vocals are shadowy and distant, recalling Liquid Liquid in how they figure into the sound as textural elements rather than as a vehicle for expressing sentiments through easily discernable lyrics. Similarly, the music plays with the listener's perceptions, liberally incorporating jagged bursts of fuzz and trippy echo, and often adding suspenseful mood shifts. &quot;Tom Tom&quot; is one of the album's early highlights, pairing a minimal kick-snare beat with oddly cheerful singsong vocals and engulfing them in carefully controlled waves of distortion. &quot;Shivering&quot; is slower and more haunting, with brief blips of vocals forming a ghostly melody beneath chilling synth arpeggios. &quot;Neon Dad&quot; is surprisingly tender for the band, with a Fleetwood Mac-worthy melody disguised in layers of drifting, resounding reverb. &quot;House of Glass&quot; bursts forth with aggressive bass blasts, then hits a striding rhythm that is constantly offset by stuttering delay. &quot;Acidic&quot; is a gleefully EQ'd noisy disco-reggae jam, and the concluding &quot;Crapture&quot; (potentially a dig at disbanded dance-punks the Rapture?) is the most aggressive dance track on the album, furiously bashing its way up to an ecstatic climax via a vocal melody that recalls Prince's &quot;Dirty Mind.&quot; Congrats still sounds unmistakably like Holy Fuck, but their vision of weird electronic pop is much clearer here","torrent":{"xt":"urn:btih:6ef01fb0dacea46d4806a622c3a1a75f0c2a1c7d","amp;dn":"Holy+Fuck+-+Congrats+%282016%29+%5B16.44+CD+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ef01fb0dacea46d4806a622c3a1a75f0c2a1c7d","infoHashBuffer":{"type":"Buffer","data":[110,240,31,176,218,206,164,109,72,6,166,34,195,161,167,95,12,42,28,125]},"announce":[],"urlList":[]}}