{"title":"Comedy - Derek and Clive (Peter Cook, Dudley Moore) All 3 Albums","uid":6817636,"size":275555664,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6efd06c8b5104067d7948d6bf921d6b6420d7b7b&amp;dn=Comedy+-+Derek+and+Clive+%28Peter+Cook%2C+Dudley+Moore%29+All+3+Albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rambam1776","files":-1,"time":1321281207,"description":"Torrent originates on Demonoid, tags fixed. VBR mp3\n &lt;a href=&quot;\nhttp://bayimg.com/haKElaaDP&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/haKElaaDP&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Derek_and_Clive&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Derek_and_Clive&lt;/a&gt;\n\n\nDerek and Clive is a double act of comedic characters created by Dudley Moore (Derek) and Peter Cook (Clive) in the 1970s. The performances were captured on the records Derek and Clive (Live) (1976), Derek and Clive Come Again (1977), and Derek and Clive Ad Nauseam (1978), as well as in a film documentary, Derek and Clive Get the Horn (1979). The characters are foul-mouthed extensions of the earlier characters Pete and Dud.\n\nConsidered highly offensive by many at the time, the sketches primarily took the form of bizarre, sometime drunken streams of consciousness led by Cook, with interjections from Moore. Memorable moments from the records include Clive claiming that the worst job he ever had was retrieving lobsters from Jayne Mansfield's anus, Derek claiming his worst job was cleaning up Winston Churchill's bogeys (leading the pair to conclude that the Titanic was one such bogey), Clive claiming that he was sexually aroused by the sight of a deceased Pope lying in state, and a horse-racing 'commentary' featuring horses named after sexual organs or their vulgarised derivatives.\n\nThough the recordings were far too crude for television or a mainstream audience, Derek and Clive bootleg recordings circulated. They became famous as mostly unscripted dialogues, vulgar situations depicting with copious swearing - especially the word &quot;cunt&quot;.\n &lt;a href=&quot;\nhttp://www.search.com/reference/Derek_and_Clive&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.search.com/reference/Derek_and_Clive&lt;/a&gt;\n\nDerek and Clive are controversial cult characters created by double act Dudley Moore and Peter Cook respectively on the records Derek and Clive (Live), 1976; Derek and Clive Come Again, 1977 and Derek and Clive Ad Nauseam, 1978 and a film documentary, Derek and Clive Get the Horn, 1979. The characters are seen as more foul-mouthed extensions of their earlier characters Pete and Dud. Though the recordings were far too controversial for television or a mainstream audience, Derek and Clive bootleg recordings circulated, becoming famous for their, mostly, unscripted dialogues, vulgar situations and copious use of profanity - especially the word &quot;cunt&quot;.\n\nConsidered by many at the time as highly offensive, the comic sketches primarily took the form of bizarre, sometime drunken streams of consciousness led by Cook, with interjections from Moore. Memorable moments from the records include Clive claiming that the worst job he ever had was retrieving lobsters from Jayne Mansfield's bum, Derek claiming his worst job was cleaning up Winston Churchill's bogies (leading the pair to conclude that the Titanic was one such bogie), Clive claiming that he was sexually aroused by the sight of a deceased Pope lying in state and a brilliantly staged horse racing 'commentary' featuring horses named after sexual organs or their vulgarised derivatives.\n\nThe characters, supposedly two lavatory attendants (although in one sketch, 'Back of the Cab', they play the roles of two London taxi drivers) first surfaced in the mid-seventies. Cook and Moore were touring Broadway with their revue show &quot;Good Evening&quot;, a live version of their television series &quot;Not Only... But Also.&quot; The relationship between the two had already become strained, as a result of Cook's increasing alcoholism. To reassure Moore, Cook hired out a recording studio in New York, where the two could simply relax, drink and ad-lib. The resulting recording was padded out with live performances of old favorites (such as &quot;Bo Duddley&quot;), and began to circulate as Derek and Clive (Live).\n\nCook became bemused at the idea that they should not be making money from the increasing popularity of Derek and Clive, and suggested to Moore that the recording should be released officially. By this point, Moore had embarked on a successful film career and found the tapes embarrassing, until he too realised his contemporaries were fans.\n\nA further two records were made. However, they became less like dialogues and more like vindictive attacks on the increasingly successful Moore by Cook, whose career had stalled somewhat in comparison.\n\nThese personal attacks culminated in an exasperated Moore eventually walking out of the Ad Nauseam sessions, effectively ending their comedy partnership which had begun nearly twenty years earlier. In one particularly cruel attack, on the &quot;Come Again&quot; record, Cook rants at length about his irritation at his father dying of cancer. He was fully aware that Moore's father was at the time dying of cancer, and that Moore was having a particularly hard time coping with this. Nevertheless, Moore, also fuelled by large quantities of drink, not only happily joins in ad-libbing the &quot;My Mum Song&quot;, but is reduced to hysterical laughter by Cook's lyrics.\n\nThe same love-hate relationship between them is evident in the Derek and Clive Get the Horn movie, during which Moore withstands brutally vindictive verbal tirades from Cook and walks out in anger, only to return, and have Cook reduce him to helpless laughter again only minutes later. It's often, mistakenly, assumed that all of their releases were recorded while under the influence of alcohol. While this can be presumed of &quot;Come Again&quot; - where the sounds of bottles can be heard in the background and which features some tracks where both Cook and Moore are slurring their words, the videotaped release of &quot;Derek and Clive get the Horn&quot;, most of which ended up on &quot;Ad Nauseum&quot;, shows a very sober looking Cook and Moore drinking coffee and water throughout. Likewise the first record &quot;Derek and Clive&quot; features studio tracks where both Cook and Moore are clearly sober. It's probable that this assumption derived from the front and back cover of &quot;Come Again&quot; where Cook and Moore are holding drinks and appear to be drunk.\n\nLater taped and CD releases of &quot;Come Again&quot; and &quot;Ad Nauseum&quot; featured out-takes not previously released - most were recorded during the &quot;Ad Nauseum&quot; sessions. Surreal at times, these included &quot;Mother&quot; (featured on &quot;Derek and Clive get the Horn&quot;) where Cook pretended to visit his over-possessive and deranged mum, ending with Cook telling Moore to &quot;Fuck off and die&quot; after Moore rants on about seeing Cook's &quot;Ticket&quot; - a reference to his penis, &quot;Intergalatic Sex&quot;, &quot;Valerie's Hymen&quot;, where Moore discussed cutting out his wife's hymen with a carving knife and &quot;Lady Vera Shit Teller&quot; where Moore elaborates on a visit to a fortune teller who could tell his future by examining his &quot;farts&quot;. Transcripts of further, unreleased, 'out-takes' are available in a book entitled &quot;Come Again&quot;, edited by William Cook and feature &quot;General Eisenhower&quot;, where Cook reflects on the perils of counting the late General's dandruff flakes, &quot;Vietnam&quot;, where Moore received a paper cut inflicted by the Viet Cong; in one insightful remark Cook mentions a &quot;friend&quot; of his who fought in Vietnam but he's not sure &quot;on which side&quot; and &quot;A Million Pounds&quot;, where Cook plays an hysterical woman looking for a million pounds off a sympathetic Moore. The remaining unreleased out-takes are variations on actual releases.","torrent":{"xt":"urn:btih:6efd06c8b5104067d7948d6bf921d6b6420d7b7b","amp;dn":"Comedy+-+Derek+and+Clive+%28Peter+Cook%2C+Dudley+Moore%29+All+3+Albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6efd06c8b5104067d7948d6bf921d6b6420d7b7b","infoHashBuffer":{"type":"Buffer","data":[110,253,6,200,181,16,64,103,215,148,141,107,249,33,214,182,66,13,123,123]},"announce":[],"urlList":[]}}