{"title":"Chris Wooding - Retribution Falls (Tales of the Ketty Jay #1)","uid":11585121,"size":211826447,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6f6ba07d2aae132f57315fcbba9985c5e74782f5&amp;dn=Chris+Wooding+-+Retribution+Falls+%28Tales+of+the+Ketty+Jay+%231%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Cybotage","files":1,"time":1417160307,"description":"Frey is the captain of the Ketty Jay, leader of a small and highly dysfunctional band of layabouts. An inveterate womaniser and rogue, he and his gang make a living on the wrong side of the law, avoiding the heavily armed flying frigates of the Coalition Navy. With their trio of ragged fighter craft, they run contraband, rob airships and generally make a nuisance of themselves. So a hot tip on a cargo freighter loaded with valuables seems like a great prospect for an easy heist and a fast buck. Until the heist goes wrong, and the freighter explodes. Suddenly Frey isn't just a nuisance anymore - he's public enemy number one, with the Coalition Navy on his tail and contractors hired to take him down. But Frey knows something they don't. That freighter was rigged to blow, and Frey has been framed to take the fall. If he wants to prove it, he's going to have to catch the real culprit. He must face liars and lovers, dogfights and gunfights, Dukes and daemons. It's going to take all his criminal talents to prove he's not the criminal they think he is","torrent":{"xt":"urn:btih:6f6ba07d2aae132f57315fcbba9985c5e74782f5","amp;dn":"Chris+Wooding+-+Retribution+Falls+%28Tales+of+the+Ketty+Jay+%231%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f6ba07d2aae132f57315fcbba9985c5e74782f5","infoHashBuffer":{"type":"Buffer","data":[111,107,160,125,42,174,19,47,87,49,95,203,186,153,133,197,231,71,130,245]},"announce":[],"urlList":[]}}