{"title":"Metallica - And Justice For All 1988 (Unique Custom Remaster, 20","uid":3785598,"size":505379025,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:70361aba0bf0d3d754e01d960cb17c74dce6fc7c&amp;dn=Metallica+-+And+Justice+For+All+1988+%28Unique+Custom+Remaster%2C+20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Tech-Noir","files":13,"time":1188185980,"description":"Metallica - And Justice For All 1988 (Unique Custom Remaster, 2007) FLAC Lossless\n\n\n-----------------------------------------------------------------------\nTechnical Info\n-----------------------------------------------------------------------\n\n-Source material:\nTracks 1-9: FLAC Lossless\n\n\n-New Encoding:\nFLAC Lossless (In other words, full quality compressed to generally about 1/2 of an Audio CD size)\n\n\n-Total Size:\n481 MB\n\n\n-Total Play Time:\n1:05:26\n\n\n-Tracklist:\n1. Metallica - Blackened (Remastered) (6:42)\n2. Metallica - ...And Justice For All (Remastered) (9:45)\n3. Metallica - Eye Of The Beholder (Remastered) (6:27)\n4. Metallica - One (Remastered) (7:26)\n5. Metallica - The Shortest Straw (Remastered) (6:35)\n6. Metallica - Harvester Of Sorrow (Remastered) (5:45)\n7. Metallica - The Frayed Ends Of Sanity (Remastered) (7:44)\n8. Metallica - To Live Is To Die (Remastered) (9:48)\n9. Metallica - Dyers Eve (Remastered) (5:14)\n\n\n\n-----------------------------------------------------------------------\nGeneral info\n-----------------------------------------------------------------------\n\nWhat to say... Of all the Metallica albums, this one is definately the one I dislike the most. The recording is just horrible. The bass guitar is barely there at all, it can just be heard as a presence sometimes. And it doesn&amp;#039;t have any lower frequencies to give some fluidity and drive to the bottom end. That is left up to the kick, which is equalized to, as it seems, fill the bass-space the bass should. It doesn&amp;#039;t kick (you know, &quot;thump&quot;), it just clicks, followed by a slow surge of subsonics.\n\nThe recording itself is horrible. Going from &quot;Master Of Puppets&quot; or &quot;Ride The Lightning&quot; to this is like day and night. I suppose someone decided that the ambience and reverbs or those earlier albums sounded way too good, so they decided to stick the drums in a sonically dead vocal booth. Everything is dry as a desert. There is a hint of reverb on some instruments, but even the reverb is thin and crap, and it doesn&amp;#039;t help at all in giving some extra depth. The drums are definately the biggest dissapointment here.\n\nI also don&amp;#039;t like any of the tracks (possibly because the recording sounds like a turd). You would definately be better off just getting hold of the tracks recorded off live performances (official recordings that is), and compiling them to an album. It is amazing when you actually hear for example the title track in a live recording, because it sounds alot better. Just compare the track &quot;One&quot; with the version they recorded for &quot;S&amp;M&quot;. There is an indescribable difference, even if you ignore the orchestra.\n\n\nAnyways, I am not happy with this at all. One of the rules I should have when working on stuff like this is that I myself should want to listen to it, but that doesn&amp;#039;t apply with this one. I still think it sounds pretty bad, mostyl due to the lack of the bassguitar. This is just for everyone elses sake. :)\n\n\n\n\nSo what have I done? Well, lots of things. I have just done whatever I could to make this sound acceptable to me personally. I have used a barrage of stuff, experimenting over and over to try and find what best suits the sound.\n\n\n\nEqualizing: Just to level out the spectrum so that certain things aren&amp;#039;t hidden. The Original was described as being &quot;thin&quot;, and that&amp;#039;s thanks to the low-mid section being hollowed out. This has been corrected.\n\nAcoustics: This one I haven&amp;#039;t used before, but I felt it could lend a new dimension to the tracks. The worst part about the original is that it is so completely one-dimensional. No room ambience or anything. So I threw on acoustic processors of various kinds (reverbs, and other types) to try and bring some life back into the record (so that it atleast sounds like it was recorded in some kind of room instead of the vacuum of space). The result is a more dimensional sound, with both reverb in the distance, aswell as another dimension in the foreground.\n\nTransient Processors: To try and balance the transients (quick attacks) coming from drums and percussive instruments. The transients are important for determining the &quot;closeness&quot; of a sound to the listener. Altering the amplitude of these can also change the character of certain sounds. It can be used as a sort of compression, but it only affects the isolated transients and not the body of sounds. Also it can be used for expansion rather than compression (making the snare drum snap even louder for example). I&amp;#039;ve used it to make transients more subtle, which makes snares etc appear to be further away. I did this because I also added reverb etc, and I wanted to give a sense of distance and depth a la the older albums. The attenuation of peaks also helps make the tracks flow better (less peaks to break the flow. And it is alot better to use for this purpose than compression which affects the whole signal, not just the transients.\n\nHarmonic Processors: Since the bassguitar is completely missing, I have tried to expand the guitars downwards to atleast give some bottom edn and &quot;gut&quot; to this mess.\n\nCompression/Lmiting: Because it was sorely needed. The original is very flat. There is no sense of &quot;unity&quot; to the separate parts of the track (they don&amp;#039;t &quot;interact&quot; sonically in any way, like slightly push eachother out of the way or such). They also seem to not have been compressed indivudually either.\n\n\nThe result sounds alot better than the original (In my opinion ofcourse). But it is still very flat and dull, and this is an album I&amp;#039;d rather not listen to. I even prefer St. Anger, which has alot better production value than this (if that tells you anything).\n\nIn my opinion, they should have just stuck with the setup they had with Master Of Puppets. It&amp;#039;s old, but the reverbs, guitar delay units, ambience and depth they had on that album is on of the most impressive I&amp;#039;ve heard so far.","torrent":{"xt":"urn:btih:70361aba0bf0d3d754e01d960cb17c74dce6fc7c","amp;dn":"Metallica+-+And+Justice+For+All+1988+%28Unique+Custom+Remaster%2C+20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70361aba0bf0d3d754e01d960cb17c74dce6fc7c","infoHashBuffer":{"type":"Buffer","data":[112,54,26,186,11,240,211,215,84,224,29,150,12,177,124,116,220,230,252,124]},"announce":[],"urlList":[]}}