{"title":"iSkysoft iTube Studio v5.6.0 Mac OS X {B4tman}","uid":14202460,"size":45656999,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:704f64144f43fe46567a206fe3748f9db460cfe6&amp;dn=iSkysoft+iTube+Studio+v5.6.0+Mac+OS+X+%7BB4tman%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"AliPaK","files":3,"time":1459942444,"description":"iSkysoft iTube Studio v5.6.0 Mac OS X {B4tman}\r\n \nhttp://i.imgur.com/ACiy6Vf.png\r\n\r\nDescription:-\r\n\r\niTube Studio is much more than just a YouTube downloader. It is easy to build your video library with your own desktop videos and the downloaded videos. It can save download history and you also can delete any unwanted videos.\r\niTube Studio allows you to import your desktop videos to the program for organization. And you are able to play any video with the built-in media player.\r\nou will now be able to enjoy your favorite viral video even if you are offline regardless of where you are. This is thanks to iTube Studio which allows you to download all types of videos fromYouTube, Metacafe, Break and Vimeo.\r\n\r\nYou will also be able to download HD videos and this is possible from other video sharing sites in Firefox, Chrome and Safari. It also has the ability to convert the videos you have downloaded or even MP4/FLV videos into a format that can be used on iPods, iPhone 4S, iPad 2, PSP among other devices. The variety of options it allows you is one of the most attractive things about iTube Studio.\r\n\r\nDownload your favorite videos from video sharing site such as YouTube\r\nConvert video for iPad, iPhone, iPod or iPhone 4 S or any other platform\r\nManage and play downloaded web video on your Mac's hard drive\r\nAutomatically download YouTube video in your specified format--it's hands off.\r\n\r\nFeatures:-\r\n\r\n• Record original audio stream from YouTube to MP3, M4A, WAV or MKV\r\n• One click to download music videos from YouTube to MP3 in high quality\r\n• Convert YouTube videos to MP3 and other lossless audio formats\r\n• Export MP3 audio files from YouTube to iTunes automatically\r\n\r\nRequirements:-\r\n\r\n• Mac OS X 10.6 or later","torrent":{"xt":"urn:btih:704f64144f43fe46567a206fe3748f9db460cfe6","amp;dn":"iSkysoft+iTube+Studio+v5.6.0+Mac+OS+X+%7BB4tman%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"704f64144f43fe46567a206fe3748f9db460cfe6","infoHashBuffer":{"type":"Buffer","data":[112,79,100,20,79,67,254,70,86,122,32,111,227,116,143,157,180,96,207,230]},"announce":[],"urlList":[]}}