{"title":"Paul Desmond - 1959 - First Place Again (2012) FLAC","uid":8795305,"size":284232669,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:709b10320e0fe0fd393cf0ddb2f09246c0909a30&amp;dn=Paul+Desmond+-+1959+-+First+Place+Again+%282012%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"eika256","files":-1,"time":1376060001,"description":"Paul Desmond - 1959 - First Place Again (2012)\n\nThe title of this set by alto saxophonist Paul Desmond refers to his having placed first once again in the alto chair in the Downbeat poll. Released in 1959, First Place Again is the result of an unexpected gathering of the rhythm section of the Modern Jazz Quartet: Percy Heath and Connie Kay, and Jimmy Giuffre 3 guitarist Jim Hall. The four musicians were all unexpectedly at home in New York and took full advantage of cheap, after-hours recording studio time to play out this set of standards and a pair of newer tunes, John Lewis' great blues, &quot;Two Degrees East, Three Degrees West,&quot; and &quot;East of the Sun (and West Of The Moon),&quot; from a Princeton University theater work. The rest, including a fine reading of &quot;Greensleeves,&quot; which is short and tight here, Cole Porter's &quot;I Get a Kick out of You,&quot; J. Fred Coots' &quot;For All We Known,&quot; &quot;You Got to My Head&quot; -- another Coots' tune -- and Sammy Cahn's &quot;Time After Time,&quot; are done with an airy, amiable vibe, especially the work between Hall and the rhythm section, which is full of counterpoint and sharp accents. Desmond, of course, being at that time the king of melodic improvisation on the alto -- with the possible exception of Art Pepper's ascendancy -- is in fine form. His whimsical, breathy, dry tone is sharp, on the spot, and full of ideas as he quotes from a vast number of tunes. This is a thoroughly enjoyable and relaxed set if ultimately unmemorable. [Though the album was first released under the title First Place Again, it was reissued by the Discovery label in 1986 under the title East of the Sun. The track listing was the same, though the running oder was shuffled.] (AllMusic)\n\nTrack list:\n01. East Of The Sun\n02. For All We Know\n03. I Get A Kick Out Of You\n04. Greensleeves\n05. Two Degrees East, Three Degrees West\n06. Time After Time\n07. You Go To My Head\n08. Susie\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:709b10320e0fe0fd393cf0ddb2f09246c0909a30","amp;dn":"Paul+Desmond+-+1959+-+First+Place+Again+%282012%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"709b10320e0fe0fd393cf0ddb2f09246c0909a30","infoHashBuffer":{"type":"Buffer","data":[112,155,16,50,14,15,224,253,57,60,240,221,178,240,146,70,192,144,154,48]},"announce":[],"urlList":[]}}