{"title":"How the Beatles Destroyed Rock 'n' Roll An Alternative History o","uid":11422127,"size":1201162,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70a32366e7111d8ad84b55b47a2d13b9af75e139&amp;dn=How+the+Beatles+Destroyed+Rock+%27n%27+Roll+An+Alternative+History+o&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415629774,"description":"&quot;There are no definitive histories,&quot; writes Elijah Wald, in this provocative reassessment of American popular music, &quot;because the past keeps looking different as the present changes.&quot; Earlier musical styles sound different to us today because we hear them through the musical filter of other styles that came after them, all the way through funk and hip hop.\n\nAs its blasphemous title suggests, How the Beatles Destroyed Rock 'n' Roll rejects the conventional pieties of mainstream jazz and rock history. Rather than concentrating on those traditionally favored styles, the book traces the evolution of popular music through developing tastes, trends and technologies--including the role of records, radio, jukeboxes and television --to give a fuller, more balanced account of the broad variety of music that captivated listeners over the course of the twentieth century. Wald revisits original sources--recordings, period articles, memoirs, and interviews--to highlight how music was actually heard and experienced over the years. And in a refreshing departure from more typical histories, he focuses on the world of working musicians and ordinary listeners rather than stars and specialists. He looks for example at the evolution of jazz as dance music, and rock 'n' roll through the eyes of the screaming, twisting teenage girls who made up the bulk of its early audience. Duke Ellington, Benny Goodman, Frank Sinatra, Elvis Presley, Chuck Berry, and the Beatles are all here, but Wald also discusses less familiar names like Paul Whiteman, Guy Lombardo, Mitch Miller, Jo Stafford, Frankie Avalon, and the Shirelles, who in some cases were far more popular than those bright stars we all know today, and who more accurately represent the mainstream of their times.\n\nWritten with verve and style, How the Beatles Destroyed Rock 'n' Roll shakes up our staid notions of music history and helps us hear American popular music with new ears.\n\nPublisher: Oxford University Press (October 1, 2011)\nLanguage: English\nISBN-10: 019975697X\nISBN-13: 978-0199756971\n\nEditorial Reviews\n\nFrom Bookmarks Magazine\nRevisiting original sources to understand how music has been received over the past century, Wald neatly traces the evolution of popular music. As with many books that set out to prove sensational claims in the title (the Christian Science Monitor calls the book's tag &quot;blatantly disingenuous&quot;), Wald's work doesn't really deliver on its claim (or, in fact, pay it a great deal of attention). But look past the title, and readers will discover that even when he's not being provocative, Wald can be thought-provoking, as in his profiles of lesser-known musicians and their influence on subsequent generations of musicians. Those pieces complement more mainstream -- and, in Wald's hands, refreshingly honest -- discussions of superstars and issues of race and gender. The result, despite the Los Angeles Times's sharp criticism of the thesis, is both passionate and informative. --This text refers to the Hardcover edition.\n\nReview\n\n&quot;I couldn't put it down. It nailed me to the wall, not bad for a grand sweeping in-depth exploration of American Music with not one mention of myself. Wald's book is suave, soulful, ebullient and will blow out your speakers.&quot;--Tom Waits\n\n\n&quot;Wald is a meticulous researcher, a graceful writer and a committed contrarian... an impressive accomplishment.&quot;--New York Times Book Review\n\n\n&quot;A complex, fascinating and long-overdue response to decades of industry-driven revisionism.&quot;--Jonny Whiteside, LA Weekly\n\n\n&quot;It's an ambitious project, but Wald's casual narrative style and eye for a juicy quote give it a lightness that even a novice to pop, rock, or jazz history can appreciate... The title is appropriate: This is a provocative book, in all the right ways.&quot;--The Onion AV Club\n\n\n&quot;Wald is a sharp, fair critic eager to right the record on popular music... deepens the appreciation of American popular music.&quot;--Boston Globe\n\n\n&quot;This is a debatable premise... you don't have to agree with it to admire this book... It is as an alternative, corrective history of American music that Wald's book is invaluable. It forces us to see that only by studying the good with the bad--and by seeing that the good and bad can't be pulled apart--can we truly grasp the greatness of our cultural legacy.&quot;-- Malcolm Jones, Newsweek\n\n\n&quot;A serious treatise on the history of recorded music, sifted through his filter as musician, scholar, and fan... It's a brave and original work that certainly delivers.&quot;-Christian Science Monitor\n\n\n&quot;A smart, inclusive celebration of mainstream stars, such as 1920s bandleader Paul Whiteman and the Fab Four, who introduced jazz, blues, and other roughhewn musical forms to mass audiences.&quot;--AARP Magazine\n\n\n&quot;A powerfully provocative look at popular music and its impact on America.&quot;--Dallas Morning News\n\n\n&quot;Elijah Wald is a treasure... There is far too much in these 300 pages to even summarize here. Wald is an economical and lucid writer with an amazing grasp of his subject. I know quite a lot of musical history, and I did not find a single clinker in this symphony of renewal and re-examination.&quot;--Winston-Salem Journal\n\n\n&quot;As catchy and compelling as a great pop single, this revisionist retelling is provocative, profound and utterly necessary... Clearly the product of years of passionate research, it's so rife with references and surprising anecdotes that it's potentially overwhelming, but Wald makes a superlative tour guide-- frank, funny and generous but judicious with his inclusions-- and his book is a beguiling, blasphemous breeze.&quot;--Philadelphia City Paper\n\n\n&quot;Elijah Wald's provocative, meticulously researched new book, How the Beatles Destroyed Rock 'n' Roll: An Alternative History of American Popular Music, turns the stock rock-and-roll narratives on their head.&quot;--Very Short List\n\n\n&quot;Brilliant and provocative... the most challenging and head-clearing history of American popular music to be published in decades.&quot;--The Buffalo News\n\n\n&quot;Wald explains musical and recording techniques and sociological phenomena in an engaging style accessible to a wide range of readers. Throughout, he makes a compelling case for why the figures most historians have disregarded or footnoted need to be considered in order to understand the totality of American popular music. This is an ideal companion to the plethora of standard histories available. Highly recommended.&quot; --Library Journal starred review\n\n\n&quot;Wald's arguments are as nuanced as his scope is wide, which makes this a fascinating and useful volume--required reading for any fan of pop music.&quot;--Memphis Flyer\n\n\n&quot;Fascinating... It's hard to imagine any American music buff coming away from this book without a fresh perspective and an overwhelming desire to seek out Paul Whiteman CDs. Highly recommended.&quot;--San Jose Mercury News\n\n\n&quot;Wald's book may be the literary equivalent of revisionist Civil War histories which tell the war through the eyes of soldiers rather than the generals, for he highlights how consumers actually heard and experienced music over the years, whether as screaming teeny-boppers watching Dick Clark's Bandstand or swing afficionados dancing to Glenn Miller at the Roseland.&quot;--HistoryWire.com\n\n\n&quot;A subtle polemic, one that is fundamentally broad-minded and seeks to educate the reader on the rich legacy and development of American popular music, the music that spawned the Beatles and from which that group departed, for better and worse.&quot;--Brooklyn Rail\n\n\n&quot;Walds eminently readable book is a scholarly, provocative and opinionated account of the history of pop music from Sousa to the Stones, from genteel parlor piano recitals to arena rock spectacles.&quot;--Kansas City Star\n\n\n&quot;A bracing, inclusive look at the dramatic transformation in the way music was produced and listened to during the 20th century... One of those rare books that aims to upend received wisdom and actually succeeds.&quot;--Kirkus Reviews\n\n\n&quot;Some of the smartest historiography I've ever read. The examples and turns of phrase sometimes make me laugh out loud, and nearly every page overturns another outmoded assumption. Wald just calls it like he sees it and transforms everything as a result.&quot;--Susan McClary, MacArthur Fellow and author of Feminine Endings: Music, Gender, and Sexuality\n\n\n&quot;This is a ground-breaking book, a muscular revisionist account that will get people thinking quite differently about the history of pop music. I've learned much from it and admire the writing style that is so light on its feet, lucid and elegant.&quot;--Bernard Gendron, author of Between Montmartre and the Mudd Club: Popular Music and the Avant Garde\n\n\n&quot;Meticulously researched.&quot;--Bookforum.com\n\n\n&quot;A fascinating and scrupulous piece of pop scholarship...Tantalizing.&quot; --Paste Magazine","torrent":{"xt":"urn:btih:70a32366e7111d8ad84b55b47a2d13b9af75e139","amp;dn":"How+the+Beatles+Destroyed+Rock+%27n%27+Roll+An+Alternative+History+o","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70a32366e7111d8ad84b55b47a2d13b9af75e139","infoHashBuffer":{"type":"Buffer","data":[112,163,35,102,231,17,29,138,216,75,85,180,122,45,19,185,175,117,225,57]},"announce":[],"urlList":[]}}