{"title":"Elly Griffiths-Dying Fall","uid":9804671,"size":228146176,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:711ef343cde389b6b765946b4bdc5b3a1ed39492&amp;dn=Elly+Griffiths-Dying+Fall+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"twocows","files":38,"time":1395439954,"description":"\nRuth Galloway is shocked when she learns that her old university friend Dan Golding has died tragically in a house fire. But the death takes on a sinister cast when Ruth receives a letter from Dan written just before he died. The letter tells of a great archaeological discovery, but Dan also says that he is scared for his life. Was Dan' s death linked to his find? The only clue is his mention of the Raven King, an ancient name for King Arthur. Then Ruth is invited to examine the bones Dan found. Ruth travels to Lancashire- the hometown of DCI Nelson- with both her eighteen-month-old daughter, Kate, and her druid friend, Cathbad, in tow. She discovers a campus living in fear of a sinister right-wing group called the White Hand. She also finds that the bones revealed a shocking fact about King Arthur- and they' ve mysteriously vanished. When Nelson, visiting his mother in Blackpool, learns about the case, he is drawn into the investigation, especially when Ruth and his beloved Kate seem to be in danger. Who is willing to kill to keep the bones a secret? ","torrent":{"xt":"urn:btih:711ef343cde389b6b765946b4bdc5b3a1ed39492","amp;dn":"Elly+Griffiths-Dying+Fall+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"711ef343cde389b6b765946b4bdc5b3a1ed39492","infoHashBuffer":{"type":"Buffer","data":[113,30,243,67,205,227,137,182,183,101,148,107,75,220,91,58,30,211,148,146]},"announce":[],"urlList":[]}}