{"title":"Master of Kung Fu","uid":4296792,"size":1429192420,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:714f52448e87f6d6a1bbfdcaaa54a39facfc1711&amp;dn=Master+of+Kung+Fu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"Rishab","files":116,"time":1216114837,"description":"Master of Kung Fu was an American comic book series published by Marvel Comics from 1974 to 1983. The series is alternately known as Shang-Chi: Master of Kung Fu (not to be confused with a later title of the same name) or MOKF. Beginning with issue #17, the series continued the numbering sequence from Special Marvel Edition (Shang-Chi had previously appeared there in issues #15 and #16). Written primarily by Doug Moench, Master of Kung Fu featured martial arts secret agent Shang-Chi. Although Shang-Chi was an original Marvel Comics character, many of his supporting cast members, including Fu Manchu, Fah Lo Suee, Sir Denis Nayland Smith, and Doctor Petrie, were in fact the creation of pulp crime novelist Sax Rohmer. In 1974, Marvel published four quarterly Giant-Size issues of Master of Kung Fu (as they did for many other titles). In lieu of these double-sized comics, no annual was published that year. \n\nThis feature contians Master of Kung Fu complete from issues 17 to 125, plua one Annual. Two Marvel Special edition of Shang Chi are also there (issues 15 and 16). All the 4 Giant sized issues are also included. \n\nEnjoy and Seed. ","torrent":{"xt":"urn:btih:714f52448e87f6d6a1bbfdcaaa54a39facfc1711","amp;dn":"Master+of+Kung+Fu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"714f52448e87f6d6a1bbfdcaaa54a39facfc1711","infoHashBuffer":{"type":"Buffer","data":[113,79,82,68,142,135,246,214,161,187,253,202,170,84,163,159,172,252,23,17]},"announce":[],"urlList":[]}}