{"title":"A Short History of Islam - Karen Armstrong","uid":4249685,"size":193226093,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7152e84dfc2fbcefd87d2446c77ff821fcb3aec2&amp;dn=A+Short+History+of+Islam+-+Karen+Armstrong&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rambam1776","files":-1,"time":1213950691,"description":"Islam: A Short History\nby Karen Armstrong &lt;a href=&quot;\nhttp://www.amazon.com/Islam-History-Modern-Library-Chronicles/dp/081296618X/ref=pd_bbs_sr_5?ie=UTF8&amp;s=books&amp;qid=1213942857&amp;sr=8-5&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Islam-History-Modern-Library-Chronicles/dp/081296618X/ref=pd_bbs_sr_5?ie=UTF8&amp;s=books&amp;qid=1213942857&amp;sr=8-5&lt;/a&gt;\n\nEditorial Reviews\nAmazon.com\nThe picture of Islam as a violent, backward, and insular tradition should be laid to rest, says Karen Armstrong, bestselling author of Muhammad and A History of God. Delving deep into Islamic history, Armstrong sketches the arc of a story that begins with the stirring of revelation in an Arab businessman named Muhammad. His concern with the poor who were being left behind in the blush of his society's new prosperity sets the tone for the tale of a culture that values community as a manifestation of God. Muhammad's ideas catch fire, quickly blossoming into a political empire. As the empire expands and the once fractured Arabs subdue and overtake the vast Persian domain, the story of a community becomes a panoramic drama. With great dexterity, Armstrong narrates the Sunni-Shi'ite schism, the rise of Persian influence, the clashes with Western crusaders and Mongolian conquerors, and the spiritual explorations that traced the route to God. Armstrong brings us through the debacle of European colonialism right up to the present day, putting Islamic fundamentalism into context as part of a worldwide phenomenon. Islam: A Short History, like Bruce Lawrence's Shattering the Myth and Mark Huband's Warriors of the Prophet, introduces us to a faith that beckons like a minaret to those who dare to venture beyond the headlines. --Brian Bruya --This text refers to the Paperback edition. \n\nFrom Publishers Weekly\nReaders seeking a quick but thoughtful introduction to Islam will want to peruse Armstrong's latest offering. In her hallmark stylish and accessible prose, the author of A History of God takes readers from the sixth-century days of the Prophet Muhammad to the present. Armstrong writes about the revelations Muhammad received, and explains that the Qur'an earned its name (which means recitation) because most of Muhammad's followers were illiterate and learned his teachings not from reading them but hearing them proclaimed aloud. Throughout the book, Armstrong traces what she sees as Islam's emphasis on right living (? la Judaism) over right belief (? la Christianity). Armstrong is at her most passionate when discussing Islam in the modern world. She explains antagonisms between Iraqi Muslims and Syrian Muslims, and discusses the devastating consequences of modernization on the Islamic world. Unlike Europe, which modernized gradually over centuries, the Islamic world had modernity thrust upon it in an exploitative manner. The Islamic countries, Armstrong argues, have been &quot;reduced to a dependent bloc by the European powers.&quot; Armstrong also rehearses some basics about Islamic fundamentalism in a section that will be familiar to anyone who has read her recent study, The Battle for God. A useful time line and a guide to the &quot;Key Figures in the History of Islam&quot; complete this strong, brisk survey of 1,500 years of Islamic history. (Aug.) \nCopyright 2000 Reed Business Information, Inc. --This text refers to the Paperback edition. \n","torrent":{"xt":"urn:btih:7152e84dfc2fbcefd87d2446c77ff821fcb3aec2","amp;dn":"A+Short+History+of+Islam+-+Karen+Armstrong","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7152e84dfc2fbcefd87d2446c77ff821fcb3aec2","infoHashBuffer":{"type":"Buffer","data":[113,82,232,77,252,47,188,239,216,125,36,70,199,127,248,33,252,179,174,194]},"announce":[],"urlList":[]}}