{"title":"Caribbean Cruise Ports of Call - Fodor's Travel","uid":10363469,"size":29096741,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71e6a9e2412330f65fe5682727298ccd23356fbe&amp;dn=Caribbean+Cruise+Ports+of+Call+-+Fodor%27s+Travel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1402843656,"description":"Packed with information on more than 40 ports of call and a dozen ports of embarkation, Caribbean Ports of Call ebook edition is a comprehensive guide to everything from sightseeing information and strategies to help cruisers plan their own shore excursions to some basic information on the cruise-ship experience.\n\nExpanded Coverage: New attractions and activities are covered in every port along with new lunch recommendations. Many ports of embarkation have new dining and lodging recommendations for cruisers who are embarking in different cities.\n\nIndispensable Trip Planning Tools: Every section contains a Best Bets list of activities aimed specifically at cruise passengers, in addition to a well-curated selection of sights and experiences that can be completed in a day in port. A Cruise Primer covers the basics of cruising, while Cruising the Caribbean has capsule overviews of every major cruise line.\n\nCompetitive Advantage:  Unlike other ports of call guides, Fodor's covers the entire Caribbean in one comprehensive volume, as well as a much wider variety of ports of call and ports of embarkation that are dealt with only cursorily in other similar guides.\n\nDiscerning Recommendations: Fodor's Caribbean Ports of Call offers savvy advice and recommendations from seasoned updates to help travelers make the most of their time. Fodor's Choice designates our best picks, from hotels to nightlife. &quot;Word of Mouth&quot; quotes from fellow travelers provide valuable insights.","torrent":{"xt":"urn:btih:71e6a9e2412330f65fe5682727298ccd23356fbe","amp;dn":"Caribbean+Cruise+Ports+of+Call+-+Fodor%27s+Travel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71e6a9e2412330f65fe5682727298ccd23356fbe","infoHashBuffer":{"type":"Buffer","data":[113,230,169,226,65,35,48,246,95,229,104,39,39,41,140,205,35,53,111,190]},"announce":[],"urlList":[]}}