{"title":"Anthrax - The Greater Of Two Evils [Bonus Disc] [2004] 320 ","uid":6841929,"size":216943028,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7281b2b761cc53aac0d189521c9764b1f482f466&amp;dn=Anthrax+-+The+Greater+Of+Two+Evils+%5BBonus+Disc%5D+%5B2004%5D+320+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1322197886,"description":"\n\n\nAnthrax\nThe Greater Of Two Evils (2004)\n\n\n\n\nNearly as much as Metallica or Megadeth, Anthrax were responsible for the emergence of speed and thrash metal. Combining the speed and fury of hardcore punk with the prominent guitars and vocals of heavy metal, they helped create a new subgenre of heavy metal on their early albums. Original guitarists Scott Ian and Dan Spitz were a formidable pair, spitting out lightning-fast riffs and solos that never seemed masturbatory. Unlike Metallica or Megadeth, they had the good sense to temper their often serious music with a healthy dose of humor and realism. After their first album, Fistful of Metal, singer Joey Belladonna and bassist Frank Bello joined the lineup. Belladonna helped take the band farther away from conventional metal clichÃƒÂ©s, and over the next five albums (with the exception of 1988's State of Euphoria, where the band sounded like it was in a creative straitjacket), Anthrax arguably became the leaders of speed metal. As the '80s became the '90s, they also began to increase their experiments with hip-hop, culminating in a tour with Public Enemy in 1991 and a joint re-recording of PE's classic &quot;Bring the Noise.&quot; \n\n\nFormat:\t\t\tMp3\nBitrate:\t\t320 CBR\nContains:\t\tAlbum Art &amp; ID Tags\n\n\n&quot;These are your favorite Anthrax songs from the Turbin/Belladonna era Anthrax. You voted and we listened.&quot; So writes Scott Ian in the liners to The Greater of Two Evils, Anthrax's tribute to their past, their fans, and their present tense. Message board voters built the track list, and they did well, hitting on a mix of classics and fan favorites from the group's first five albums. But Two Evils also unites the band's early creative zenith with the resurgent promise of 2003's We've Come for You All. That album wasn't a comeback, since Anthrax had never really left. But it was definitely a return to form after a few years spent casting around for direction. Hearing the 2004 lineup of Ian, John Bush, Charlie Benante, Frank Bello, and Rob Caggiano absolutely rip into cuts like &quot;Metal Thrashing Mad&quot; and &quot;Caught in a Mosh&quot; -- and have their passion matched by raw and thumping production -- combines the thrill of returning to a great old album with knowing that the band's loving it just as much as you. Bush is particularly engaged for &quot;Indians,&quot; and Caggiano's frenetic soloing to open &quot;A.I.R.&quot; is a perfect foil to the track's near-hardcore bottom end. The beginning of &quot;Madhouse&quot; sounds like magnets ripping away iron plating, and &quot;I Am the Law&quot; and &quot;Gung-Ho&quot; are still clinics on thrash. Anthrax fans are sure to love The Greater of Two Evils, especially since they picked the tracks. But what's even better about the set is how vital it makes the band itself sound. \n\n\n\n\n\nAudio-Info:\n\n\n\n\nDisc 1\n\n\n01.Deathrider\n02.Metal Thrashing Mad\n03.Caught In A Mosh\n04.A.I.R.\n05.Among The Living\n06.Keep It In The Family\n07.Indians\n08.Madhouse\n09.Panic\n10.I Am The Law\n11.Belly Of The Beast\n12.N.F.L.\n13.Be All End All\n14.Gung-Ho\n\n\nBonus Disc\n\n\n01.Anthrax\n02.Lone Justice\n03.In My World\n\n\n\n\n\n\n\n\n\n              ****Support The Artists &amp; Buy It If You Like It.****\n\n   \n                  ****Enjoy &amp; Please Don't Forget To Seed!****\n\n\n\n\n\n","torrent":{"xt":"urn:btih:7281b2b761cc53aac0d189521c9764b1f482f466","amp;dn":"Anthrax+-+The+Greater+Of+Two+Evils+%5BBonus+Disc%5D+%5B2004%5D+320+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7281b2b761cc53aac0d189521c9764b1f482f466","infoHashBuffer":{"type":"Buffer","data":[114,129,178,183,97,204,83,170,192,209,137,82,28,151,100,177,244,130,244,102]},"announce":[],"urlList":[]}}