{"title":"No Gym Needed - Quick &amp; Simple Workouts for Gals on the Go","uid":11690590,"size":1818792,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72a2b55bc8d16470d3659cb29e2e64417f4d758c&amp;dn=No+Gym+Needed+-+Quick+%26amp%3B+Simple+Workouts+for+Gals+on+the+Go&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Jallentino","files":4,"time":1423512243,"description":"Mrs Lise Cartwright, &quot;No Gym Needed - Quick &amp; Simple Workouts for Gals on the Go: Get a Toned Body in 30 Minutes or Less&quot; \nEnglish | ISBN: 1501063898 | 2014 | EPUB, MOBI | 150 pages | 1,7 MB\n\nWhen's the last time you went to the gym or exercised? And when's the last time you actually enjoyed exercise or had the time to fit it into your hectic schedule?\n\nWhether you're a busy mum, single lady with an up and coming career or full-time entrepreneur, figuring out how to fit exercising and keeping healthy into your daily routines can be hard.\n\nHow do you balance personal excuses, schedules and life in general so that you can get the body you want in the least amount of time?\n\nAnd... how do you make sure that you actually STICK to exercising... stick to workouts that help you lose weight, are less than 30 minutes and without the need for annoying weights?\n\nBoth of these things require the right knowledge and can be tricky to implement and manage within your already busy schedule.\n\nIn this hands-on, relaxed and action-packed book, Lise Cartwright explains how you can get the body you want, in 30 minutes or less, WITHOUT having to step foot in a gym or purchase expensive weights and equipment.\n\nBy using examples from her own personal experiences, she shows you how to get a toned body while also creating time to fit exercising into busy schedules.\n\nIn this how-to guide, the reader will be given:\n\n- Total Body Workouts to help you quickly achieve a toned body in 30 minutes or less\n- 30-Day Programs to help kick-start your exercise program and develop the habit\n- Lifestyle Hacks that will provide you with ways to stay fit and healthy, no matter what you do on a day-to-day basis\n\nNo Gym Needed is concisely written with your busy schedule in mind, and it teaches and shows you how to get the body you want no matter whether you're an entrepreneur, full-time mum and career women, college student, or anyone who loathes going to the gym.\n\nDon't let your busy schedule and gym loathing stop you from having the body you deserve... take action, follow the book's steps, and enjoy your new body and lease on life.\n &lt;a href=&quot;\nhttp://i.imgur.com/LCWZiGo.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/LCWZiGo.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:72a2b55bc8d16470d3659cb29e2e64417f4d758c","amp;dn":"No+Gym+Needed+-+Quick+%26amp%3B+Simple+Workouts+for+Gals+on+the+Go","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72a2b55bc8d16470d3659cb29e2e64417f4d758c","infoHashBuffer":{"type":"Buffer","data":[114,162,181,91,200,209,100,112,211,101,156,178,158,46,100,65,127,77,117,140]},"announce":[],"urlList":[]}}