{"title":"Reno 911! - Seasons 1-5 + Extras (Complete)","uid":4425027,"size":17041787343,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:72cf1cc44e5ebe2d4c67146ea80925ba7b63000e&amp;dn=Reno+911%21+-+Seasons+1-5+%2B+Extras+%28Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"BloodLogic","files":112,"time":1222982287,"description":"Reno 911! - Seasons 1-5 + Extras\n(2003-Present, Comedy Cental Show)\n\nTVRips by DOT, FOV, LMAO, FOQM, 0TV, CRiMSON, 2SD, DGAS, aAF, CRTV, aXXo, and many others who are unknown.\nAll Extras Ripped by BloodLogic\nDelivered to the Public by BloodLogic.\n\nDirectors: Michael Patrick Jann, Thomas Lennon, Brad Abrams.\nWriters: Robert Ben Garant, Kerri Kenney, Thomas Lennon.\nStarring: Cedric Yarbrough, Niecy Nash, Robert Ben Garant, Thomas Lennon, Carlos Alazraqui, Wendi McLendon-Covey, Kerri Kenney, Mary Birdsong, Nick Swardson, Jim Rash, Toby Huss, Lisa LoCicero, Kyle Dunnigan, Jack Plotnick, Cathy Shim, Kristina Hayes, David Lincoln, Nadine Ellis, Patton Oswalt, Chris Tallman, Mitch Rouse, Keegan Michael Key, Jenn Shagrin, Brian Finney, George Sharperson, Nat Faxon, Guy Stevenson, Mather Zickel, Wanru Tseng, Rachel Sterling, Mina Olivera, Paul Rudd, Jenny Robertson, Justin Castor, Ben Zook, Steve Hart, John Ross Bowie, Jamie Denbo, Andrew Daly, Rachael Harris, DeRay Davis, Katie Lohmann, Tracey Walter, Casey Pieretti, Phyllis Katz, January Welsh, Carrie Keagan, Jill-Michele Melean, Natasha Leggero, Dave Holmes, Debra Wilson, Zach Galifianakis, Jayme Rhae Edwards, Ken Marino, Floyd Van Buskirk, A.D. Miles, Gary Anthony Williams, Michael Ian Black, Steve Little, Brian Posehn, David Koechner, Oscar NuÃƒÂ±ez, Charlie Weirauch, Andrew Bowen, Patrick J. Statham, Kip King, Matt Besser, Paul Greenberg, Marissa Welsh, Greg Ellis, Marc Warzecha, Regan Burns, Joe O&amp;#039;Connor, Maile Flanagan, George Lopez, Masi Oka, Kevin Berntson, Christina DeRosa, Nicole Denise, Na Shi La, Heather DeLoach, Michael Savage, Aaron Takahashi, Randal Reeder, Eric Price, Matt Price, Gilbert Rosales, David Wain, Daniele Gaither, Gene LeBell, Paul Vogt, Joe Kessler, J.P. Manoux, Blaine Miller, Mio Takada, Heather R. Provost, Susan Yeagley, Kathryn Fiore, John F. Schaffer, Tommy DiMassimo, Patrick Gallo, Trent Gill, Dick Gregory, Simon Helberg, Nicole Randall Johnson, Phil LaMarr, Kenny Rogers, Brendon Small, Mindy Sterling, Lauren Weedman, Alex Bates, Brandon Molale, Jack Donner, Brad Abrams, Corinne Chooey, Ernie Grunwald, Jesse Heiman, Dana Powell, Magdalena Holland, Anand Vadehra.\n\nDescription: The show is a satire based on the FOX Television show COPS, which follows actual police officers through their daily duties (often chasing criminals and intervening in domestic disputes). Reno 911! features members of a fictitious Reno Sheriff&amp;#039;s Department, videotaped in the course of their duties, sometimes addressing the camera directly as though being interviewed. The show deals heavily in non-politically-correct and &amp;#039;racy&amp;#039; humor, including many jokes about race, sexual orientation, drug &amp; alcohol abuse, rape, and so on. It has been nominated for and received various awards. Only the basic plot elements of the show are scripted, with the dialog improvised, enhancing the illusion of reality (a practice referred to as retroscripting). Unlike COPS, which the show parodies, Reno 911! Sheriff&amp;#039;s deputies are constantly cursing, causing much of their dialog to be &quot;bleeped&quot; for broadcast. The actors often perform their own stunts. A constantly-changing cast of weirdos, prostitutes, homeless persons, survivalists, etc. are portrayed by comedian friends of the primary cast.\nWIKI Link: http://en.wikipedia.org/wiki/Reno_911\nIMDB Link: http://www.imdb.com/title/tt0370194/\n\nSeason 1...\n\nS01E01 - Pilot\nS01E02 - Fireworks\nS01E03 - Execution Tickets\nS01E04 - Clementine&amp;#039;s Pregnant\nS01E05 - Jones Gets Suspended\nS01E06 - Help From the FBI\nS01E07 - Wiegel Suicide Watch\nS01E08 - Clementine Gets Married\nS01E09 - Garcia&amp;#039;s Anniversary\nS01E10 - Burning Man Festival\nS01E11 - Dangle&amp;#039;s Moving Day\nS01E12 - Terrorist Training (Part 1)\nS01E13 - Terrorist Training (Part 2)\nS01E14 - Halloween\n\nSeason 2...\n\nS02E01 - Dangle&amp;#039;s Promotion\nS02E02 - Wegiel&amp;#039;s New Boyfriend\nS02E03 - British Law\nS02E04 - Dangle&amp;#039;s Ex Visits\nS02E05 - Religion in Reno\nS02E06 - Firefighters Are Jerks\nS02E07 - Not Without My Mustache\nS02E08 - Security for Kenny Rogers\nS02E09 - More FBI Help\nS02E10 - Raineesha X\nS02E11 - Clementine and Garcia Are Dating\nS02E12 - Undercover Drug Bust\nS02E13 - President Bush in Reno\nS02E14 - Accidental Marriage (Part 1)\nS02E15 - Accidental Marriage (Part 2)\nS02E16 - Investigation Concluded (Part 3)\n\nSeason 3...\n\nS03E01 - Reno S.D. In &amp; Out of Jail\nS03E02 - American Dangle\nS03E03 - Cop School\nS03E04 - SARS\nS03E05 - Eddie&amp;#039;s Getaway\nS03E06 - The Prefect of Wanganui\nS03E07 - ...And the Installation Is Free\nS03E08 - The Hot Tub King\nS03E09 - Garcia&amp;#039;s Girlfriend\nS03E10 - The Hummer\nS03E11 - Crime Scene Idiots\nS03E12 - The One That Got Away\nS03E13 - Craig&amp;#039;s Question\n\nSeason 4...\n\nS04E01 - Wiegel&amp;#039;s Pregnant\nS04E02 - The Junior Bros.\nS04E03 - Jet Ski Blues\nS04E04 - Rick&amp;#039;s On It\nS04E05 - Spanish Mike Returns\nS04E06 - Son of a Chechekevitch (Part 1)\nS04E07 - The Investigation Continues (Part 2)\nS04E08 - Miami (Unrated Edition)\nS04E09 - The Department Gets a Corporate Sponsor\nS04E10 - Christian Singles Mixer\nS04E11 - Proposition C\nS04E12 - Reno Mounties\nS04E13 - Hodgepodge\nS04E14 - Ex-Wife and Her New Husband\nS04E15 - Dangle&amp;#039;s Wedding (Part 1)\n\nSeason 5...\n\nS05E01 - Did Garcia Steal Dangle&amp;#039;s Husband (Part 2)\nS05E02 - Bounty Hunter Tommy Hawk\nS05E03 - Super Knockers!\nS05E04 - Mayor Hernandez\nS05E05 - Coconut Nut Clusters!\nS05E06 - Dangle&amp;#039;s Secret Family\nS05E07 - Undercover at Burger Cousin\nS05E08 - The Wall\nS05E09 - Death Of A Pickle-Thrower\nS05E10 - Baghdad 911\nS05E11 - The Tanning Booth Incident\nS05E12 - Strong Sister\nS05E13 - Wiegel&amp;#039;s Dad Returns\nS05E14 - Junior Runs for Office\nS05E15 - Undercover Acting Coach\nS05E16 - The Parade\n\nExtras...\n\nCop Psychology - Garcia\nCop Psychology - Jim Dangle\nCop Psychology - Junior\nCop Psychology - Trudy Wiegel\nExtras - At the Sixers Football Game\nExtras - Junior and Dangle Appearing on GetUpAndVote.Com\nInterview - Hollywood Television Interview with Aisha Tyler\nInterview - Inside Reel, Interview with the Cast\nInterview - Interview with Clementine\nInterview - Interview with Jones at the Red Carpet for Miami Movie\nInterview - LA Talk Show Interview on Movie (Part 1)\nInterview - LA Talk Show Interview on Movie (Part 2)\nInterview - Mahalo Daily Interview with Jim Dangle\nInterview - NGTV Interview with Raineesha and Wiegel\nInterview - Premiere Signing Interview With Jones and Garcia\nInterview - Q101 Interview with Dangle and Junior\nInterview - Radio Interview on 105.3 Mornings, SF, Live (Part 1)\nInterview - Radio Interview on 105.3 Mornings, SF, Live (Part 2)\nInterview - Strike Interview with Thomas Lennon and Ben Garant\nInterview - United Hollywood Live Interview with Robert Garant, Creator of Reno 911!\nInterview - Washington Post Interview With Dangle, Raineesha, and Junior\nInterview - YourNewTV Live Interview with Robert Garant, Creator of Reno 911!\nPremiere - Hollywood Press TV Coverage\nPremiere - Miami Premiere at Chinese Mann Theater\nPremiere - Red Carpet Opening\nPromos - Reno 911! Miami Trailer (with Commentary)\nPromos - Reno 911! Miami Trailer\nPromos - Season 3 Promo (German)\nPromos - Season 5 Promo-1\nPromos - Season 5 Promo-2\nStandup Comedy - Garcia (Part 1)\nStandup Comedy - Garcia (Part 2)\nStandup Comedy - Jones at Emporia ESU (Part 1)\nStandup Comedy - Jones at Emporia ESU (Part 2)\nStandup Comedy - Jones at Emporia ESU (Part 3)\nStandup Comedy - Messing With My Friend, Terry, at Towson University\n\n[Episode Guide included.]\n\n[BloodLogic Note: Long ago, I uploaded a torrent of this show, seasons 1-3, but then I didn&amp;#039;t realize that the audio and video were out of sync for the third season. Since then, I took the episodes, fixed them with YAAI (&amp;#039;Yet Another AVI Info&amp;#039;), and now they&amp;#039;re perfectly synced. That was a good ten or eleven hours well-spent. Also, enjoy the extensive extras, and a bunch of stuff that you wouldn&amp;#039;t find on an official DVD release, like interviews with the creators and actors during the writers&amp;#039; strike. Of course the capitalist class doesn&amp;#039;t want you to see the people you watch and love unionizing and toppling corporate power -- that would give you ideas. By means of the strike, they gave the themselves, the laborers, a greater share of the wealth that they are personally responsible for creating. If they can do it, you can do it, I can do it, we can all do it. The profit of an entrepreneur, no matter how much, is still a theft of the working class. The capitalists are awarded their extravagant and limitless wealth for being idle, while the untold millions are in poverty for laboring in harsh and difficult conditions. That&amp;#039;s why I definitely included the strike interviews here. Now look at your social situation, analyze and think about it, and then act. Strike! Strike! Strike! And enjoy your free videos!]\n\nThis torrent is a part of Operation: Massive Information Leak, Wave Two.\nBloodLogic","torrent":{"xt":"urn:btih:72cf1cc44e5ebe2d4c67146ea80925ba7b63000e","amp;dn":"Reno+911%21+-+Seasons+1-5+%2B+Extras+%28Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72cf1cc44e5ebe2d4c67146ea80925ba7b63000e","infoHashBuffer":{"type":"Buffer","data":[114,207,28,196,78,94,190,45,76,103,20,110,168,9,37,186,123,99,0,14]},"announce":[],"urlList":[]}}