{"title":"The Mammoth Book of New Jules Verne Adventures (gnv64)","uid":9735298,"size":13188833,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:736b96e49878b74312580d3472ea6b7a83c69141&amp;dn=The+Mammoth+Book+of+New+Jules+Verne+Adventures+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"gnv65","files":-1,"time":1394433360,"description":"The Mammoth Book of New Jules Verne Adventures\nReturn to the Center of the Earth and Other Extraordinary Voyages, New Tales by the Heirs of Jules Verne\nEdited by Mike Ashley and Eric Brown\nRunning Press | February 2005 | ISBN-10: 0786714956 | PDF | xiii+498 pages | 12.5 mb\nscanned to PDF by me.\n\nJules Verne, one of the founding fathers of science fiction, was the author of such thrilling and perennial favorites as Around the World in Eighty Days, Journey to the Center of the Earth, and Twenty Thousand Leagues Under the Sea, as well as more than sixty other novels of adventure and exploration. One hundred years after his death, this magnificent new collection celebrates Verne's amazing vision. A host of today's top science fiction authors pay homage to Verne's genius with a series of stories inspired by his groundbreaking imagination and original characters. In this anthology are extraordinary voyages of discovery and adventure from the four corners of the globe, and even within it. Following the tradition of Verne's original tales, Ian Watson tells of a journey deep into the center of the Earth, where Verne himself does battle with occultist Nazis, and Adam Roberts takes us to latter-day California, where a descendant of Verne's character Hector Servadac is preparing for the end of the world as we know it. These and many more compelling adventures add up to an anthology that will introduce a new generation to the wonder of Jules Verne and delight readers already familiar with the master.\n\nCONTENTS\nCopyright and Acknowledgments vii\nIntroduction: Return to the Centre of the Earth ix\nA Drama on the Railway, Stephen Baxter 1\nJehan Thun's Quest, Brian Stableford 15\nSix Weeks in a Balloon, Eric Brown 48\nLondres au XXIe Siecle, James Lovegrove 59\nGiant Dwarfs, Ian Watson 74 Cliff Rhodes and The Most Important Journey,\nPeter Croivther 99 The True Story of Barbicane's Voyage,\nLaurent Genefort 144\nColumbiad, Stephen Baxter 169\nTableaux, F. Gwynplaine Maclntyre 184\nThe Secret of the Nautilus, Michael Mallory 209\nDoctor Bull's Intervention, Keith Brooke 230\nThe Very First Affair, Johan Heliot 257 Eighty Letters, Plus One, Kevin J. Anderson &amp;\nSarah A. Hoyt 278\nThe Adventurers' League, Justina Robson 291\nHector Servadac, fils, Adam Roberts 315\nThe Mysterious Iowans, Paul Di Filippo 344\nOld Light, Tim Lebbon 366\nThe Selene Gardening Society, Molly Brown 383\nA Matter of Mathematics, Tony BaUantyne 402\nThe Secret of the Sahara, Richard A. Lupqff 424\nThe Golden Quest, Sharan Newman 454\nThe True Story of Wilhelm Storitz, Michel Pagel 467\nThe Shoal, Liz WiUiams 481\nContributors 491","torrent":{"xt":"urn:btih:736b96e49878b74312580d3472ea6b7a83c69141","amp;dn":"The+Mammoth+Book+of+New+Jules+Verne+Adventures+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"736b96e49878b74312580d3472ea6b7a83c69141","infoHashBuffer":{"type":"Buffer","data":[115,107,150,228,152,120,183,67,18,88,13,52,114,234,107,122,131,198,145,65]},"announce":[],"urlList":[]}}