{"title":"I Am That - Talk with Sri Nisargadatta Maharaj","uid":3958154,"size":1664711,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73a1fd4ec374993cb36036dbce3f6d93c311be4f&amp;dn=I+Am+That+-+Talk+with+Sri+Nisargadatta+Maharaj&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"-blurp-","files":1,"time":1199290535,"description":"This collection of the timeless teachings of one of the greatest sages of India, Sri Nisargadatta Maharaj, regarded by many as a &quot;modern spiritual classic&quot; is a testament to the uniqueness of the seer&amp;#039;s life and work.\n\n&quot;I Am That&quot; preserves Maharaj&amp;#039;s dialogues with the followers who came from around the world seeking his guidance in destroying false identities. The sage&amp;#039;s sole concern was with human suffering and the ending of suffering. It was his mission to guide the individual to an understanding of his true nature and the timelessness of being. He taught that mind must recognize and penetrate its own state of being, &quot;being this or that, here or that, then or now,&quot; but just timeless being.\n\nAbout the Author\nA simple man, Nisargadatta Maharaj, was a householder and petty shopkeeper in Bombay where he lived, and died in 1981 at the age of 84. He had not been educated formally, but came to be respected and loved for his insights into the crux of human pain and the extraordinary usidity of his direct discourse. Hundreds of diverse seekers traveled the globe and sought him out in his unpretentious home to hear him. To all of them he gave hope that &quot;beyond the real experience is not the mind, but the self, the light in which everything appears...the awareness in which everything happens.&quot; ","torrent":{"xt":"urn:btih:73a1fd4ec374993cb36036dbce3f6d93c311be4f","amp;dn":"I+Am+That+-+Talk+with+Sri+Nisargadatta+Maharaj","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73a1fd4ec374993cb36036dbce3f6d93c311be4f","infoHashBuffer":{"type":"Buffer","data":[115,161,253,78,195,116,153,60,179,96,54,219,206,63,109,147,195,17,190,79]},"announce":[],"urlList":[]}}