{"title":"Cossacks Anthology [GoG]","uid":8392602,"size":1060785529,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:74079bc9568256b9b83a31640532a29669925d46&amp;dn=Cossacks+Anthology+%5BGoG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GOG-Upp","files":23,"time":1366479269,"description":" &lt;a href=&quot;http://www.gog.com/en/gamecard/cossacks_anthology&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.gog.com/en/gamecard/cossacks_anthology&lt;/a&gt;\n\n\nWhat's cool about it:\nCossacks Anthology includes: Cossacks: European Wars, Cossacks: The Art of War, and Cossacks: Back to War.\nHistorically accurate campaigns and realistically recreated battles where you can manage up to 8,000 units on the field at once.\nIncludes features such as: mission editor, random map generator, and various multiplayer modes.\n\nOverview:\nThe Cossacks series are a bestseller of the real-time strategy game genre that sold over 4 million copies worldwide. Winners of the PC Zone - Award for Excellence, and they are an unquestionable gem in the genre. This pack includes the original Cossacks and its two expansions in which the developers really took the feedback from the fans into consideration, and through that they managed to improve the game even further. The result is an almost perfect, and quite realistic, strategy game in which you can write your own version of post-Renaissance European history.\n\nWhat makes Cossacks shine among other RTS games is its depth and lasting appeal. With 20 unique nations (each with its own set of perks), 200 missions, sophisticated economic and political systems, and a polished multiplayer mode, it offers countless hours of top-notch strategy gaming. There are only a few games like it and none of them match the perfect balance between realism and simplicity that made the Cossacks series so great. ","torrent":{"xt":"urn:btih:74079bc9568256b9b83a31640532a29669925d46","amp;dn":"Cossacks+Anthology+%5BGoG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74079bc9568256b9b83a31640532a29669925d46","infoHashBuffer":{"type":"Buffer","data":[116,7,155,201,86,130,86,185,184,58,49,100,5,50,162,150,105,146,93,70]},"announce":[],"urlList":[]}}