{"title":"Radio 2 Comedy Season - Being Here The Peter Sellers Story - Aud","uid":5719705,"size":54039241,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:747c366d8b3be9aafc2ae6398b491b7021957873&amp;dn=Radio+2+Comedy+Season+-+Being+Here+The+Peter+Sellers+Story+-+Aud&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"_Slimoo_","files":1,"time":1280242605,"description":"Being Here: The Peter Sellers Story - Audio Comedy - BBC Radio 2 \n1 x 60 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\n\n30 years after his death, Alexander Armstrong profiles the life and times of a man who brought laughter to millions. This documentary explores how a one time drummer and banjo player from Southsea become the toast of Hollywood and one of Britain's greatest ever comedy exports.\n\nHe became famous for his vocal skills in The Goons as well as his chameleon-like ability to adopt many different personas. He was a Goon, Inspector Clouseau, Dr Strangelove - but there was much more to Peter Sellers than these comic creations. This documentary looks at the films, but also the other radio work, the chart success [with multi-selling comedy LPs], and Sellers' life off-stage.\n\nSellers features extensively in the programme, via the BBC's archives, while friends like Eric Sykes, Denis Norden and writer John Antrobus are on hand to make sense of this comedic genius. Actress Liz Fraser talks about his early film days whilst Simon Williams and Valerie Leon reflect on the latter ones. Sir Michael Parkinson also recalls his memorable interview with Sellers.\n\nTo those who knew him, Peter could be difficult at times, but many of the friends he made stayed with him throughout his life. To those of us who grew up watching him on the big screen or listening to him on the radio, the name Peter Sellers meant only one thing - laughter - and that laughter lives on through this programme.\n\nThe voice of Peter Sellers is used with permission of the Lynne Unger Children's Trust.\n\n\nBeing Here: The Peter Sellers Story\n\n\n\nAudio Format    : MP3\nDuration        : 54mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n[","torrent":{"xt":"urn:btih:747c366d8b3be9aafc2ae6398b491b7021957873","amp;dn":"Radio+2+Comedy+Season+-+Being+Here+The+Peter+Sellers+Story+-+Aud","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"747c366d8b3be9aafc2ae6398b491b7021957873","infoHashBuffer":{"type":"Buffer","data":[116,124,54,109,139,59,233,170,252,42,230,57,139,73,27,112,33,149,120,115]},"announce":[],"urlList":[]}}