{"title":"Duplex Stainless Steels","uid":15551835,"size":42999944,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:74b49451bbaa5df23cff4960c2c475a3e9694a4a&amp;dn=Duplex+Stainless+Steels&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1471032937,"description":"Duplex Stainless Steels - Iris Alvarez-Armas, Suzanne Degallaix-Moreuil (Wiley-ISTE, 2009).pdf\r\n\r\nDuplex Stainless Steels (DSSs) are chromium-nickel-molybdenum-iron alloys that are usually in proportions optimized for equalizing the volume fractions of austenite and ferrite. Due to their ferritic-austenitic microstructure, they possess a higher mechanical strength and a better corrosion resistance than standard austenitic steels. This type of steel is now increasing its application and market field due to its very good properties and relatively low cost.\r\nThis book is a review of the most recent progress achieved in the last 10 years on microstructure, corrosion resistance and mechanical strength properties, as well as applications, due to the development of new grades. Special attention will be given to fatigue and fracture behavior and to proposed models to account for mechanical behavior. Each subject will be developed in chapters written by experts recognized around the international industrial and scientific communities.\r\n\r\nThe use of duplex stainless steels has grown rapidly in the last 10 years, particularly in the oil and gas industry, chemical tankers, pulp and paper as well as the chemical industry. In all these examples, topics like welding, corrosion resistance and mechanical strength properties (mainly in the fatigue domain) are crucial. Therefore, the update of welding and corrosion properties and the introduction of topics like texture effects, fatigue and fracture strength properties, and mechanical behavior modeling give this book specific focus and character","torrent":{"xt":"urn:btih:74b49451bbaa5df23cff4960c2c475a3e9694a4a","amp;dn":"Duplex+Stainless+Steels","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74b49451bbaa5df23cff4960c2c475a3e9694a4a","infoHashBuffer":{"type":"Buffer","data":[116,180,148,81,187,170,93,242,60,255,73,96,194,196,117,163,233,105,74,74]},"announce":[],"urlList":[]}}