{"title":"Alix Lambert's The Mark Of Cain (2000)","uid":4629364,"size":576729135,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7643c8b9017e1d07f7d475b376d098880fab8f75&amp;dn=Alix+Lambert%5C%27s+The+Mark+Of+Cain+%282000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"Majikos","files":2,"time":1231334018,"description":"The Mark of CaÃƒÂ¯n (2000) is an exploration of life in The Zone, a term for the prison system in Samara, Russia. Through interviews with inmates, family members and prison officials, Lambert paints a grim picture, and focuses on the tradition of tattooing to do so.Life in any prison is tough, but the conditions depicted by Lambert are barely fathomable. Cells are so overcrowded that inmates must agree on who will stand and who will sleep. Lambert does a great job of imparting to us the importance of The Thieves Tradition of the caste system, without which arbitrary clashes would surely take a toll. From the Downcasts to the Godfather-esque Thieves-in-the-Law, inmate skins boast markings that measure a man's provenance - a second passport stamped with crimes committed and sentences served. The quality of the artwork is surprising, considering that the tattooing must be completed covertly with nothing more than a customized electric razor.The ageing generation of inmates offers observations that are cross-cultural. They frown upon the newer generation of inmates buying, rather than earning, the ink intended draw the required respect.The Mark of CaÃƒÂ¯n stamps an honour and order to an otherwise caged chaos.\n\n(Russian with English subtitles)","torrent":{"xt":"urn:btih:7643c8b9017e1d07f7d475b376d098880fab8f75","amp;dn":"Alix+Lambert%5C%27s+The+Mark+Of+Cain+%282000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7643c8b9017e1d07f7d475b376d098880fab8f75","infoHashBuffer":{"type":"Buffer","data":[118,67,200,185,1,126,29,7,247,212,117,179,118,208,152,136,15,171,143,117]},"announce":[],"urlList":[]}}