{"title":"Jagged Alliance 2 1.13 build 4870","uid":7630457,"size":709067883,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:76dc7ab835eeacb6ab0dc20aab351d2e3ff33874&amp;dn=Jagged+Alliance+2+1.13+build+4870&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TacticalBro","files":1,"time":1347520448,"description":"This is a Jagged Alliance 2 pack with the current stable build (incl. hotfixes) of 1.13 mod pre-installed so you can just install and play.\n\nNot recommended if you are new to Jagged Alliance 2 as it complicates things on top of an already complex game. Play vanilla game first.\n\nIf you are new only to 1.13 however here's a quick rundown of some of its features:\n\n- New chance-to-hit system. Completely replaces and rebalances the original JA2's gun combat. Sniper rifles are no longer the ultimate weapon of doom at all ranges. Having a pistol or SMG as a backup weapon for merc is now a lot more important.\n\n- 100 AP system instead of 25 AP. Price for actions however is also increased proportionally. However actions are much more precise now. Like you may take one more step during your turn after firing with those 2 additional APs.\n\n- ~700 new guns. Also tons of new attachments and mods for them. As well as new types of ammunition.\n\n- Suppression fire forcing soldiers to lose APs and crouch/go prone losing even more APs. That means having an LMG with you during a big battle can be the difference between winning and losing.\n\n- New inventory system. Mercs can now wear various gear and backpacks to provide more space for magazines/tools etc.\n\nAnd much much more.\n\n\nCheck 'Docs' folder after installation for manuals and also reach 'Quick tips.txt' for quick info on NCTH system.","torrent":{"xt":"urn:btih:76dc7ab835eeacb6ab0dc20aab351d2e3ff33874","amp;dn":"Jagged+Alliance+2+1.13+build+4870","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76dc7ab835eeacb6ab0dc20aab351d2e3ff33874","infoHashBuffer":{"type":"Buffer","data":[118,220,122,184,53,238,172,182,171,13,194,10,171,53,29,46,63,243,56,116]},"announce":[],"urlList":[]}}