{"title":"2015 Songwriter's Market [Epub &amp; Mobi] [StormRG]","uid":11423560,"size":8373946,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7725b99ca679e7da97d6e52a885ca938a316236f&amp;dn=2015+Songwriter%27s+Market+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"krystine","files":-1,"time":1415639814,"description":"2015 Songwriter's Market: Where &amp; How to Market Your Songs\nAuthor: James Duncan\nPublished: 2014\nPublisher: Writer's Digest Books\nISBN: 9781599638423\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! \n\n\nCover from actual book file\n\n\nThe most trusted guide to songwriting success!\n\nThere is a home out there for every song you've written, but in order to place those songs and advance your music career you must arm yourself with steadfast determination, unending passion, and the most accurate music business knowledge available. For more than 38 years, Songwriter's Market has provided songwriters and performing artists with the most complete and up-to-date information needed to place songs with music publishers, find record companies and producers, obtain representation with managers, and more. This comprehensive guide gives you the tools and first-hand knowledge you need to launch your songwriting career right now!\n\nIn the 2015 edition, you'll also gain access to:\n\nA new foreword by hit songwriter and best-selling author Jason Blume\nNew interviews with music publishers, Grammy Award-winning producers, and major music industry leaders\nArticles about how to create and mix a professional demo at home, how to get the most out of music conferences, and much more\nHundreds of songwriting placement opportunities\nListings for songwriting organizations, conferences, workshops, retreats, colonies, contests, venues, and grant sources (helpful for indie artists looking to record and tour on their own)\n*Includes access to the webinar &quot;Song Seeds: How to Jump-start Your Songwriting Process&quot; from author and Berklee College of Music professor Mark Simos","torrent":{"xt":"urn:btih:7725b99ca679e7da97d6e52a885ca938a316236f","amp;dn":"2015+Songwriter%27s+Market+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7725b99ca679e7da97d6e52a885ca938a316236f","infoHashBuffer":{"type":"Buffer","data":[119,37,185,156,166,121,231,218,151,214,229,42,136,92,169,56,163,22,35,111]},"announce":[],"urlList":[]}}