{"title":"Beirute - Gulag Orkestar","uid":4323737,"size":55325934,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:77aa2b648dd08546d144fd9627fcfafb5e38333d&amp;dn=Beirute+-+Gulag+Orkestar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"JackErr","files":12,"time":1217632848,"description":"Beirut - Gulag Orkestar (2006)\n\nBiography by Stewart Mason\n\nOne of 2006&amp;#039;s most unexpected indie success stories, Beirut combines a wide variety of styles, from pre-rock pop music and Eastern European gypsy styles to the alternately plaintive and whimsical indie folk of the Decemberists and the lo-fi, homemade psychedelic experimentation of Neutral Milk Hotel. That the central figure in all of this is a teenager from Albuquerque, NM, makes Beirut&amp;#039;s debut album, Gulag Orkestar, all the more surprising.\n\nSomething of a musical prodigy, singer and multi-instrumentalist Zach Condon was making one-man D.I.Y. bedroom recordings by his early teens; in interviews, he claims to have recorded an entire album of 1950s-style doo wop material and a collection of electronic pop songs inspired by the Magnetic Fields. (Indeed, Condon&amp;#039;s dolorous vocal delivery and low, somewhat shaky pitch sound directly inspired by the Fields&amp;#039; Stephin Merritt.) After dropping out of high school, Condon claims to have traveled through Europe at the age of 16, in the process becoming exposed to the Balkan folk and gypsy music that&amp;#039;s at the heart of Gulag Orkestar. Back home in Albuquerque, Condon crossed paths with fellow New Mexican Jeremy Barnes, formerly of Neutral Milk Hotel, whose own albums as A Hawk and a Hacksaw share similarly ethnographic interests with Condon&amp;#039;s new material. With the help of Barnes and his A Hawk and a Hacksaw partner, Heather Trost, Condon recorded the songs that would make up Gulag Orkestar largely on his own, playing accordion, keyboards, saxophone, clarinet, mandolin, ukulele, horns, glockenspiel, and percussion along with Barnes&amp;#039; drums and Trost&amp;#039;s cello and violin.\n\nAfter Barnes gave an early version of the album to Ba Da Bing! Records label head Ben Goldberg, the newly christened band Beirut was signed to the New Jersey-based label and Condon moved from Albuquerque to Brooklyn, where he put together a floating collective of part-time bandmembers along the lines of Broken Social Scene for live performances. Following the release of Gulag Orkestar in May 2006, critical approbation quickly moved from the smallest blogs to mainstream media outlets that pegged Condon as a one-man cross between Jeff Mangum, Conor Oberst, and Sufjan Stevens.\n\n01 Gulag Orkestar\n02 Prenzlaurberg\n03 Brandenburg\n04 Postcards From italy\n05 Mount Wroclai (Idle Days)\n06 Rhineland (Heartland)\n07 Scenic World\n08 Bratislava\n09 The Bunker\n10 The Canals of Our City\n11 After the Curtain\n\n192 kbps - Cd-rip - mp3","torrent":{"xt":"urn:btih:77aa2b648dd08546d144fd9627fcfafb5e38333d","amp;dn":"Beirute+-+Gulag+Orkestar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77aa2b648dd08546d144fd9627fcfafb5e38333d","infoHashBuffer":{"type":"Buffer","data":[119,170,43,100,141,208,133,70,209,68,253,150,39,252,250,251,94,56,51,61]},"announce":[],"urlList":[]}}