{"title":"Advances in Autonomous Mini Robots","uid":9724551,"size":14879497,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77c5e44e0ea1225a65bb7f334f78b6194a35a8f2&amp;dn=Advances+in+Autonomous+Mini+Robots&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"xXGalaxyXx","files":-1,"time":1394239686,"description":"English | ISBN: 3642274811 | 2012 | 296 pages | PDF | 14 MB\n\nAutonomous robots must carry out useful tasks all by themselves relying entirely on their own perceptions of their environment. The cognitive abilities required for autonomous action are largely independent of robot size, which makes mini robots attractive as artefacts for research, education and entertainment. Autonomous mini robots must be small enough for experimentation on a desktop or a small laboratory. They must be easy to carry and safe for interaction with humans. They must not be expensive. Mini robot designers have to work at the leading edge of technology so that their creations can carry out purposeful autonomic action under these constraints. Since 2001 researchers have met every two years for an international symposium to report on the advances achieved in Autonomous Mini Robots for Research and Edutainment (AMiRE). The AMiRE Symposium is a single track conference that offers ample opportunities for discussion and exchange of ideas. This volume contains the contributed papers of the 2011 AMiRE Symposium held from 23 to 25 May 2011 at Bielefeld University, Germany. The contributions in this volume represent the state-of-the-art of autonomous mini robots; they demonstrate what is currently technically feasible and show some of the applications for autonomous mini robots.","torrent":{"xt":"urn:btih:77c5e44e0ea1225a65bb7f334f78b6194a35a8f2","amp;dn":"Advances+in+Autonomous+Mini+Robots","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77c5e44e0ea1225a65bb7f334f78b6194a35a8f2","infoHashBuffer":{"type":"Buffer","data":[119,197,228,78,14,161,34,90,101,187,127,51,79,120,182,25,74,53,168,242]},"announce":[],"urlList":[]}}