{"title":"Case Files - Internal Medicine, 3rd ed. 2009","uid":7975534,"size":7883491,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7898c95617e7df778d897bf623f7ea9418468cf8&amp;dn=Case+Files+-+Internal+Medicine%2C+3rd+ed.+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"shafi3803","files":-1,"time":1356972928,"description":"Case Files Internal Medicine\n\nGeneral Information\nPublication Date: July 14, 2009 \n ISBN-10: 0071613641 \nISBN-13: 978-0071613644 \nEdition: 3\nReal-Life Cases for the Internal Medicine Clerkship and the USMLE Step 3\n\nBook Description\n&quot;...an excellent internal medicine review book written especially or medical students in their clinical years. It is perfect for clerkships, sub-internships, shelf, and USMLE exams. Sized to fit in the pocket of a white coat for easy portability, this book offers an engaging and high-yield re-view of internal medicine. It promotes active learning, using patient presentations and thought-provoking questions to encourage deeper thinking about clinical problems. The format will be comfortable for anyone who has spent time on the wards learning from patients and engaging in problem-based learning....This book is highly recommended to supplement internal medicine clerkships and sub-internships and to prepare for shelf and USMLE exams.&quot;--Yale Journal of Biology &amp; Medicine\n\nYou need exposure to high-yield cases to excel on the Internal Medicine clerkship and the shelf-exam. Case Files: Internal Medicine presents 60 real-life cases that illustrate essential concepts in Internal Medicine. Each case includes a complete discussion, clinical pearls, references, definitions of key terms, and USMLE-style review questions. With this system, you'll learn in the context of real patients, rather than merely memorize facts.\n\n60 clinical cases, each with USMLE-style questions\nClinical pearls highlight key concepts\nPrimer on how to approach clinical problems and think like a doctor\nProven learning system improves your shelf-exam scores","torrent":{"xt":"urn:btih:7898c95617e7df778d897bf623f7ea9418468cf8","amp;dn":"Case+Files+-+Internal+Medicine%2C+3rd+ed.+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7898c95617e7df778d897bf623f7ea9418468cf8","infoHashBuffer":{"type":"Buffer","data":[120,152,201,86,23,231,223,119,141,137,123,246,35,247,234,148,24,70,140,248]},"announce":[],"urlList":[]}}