{"title":"Warren Haynes Presents: The Benefit Concert Vol. 1 [320k MP3]","uid":5294154,"size":440861220,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7913a4048ad767507ab1e1ab22ee86d686bdc258&amp;dn=Warren+Haynes+Presents%3A+The+Benefit+Concert+Vol.+1+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"smbdownload","files":-1,"time":1264001616,"description":"&quot;Warren Haynes Presents: The Benefit Concert Vol. 1&quot; is now available from Evil Teen Records. This was originally recorded at the 11th Annual X-Mas Jam in Asheville, NC in December of 1999, and was originally released under the title of Wintertime Blues. This re-issue comes stocked with TWO brand new mixed and mastered tracks from Gov't Mule's electrifying set that have never been heard before. This was the Mule's last X-Mas Jam with original bass player Allen Woody.\n\n&quot;Warren Haynes Presents: The Benefit Concert Vol. 1&quot; [320k MP3]\n\nDisc 1:\n\n01. Beautiful Life - Edwin McCain\n02. Alive - Edwin McCain w/Warren Haynes\n03. I'll Be - Edwin McCain w/Warren Haynes\n04. Rastaman Chant - Derek Trucks Band (Derek Trucks, Todd Smallie, Yonrico Scott, Kofi Burbridge)\n05. Chicken Strut - Derek Trucks Band (Derek Trucks, Todd Smallie, Yonrico Scott, Kofi Burbridge)\n06. 555 Lake - Derek Trucks Band (Derek Trucks, Todd Smallie, Yonrico Scott, Kofi Burbridge) w/Jimmy Herring\n07. Yield Not To Temptation - Derek Trucks Band (Derek Trucks, Todd Smallie, Yonrico Scott, Kofi Burbridge) w/Col. Bruce Hampton &amp; Jimmy Herring\n08. Ain't That Loving You - Derek Trucks Band (Derek Trucks, Todd Smallie, Yonrico Scott, Kofi Burbridge) w/Larry McCray &amp; Jimmy Herring\n09. Don't Change Horses (In The Middle Of A Stream) - Derek Trucks Band (Derek Trucks, Todd Smallie, Yonrico Scott, Kofi Burbridge) w/Edwin McCain &amp; Jimmy Herring\n10. Just Won't Burn - Derek Trucks Band (Derek Trucks, Todd Smallie, Yonrico Scott, Kofi Burbridge) w/Susan Tedeschi\n\nDisc 2:\n\n01. Angel From Montgomery - Susan Tedeschi\n02. Pretty As You Please - Cry Of Love (Audley Freed, Jason Patterson, Robert Kearns, Kelly Holland)\n03. Peace Pipe - Cry Of Love (Audley Freed, Jason Patterson, Robert Kearns, Kelly Holland)\n04. Mule - Gov't Mule (Warren Haynes, Allen Woody, Matt Abts)\n05. Bad Little Doggie - Gov't Mule (Warren Haynes, Allen Woody, Matt Abts)\n06. Lay Your Burden Down - Gov't Mule (Warren Haynes, Allen Woody, Matt Abts) w/Johnny Neel\n07. Fallen Down - Gov't Mule (Warren Haynes, Allen Woody, Matt Abts) w/Johnny Neel\n08. Devil Likes It Slow - Gov't Mule (Warren Haynes, Allen Woody, Matt Abts) w/Johnny Neel &amp; Jimmy Herring\n09. Spoonful - Gov't Mule (Warren Haynes, Allen Woody, Matt Abts) w/Col. Bruce Hampton, Johnny Neel &amp; Mike Barnes\n10. When The Blues Come Knockin' - Gov't Mule (Warren Haynes, Allen Woody, Matt Abts) w/Little Milton &amp; Johnny Neel\n11. It Hurts Me Too - Gov't Mule (Warren Haynes, Allen Woody, Matt Abts) w/Little Milton, Johnny Neel, Yonrico Scott, Derek Trucks and Susan Tedeschi\n12. Merry Christmas Baby [from Wintertime Blues]\n\nBONUS DISC\n\n01. It Hurts Me Too\n02. Rock-a-bye Baby\n03. Born To Be No Good\n04. Good Morning Little Schoolgirl\n05. You Don't Know\n","torrent":{"xt":"urn:btih:7913a4048ad767507ab1e1ab22ee86d686bdc258","amp;dn":"Warren+Haynes+Presents%3A+The+Benefit+Concert+Vol.+1+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7913a4048ad767507ab1e1ab22ee86d686bdc258","infoHashBuffer":{"type":"Buffer","data":[121,19,164,4,138,215,103,80,122,177,225,171,34,238,134,214,134,189,194,88]},"announce":[],"urlList":[]}}