{"title":"Kidnapped by the Taliban A Story of Terror, Hope, and Rescue by ","uid":11371943,"size":5290191,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:79384be93c17dfcde32065c77dc564e7ae0abde5&amp;dn=Kidnapped+by+the+Taliban+A+Story+of+Terror%2C+Hope%2C+and+Rescue+by+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415098613,"description":"&quot;Am I About to Die?&quot;\n\nOn December 5, 2012, American medical doctor Dilip Joseph and two colleagues are driving back to Kabul, Afghanistan, after serving villagers that morning at a rural clinic. Suddenly a man waving an AK-47 blocks their path. More armed men jump out of hiding. For Dilip, it is the beginning of a nightmare--he's being kidnapped by the Taliban.\n\nDilip and his friends endure a nine-hour march into the mountains, gruesome images of torture and death, and repeated threats of execution. Four days later Dilip is freed in a daring and deadly rescue that claims the life of a SEAL Team Six operator. Yet this is more than a story of desperation, survival, and loss. It is also a tale of surprising connection, compassion, and inspiration. As Dilip begins to view the Taliban not as monsters but as men, both he and his captors are challenged to reexamine everything that matters: courage, sacrifice, hope, and faith.\n\nFlap Copy:\n\nWith a jerk of his rifle, the leader points up the mountain on the left. There is no path. I look higher and see more armed men at the top of a hill about two hundred feet above us.\n\nApprehension surges up in me like black oil from a well. These aren't ordinary robbers. This is too systematic.\n\nI've been kidnapped by the Taliban.\n\nAs we walk, I fear the worst--that when we reach the top, they will shoot us. &quot;God, however this is going to end, please don't let them torture me to death. Let it be one shot and done.&quot;\n\nIt is amazing how quickly everything we take for granted can be ripped away. In the space of a few minutes, I have lost all control of my life. All I can do is take a step, draw a breath, and hope I will be given the chance for another.\n\n\n&quot;Kidnapped by the Taliban&quot; is a story of both terror and triumph. After reading this dramatic and inspiring account, you will never view Afghanistan or the Taliban in the same way again.\n\nPublisher: Thomas Nelson (7 October 2014)\nLanguage: English\nISBN-10: 0718011287\nISBN-13: 978-0718011284","torrent":{"xt":"urn:btih:79384be93c17dfcde32065c77dc564e7ae0abde5","amp;dn":"Kidnapped+by+the+Taliban+A+Story+of+Terror%2C+Hope%2C+and+Rescue+by+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79384be93c17dfcde32065c77dc564e7ae0abde5","infoHashBuffer":{"type":"Buffer","data":[121,56,75,233,60,23,223,205,227,32,101,199,125,197,100,231,174,10,189,229]},"announce":[],"urlList":[]}}