{"title":"Creedence Clearwater Revival - Proud Mary [Ed Sullivan Show, 196","uid":8908161,"size":107403264,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:79c3d7ba227dce31ab08433fcbeec25cbcad8937&amp;dn=Creedence+Clearwater+Revival+-+Proud+Mary+%5BEd+Sullivan+Show%2C+196&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1378955089,"description":"Creedence Clearwater Revival - Proud Mary [Ed Sullivan Show, 1969].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Proud Mary&quot; is a rock song written by American singer-songwriter and multi-instrumentalist John Fogerty, and recorded by his band Creedence Clearwater Revival. The song was released as a single from the band's second studio album, Bayou Country, both released by Fantasy Records in January 1969 (although another reference related to album liner notes says just before Christmas, which would imply December 1968). The song became a hit in the United States, peaking at #2 on the Billboard Hot 100 in March 1969, the first of five non-consecutive singles to peak at #2 for the group.\n\nIn the liner notes for the 2008 expanded reissue of Bayou Country, Joel Selvin explained that the songs for the album started when John Fogerty was in the National Guard, that the riffs for &quot;Proud Mary,&quot; &quot;Born on the Bayou,&quot; and &quot;Keep on Chooglin'&quot; were conceived by Fogerty at a concert in the Avalon Ballroom, and &quot;Proud Mary&quot; was arranged from parts of different songs, one of which was about a &quot;washerwoman named Mary.&quot; The line &quot;Left a good job in the city&quot; was written following John's discharge from the National Guard, and the line &quot;rollin' on the river&quot; was from a movie by Will Rogers.\n\nCreedence Clearwater Revival (sometimes shortened to Creedence or CCR) was an American rock band that gained popularity in the late 1960s and early 1970s with a number of successful singles drawn from various albums. \n\nThe band consisted of lead vocalist, lead guitarist, and primary songwriter John Fogerty, his brother and rhythm guitarist Tom Fogerty, bassist Stu Cook, and drummer Doug Clifford. Their musical style encompassed country rock and swamp rock genres. Despite their San Francisco Bay Area origins, they positioned themselves as Southern rock stylists, singing about bayous, the Mississippi River, catfish, and other popular elements of Southern iconography. \n\nCreedence Clearwater Revival's music is still a staple of American and worldwide radio airplay and often figures in various media. The band has sold 26 million albums in the United States alone. Creedence Clearwater Revival was inducted into the Rock and Roll Hall of Fame in 1993. They were ranked at 82 on Rolling Stone's list of the 100 greatest artists of all time. \n(video does not have any logos)\n\n\n     &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Proud_Mary&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Proud_Mary&lt;/a&gt; \n       &lt;a href=&quot;\nhttp://bayimg.com/kaPicAaEh&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/kaPicAaEh&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x576 (4:3) 25fps 6000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 224kbps\n   Duration: 00:02:16\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.5\n\n\n*Media Player Classic Home Cinema*   &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:79c3d7ba227dce31ab08433fcbeec25cbcad8937","amp;dn":"Creedence+Clearwater+Revival+-+Proud+Mary+%5BEd+Sullivan+Show%2C+196","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79c3d7ba227dce31ab08433fcbeec25cbcad8937","infoHashBuffer":{"type":"Buffer","data":[121,195,215,186,34,125,206,49,171,8,67,63,203,238,194,92,188,173,137,55]},"announce":[],"urlList":[]}}