{"title":"Cunt A Declaration of Independence By Inga Muscio.epub","uid":9223038,"size":1907752,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a3f97908ec63e2acd486e0eeb966ae16b7f7bdf&amp;dn=Cunt+A+Declaration+of+Independence+By+Inga+Muscio.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"420weedman","files":1,"time":1384966916,"description":"An ancient title of respect for women, the word &quot;cunt&quot; long ago veered off this noble path. Inga Muscio traces the road from honor to expletive, giving women the motivation and tools to claim &quot;cunt&quot; as a positive and powerful force in their lives. In this fully revised edition, she explores, with candidness and humor, such traditional feminist issues as birth control, sexuality, jealousy between women, and prostitution with a fresh attitude for a new generation of women. Sending out a call for every woman to be the Cuntlovin' Ruler of Her Sexual Universe, Muscio stands convention on its head by embracing all things cunt-related. This edition is fully revised with updated resources, a new foreword from sexual pioneer Betty Dodson, and a new afterword by the author.\n&quot;Bright, sharp, empowering, long-lasting, useful, sexy...&quot;San Francisco Chronicle &quot;\n...Cunt provides fertile ground for psychological growth. &quot;San Francisco Bay Guardian\n&quot;Cunt does for feminism what smoothies did for high-fiber dietsit reinvents the oft-indigestible into something sweet and delicious. &quot;Bust Magazine&quot;","torrent":{"xt":"urn:btih:7a3f97908ec63e2acd486e0eeb966ae16b7f7bdf","amp;dn":"Cunt+A+Declaration+of+Independence+By+Inga+Muscio.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a3f97908ec63e2acd486e0eeb966ae16b7f7bdf","infoHashBuffer":{"type":"Buffer","data":[122,63,151,144,142,198,62,42,205,72,110,14,235,150,106,225,107,127,123,223]},"announce":[],"urlList":[]}}