{"title":"Clips4sale - Josette Duval (Bad Medicine 3) HD","uid":12812359,"size":937096542,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:7a5ac4b79ee21a3747995e479617df59e6623e5c&amp;dn=Clips4sale+-+Josette+Duval+%28Bad+Medicine+3%29+HD+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"feeldabyte","files":1,"time":1448197841,"description":"Screens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n \nhttp://imgkiss.com/image/rxRz4 \nhttp://imgkiss.com/image/rxBNL \nhttp://imgkiss.com/image/rxN5P \nhttp://imgkiss.com/image/rxqxO \nhttp://imgkiss.com/image/rxl4W \nhttp://imgkiss.com/image/rxpPj \nhttp://imgkiss.com/image/rxUho\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\nMy son can't sleep, but he has a very important day tomorrow. Once in a while, I will give my over caffeinated son one of my sleeping pills. I know I shouldn't, and so I hurry and sneak one from the medicine cabinet. &quot;Hurry, take it and don't tell your father, there's just a few hours before you have to wake up, and this will help you sleep heavy and sound.&quot; My son takes it gratefully.\r\n\r\nI let him sleep in as long as possible before I wake him. I cheerfully tickle him awake, &quot;rise and shine young man!&quot; I see that the sun isn't the only thing that's risen, he has quite the erection in his pants. I realize that I gave him Daddy's viagra by accident. I was in such a hurry that I grabbed the wrong medicine bottle. I can NOT allow him to go to school like this. I need to fix this right away.\r\n\r\nI make him turn his head so he doesn't see the sinful thing that I do to him. I stroke him up and down, and my goodness, that cock is so hard, young, and throbbing under my hands. He's not cumming with me using my hands, and I certainly will NOT take the boy's virginity. I tell him that he is to put it in Mommy's bum instead. He cums inside of my bum, deep, but not a lot of cum.. his cock still needs to be drained. I suck him. I look my son in the eyes and practice the effective technique that I picked up in my college &quot;party girl&quot; days. He cums in my mouth. I let his cum roll around inside of my mouth, I adore the taste of him, so sweet and masculine. His cum spills out of my mouth and I wipe my chin, look down, and he is still hard as a rock. I can't deny that I am wet, my pussy is aching to feel my son inside of me. &quot;Please, please let Mommy... please fuck me...&quot; I let my instinct take over as I take him deep inside of me. He thrusts inside of me, &quot;deep, deeper!&quot; He cums inside of me, what a man he has become. Things will be a lot different in our home from now on, my son and I have a very, very special relationship. Don't judge me.\r\n\r\n\r\nSail to another one :  https://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:7a5ac4b79ee21a3747995e479617df59e6623e5c","amp;dn":"Clips4sale+-+Josette+Duval+%28Bad+Medicine+3%29+HD+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a5ac4b79ee21a3747995e479617df59e6623e5c","infoHashBuffer":{"type":"Buffer","data":[122,90,196,183,158,226,26,55,71,153,94,71,150,23,223,89,230,98,62,92]},"announce":[],"urlList":[]}}