{"title":"BLADE: I, II, III: Trinity, The Series, Marvel ANIME - 720p+480p","uid":15175797,"size":12465082774,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:7a6d801debdd099a6c084e464965c1224fe5981f&amp;dn=BLADE%3A+I%2C+II%2C+III%3A+Trinity%2C+The+Series%2C+Marvel+ANIME+-+720p%2B480p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":7,"uploader":"HardToF1nd","files":32,"time":1467419666,"description":"This COLLECTION contains the ENTIRE &quot;Blade&quot; Saga - 3 Movies (including an EXTENDED &quot;Blade 3: Trinity&quot;, the TV Series, and the ANIME Series):\r\n\r\n________________________________________________\r\n\r\n\r\nPlot Synopsis:\r\n\r\nBlade I (1998) - &quot;A half-mortal, half-immortal is out to avenge his mother's death and rid the world of vampires. The modern-day technologically advanced vampires he is going after are in search of his special blood type needed to summon an evil god who plays a key role in their plan to execute the human race.&quot;\r\n\r\nBlade II (2002) - &quot;Exploding from the pages of Marvel Comics comes the thrilling follow-up to the blockbuster &quot;Blade.&quot; Half Man ... half vampire, and consumed by a desire to avenge the curse of his birth and save the human race from a blood-drenched Armageddon. In this newest action-packed adventure, Blade (Wesley Snipes) is forced to team up with the very vampires he hates in order to overcome a new type of monster which threatens to eradicate both races.&quot;\r\n\r\nBlade III - Trinity (2004) - &quot;The war between humans and vampires continues, but the humans' best hope, human-vampire hybrid warrior Blade (Wesley Snipes), has been framed for countless murders, turning popular sentiment against him. The vampire leader responsible for Blade's bad publicity is Danica Talos (Parker Posey), who's determined to finally lead her bloodthirsty compatriots to victory. Now Blade must team up with a band of rogue vampire hunters (Ryan Reynolds, Jessica Biel) to save humanity.&quot;\r\n\r\nBlade - The TV Series - &quot;Krista Starr returns from Iraq to learn that her twin brother, Zack, has died under mysterious circumstances. Krista soon meets Blade, as well as the killer himself, Marcus Van Sciver, a powerful vampire who becomes smitten with her, turning her into a vampire by injecting her with his blood. Blade then injects her with the same serum he uses to control his own vampire instincts. Blade offers Krista a chance to help avenge her brother's death and bring down Marcus. The series is based on the comic-book character Blade and the series of movies featuring him.&quot;\r\n\r\nBlade - Marvel's ANIME Series - &quot;Legendary half-vampire, half-human vampire hunter Blade is tracking Deacon Frost, a very powerful and influential vampire who killed his mother and who heads Existence, a secretive vampire organization that operates in Southeast Asia.&quot;\r\n\r\n_____________________________\r\n\r\n\r\nName (Title): BLADE: I, II, III: Trinity, The Series, Marvel ANIME - 720p+480p (TPB)\r\n\r\nCategory Type: Movies, TV Series, Anime\r\n\r\nLength (Duration): Varies by Film, Series, Episode\r\n\r\nYear(s): 1998-2004, etc...\r\n\r\nStarring: Wesley Snipes, Stephen Dorff, Kris Kristofferson, Sanaa Lathan, Ryan Reynolds, Jessica Biel, Dominic Purcell\r\n\r\nGenre(s): Action, Thriller, Crime, Fantasy\r\n\r\nResolution: 720p (Movies), 360p (TV Series), 480p (Anime Series).\r\n\r\nRip Type (Source): BrRip and DVDRip.\r\n\r\nCodec Type: x264\r\n\r\nFormat of File(s): MP4(s) and AVI(s).\r\n\r\nAudio Format &amp; Language(s): AAC (English).\r\n\r\nSubtitles: YES (for the Blade TRILOGY, only).\r\n\r\nChapters: No.\r\n\r\nIMDB Link(s): \r\n \nhttp://www.imdb.com/title/tt0120611/\r\n \nhttp://www.imdb.com/title/tt0187738/\r\n \nhttp://www.imdb.com/title/tt0359013/\r\n \nhttp://www.imdb.com/title/tt0823333/\r\n \nhttp://www.imdb.com/title/tt1988235/","torrent":{"xt":"urn:btih:7a6d801debdd099a6c084e464965c1224fe5981f","amp;dn":"BLADE%3A+I%2C+II%2C+III%3A+Trinity%2C+The+Series%2C+Marvel+ANIME+-+720p%2B480p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a6d801debdd099a6c084e464965c1224fe5981f","infoHashBuffer":{"type":"Buffer","data":[122,109,128,29,235,221,9,154,108,8,78,70,73,101,193,34,79,229,152,31]},"announce":[],"urlList":[]}}