{"title":"Robogenesis - Wilson Daniel","uid":10347639,"size":400619,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7afa05881670d801bd2fc69d72ad36cd037b6018&amp;dn=Robogenesis+-+Wilson+Daniel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Nyctalope43","files":1,"time":1402628961,"description":"The follow-up to Robopocalypse\n\n\nThe stunningly creative, epic sequel to Wilson's blockbuster thriller and New York Times bestseller Robopocalypse\n\n &quot;The machine is still out there. Still alive.&quot;\n\n Humankind had triumphed over the machines. At the end of Robopocalypse, the modern world was largely devastated, humankind was pressed to the point of annihilation, and the earth was left in tatters . . . but the master artificial intelligence presence known as Archos had been killed.\n\n In Robogenesis, we see that Archos has survived. Spread across the far reaches of the world, the machine code has fragmented into millions of pieces, hiding and regrouping. In a series of riveting narratives, Robogenesis explores the fates of characters new and old, robotic and human, as they fight to build a new world in the wake of a devastating war. Readers will bear witness as survivors find one another, form into groups, and react to a drastically different (and deadly) technological landscape. All the while, the remnants of Archos's shattered intelligence are seeping deeper into new breeds of machines, mounting a war that will not allow for humans to win again.\n\n Daniel H. Wilson makes a triumphant return to the apocalyptic world he created, for an action-filled, raucous, very smart thrill ride about humanity and technology pushed to the tipping point.\n","torrent":{"xt":"urn:btih:7afa05881670d801bd2fc69d72ad36cd037b6018","amp;dn":"Robogenesis+-+Wilson+Daniel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7afa05881670d801bd2fc69d72ad36cd037b6018","infoHashBuffer":{"type":"Buffer","data":[122,250,5,136,22,112,216,1,189,47,198,157,114,173,54,205,3,123,96,24]},"announce":[],"urlList":[]}}