{"title":"Believer: My Forty Years in Politics - David Axelrod - Audiobook","uid":11691378,"size":549775338,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7b3898eaea45c4aca496f05d19bb6517f447509b&amp;dn=Believer%3A+My+Forty+Years+in+Politics+-+David+Axelrod+-+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Squiddy82","files":16,"time":1423555171,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nBeliever: My Forty Years in Politics\n\nWritten by: David Axelrod\nNarrated by: David Axelrod\nLength: 19 hrs and 3 mins\nUnabridged Audiobook\nRelease Date:02-10-15\n\nThe great strategist who masterminded Obama's historic election campaigns opens up about his years as a young journalist, political consultant, and ultimately senior adviser to the president\n\nThe man behind some of the greatest political changes of the last decade, David Axelrod has devoted a lifetime to questioning political certainties and daring to bring fresh thinking into the political landscape. Whether as a child hearing John F. Kennedy stump in New York or as a strategist guiding the first African American to the White House, Axelrod shows in Believer how his own life stands at the center of the tumultuous American century.\n\nBeliever begins in the inimitable world of 1960s New York, but rapidly moves west. As a young newspaperman in the Chicago of the 1970s and 1980s, Axelrod reported on the dissolution of the last of the big city political machines, along with the emergence of a black, independent movement that made Obama's ascent possible. Seeing the golden age of Chicago journalism collapse, Axelrod switched careers to become a political strategist, working for pathbreakers like Barack Obama and Hillary Clinton and morally conflicted characters like John Edwards. For better and worse, Axelrod helped to redefine the techniques by which modern political campaigns are run.\n\nThe heart of Believer is devoted to Axelrod's 20-year friendship with Obama, a warm partnership that inspired both men even as it propelled each to great heights. As senior adviser to the president, Axelrod served during one of the most challenging periods in national history and worked at Obama's side as he battled an economic disaster, navigated America through two wars, and fought to reform health care, the financial sector, and our grid-locked political institutions","torrent":{"xt":"urn:btih:7b3898eaea45c4aca496f05d19bb6517f447509b","amp;dn":"Believer%3A+My+Forty+Years+in+Politics+-+David+Axelrod+-+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b3898eaea45c4aca496f05d19bb6517f447509b","infoHashBuffer":{"type":"Buffer","data":[123,56,152,234,234,69,196,172,164,150,240,93,25,187,101,23,244,71,80,155]},"announce":[],"urlList":[]}}