{"title":"My Journey To Heaven - Marvin J. Besteman &amp; Lorilee Craker.e","uid":9730210,"size":814001,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b42457d5d03b604d5415a696ba38352008a9e00&amp;dn=My+Journey+To+Heaven+-+Marvin+J.+Besteman+%26amp%3B+Lorilee+Craker.e&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1394364726,"description":"On April 28, 2006, as he lay in his hospital bed in Ann Arbor, Michigan, visions of celestial beauty were the last thing on Marv Besteman's mind. He had just had surgery to remove a rare pancreatic tumor. It was after visiting hours and his family had left for the day. Alone and racked with pain, Marv tossed and turned, wanting more than anything else to simply sleep and escape the misery and discomfort for a while. The retired banker, father, and grandfather had no idea he was about to get a short reprieve in the form of an experience he never could have imagined.\n\nIn My Journey to Heaven, Marv Bestman shares the story of his experience of heaven with astounding detail. Readers will hear of his encounters with angels who accompanied him to the gate, his conversation (argument, really) with St. Peter, and his recognition of friends and family members who touched his life. His story offers peace, comfort, and encouragement to those who have lost loved ones and gives security and solace to those who are grieving, dying, or wonder about the afterlife. Marv believed God sent him back to earth to fulfill this mission of comfort and reminds readers that God has work for each of us to do before he calls us to be with him in heaven. Secure in his belief that his book was the fulfillment of his own mission, Marv returned to heaven in January 2012.","torrent":{"xt":"urn:btih:7b42457d5d03b604d5415a696ba38352008a9e00","amp;dn":"My+Journey+To+Heaven+-+Marvin+J.+Besteman+%26amp%3B+Lorilee+Craker.e","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b42457d5d03b604d5415a696ba38352008a9e00","infoHashBuffer":{"type":"Buffer","data":[123,66,69,125,93,3,182,4,213,65,90,105,107,163,131,82,0,138,158,0]},"announce":[],"urlList":[]}}