{"title":"Satan, Cantor, And Infinity and Other Mind-Boggling Puzzles ","uid":10392387,"size":2248605,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7bf88f936c56e61002ae3a55df8da37cc542b63d&amp;dn=Satan%2C+Cantor%2C+And+Infinity+and+Other+Mind-Boggling+Puzzles+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":1,"time":1403209722,"description":"epub 1992\n\n\n\n More than two hundred new and challenging logic puzzles--the simplest brainteaser to the most complex paradoxes in contemporary mathematical thinking--from our topmost puzzlemaster (&quot;the most entertaining logician who ever lived,&quot; Martin Gardner has called him).\n\n Our guide to the puzzles is the Sorcerer, who resides on the Island of Knights and Knaves, where knights always tell the truth and knaves always lie, and he introduces us to the amazing magic--logic--that enables to discover which inhabitants are which. Then, in a picaresque adventure in logic, he takes us to the planet Og, to the Island of Partial Silence, and to a land where metallic robots wearing strings of capital letters are noisily duplicating and dismantling themselves and others. The reader's job is to figure out how it all works.\n\n Finally, we accompany the Sorcerer on an alluring tour of Infinity which includes George Cantor's amazing mathematical insights. The tour (and the book) ends with Satan devising a diabolical puzzle for one of Cantor's prize students--who outwits him!\n\n In sum: a devilish magician's cornucopia of puzzles--a delight for every age and level of ability.\n","torrent":{"xt":"urn:btih:7bf88f936c56e61002ae3a55df8da37cc542b63d","amp;dn":"Satan%2C+Cantor%2C+And+Infinity+and+Other+Mind-Boggling+Puzzles+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bf88f936c56e61002ae3a55df8da37cc542b63d","infoHashBuffer":{"type":"Buffer","data":[123,248,143,147,108,86,230,16,2,174,58,85,223,141,163,124,197,66,182,61]},"announce":[],"urlList":[]}}