{"title":"MTCDC-NMC 47 DC from Te-Tn (joshua13","uid":6852509,"size":18775725177,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7c575f61d0835bca19703ce4b299777422b8a4a9&amp;dn=MTCDC-NMC+47+DC+from+Te-Tn+%28joshua13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":4,"uploader":"joshua13","files":-1,"time":1322579214,"description":"The More than Complete DC-Now More Completerer!\n\nThis forty-seventh alphabetical installment is: DC from Te-Tn\n\nWhat's This?\n     It's a project to upload everything that's been scanned that DC ever published or distributed, whatever name was on the cover. That's DC, Vertigo (ugghh!)Ã‚Â®, Wildstorm, Helix, Milestone, Minx, Paradox, Piranha, Tangent, America's Best Comics, Cliffhanger, CMX, Homage, Humanoids, and MC.Gaines among others.\n       Plus, for characters and titles DC picked up from other companies, as much of those &quot;Pre-DC&quot; comics as I can find. This includes many major and minor DC superheroes, war comics, romance comics and various licensed characters such as Tarzan, Star Trek, Loony Toons, Scooby-Doo etc. A few of the heros include Shazam!, Blue Beetle, Plastic Man, Gen13, The Web, The Shield, Phantom Lady, Captain Atom and many more. There may be a lot of things you didn't know started with a different company. There will some &quot;Post DC&quot; comics of characters like Fallen Angel that have moved on. But that will be arbitrarily selective on my part. Assorted related material will be included. It's going to be c.875-885gb in total. It will take as long as it takes. I've already done a 600+gb subset of this in an earlier project (MTCDC). So clearly, I'm insane, which is what you look for in a guy promising this. So here we go again, but bigger.\n\n=================================\n\nProjected remaining torrents and approximate file sizes. Several of these still have significant work needed and the size could go up or down. I'm betting on down for the last 3, though they continue to grow for now. All the cutting will occur when I sort through them after #53. Of course I also just added 1gb folder for a 200AD TPB I forgot to include in the Js. This caused a shift in the last three.\n\n17G\t48\tTo-Unk\n18G\t49\tUnl-Wes\n18G\t50\tWet-Wn\n14G\t51\tWonder Woman, Wonder Girl\n16G\t52\tWor-Wq\n14G\t53\tWr-Z\n19G\t54\tFill Torent a-c\n17G\t55\tFill Torent d-j\n17G\t56\tFill Torent k-z\n\nIt is frankly astonishing how much I  have missed, forgotten, screwed up, compromised on for space or other reasons, and just *blanked on* in this series, despite every effort to do it right this time. This is not true of course. If I had put EVERY effort into it, I would not have made those mistakes, omissions, and miss-steps. (I should have taken the escalator to avoid those). Was it the best I could do? No! The best I can do is *never good enough*, is never the ultimate effort, merely the penultimate. PEN ULTIMATE do you hear me PEN! Sounds like some lame Marvel super-hero. I should be LaserPrinter-Ultimate!, I should be 4D-Omnimedia-Solid-Projection Ultimate! The best I can do is never the best I can do! I could have devoted 24/7 to it! I could have given up everything else in my so called life! I could have abandoned my family, quit my job and holed up in a tiny cheap apartment somewhere, living off my savings, and poured over these things again and again, taking weeks if necessary to track down every last scanned issue of anything even tangentially connected to any DC publication! I could have gone out and PURCHASED some of the unscanned issues and scanned them! By &quot;gone out&quot; of course I mean &quot;ordered on the internet&quot;. Going out would be a distraction from my grossartige arbeit, my bolshaya rabota! Oh god, I'm an utter failure, I'm sorry dad, don't hit me! I'll do better! Mommy! mommy!\n\nAh hem. Guess I got a bit carried away. If I can catch all of these in the fills, perhaps I can rest easy. I don't want to be back here in a year or two attempting to torrent ever comic ever because somewhere in them they might mention bats or use the word green. (clear DC tie-ins)\n\n=================================\n\nToday's offering: DC from Te-Tn\n\nEnjoy!\n\n\nTitle in indica for below is &quot;Superman 3-D&quot;. It's here because it's commonly listed as &quot;Three-Dimensions Adventures- Superman in Startling 3-D&quot; based on the cover, even by the Phantom Stranger's DC scanned list which is usually more precise\n\nSuperman 3-D (Three-Dimensions Adventures-Superman in Startling 3-D) (1953,1997)\n\nWord of the day is &quot;thunder&quot; The world desperately needs a Thunder-Agents - Thunder Cats crossover, with special guest appearance by heroes and villains such as Storm,  Thor, Thunder (outsiders), Captain Thunder, Thunderbolt Jaxon, Blue Bolt, Johnny Thunder, Leslie Thunder, Chocolate Thunder (yes really - I did not make this up), Black Lightning, Thunderbolt, Lighting Man, Lightning Lord, Lightning Lad, Lightning Lass, Lightning Girl, Lightning Woman, Lightning Squirrel (again, really) Lash Lightning, Storm Shadow and Dragonstorm.\n\nOf course it should be a time traveling cross dimensional adventure so they they can fight both the WWII Germans with their Blitzkrieg tactics and of course, the Star Wars storm troopers.\n\n\nT.H.U.N.D.E.R. Agents\nBlue Ribbon Comics v2 012-T.H.U.N.D.E.R. Agents\nOmni Comix v1 003-T.H.U.N.D.E.R. Agents (Penthouse\nSomeone's Reading Order.txt\nT.H.U.N.D.E.R. Agents 01-05 (Deluxe Comics(1984-1986)\nT.H.U.N.D.E.R. Agents Archives v1-6 covers only (WS\nT.H.U.N.D.E.R. Agents Companion (TwoMorrows(2005)\nT.H.U.N.D.E.R. Agents v1 01-10 (DC(2011)\n\nT.H.U.N.D.E.R 001 (Solson Publications(1987)\n\nT.H.U.N.D.E.R. Agents (JC Comics\n     Hall of Fame featuring Thunder Agents 01-03 (1983)\n     T.H.U.N.D.E.R. Agents 01-02 (1983-1984)\n     \nT.H.U.N.D.E.R. Agents (Tower Comics\n     Dynamo 01-04 (1966-1967)\n     Noman 01-02 (1966-19667)\n     Thunder Agents v1 01-20 (1965-1969)\n     Undersea Agent 01-06 (1966-1967)\n \nWildstorm loved these guys (team 7)  best because they got the number 7,  traditionally lucky, magical, and good news in western culture, whereas Gen13 got the second worst number of ill omen after 666.\n \n May I be serious for a moment before i try some lighter stuff again? Just one of those moments why I feel like spouting off about a random topic\n     Lest any of you chime in (in your heads) with the widely spread idea that the Number of the Beast is not 666 but 616, that's a big maybe. Just because a fragment of a copy of the  Revelaton of John was found that is older than any other copy, containing the number 616 instead of 666 proves nothing. It not even news that some ancient manuscripts had a different number. It takes a lot more than that to settle it.  I know a bunch of scholars (mostly not textual critics) have jumped on it, but scholars follow fads and &quot;neat new ideas&quot; too. Textual critics are these guys who study ancient documents that exist with variations between copies and try to determine which is closest to the original, whether it be the bible or a greek play. One of the things they'll tell you is older is not always better, and more copies with a particular variant proves nothing also. Imagine a guy makes a small error in copying and doesn't notice. That copy is copied by others and eventually there are dozens of copies with the mistake. Meanwhile a more accurate copy sits on a shelf uncopied. The majority vote is wrong. Or an erroneous copy just happens to be the one to survive when better copies perished. The great majority of ancient documents didn't survive the passage of a couple thousand years. When  two thousand years you reach, survive as well, you will not.\n    \n    I'm not advocating for 616, I'm just saying new discoveries are rarely settled questions from the start in science or any scholarly endeavor, though some eventually hold up to scrutiny.\n    \n    All this above because there is an attraction for me about the 616 possibility which I wanted to mention, but it's difficult for me to resist the temptation to digress. Sadly, not all my digressions are even trying to be funny. Just trying to your very soul.\n    \n     6 + 1 + 6  = 13. Thirteen is the number of me, I am the joshua13. It has been my favorite number since I was 13. Further, I have a special connection to the DC character Dr. 13 (which I will not reveal). I once used the pseudonym &quot;Doctor 13&quot; in something I worked on a very long time ago. Whenever possible I work 13 into things. Do I need to set a time for an automated operation on a computer at my job as an IT guy? Most people go with on the hour or half hour. I go for 13 minutes past the hour. If it's ok to do in the afternoon I go for 24 hour time - 13:13.  I could go on but my WQ (weirdness quotient) in the eyes of the world is already too high.\n \n \nTeam 7 (Image-WS\n     Team 7 v1 01-04 (1994-1995)\n     Team 7-Dead Reckong 01-04 (01-04 1996)\n     Team 7-Obective Hell 01-03 (05-07 1995)\n     Team X and Team 7 (Marvel(1996)\n\nTeam One-Stormwatch 01-02 (Image-WS(1995)\nTeam One-Wildcats 01-02 (Image-WS(1995)\nTeam Superman (1999)\nTeam Superman Secret Files 001 (1998)\nTeam Titans v1 01-24 (1992-1994)\nTeam Titans v1 Annual 01-02 (1993-1994)\nTeam Zero 01-05 (WS(2006)\n\nTeams and teams above. I am not a team player. I hate team games. I hate to work in teams. I  keep waiting for someone to say to me &quot;There is no I in team!&quot;. I am ready to fire back - &quot;But there is a ME!!!!&quot;. It's not that it's all about me, or I don't want to cooperate. It's not that I think I'm better than everyone else, or only my  ideas are good, or I never need any help (though all of that is true). It's  just that I hate everyone and keep thinking about how to kill them without getting caught whenever I'm asked to work on a team. This seriously impacts my productivity!  I'm a loner, an island (cause this mans IS), a solitary figure trodding though a harsh wilderness of his own making, an asocial (not anti) being, a misanthrope of a sort. It's paradise.\n\nTears of a Lamb Hitsuji no Namida scanlation-CMX substitute  - Tears of a lamb. Are they silent tears? or is this lamb a noisy lamb, not like the ones in the movie.  Read and discover.\n\nTechnopriests, The 01-02 (DC_Humanoids(2004)\n\nA short lived attempt to enter the teen girls magazine market. Teen beat was too close to &quot;Tiger Beat&quot; if I recall, so they had to change to avoid a suit. The it died. I postulate DC had no clue what it was doing, and was probably too embarrassed to give it a full effort in any case. Im sure DC would just like to forget. Bring it up if you're even out a t a bar with DC and the gang. Especially if Marvel is there. Watch DC, hem and haw about it. No I'm not talking about DC staff. I'm talking about anthropomorphizing the entire corporation itself. Remember corporations are people too! The US supreme court says so! So take DC out for dinner and drinks. DC will be whatever gender you prefer\n\nTeen Beat 001 (12-1967)\nTeen Beam 002 (02-1968)\n\n\nTeen Titans\n     DNAgents v1 014 (1984) - this is a &quot;non-crossover crossover&quot;  with the teen titans. The DNA Agents meet a Teen Titans like group (Project Youngblood), and meanwhile the Teen Titans meet a DNA Agent like group the &quot;ReCombatants&quot; in their comic.\n     \n    The &quot;Project Youngblood&quot; group dies, but the Youngblood name you may recognize from Image and Awesome comics. Rob Liefeld, who created the group conceived of them originally as a Teen Titans revision or reboot which never happened, but in a different form they became the Youngblood team you know and love, or dislike, or are indifferent about. I don't care.\n      \n     Teen Titans Go Sparktop Giveaway-Insert Introducing Sara Hunter (2006)\n     Teen Titans Go! 001 ct FCBD (2004)\n     Teen Titans Go! 01-55 (2004-2008)\n     Teen Titans Go! Action Figure Comic 001 (2004)\n     Teen Titans Go! Action Figure Comic 004 (2005)\n     Teen Titans Go! TPB covers\n     Teen Titans Lost Annual 001 (03-2008)\n     Teen Titans Spotlight 01-21 (1986-1988)\n     Teen Titans TPB covers\n     Teen Titans Year One (2008)\n     Teen Titans and Outsiders Secret Files and Origins (2005)\n     Teen Titans v1 01-53 (1966-1978)\n     Teen Titans v1 Annual 001 (1967)\n     Teen Titans v2 01-24 (1996-1998)\n     Teen Titans v2 Annual 001-Pulp Heroes (1997)\n     Teen Titans v3 001-100 (2003-2011)\n     Teen Titans v3 Annual 2009 52p ctc\n     Teen Titans v3 Annual 52p ctc (2006)\n     Teen Titans v3 Ã‚Â½-Wizard (2004)\n     Teen Titans v4 01-xx (2011-20xx)\n     Teen Titans-Cold Case 001 (2011)\n     Teen Titans-Jam Packed Action (2005)\n     Teen Titans-Outsiders Secret Files 001-Graduation Day (2003)\n     Teen Titans-The Legion Special (read as v3 16b)\n     \nTelara Chronicles 00-04 (WS(2010-2011)\nTelara Chronicles TPB (2011)\nTell Me, Dark TPB (1993)\nTempest 01-04 (1996-1997)\nTempus Fugitive 01-04 (1990-1991)\nTenjho Tenge v01-33-scanlated (UJ-YJC-CMX Subsitute\n\nTenryu-The Dragon Cycle CMX covers only\n\nTerminal City (Vertigo\n     Terminal City 01-09 (1996-97)\n     Terminal City Postcards Promo (1996)\n     Terminal City Postcards Promo (alt)(1996)\n     Terminal City TPB-unscanned.jpg\n     Terminal City-Aerial Graffiti 01-05 (1997-1998)\n     Terminal City-Aerial Graffiti-preview\n\nTerra 01-04 (2009)\n\nTerra Obscura (ABC\n     Terra Obscura v1 01-06 (2003-2004)\n     Terra Obscura v2 01-06 (2004-2005)\n\nTerror Titans 01-06 (2008-2009)\nTeru Teru X Shonen v01 (CMX\nTestament 01-22 (Vertigo(2006-2008)\nTestament Sneak Preview\nTestarotho v1-v4 (CMX(2001)\n\nThe Texas Chainsaw Massacre (WS\n     The Texas Chainsaw Massacre (WS\n          The Texas Chainsaw Massacre  01-06 (2007)\n          The Texas Chainsaw Massacre-About a Boy 001 ctc (2007)\n          The Texas Chainsaw Massacre-By Himself ctc (2007)\n          The Texas Chainsaw Massacre-Cut! ctc (2007)\n          The Texas Chainsaw Massacre-Raising Cain 01-03 (2008)\n\n     The Texas Chainsaw Massacre (Avatar\n          The Texas Chainsaw Massacre Special 001 (2005)\n          The Texas Chainsaw Massacre-Fearbook-6 covers (2006)\n          The Texas Chainsaw Massacre-The Grind 01-03 (2006)\n          \n     Film Comment-The Texas Chainsaw Massacre only (08-1986)\n     The Texas Chainsaw Massacre Movie Posters (5)\n     \nTh1Rt3En TPB-unscanned. Original 2000AD comics substituted since this is unscanned in this form.\n\nThorion of the New Asgods-Thorion The Hunter! (Amalgam(06-1997)\nThousand Faces Book 001 ctc (2009)\nThree Aces v3 06-Bulletman\nThree Mouseketeers,The v1 01-26 (1956-1960)\nThree Mouseketeers,The v2 01-07 (1970-1971)\nThriller 01-12 (1983-1984)\n\nThrilling Comics v1 01-80(i) (1940-1951)  - These are here because some of the characters within were revived by the ABC imprint of Wildstorm in the Tom Strong and Terra Obscura titles. DC also used the title for a one shot &quot;volume two&quot; as part of the JSA returns series, each done as  a new issue of a classic Golden Age title.\n\nThrilling Comics v2 001 ctc (1999)\n\nThrillkiller 01-03 (1997)\n\nThunderbolt Jaxon (WS\n     Thunderbolt Jaxon 01-05 (WS(2006)\n     Giant Holiday Fantasy Comic Album, The-Thunderbolt Jaxon and the Golden Princess only (1989)\n     Knockout Annual 1958-Thunderbolt Jaxon and the Flying Wreckers only\n     Knockout Annual 1958-Thunderbolt Jaxon and the Frightened Lion Tamer only\n     Knockout Annual 1958-Thunderbolt Jaxon and the Kidnappers only\n     Knockout Annual 1960-1st page of Thunderbolt Jaxon and the Golden Princess only\n     Knockout Annual 1960-Thunderbolt Jaxon and the Glamorous Cannon-Ball only\n     Thunderbolt Jaxon and the Golden Princess\n\nOften listed as &quot;Peter Cannon, Thunderbolt&quot; from the cover, but the indica says just Thunderbolt.\n\nThunderbolt-Peter Cannon 01, 51-60 (Charlton(1966-1967)\n\nThundercats (WS\n     Superman-Thundercats 001 (2004) (WS-DC\n     Superman-Thundercats-variant.jpg\n     Thundercats Origins-Heroes and Villains 001 (2004)\n     Thundercats Origins-Villains and Heroes 001 (2004)\n     Thundercats Sourcebook (01-2003)\n     Thundercats TPB unscanned reprints\n     Thundercats v2 00-05 (WS(2002-2003)\n     Thundercats variant covers\n     Battle of the Planets Thundercats 001-2 covers 52p ctc (WS-Top Cow-image(05-2003)\n     Thundercats-Battle of the Planets 001 40p (WS-TopCow-Image(07-2003)\n     Thundercats-Dogs of War 01-05 (2003)\n     Thundercats-Enemy's Pride 01-05 (2004)\n     Thundercats-HammerHand's Revenge 01-05 (2003-2004)\n     Thundercats-The Return 01-05 (2003)\n     \nThunderCats (i) 30 issues (Marvel UK(1987-19xx)\nThundercats v1 01-24 (Marvel-Star(1985-1988)\nThundercats-Quest For the Magic Crystal ctc (Random House(1985)\n\nTimber Wolf 01-05 (1992-1993)\nTime Breakers 01-05 (Helix-DC(1997)\nTime Guardian-Toki no Shugomono v1-v2(i) (CMX(2006)\nTime Masters 01-08 (1990)\nTime Masters-Vanishing Point 01-06 (2010-2011)\nTime Warp 01-05 (1979-1980)\n\nI still want to cry when I think about the horror of what is done to the Teen Titans in this comic.\n\nTiny Titans 01-xx (2008-20xx)\nTiny Titans-Little Archie 01-03 (2010-2011)\n\nTiny Toon Adventures Magazine 001 ctc (1990)\n\nTitans, The\n     Titans Beat (1997)\n     Titans Secret Files 001 56p (10-2000)\n     Titans Secret Files 001 66p ctc (03-1999)\n     Titans Tower Index files (xxxx).zip\n     Titans v1 01-50 (1999-2003)\n     Titans v1 Annual 001-Planet DC (09-2000)\n     Titans v1 Sell-Out Special (1992)\n     Titans v2 01-38 (2008-2011)\n     Titans v2 Annual 001 (09-2011)\n     Titans v3 East Special 001 (01-2008)\n     Titans-Legion of Super-Heroes-Universe Ablaze 01-04 (2000)\n     Titans-Scissors, Paper, Stone-Elseworlds (1997)\n     Titans-Villains for Hire Special 001 ctc (2010)\n     Titans-Young Justice Graduation Day  01-03 (2003)\n     Titans-Young Justice-Graduation Day TPB (2003)\n\n=====================================================================\n\nFeel free to post this to other sites if you know how and are so inclined\n\n========================================================================\n\nPlease Seed! Lots of people will start on the series months\nor even a year or two from now. You are their only hope to complete\ntheir downloads.\n\n=========================================================================\nThanks to the Scanners and editors, and thanks to the seeders, the\nanonymous folk that make the work of the scanners and uploaders multiply!\n=========================================================================\nUntil we once again don't actually meet,\n\nCordially,\n\n13\n\nYou can see my other torrents at \n\nd-e-m-o-n-o-id.me/files/?uid=1213225&amp;seeded=2\n\nor\n-h-3-3-t.com-/userdetails.php?id=72866\n\nor &lt;a href=&quot;\nhttp://thepiratebay.se/user/joshua13/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/joshua13/&lt;/a&gt;","torrent":{"xt":"urn:btih:7c575f61d0835bca19703ce4b299777422b8a4a9","amp;dn":"MTCDC-NMC+47+DC+from+Te-Tn+%28joshua13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c575f61d0835bca19703ce4b299777422b8a4a9","infoHashBuffer":{"type":"Buffer","data":[124,87,95,97,208,131,91,202,25,112,60,228,178,153,119,116,34,184,164,169]},"announce":[],"urlList":[]}}