{"title":"ROMANTIC COMEDY 1983.avi","uid":8184948,"size":1174493228,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7c5d5559960ee5de62fb2a41077de35a6ab80c27&amp;dn=ROMANTIC+COMEDY+1983.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"claudiatannahill","files":1,"time":1361664125,"description":"Romantic Comedy\n\n1983 film\n\nRomantic Comedy is a 1983 American film starring Dudley Moore and Mary Steenburgen, directed by Arthur Hiller. The screenplay by Bernard Slade is based on his 1979 play of the same title.Jason Carmichael is a popular New York City playwright in desperate need of a new writing partner who can provide him with inspiration. Phoebe Craddock is a small-town teacher who aspires to be a writer.\n\nOn the day Jason is marrying wealthy socialite Allison St. James, he meets Phoebe, stripping naked in front of her when he mistakes her for a masseuse.\n\nThe two embark on a professional partnership. Over the course of the next nine years, they produce a string of plays, some flops but mostly hits. They find themselves attracted to each other but manage to avoid becoming involved romantically except for a one-nighter out of town, which the aloof Jason fails to even acknowledge the next morning. As time passes, Jason's marriage suffers as Allison runs for political office.\n\nHis agent Blanche remains a constant, mothering presence as years go by. Jason is still a husband and a father while Phoebe remains a close family friend. But he permanently loses the respect of both his wife and writing partner by having a fling with a pushy Hollywood actress, Kate Mallory, as well as changing a new play at her request.\n\nJason goes to pieces after his wife divorces him while Phoebe gets married to newspaper reporter Leo Janowitz. Phoebe moves away, ends their professional partnership and becomes a successful author. When they are reunited for the first time in years, Jason picks an argument with Phoebe in a restaurant and has a heart attack.\n\nUpon coming home, Jason does everything in his power to sabotage Phoebe's marriage while she moves in to take care of him. Leo can plainly see that his wife is in love with Jason and possibly always has been, so he leaves her. Phoebe ultimately invites Jason to try a new kind of collaboration. ","torrent":{"xt":"urn:btih:7c5d5559960ee5de62fb2a41077de35a6ab80c27","amp;dn":"ROMANTIC+COMEDY+1983.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c5d5559960ee5de62fb2a41077de35a6ab80c27","infoHashBuffer":{"type":"Buffer","data":[124,93,85,89,150,14,229,222,98,251,42,65,7,125,227,90,106,184,12,39]},"announce":[],"urlList":[]}}