{"title":"The Conversion of Scott Hahn (Original Recording)","uid":10726493,"size":37377136,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7cf6a138e4c672b773f226ac235d69e325f3e718&amp;dn=The+Conversion+of+Scott+Hahn+%28Original+Recording%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ancapcatholic","files":-1,"time":1407573062,"description":"This is the original recording of Scott Hahn's conversion story that started it all. A more-recent updated version is now available called &quot;Why a Protestant Pastor Became Catholic&quot; which can be found here: https://thepiratebay.se/torrent/10174016 \n\nWhile both versions essentially tell the same story, they each offer plenty of unique insight and value. I highly recommend both.\n\n---\n\nThis classic is the beguiling firsthand account from the brilliant young Protestant minister who became a Catholic and set in motion a tidal wave of conversions. Millions have been touched by this talk. A great supplement for Bible Studies and many parish programs.\n\nDr. Scott Hahn is an exceptionally popular speaker who has delivered thousands of talks nationally and internationally on a wide variety of topics talks related to Scripture and the Catholic faith. His talks have been effective in helping thousands of Protestants and fallen away Catholics to (re)embrace the Catholic faith. He is a Professor of Theology and Scripture at Franciscan University of Steubenville, where he has taught since 1990, and is the founder and director of the Saint Paul Center for Biblical Theology. \n\nMore about &quot;The Conversion of Scott Hahn&quot;:\n\nFew people know the remarkable story of how &quot;The Conversion of Scott Hahn&quot; came into existence. A Catholic organization in California publishes an excellent magazine called This Rock. A woman from the Midwest ordered a gift subscription for a relative who lived in Pennsylvania. Apparently, the relative never received her magazines, so someone at the magazine looked into the matter. It turned out that the address on the gift subscription had the right town and street, but the wrong street number.\n\nWhen the magazine staffer called the man who had been accidentally receiving This Rock, the man mentioned that although he didn't know why he had been receiving it, the magazine had been a big help during his conversion to Catholicism. The &quot;accidental&quot; subscriber's story was so impressive that he was invited to California to share his story.\n\nThe man's name was Scott Hahn, and that's how he came to have his conversion story recorded for the first time. No one could have anticipated the impact this one talk would have on Catholic culture in North America and beyond. It has electrified countless souls around the world, and it will have an impact on you, too.\n\nScott Hahn became the first in a landslide of Protestant ministers who have since converted to Catholicism. The Mary Foundation is the only organization that still produces the original talk. We believe it is just as fresh and just as jolting as the day it was recorded.\n\nAnd even if you're a Christian who has a negative outlook on the Catholic Church, don't be afraid to give it a listen. Scott knows how to speak in a way that you can understand. Perhaps you will never consider becoming a Catholic, but at least you'll finally be able to comprehend why someone who knows and loves the Bible would convert to Catholicism.\n\nORDER YOUR FREE CD COPIES ONLINE NOW\n &lt;a href=&quot;\nhttp://www.catholicity.com/cds/hahn.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.catholicity.com/cds/hahn.html&lt;/a&gt;\n\n---\n\nCatholiCity runs a large deficit each year because they give away free life-changing Catholic CDs, booklets and novels. Your generosity will ensure that millions continue to have the opportunity to receive them. Your gift is tax deductible, and you will receive a free gift with your donation of any amount, and larger gifts for donations of $25, $50 or $100.\n  &lt;a href=&quot;\nhttp://www.catholicity.com/support/donation.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.catholicity.com/support/donation.html&lt;/a&gt;\n\n\n\n\nSee also:\n\n--Stephen Ray: Finding the Fullness of Faith\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10177239&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10177239&lt;/a&gt;\n\n--Deacon Alex C. Jones - No Price Too High\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10177587&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10177587&lt;/a&gt;\n\n--Thomas Smith - From Mormon Missionary to the Catholic Church\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10184038&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10184038&lt;/a&gt;\n\n--Mark Hart - Remade\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10198741&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10198741&lt;/a&gt;\n\n--Fr. Donald Calloway - No Turning Back: Former Drug Dealer to Catholic Priesthood\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10198876&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10198876&lt;/a&gt;\n\n--Patrick Madrid - Why I Am Catholic When I Could Be Anything Else\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10185328&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10185328&lt;/a&gt;\n\n--Scott Hahn - How to Bring Fallen Away Catholics Back to the Church\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10192840&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10192840&lt;/a&gt;\n\n--Fr Francis Peffley: An Invitation to Consider the Catholic Faith\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10178011&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10178011&lt;/a&gt;\n\n\n\n\n\nPlease seed!\n\nMore: https://thepiratebay.se/user/ancapcatholic/\n\nBTC: 1N3Y2HNWe3xWY4qdYricHRKz58zqqi5MZp\t\n","torrent":{"xt":"urn:btih:7cf6a138e4c672b773f226ac235d69e325f3e718","amp;dn":"The+Conversion+of+Scott+Hahn+%28Original+Recording%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cf6a138e4c672b773f226ac235d69e325f3e718","infoHashBuffer":{"type":"Buffer","data":[124,246,161,56,228,198,114,183,115,242,38,172,35,93,105,227,37,243,231,24]},"announce":[],"urlList":[]}}