{"title":"Vodka Politics - Alcohol, Autocracy, and the Secret History of t","uid":9918354,"size":7500614,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7e33c5357aaa93f90a7af5da7c435bc009dd54a0&amp;dn=Vodka+Politics+-+Alcohol%2C+Autocracy%2C+and+the+Secret+History+of+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"AtomTPB","files":1,"time":1396973623,"description":"Hardcover: 512 pages\nPublisher: Oxford University Press, USA (February 5, 2014)\nLanguage: English\nISBN-10: 0199755590\nISBN-13: 978-0199755592\n\n\nRussia is famous for its vodka, and its culture of extreme intoxication. But just as vodka is central to the lives of many Russians, it is also central to understanding Russian history and politics.\n\nIn Vodka Politics, Mark Lawrence Schrad argues that debilitating societal alcoholism is not hard-wired into Russians' genetic code, but rather their autocratic political system, which has long wielded vodka as a tool of statecraft. Through a series of historical investigations stretching from Ivan the Terrible through Vladimir Putin, Vodka Politics presents the secret history of the Russian state itself-a history that is drenched in liquor. Scrutinizing (rather than dismissing) the role of alcohol in Russian politics yields a more nuanced understanding of Russian history itself: from palace intrigues under the tsars to the drunken antics of Soviet and post-Soviet leadership, vodka is there in abundance.\n\nBeyond vivid anecdotes, Schrad scours original documents and archival evidence to answer provocative historical questions. How have Russia's rulers used alcohol to solidify their autocratic rule? What role did alcohol play in tsarist coups? Was Nicholas II's ill-fated prohibition a catalyst for the Bolshevik Revolution? Could the Soviet Union have become a world power without liquor? How did vodka politics contribute to the collapse of both communism and public health in the 1990s? How can the Kremlin overcome vodka's hurdles to produce greater social well-being, prosperity, and democracy into the future?\n\nViewing Russian history through the bottom of the vodka bottle helps us to understand why the &quot;liquor question&quot; remains important to Russian high politics even today-almost a century after the issue had been put to bed in most every other modern state. Indeed, recognizing and confronting vodka's devastating political legacies may be the greatest political challenge for this generation of Russia's leadership, as well as the next.","torrent":{"xt":"urn:btih:7e33c5357aaa93f90a7af5da7c435bc009dd54a0","amp;dn":"Vodka+Politics+-+Alcohol%2C+Autocracy%2C+and+the+Secret+History+of+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e33c5357aaa93f90a7af5da7c435bc009dd54a0","infoHashBuffer":{"type":"Buffer","data":[126,51,197,53,122,170,147,249,10,122,245,218,124,67,91,192,9,221,84,160]},"announce":[],"urlList":[]}}