{"title":"ExploitedCollegeGirls - Rosana NEW 03 September 2015","uid":12345931,"size":397876402,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:7eaa9cceebfbd14d4c77c718e64d207d8da80639&amp;dn=ExploitedCollegeGirls+-+Rosana+NEW+03+September+2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1441357453,"description":"Meet Rosana, a sassy Latina show off and, while you're here, meet her busty show off friend. Yes, Rosana is definitely going to get fucked but sadly no, her busty friend is not. As the scene opens, Jay gets a little behind the scenes footage as Rosana explains how nervous she is and that's why she's brought her friend along for moral support. Jay isn't able to convince Rosana's amiga to join in the action, but he is able to talk her out of her top to get an eyeful of her lovely, big natural titties.The interview moves to the bed and Rosana strips down to nothing and shows off her cute little body. It's really too bad Jay isn't able to turn this into a threesome, these girls are the perfect sweet and sour to each other: a firm little spinner and a curvy, busty babe. While they might have plenty of fuckable assets between the two of them, they barely have the enthusiasm of one average girl. The look on Rosana's face as Jay fingers her and fucks her with a vibrator is about the same look you'd see on a girl's face watching a stranger change her tire for her.Bored or not, Rosana knows how to fuck and when she drops to the floor and demonstrates her blowjob skills you can see why a guy would put up with her being bored the rest of the time. Jay has Rosana's pal help out with camera duties, so you get a lot of great angles this week of a talented little cocksucker. Jay does his best to liberate an orgasm from Rosana but it seems like she's making a grocery list in her head until he manages to hit her g spot and elicit some vocal enthusiasm from her.Rosana may not cum but Jay is sure as hell going to, and probably on someone's face. When he gets Rosana on her knees and blasts her she seems to be having the most fun of the whole shoot.\nTags: Deep Throat, Blowjob, Facial, Sex Toys, Amateur, Casting, POV, Hardcore\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=84986661161570379253.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=84986661161570379253.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=36378557097136193778.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=36378557097136193778.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:7eaa9cceebfbd14d4c77c718e64d207d8da80639","amp;dn":"ExploitedCollegeGirls+-+Rosana+NEW+03+September+2015","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7eaa9cceebfbd14d4c77c718e64d207d8da80639","infoHashBuffer":{"type":"Buffer","data":[126,170,156,206,235,251,209,77,76,119,199,24,230,77,32,125,141,168,6,57]},"announce":[],"urlList":[]}}