{"title":"Katie Alender, Bad Girls Don't Die Complete series [dovah]","uid":9120404,"size":1915155,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f0b51c6914fdafc51dd7f200d1be63ae446cf58&amp;dn=Katie+Alender%2C+Bad+Girls+Don%27t+Die+Complete+series+%5Bdovah%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"dovah12","files":-1,"time":1383119047,"description":"Bad Girls Don't Die complete series :\nBad Girls Don't Die (Bad Girls Don't Die, #1)\nFrom Bad to Cursed (Bad Girls Don't Die, #2)\nAs Dead As It Gets (Bad Girls Don't Die, #3)\n\n\n\nAuthor : Katie Alender\n\n\n\n\nformat: ebook\nPublished 2009 to 2013 by Hyperion\n\n\n\n\nAlexis thought she led a typically dysfunctional high school existence. Dysfunctional like her parents' marriage; her doll-crazy twelve-year-old sister, Kasey; and even her own anti-social, anti-cheerleader attitude. When a family fight results in some tearful sisterly bonding, Alexis realizes that her life is creeping from dysfunction into danger. Kasey is acting stranger than ever: her blue eyes go green sometimes; she uses old-fashioned language; and she even loses track of chunks of time, claiming to know nothing about her strange behavior. Their old house is changing, too. Doors open and close by themselves; water boils on the unlit stove; and an unplugged air conditioner turns the house cold enough to see their breath in.\n\nAlexis wants to think that it's all in her head, but soon, what she liked to think of as silly parlor tricks are becoming life-threatening--to her, her family, and to her budding relationship with the class president. Alexis knows she's the only person who can stop Kasey -- but what if that green-eyed girl isn't even Kasey anymore?\n================\n\nDovah","torrent":{"xt":"urn:btih:7f0b51c6914fdafc51dd7f200d1be63ae446cf58","amp;dn":"Katie+Alender%2C+Bad+Girls+Don%27t+Die+Complete+series+%5Bdovah%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f0b51c6914fdafc51dd7f200d1be63ae446cf58","infoHashBuffer":{"type":"Buffer","data":[127,11,81,198,145,79,218,252,81,221,127,32,13,27,230,58,228,70,207,88]},"announce":[],"urlList":[]}}