{"title":"Perfect Scoundrels - Ally Carter.epub","uid":9269614,"size":4319199,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7fd8e1fb63aa9238115b3a0e1053a095e9e318f8&amp;dn=Perfect+Scoundrels+-+Ally+Carter.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Mohammad_AT","files":1,"time":1385751783,"description":"Katarina Bishop and W.W. Hale the fifth were born to lead completely different lives: Kat comes from a long, proud line of loveable criminal masterminds, while Hale is the scion of one of the most seemingly perfect dynasties in the world. If their families have one thing in common, it's that they both know how to stay under the radar while getting-or stealing-whatever they want. No matter the risk, the Bishops can always be counted on, but in Hale's family, all bets are off when money is on the line. When Hale unexpectedly inherits his grandmother's billion dollar corporation, he quickly learns that there's no place for Kat and their old heists in his new role. But Kat won't let him go that easily, especially after she gets tipped off that his grandmother's will might have been altered in an elaborate con to steal the company's fortune. So instead of being the heir-this time, Hale might be the mark. Forced to keep a level head as she and her crew fight for one of their own, Kat comes up with an ambitious and far-reaching plan that only the Bishop family would dare attempt. To pull it off, Kat is prepared to do the impossible, but first, she has to decide if she's willing to save her boyfriend's company if it means losing the boy.","torrent":{"xt":"urn:btih:7fd8e1fb63aa9238115b3a0e1053a095e9e318f8","amp;dn":"Perfect+Scoundrels+-+Ally+Carter.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fd8e1fb63aa9238115b3a0e1053a095e9e318f8","infoHashBuffer":{"type":"Buffer","data":[127,216,225,251,99,170,146,56,17,91,58,14,16,83,160,149,233,227,24,248]},"announce":[],"urlList":[]}}