{"title":"Dizzy Gillespie - 2006 - Supreme Jazz (SACD 24 88.2) FLAC","uid":9143618,"size":1162415083,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7fdfa4ad54fea691a648b72286808e3cc54ba0b2&amp;dn=Dizzy+Gillespie+-+2006+-+Supreme+Jazz+%28SACD+24+88.2%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"eika256","files":-1,"time":1383555982,"description":"Dizzy Gillespie - 2006 - Supreme Jazz\nSACD 24 bit, 88.2 KHz\n\nDizzy Gillespie's contributions to jazz were huge. One of the greatest jazz trumpeters of all time (some would say the best), Gillespie was such a complex player that his contemporaries ended up copying Miles Davis and Fats Navarro instead, and it was not until Jon Faddis' emergence in the 1970s that Dizzy's style was successfully recreated. Somehow, Gillespie could make any &quot;wrong&quot; note fit, and harmonically he was ahead of everyone in the 1940s, including Charlie Parker. Unlike Bird, Dizzy was an enthusiastic teacher who wrote down his musical innovations and was eager to explain them to the next generation, thereby insuring that bebop would eventually become the foundation of jazz.\nDizzy Gillespie was also one of the key founders of Afro-Cuban (or Latin) jazz, adding Chano Pozo's conga to his orchestra in 1947, and utilizing complex poly-rhythms early on. The leader of two of the finest big bands in jazz history, Gillespie differed from many in the bop generation by being a masterful showman who could make his music seem both accessible and fun to the audience. With his puffed-out cheeks, bent trumpet (which occurred by accident in the early '50s when a dancer tripped over his horn), and quick wit, Dizzy was a colorful figure to watch. A natural comedian, Gillespie was also a superb scat singer and occasionally played Latin percussion for the fun of it, but it was his trumpet playing and leadership abilities that made him into a jazz giant. (AllMusic)\n\nTrack list:\n01. It Don't Mean A Thing\n02. I Let A Song Go Out Of My Heart\n03. Girl Of My Dreams\n04. Impromptu\nLos Angeles. December 9. 1953, Dizzy Gillespie / Stan Getz Sextet:Dizzy Gillespie (tp), Stan Getz (ts), Oscar Peterson (p), Herb Ellis (g), Ray Brown (b), Max Roach (d)\n05. Doodlin'\n06. Stella By Starlight\n07. A Night In Tunisia\n08. Tour De Force\n09. The Champ\n10. Yesterdays\n11. Groovin' for Nat\n12. Annie's Dance\n13. Dizzy's Blues\nNew York. June 6. 1956, Joe Gordon, Quincy Jones, E.V. Perry, Carl Warwick (tp), Melba Liston, Frank Rehak (tb), Rod Levitt (btb), Jimmy Powell, Phil Woods (as), Billy Mitchell, Ernie Wilkins (ts), Marty Flax (bar), Walter Davis jr. (p), Nelson Boyd (b), Charlie Persip (d)\n\nEnjoy and share!","torrent":{"xt":"urn:btih:7fdfa4ad54fea691a648b72286808e3cc54ba0b2","amp;dn":"Dizzy+Gillespie+-+2006+-+Supreme+Jazz+%28SACD+24+88.2%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fdfa4ad54fea691a648b72286808e3cc54ba0b2","infoHashBuffer":{"type":"Buffer","data":[127,223,164,173,84,254,166,145,166,72,183,34,134,128,142,60,197,75,160,178]},"announce":[],"urlList":[]}}