{"title":"Dale C. Tatum - Genocide at the Dawn of the Twenty First Century","uid":9948332,"size":2995222,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ffb3519951c451552f5f80c17bbec9e407b7e0f&amp;dn=Dale+C.+Tatum+-+Genocide+at+the+Dawn+of+the+Twenty+First+Century&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Anette14","files":-1,"time":1397350651,"description":"Description\nProduct details\nBook Title: Genocide at the Dawn of the Twenty-First Century: Rwanda, Bosnia, Kosovo, and Darfur\t\nBook Author: Dale C. Tatum (Author)\nHardcover: 256 pages\nPublisher: Palgrave Macmillan (18 Aug 2010)\nLanguage: English\nISBN-10: 0230621899\nISBN-13: 978-0230621893\n\nBook Description\nPublication Date: 18 Aug 2010\nAt the end of World War II, the international community deemed genocide a crime against humanity. Yet, at the dawn of the twenty-first century it has occurred repeatedly. This book explains why genocide began to occur in the twenty-first century and why the United States has been ineffective at preventing it and stopping it once it occurs.\n\nReviews\n&quot;In the first half of the twentieth century, the worst cases of genocide were perpetrated in two of the most advanced countries in the world--Hitler's Germany and Stalin's Russia. Since the middle of the twentieth century, smaller countries have caught the genocidal bug--including Bosnia, Rwanda, Kosovo, and probably Darfur. Dale C. Tatum laments the lack of strong American leadership in dealing with the proliferation of genocide, which is as compelling a moral cause as preventing the proliferation of nuclear weapons. Indeed, Tatum has convinced me that genocidal proliferation may be more imminent and needs the urgent attention of America and the world community.&quot;--Ali A. Mazrui, Director of Global Cultural Studies, State University of New York, Binghamton, NY\n\n&quot;This book covers genocides in recent history and the political/historical environments associated with these tragedies. We should all study these events, but it is particularly appropriate for college students to ponder and discuss them. Insufficient attention is given to the genocide question at the collegiate level and to those areas of the world covered by this volume. Importantly, it is written with considerable passion, clarity, and perception--qualities that stand to stimulate thinking and debate about governments should approach genocide and how to prevent it.&quot;--William Leiter, Professor of Political Science, California State University\n\nAbout the Author\nDALE C. TATUM has taught Political Science at several universities and colleges and is the author of Who Influenced Whom? Lessons from the Cold War (2002).\n","torrent":{"xt":"urn:btih:7ffb3519951c451552f5f80c17bbec9e407b7e0f","amp;dn":"Dale+C.+Tatum+-+Genocide+at+the+Dawn+of+the+Twenty+First+Century","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ffb3519951c451552f5f80c17bbec9e407b7e0f","infoHashBuffer":{"type":"Buffer","data":[127,251,53,25,149,28,69,21,82,245,248,12,23,187,236,158,64,123,126,15]},"announce":[],"urlList":[]}}