{"title":"Sven Lindqvist - Terra Nullius [Australian history] (2007)","uid":8884614,"size":5619652,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:807c414a7cca8681939e3f57cc37ef1d43e2969e&amp;dn=Sven+Lindqvist+-+Terra+Nullius+%5BAustralian+history%5D+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"workerbee","files":-1,"time":1378420488,"description":"Sven Lindqvist - Terra Nullius: A Journey Through No One's Land (New Press, 2007).  Translated by Sarah Death.\n\nISBN: 9781595580511 | 256 pages | PDF\n\n\nA provocative journey through the dark history of the creation of white Australia, exposing the hidden genocide of the Aboriginal people\n\n&quot;Terra nullius&quot; -- no man's land -- was the legal fiction employed to justify the white invasion of Australia. Aboriginal lands were declared &quot;terra nullius&quot; because, it was claimed, they were inhabited by people who would soon die out, and who could be helped on the way to extinction if they lingered.\n\nAuthor of the acclaimed &quot;Exterminate All the Brutes&quot;, Sven Lindqvist is one of the most innovative writers and historians at work today. He brings his original sensibility to bear as he travels 12,000 kilometers through so-called no man's land in search of places where belief in the rights of the white man and the inevitable extinction of the &quot;lower races&quot; were put into practice. The world the Aborigines had known for centuries ended as young boys were kidnapped to dive for pearls, then whipped and abandoned when the bends ruined them for work; &quot;half-caste&quot; children were taken from their mothers; and natives were put in neck irons and sent to internment camps under false diagnoses of STDs.\n\nMining history, popular fiction, anthropology, and his own travels, Lindqvist brilliantly weaves together an illuminating and disturbing history of how &quot;no man's land&quot; became the province of the white man.\n\n\nReviews\n\n&quot;The core of his book is a dreary, often horrifying, but necessary recounting of the displacement and even deliberate slaughter of various indigenous groups. But Lindqvist goes further, condemning Australians today for their refusal to acknowledge and make amends for past injustices. No doubt this will infuriate many Australians who, bearing no direct responsibility for the past, have supported efforts to advance the economic and social status of aborigines. Lindqvist is on less-controversial but equally interesting ground in describing aspects of his extensive travels across the continent and the connections between places he's visited and the past.&quot; -- Jay Freeman, Booklist\n\n&quot;Sven Lindqvist is part of a select group of writers who are re-drawing the world map of literary form.&quot; -- Geoff Dyer\n\n&quot;One of the best storytellers in the historical profession today.&quot; -- Joanna Bourke, Times Literary Supplement\n\n&quot;Sven Lindqvist is one of the most original and imaginative authors working at the end of the twentieth century.&quot; -- Richard Gott\n\n&quot;Lindqvist is a citizen-writer with socialist roots and an open mind.&quot; -- London Review of Books\n","torrent":{"xt":"urn:btih:807c414a7cca8681939e3f57cc37ef1d43e2969e","amp;dn":"Sven+Lindqvist+-+Terra+Nullius+%5BAustralian+history%5D+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"807c414a7cca8681939e3f57cc37ef1d43e2969e","infoHashBuffer":{"type":"Buffer","data":[128,124,65,74,124,202,134,129,147,158,63,87,204,55,239,29,67,226,150,158]},"announce":[],"urlList":[]}}