{"title":"Making Malcolm - The Myth and Meaning of Malcolm X","uid":4671071,"size":9232409,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:808eb907e047dda9d66bfe83340c26aedce233f4&amp;dn=Making+Malcolm+-+The+Myth+and+Meaning+of+Malcolm+X&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"malestrom_HH","files":1,"time":1232734935,"description":" &lt;a href=&quot;http://www.image-upload.net/images/dp6fodbpsenfkoedj.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/dp6fodbpsenfkoedj.jpeg&lt;/a&gt;\n\nMaking Malcolm: The Myth and Meaning of Malcolm X By Michael Eric Dyson\nPublisher Oxford University Press, USA | ISBN: 0195102851 | edition 1996 | PDF | 256 pages\n\nMalcolm X's cultural rebirth his improbable second coming brims with irony. The nineties are marked by intense and often angry debates about racial authenticity and &quot;selling out,&quot; and the participants in these debates from politicians to filmmakers to rap artists often draw on Malcolm's scorching rebukes to such moves. Meanwhile, Malcolm's &quot;X&quot; is marketed in countless business endeavors and is stylishly branded on baseball hats and T-shirts sported by every age, race, and gender. But this rampant commercialization is only a small part of Malcolm's remarkable renaissance. One of the century's most complex black leaders, he is currently blazing a new path across contemporary popular culture, and has even seared the edges of an academy that once froze him out. Thirty years after his assassination, what is it about his life and words that speaks so powerfully to so many? In Making Malcolm, Michael Eric Dyson probes the myths and meanings of Malcolm X for our time. From Spike Lee's film biography to Eugene Wolfenstein's psychobiographical study, from hip-hop culture to gender and racial politics, Dyson cuts a critical swathe through both the idolization and the vicious caricatures that have undermined appreciation of Malcolm's greatest accomplishments. The book's first section offers a boldly original and penetrating analysis of the major trends in interpreting Malcolm's legacy since his death, and the fiercely competing interests and ideologies that have shaped these trends. From mainstream books to writings published by the independent black press, Dyson identifies and examines the different &quot;Malcolms&quot; who have emerged in popular and academic investigations of his life and career. With impassioned and compelling force, Dyson argues that Malcolm was too formidable a historic figure the movements he led too variable and contradictory, the passion and intelligence he summoned too extraordinary and disconcerting to be viewed through any narrow cultural prism.","torrent":{"xt":"urn:btih:808eb907e047dda9d66bfe83340c26aedce233f4","amp;dn":"Making+Malcolm+-+The+Myth+and+Meaning+of+Malcolm+X","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"808eb907e047dda9d66bfe83340c26aedce233f4","infoHashBuffer":{"type":"Buffer","data":[128,142,185,7,224,71,221,169,214,107,254,131,52,12,38,174,220,226,51,244]},"announce":[],"urlList":[]}}