{"title":"Jimmy Buffet - Margaritaville [1977]","uid":5310881,"size":83550212,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:809319a79c2fb9b53db7434416e58f50f3fd1570&amp;dn=Jimmy+Buffet+-+Margaritaville+%5B1977%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"claudeq","files":1,"time":1264557058,"description":"Margaritaville&quot; is a 1977 song by American popular music singer-songwriter Jimmy Buffett from the album Changes in Latitudes, Changes in Attitudes. He wrote it in Fort Myers, Florida after touring Texas with his group, the Coral Reefer Band.\n\nThe song was a chart hit in the United States when it was released and contemporary popular culture references and remakes attest to its continuing popularity. It reached #8 on Billboard Hot 100 chart, topped the Easy Listening (Adult Contemporary) chart at #1, and peaked at #13 on the Hot Country Songs chart. It remains Buffett's highest charting solo single.\n\nNamed for a cocktail, the margarita, and with lyrics reflecting a laid-back lifestyle in a tropical climate, &quot;Margaritaville&quot; has come to define Buffett's music and career. The relative importance of the song to Buffett's career is referred to obliquely in a parenthetical plural in the title of a Buffett greatest hits compilation album, Songs You Know By Heart: Jimmy Buffett's Greatest Hit(s). The name has been used in the title of other Buffett compilation albums such as Meet Me In Margaritaville: The Ultimate Collection and is also the name of several commercial products licensed by Buffett","torrent":{"xt":"urn:btih:809319a79c2fb9b53db7434416e58f50f3fd1570","amp;dn":"Jimmy+Buffet+-+Margaritaville+%5B1977%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"809319a79c2fb9b53db7434416e58f50f3fd1570","infoHashBuffer":{"type":"Buffer","data":[128,147,25,167,156,47,185,181,61,183,67,68,22,229,143,80,243,253,21,112]},"announce":[],"urlList":[]}}