{"title":"International Human Rights, 2E- Haas [PDF] [StormRG]","uid":10667127,"size":6658351,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:80c5c13b907d00b4acda1de0cf9e46852d587f77&amp;dn=International+Human+Rights%2C+2E-+Haas+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"F1restorm","files":-1,"time":1406818570,"description":"International Human Rights: A Comprehensive Introduction\nAuthor: Michael Haas\nPublished: 2013\nPublisher: Routledge\nISBN: 9780415538206\nFormat: Retail PDF\n___________________________________________________________________________\n\nThis book provides a comprehensive introduction to international human rights -- international human rights law, why international human rights have increasingly risen to world prominence, what is being done about violations of human rights, and what might be done to further promote the cause of international human rights so that everyone may one day have their rights respected regardless of who they are or where they live.\n\nIt explains:\n\nhow the concept of international human rights has developed over time\nthe variety of types of human rights (civil-political rights, economic-social rights, as well as a delineation of war crimes)\nempirical findings from statistical research on human rights\ninstitutional efforts to promote human rights\nan extensive listing of international human rights agreements\nidentification of recent prosecutions of war criminals in domestic and international tribunals\nongoing efforts to promote human rights through international aid programs\nthe newest dimensions in the field of human rights (gay rights, animal rights, environmental rights).\nRichly illustrated throughout with case studies, controversies, court cases, think points, historical examples, biographical statements, and suggestions for further reading, International Human Rights is the ideal introduction for all students of human rights. The book will also be useful for human rights activists to learn how and where to file human rights complaints in order to bring violators to justice.\n\nThe new edition is fully updated and includes new material on:\n\nthe Obama presidency\nthe Arab Spring and its aftermath\nthe workings of the International Criminal Court\nquantitative analyses of human rights\nwar crimes.\n","torrent":{"xt":"urn:btih:80c5c13b907d00b4acda1de0cf9e46852d587f77","amp;dn":"International+Human+Rights%2C+2E-+Haas+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80c5c13b907d00b4acda1de0cf9e46852d587f77","infoHashBuffer":{"type":"Buffer","data":[128,197,193,59,144,125,0,180,172,218,29,224,207,158,70,133,45,88,127,119]},"announce":[],"urlList":[]}}