{"title":"Wallace Stevens - The Necessary Angel: Essays (1951)","uid":8922453,"size":2428135,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:80d7c9d3d1c71748460594b2064e63d6486a11c3&amp;dn=Wallace+Stevens+-+The+Necessary+Angel%3A+Essays+%281951%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"workerbee","files":-1,"time":1379286660,"description":"\nWallace Stevens - The Necessary Angel: Essays on Reality and the Imagination (Alfred A. Knopf, 1951).\n\nISBN: 9780394702780 | 192 pages | PDF\n\n\nWALLACE STEVENS (1879-1955) was one of the great American poets of the 20th century.  Born in Reading, Pennsylvania, educated at Harvard and then New York Law School, he spent most of his life working as an executive for an insurance company in Hartford, Connecticut.  Harold Bloom called Stevens &quot;the best and most representative American poet of our time.&quot;  He won the Pulitzer Prize for Poetry for his Collected Poems in 1955.\n\nStevens was also a philosopher of aesthetics, vigorously exploring the notion of poetry as the supreme fusion of the creative imagination and objective reality.  In this collection of his prose works, Stevens articulated his poetic notions without resorting to abstraction and obfuscation.  In the essay &quot;The Noble Rider and the Sound of Words,&quot; he addressed the imagination's response to adversity, and in 'The Figure of the Youth as Virile Poet,&quot; he championed the imagination as the medium toward a reality transcending mere action and rationalization.  Rendering his ideas in a precise, accessible manner, THE NECESSARY ANGEL considerably illuminates his poetry.\n\n\nReviews\n\n&quot;In this book, the first collection of his prose works, he accounts in scintillating language for the peculiarly modern and sometimes deliquescent fervor that has prompted his poems. Few poets have written so characteristically about their own craft.&quot; -- Perspective\n\n&quot;These are rich essays, simply constructed yet richly and elegantly written.&quot; -- Hayden Carruth, The Nation\n\n&quot;The most welcome attribute of the book is its humane good sense, equally manifest whether Stevens is discussing a desolate Pennsylvania churchyard, Plato's images or the personalities of those who prefer a drizzle in Venice to a hard rain in Hartford.&quot; -- New Republic\n\n&quot;It is a rare pleasure to breathe the atmosphere of confidence and wholeness which distinguishes the world of Wallace Stevens.  Here we are refreshed by certainty without fragmentariness, by joyous possibilities without dishonesty.  Here we find a moral and philosophical center through which reality may be repossessed and re-created with each new poetic act.&quot; -- C. Roland Wagner, The Hudson Review\n\n_______________________________________\n\nSee THE COLLECTED POEMS (1971) here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8333407/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8333407/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:80d7c9d3d1c71748460594b2064e63d6486a11c3","amp;dn":"Wallace+Stevens+-+The+Necessary+Angel%3A+Essays+%281951%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80d7c9d3d1c71748460594b2064e63d6486a11c3","infoHashBuffer":{"type":"Buffer","data":[128,215,201,211,209,199,23,72,70,5,148,178,6,78,99,214,72,106,17,195]},"announce":[],"urlList":[]}}