{"title":"Human Reproductive Biology / Edition 4","uid":9680559,"size":66805603,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:81b3b99fa39d5aa05c669063ae6694b9807391ad&amp;dn=Human+Reproductive+Biology+%2F+Edition+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Jenson100","files":-1,"time":1393662667,"description":"\n\nThe fourth edition of Human Reproductive Biology emphasizes the biological and biomedical aspects of human reproduction, explains advances in reproductive science and discusses the choices and concerns of today. Generously illustrated in full color, the text provides current information about human reproductive anatomy and physiology. This expansive text covers the full range of topics in human reproduction, from the biology of male and female systems to conception, pregnancy, labor and birth. It goes on to cover issues in fertility and its control, population growth and family planning, induced abortion and sexually transmitted diseases. This is the ideal book for courses on human reproductive biology, with chapter introductions, sidebars on related topics, chapter summaries and suggestions for further reading.\n\n\n    Beautifully redrawn full-color illustrations complement completely updated material with the latest research results, and clear, logical presentation of topics\n\n    Covers the basic science of reproduction - endocrinology, anatomy, physiology, development, function and senescence of the reproductive system - as well as applied aspects including contraception, infertility and diseases of the reproductive system\n\n\n    New companion website features full-color illustrations as PPT and jpeg files for both professors and students to use for study and presentations\n\nAudience: Ideal for undergraduates taking biology of human reproduction courses. These courses are generally for nonmajors and are usually taken after an introduction to biology course. Students in the health sciences should also find this book useful.\n","torrent":{"xt":"urn:btih:81b3b99fa39d5aa05c669063ae6694b9807391ad","amp;dn":"Human+Reproductive+Biology+%2F+Edition+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81b3b99fa39d5aa05c669063ae6694b9807391ad","infoHashBuffer":{"type":"Buffer","data":[129,179,185,159,163,157,90,160,92,102,144,99,174,102,148,185,128,115,145,173]},"announce":[],"urlList":[]}}