{"title":"Nubiles-Porn - Jillian Janson, Pristine Edge (Final Farewell) HD","uid":13223556,"size":807112193,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:81e59b993001ba2fc2a10941ba01cea162c967a0&amp;dn=Nubiles-Porn+-+Jillian+Janson%2C+Pristine+Edge+%28Final+Farewell%29+HD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"SudoSu","files":1,"time":1452816668,"description":"http://youpornbook.com\r\n\r\n―――――――――――――――――――――――――\r\n ... : Screenshots : ... \r\n―――――――――――――――――――――――――  \nhttp://imgkiss.com/image/tx8bO \nhttp://imgkiss.com/image/txOLW \nhttp://imgkiss.com/image/txVOj \nhttp://imgkiss.com/image/txiuo \nhttp://imgkiss.com/image/tx4A0\r\n\r\nPristine Edge has called in Ryan Ryder and Jillian Janson so that she can tell her students that the threesome affair they've been enjoying needs to come to an end. Although they are disappointed that they won't be able to play with their teacher any longer, Ryan and Jillian talk Pristine into one final romp and she agrees. Pulling Ryan's cock out of his jeans, Jillian and Pristine get down on their knees and work together applying their hands and soft mouths to produce the perfect double blowjob. In between licks and suck the girls work each other's tops off until they are both naked from the top down. When Jillian stands up so that Pristine can pull off her thong, the blonde teacher surprises Jillian by diving in for a brief pussy licking. Of course Jillian wants to return the favor!\r\n\r\nHopping onto her desk, Pristine spreads her legs and invites Jillian in for a bald pussy feast. Jillian is happy to oblige, while Ryan takes advantage of Jillian's exposed bottom to slide his cock up and down her slit until it's covered with her juices and then to push himself home in Jillian's needy twat. Next Jillian makes sure that Pristine gets as much of the D as she wants by taking Ryan's dick in her hand and guiding it right up to Pristine's fuck hole. Ryan is eager to slam himself home, and soon he is buried balls-deep while Pristine goes to town feasting on Jillian's juicy snatch. A stiffie ride in Jillian's landing strip puss is the next order of business while Pristine pays plenty of attention to her student's perky breasts and rock hard nips. The pleasure is so great that Jillian just can't help but squirt her joy all over the place. Moments later, Ryan pulls out just in time to let loose a fountain of jizz that Pristine greedily licks form the tip of his dick.\r\n\r\nMore exclusive porn at:  https://thepiratebay.se/user/SudoSu/","torrent":{"xt":"urn:btih:81e59b993001ba2fc2a10941ba01cea162c967a0","amp;dn":"Nubiles-Porn+-+Jillian+Janson%2C+Pristine+Edge+%28Final+Farewell%29+HD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81e59b993001ba2fc2a10941ba01cea162c967a0","infoHashBuffer":{"type":"Buffer","data":[129,229,155,153,48,1,186,47,194,161,9,65,186,1,206,161,98,201,103,160]},"announce":[],"urlList":[]}}