{"title":"Red Or Dead - David Peace.epub","uid":8874893,"size":1748047,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8232c87e742d112ebf8e23da888cbed034ef4731&amp;dn=Red+Or+Dead+-+David+Peace.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"420weedman","files":1,"time":1378168368,"description":"In 1959, Liverpool Football Club were in the Second Division. Liverpool Football Club had never won the FA Cup. Fifteen seasons later, Liverpool Football Club had won three League titles, two FA Cups and the UEFA Cup. Liverpool Football Club had become the most consistently successful team in England. And the most passionately supported club. Their manager was revered as a god.Destined for immortality. Their manager was Bill Shankly. His job was his life. His life was football. His football a form of socialism. Bill Shankly inspired people. Bill Shankly transformed people. The players and the supporters. His legacy would reveberate through the ages.\n\nIn 1974, Liverpool Football Club and Bill Shankly stood on the verge of even greater success. In England and in Europe. But in 1974, Bill Shankly shocked Liverpool and football. Bill Shankly resigned. Bill Shankly retired.\n\nRed or Dead is the story of the rise of Liverpool Football Club and Bill Shankly. And the story of the retirement of Bill Shankly. Of one man and his work. And of the man after that work. A man in two halves. Home and away. Red or dead.","torrent":{"xt":"urn:btih:8232c87e742d112ebf8e23da888cbed034ef4731","amp;dn":"Red+Or+Dead+-+David+Peace.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8232c87e742d112ebf8e23da888cbed034ef4731","infoHashBuffer":{"type":"Buffer","data":[130,50,200,126,116,45,17,46,191,142,35,218,136,140,190,208,52,239,71,49]},"announce":[],"urlList":[]}}