{"title":"RWBY Grim Eclipse Game","uid":11719491,"size":139420680,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:82c76017c9d7ba4c67ec0cac1764c1e981689575&amp;dn=RWBY+Grim+Eclipse+Game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"ReconVirus","files":41,"time":1424760014,"description":"RWBY: Grim Eclipse; \n\n\nThis is the summary given on the youtube page:\n\nHappy birthday RoosterTeeth!\n\nYo! My name's Jordan, and this here is a game I've put together throughout the past 5 months or so. It could be considered something of a tribute to RoosterTeeth/RWBY/Monty Oum to celebrate their 11th Year Anniversary. It's based off of their series &quot;RWBY&quot; and more specifically the &quot;Red Trailer&quot;, both of which I've linked below alongside the game's installer.\n\nRoosterTeeth has given me so much freaking entertainment over the years that I just had to return the favour. Monty Oum specifically is my idol &amp; hero, as that guy has indirectly taught me so many lessons and made me who I am today. I can't express in words how appreciative I am of everyone over there and the amount of work they put into their content, so I'm showing my appreciation only way I know how - make a game about it, hah.\n\nEssentially this is a survival based action RPG, but more so just a mish-mash of my personal favourites (KH, DMC, FF, Mystic Heroes). You slay creatures known as Beowolves for as long as you can, and unlock new techniques, abilities, and ammunition types along the way.\n\nIt's a simple game, but it's also the first one I've ever finished, so take it with a grain of salt. I'll be the first to say that my ideas outweigh my skills as an artist, which you'll undoubtedly be able to see. I went for enough accuracy to the source material to get the message across and no more. It isn't much, but I think (hope) you guys will enjoy it.\n\nI've tried to make many fan-games in the past and they all ended terribly. This is ironically the first and last fan-game I've actually finished, and it was a hell of a learning experience. I gave myself 5 months to see what I could come up with and threw this together. It's not an ongoing project, nor will there be any future updates, promises, etc. It's simply a short little experience you can sit down and play. Unfortunately the nature of fan-games means that it's extremely difficult (nearly impossible) to make a living off of them, so this one basically starts and stops right here.\n\nUnless I luck out in some way, the next game I pursue will be an original concept without ties to any other series/game/etc. Fan-games have been extremely fun to make the past few years, but I'm just at a point where I literally cannot be making them anymore without starving to death, hah. However, I told myself that I had to finish AT LEAST one, so I made Grim Eclipse.\n\nYou'll see various elements which aren't fleshed out but just &quot;there&quot; such as the party system, items, stats, etc. simply because I wanted to practice making those elements for future endeavours. This is very much a guinea pig for future ideas, but I'd be lying if I said I wasn't itching to make a RWBY game once I saw the series.\n\nAnyway, I would just like RoosterTeeth to know (although I'm sure they've heard it plenty) that they're a very positively influential company, and I can't give them enough respect for what they do. Everyone should go to their site and check out their stuff, and if you already have, then do it again!\n\nIncluded is a general play guide, disclaimer, credits, and the game itself. I recommend reading through the play guide before jumping right into it though, as the game can be quite challenging!\n\nRoosterTeeth: http://roosterteeth.com/home.php\nRed Trailer:\nTwitter:\n\nRWBY Â© 2012-2014, RoosterTeeth Productions, LLC. Â© 2003 - 2014.\n\nRWBY Logo, Music, Characters, and Concept Art are trademarks of RoosterTeeth Productions.\n\nRWBY Grim Eclipse was created by Jordan Scott\n\n\n\n\n~ PC Requirements:\nOperating System: Windows XP / 7 / Vista / 8\nProcessor: Pentium4 2.4GHz, Core2Duo 2.6GHz or better\nMemory: 2 GB for Windows Vista &amp; Windows 7\nHard Disk: 8 GB with additional space required for saved games\nVideo: Nvidia 8800 GT / ATI Radeon HD 4650\nSound Card: DirectX 9.0c Compatible\nDirectX: 9.0c","torrent":{"xt":"urn:btih:82c76017c9d7ba4c67ec0cac1764c1e981689575","amp;dn":"RWBY+Grim+Eclipse+Game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82c76017c9d7ba4c67ec0cac1764c1e981689575","infoHashBuffer":{"type":"Buffer","data":[130,199,96,23,201,215,186,76,103,236,12,172,23,100,193,233,129,104,149,117]},"announce":[],"urlList":[]}}