{"title":"The Last Poets - The Last Poets (1970)","uid":7105442,"size":54904978,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:82d2eb39ce379bfdbea8fe20316e2c4167655df6&amp;dn=The+Last+Poets+-+The+Last+Poets+%281970%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":-1,"time":1331852546,"description":"The Last Poets - The Last Poets\nReleased 1970 on Metrotone\nReissued 2002 on Fuel 2000\n\n1. Run, Nigger\n2. On the Subway\n3. Niggers Are Scared of Revolution\n4. Black Thighs\n5. Gashman\n6. Wake Up, Niggers\n7. New York, New York\n8. Jones Comin' Down\n9. Just Because\n10. Black Wish\n11. When the Revolution Comes\n12. Two Little Boys\n13. Surprises\n\nAlbum review --\n\nQuote:\nReview by Amy Hanson\n\nBrutally honest and beautifully truthful, the Last Poets' eponymous 1970 debut would become one of proto-funk's most seminal sets. The album itself soared to the top of the R&amp;B charts and reached respectably into the pop charts as well -- an astonishing feat for such a politically-charged LP. The album's rise was made especially bittersweet as vocalist Abiodun Oyewole was sent to prison for robbery.\n\nPulling out the primal vocal essences that would later lie just in the background of any great funk song, and bringing them straight to the front, the Last Poets layered street poetry and manifesto over sparse instrumentation and tribal beats. But, in so doing, they created a unique landscape that reflected a pure passion for sound, for words, for the revolution of education. It was a formula to which rap would later owe an enormous debt. From beginning to end, it would be easy to label this album simply spoken word. But it is testament to the brilliance of the Last Poets that it also becomes so much more. This is perhaps best heard in the outstanding opener &quot;Run, Nigger.&quot; As Oyewole laid his poetry across spare percussion, the stage was set for a vocal subtext which allowed poetry to become song as voices became instruments. This opener set the tone for the rest of the album, as the Last Poets utilized the same construction with subtle variations across other gems: &quot;Niggers Are Scared of Revolution,&quot; &quot;New York, New York,&quot; and &quot;When the Revolution Comes.&quot; At no time does The Last Poets falter or fail to please. And perhaps, more importantly, it will always be as vital, alive, and fresh as it was the day it was recorded.","torrent":{"xt":"urn:btih:82d2eb39ce379bfdbea8fe20316e2c4167655df6","amp;dn":"The+Last+Poets+-+The+Last+Poets+%281970%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82d2eb39ce379bfdbea8fe20316e2c4167655df6","infoHashBuffer":{"type":"Buffer","data":[130,210,235,57,206,55,155,253,190,168,254,32,49,110,44,65,103,101,93,246]},"announce":[],"urlList":[]}}