{"title":"Sonny Clark - Cool Struttin'","uid":4305022,"size":139567096,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:82e5a9ae40f7a954d50d8b040cfce929343101a4&amp;dn=Sonny+Clark+-+Cool+Struttin%5C%27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"alekow1","files":12,"time":1216497468,"description":"Recorded in 1958, this legendary date with the still-undersung Sonny Clark in the leader&amp;#039;s chair also featured a young Jackie McLean on alto (playing with a smoother tone than he had before or ever did again), trumpeter Art Farmer, and the legendary rhythm section of bassist Paul Chambers and drummer Philly Joe Jones, both from the Miles Davis band. \nThe set begins with one of the preeminent &quot;swinging medium blues&quot; pieces in jazz history: the title track with its leveraged fours and eights shoved smoothly up against the walking bass of Chambers and the backbeat shuffle of Jones. Clark&amp;#039;s solo, with its grouped fifths and sevenths, is a wonder of both understatement and groove, while Chambers&amp;#039; arco solo turns the blues in on itself. \nWhile there isn&amp;#039;t a weak note on this record, there are some other tracks that stand out, most notably Miles&amp;#039; &quot;Sippin&amp;#039; at Bells,&quot; with its loping Latin rhythm. When McLean takes his solo against a handful of Clark&amp;#039;s shaded minor chords, he sounds as if he may blow it -- he comes out a little quick -- but he recovers nicely and reaches for a handful of Broadway show tunes to counter the minor mood of the piece. He shifts to both Ben Webster and Lester Young before moving through Bird, and finally to McLean himself, riding the margin of the changes to slip just outside enough to add some depth in the middle register. \nThe LP closes with Henderson and VallÃƒÂ©e&amp;#039;s &quot;Deep Night,&quot; the only number in the batch not rooted in the blues. It&amp;#039;s a classic hard bop jamming tune and features wonderful solos by Farmer, who plays weird flatted notes all over the horn against the changes, and McLean, who thinks he&amp;#039;s playing a kind of snake charmer blues in swing tune. \nThis set deserves its reputation for its soul appeal alone. [The CD version includes two bonus tracks: &quot;Royal Flush&quot; and &quot;Lover&quot;]. (AMG)\n\n\n\n1   Cool Struttin&amp;#039; (9:20) \n2   Blue Minor (10:17) \n3   Sippin&amp;#039; At Bells (8:15) \n4   Deep Night (8:45) \n5   Royal Flush (9:00) \n6   Lover (7:00)\n\n\nPiano - Sonny Clark\nBass - Paul Chambers\nSaxophone [Alto] - Jackie McLean \nTrumpet - Art Farmer\nDrums - &quot;Philly&quot; Joe Jones\n\nProducer - Alfred Lion\nRecorded By - Rudy Van Gelder\nRecorded on January 5, 1958.\nTracks 5, 6 do not appear on the original LP.\nLabel: Blue Note\nReleased: 1987\n\nBITRATE: 320\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n\n\nEnjoy,Seed and Share\t\n\n","torrent":{"xt":"urn:btih:82e5a9ae40f7a954d50d8b040cfce929343101a4","amp;dn":"Sonny+Clark+-+Cool+Struttin%5C%27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82e5a9ae40f7a954d50d8b040cfce929343101a4","infoHashBuffer":{"type":"Buffer","data":[130,229,169,174,64,247,169,84,213,13,139,4,12,252,233,41,52,49,1,164]},"announce":[],"urlList":[]}}