{"title":"A Gift from Bob_ How a Street C - James Bowen.epub","uid":15848612,"size":412755,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82fec94ddab4434910dec184f8c93eab5838cf01&amp;dn=A+Gift+from+Bob_+How+a+Street+C+-+James+Bowen.epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Replicant70","files":1,"time":1474135790,"description":"Bob Fever has swept the globe, with A Street Cat Named Bob vaulting its way to #7 on The New York Times bestseller list in its first week on sale. With rights sold to 27 countries around the globe and a top spot on the British bestseller list for more than a year, this book has been a smashing success around the world. As Street Cat Bob and James spend a cold and challenging December on the streets together, James once more draws strength and inspiration from his extraordinary cat―learning important lessons about the true meaning of Christmas along the way.\r\n\r\nFrom the day James rescued a street cat abandoned in the hallway of his sheltered accommodation, they began a friendship which has transformed both their lives and, through the bestselling books A Street Cat Named Bob and The World According to Bob, touched millions around the world.\r\n\r\nIn this new story of their journey together, A Gift from Bob, James looks back at the last Christmas they spent scraping a living on the streets and how Bob helped him through one of his toughest times―providing strength, friendship and inspiration but also teaching him important lessons about the true meaning of Christmas along the way","torrent":{"xt":"urn:btih:82fec94ddab4434910dec184f8c93eab5838cf01","amp;dn":"A+Gift+from+Bob_+How+a+Street+C+-+James+Bowen.epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82fec94ddab4434910dec184f8c93eab5838cf01","infoHashBuffer":{"type":"Buffer","data":[130,254,201,77,218,180,67,73,16,222,193,132,248,201,62,171,88,56,207,1]},"announce":[],"urlList":[]}}