{"title":"12 Years a Slave (2013, 1080p, DTS-HD, NL subs)","uid":9830768,"size":10370573572,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:834a4fe24e03c97f3f1af82b12b12938bcf3fd4f&amp;dn=12+Years+a+Slave+%282013%2C+1080p%2C+DTS-HD%2C+NL+subs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":-1,"time":1395792863,"description":"[Dutch]\nVerenigde Staten\nDrama\n133 minuten\n\ngeregisseerd door Steve McQueen\nmet Chiwetel Ejiofor, Michael Fassbender en Brad Pitt\n\nHet verhaal speelt zich af rond 1850. Solomon Northup (Ejiofor), een ontwikkelde zwarte man met een talent voor muziek, woont met zijn vrouw en kinderen in Saratoga, New York. Op een dag, wanneer zijn gezin de stad uit is, wordt hij benaderd door twee mannen die hem drogeren, vastbinden en naar het Zuiden sturen als slaaf. Niemand luistert naar Solomon wanneer die beweert een vrij man te zijn. Hij probeert wanhopig te ontsnappen maar zijn pogingen worden telkens verijdeld. Hij wordt verkocht aan William Ford, een vriendelijk molenaar die de attente Solomon wel op prijs kan stellen. Ford moet hem echter verkopen aan een wrede meester die hem en de andere slaven onderwerpt aan afschuwelijke wreedheden. Jarenlang droomt Solomon van een terugkeer naar huis. Hij verbergt stukken papier in zijn viool en ontwikkelt een natuurlijke inkt waarmee hij een brief kan schrijven. Maar zelfs al kan hij de brief schrijven zonder betrapt te worden, aan wie moet hij hem dan verzenden? Wie kan hij vertrouwen om de brief af te leveren? En zal hij lang genoeg in leven blijven om gered te worden?\n\n\n[English]\nBased on an incredible true story of one man's fight for survival and freedom. In the pre-Civil War United States, Solomon Northup (Chiwetel Ejiofor), a free black man from upstate New York, is abducted and sold into slavery. Facing cruelty (personified by a malevolent slave owner, portrayed by Michael Fassbender), as well as unexpected kindnesses, Solomon struggles not only to stay alive, but to retain his dignity. In the twelfth year of his unforgettable odyssey, Solomon's chance meeting with a Canadian abolitionist (Brad Pitt) will forever alter his life.","torrent":{"xt":"urn:btih:834a4fe24e03c97f3f1af82b12b12938bcf3fd4f","amp;dn":"12+Years+a+Slave+%282013%2C+1080p%2C+DTS-HD%2C+NL+subs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"834a4fe24e03c97f3f1af82b12b12938bcf3fd4f","infoHashBuffer":{"type":"Buffer","data":[131,74,79,226,78,3,201,127,63,26,248,43,18,177,41,56,188,243,253,79]},"announce":[],"urlList":[]}}