{"title":"Thomas Merton - Passion for Peace: The Social Essays (pdf)","uid":8622210,"size":2847045,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83b2c4dec12002cea4d64ada9750667cacfcee8f&amp;dn=Thomas+Merton+-+Passion+for+Peace%3A+The+Social+Essays+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pharmakate","files":-1,"time":1372406134,"description":"Thomas Merton (William Shannon, ed.) - Passion for Peace: The Social Essays (Crossroad, 1995). \n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\ndescription:\n\nThis book is a series of Thomas Merton's most important writings on peace, racial issues and non-violence. on peace, racial issues, and non-violence.Essentail reading.\n\nFrom Booklist\n\nWilliam H. Shannon, the biographer (Silent Lamp [1992]) of the great American Catholic apostle of nonviolence and racial justice, Thomas Merton, here restores to print Merton's essays on those matters and provides the briefest of context-setting headnotes to each. Introductorily, Shannon notes how much soul searching and courage it took for Merton to speak out against the cold war and its perversions, as he saw them, of society, the economy, language, and religion, at a time when his own Catholic Church was, if not silent about war, liable to cheer on armed American aggression. These particular writings of Merton's are, besides being stirring reminders of the Christian duty to prosecute peace, documents of importance to American history as much as or more than to Christian history. Ray Olson\n\nReview\n\nSkillfully edited by William H. Shannon, Passion For Peace: The Social Essays is a comprehensive volume containing Thomas Merton's principal writings on non-violence, war, and racism. Much of what he wrote between 1961 and 1968 is prophetic and speaks penetratingly to our time thirty years later. Wars and rumors of war are still with us. Justice and love remain a dream. In most of these articles, it's as if Merton is actually writing in the 1990s! He is speaking to us -- reminding us of the essential oneness that roots the equal dignity of all people. Merton's writings on social issues flowed from a deep contemplative vision. Shannon puts each of Merton's essays in context and reveals how this vision developed. We see a side of Merton's character that does not come through in his other books: his passion for peace and the ardor with which he pleaded for it in a world where people so desperately yearn for it. Passion For Peace is a book of testament, vision, and hope. This is yet another legacy Merton left behind for the enlightenment and encouragement of future generations. -- Midwest Book Review\n\n-----------------\n\nA similar collection, The Nonviolent Alternative, is here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8291972&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8291972&lt;/a&gt;","torrent":{"xt":"urn:btih:83b2c4dec12002cea4d64ada9750667cacfcee8f","amp;dn":"Thomas+Merton+-+Passion+for+Peace%3A+The+Social+Essays+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83b2c4dec12002cea4d64ada9750667cacfcee8f","infoHashBuffer":{"type":"Buffer","data":[131,178,196,222,193,32,2,206,164,214,74,218,151,80,102,124,172,252,238,143]},"announce":[],"urlList":[]}}