{"title":"Tara Brach - Radical Self-Acceptance","uid":7246734,"size":29647581,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:83bbce85ccb0e15e4aadf8bbcc19c49a8e28b74a&amp;dn=Tara+Brach+-+Radical+Self-Acceptance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":6,"time":1336323300,"description":"From Amazon's description:\nIn the same tradition as such bestselling authors as Jack Kornfield and Sharon Salzberg, Insight Meditation teacher Tara Brach has cultivated one of the largest and most active Buddhist meditation communities in the Eastern United States. With Radical Self-Acceptance, this gifted guide brings her enthusiasm and depth of experience to a wide new arena of listeners for the first time.\n\n&quot;Imagine what it would be like to be without anxiety about your imperfections&quot;, begins Brach. Employing her skills in two worlds, this clinical psychologist and meditation instructor takes on what she considers to be the most difficult -- and pervasive -- challenge to Westerners today: the suffering caused by our feelings of unworthiness and deficiency. Here, Brach teaches the specific practices we need to become more mindful and compassionate toward the &quot;unforgivable&quot; parts within ourselves -- and how to free ourselves from &quot;the prison of shame and self-aversion&quot;. Practical and supportive, Radical Self-Acceptance marks the debut of one of the most capable new voices today on the marriage between Eastern meditation and Western psychology. --This text refers to an out of print or unavailable edition of this title.\n\nAbout the Author\nTara Brach is the founder and senior teacher of the Insight Meditation Community of Washington, D.C. She is a practicing clinical psychologist, a lay Buddhist priest, and the author of In the Shadow of the Buddha.\n\nFour mp3 files corresponding to four CDs.\nDisk 1: 49 minutes, 16 bit\nDisk 2: 1 hour 2 minutes, 16 bit\nDisk 3: 1 hour, 16 bit\nDisk 4: 41 minutes, 24 bit\n\nAlso included in this torrent:\n- Short text file about this torrent.\n- Cover image\n\nEnjoy!","torrent":{"xt":"urn:btih:83bbce85ccb0e15e4aadf8bbcc19c49a8e28b74a","amp;dn":"Tara+Brach+-+Radical+Self-Acceptance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83bbce85ccb0e15e4aadf8bbcc19c49a8e28b74a","infoHashBuffer":{"type":"Buffer","data":[131,187,206,133,204,176,225,94,74,173,248,187,204,25,196,154,142,40,183,74]},"announce":[],"urlList":[]}}