{"title":"Warhammer.40000.Armageddon.Da.Orks-SKIDROW","uid":15594082,"size":1017214256,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:83f71bde50cdb5b4cacb974e9a99e3f7171edbaf&amp;dn=Warhammer.40000.Armageddon.Da.Orks-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Itanium2","files":2,"time":1471545697,"description":"Warhammer 40,000: Armageddon - Da Orks (c) Matrix Games\r\n\r\n18-08-2016......Release Date - Protection..........SteamCustom\r\nStrategy...........Game Type - Disk(s)....................1 DVD\r\n\r\nRELEASE NOTES\r\n\r\nThe year is 941.M41, and a massive Space Hulk appears in the Armageddon\r\nstar system. It is believed uninhabited, and the citizens of Armageddon\r\nwonder what riches they will discover when salvage companies survey it.\r\nLittle do they know that a huge Ork invasion force is hidden within,\r\nready to bring death and destruction upon the unsuspecting Imperial\r\nworld... The fate of Armageddon hangs in the balance, and your actions\r\nwill determine the outcome.\r\n\r\nAs Ghazghkull Thraka's most trusted Nob, take command of the Ork hordes\r\nand unleash the greatest WAAAGH in history upon the imperial world of\r\nArmageddon. Prove once again that humies is all weak scum that deserve\r\nta get stomped. Make sure that even the Space Marines will not save\r\nthe day, against the great green tide.\r\n\r\nWarhammer 40,000: Armageddon - Da Orks is the second installment in the\r\nseries of wargames about the wars for Armageddon, one of the most\r\niconic conflicts in Warhammer 40,000 universe. In this hex-based, turn-\r\nbased strategy game, players will lead the Orks against the Imperial\r\nforces of the Armageddon Steel Legion and Space Marines from a variety\r\nof Chapters, under a scorching sun, through hostile ash wastes, and in\r\nthe shadows of gigantic Hive Cities.\r\n\r\nThe game features an engaging dynamic campaign which can end with the\r\nhistoric defeat or an epic victory. While advancing through the\r\ncampaign, the player will have the ability to carry over battle-\r\nhardened veterans from scenario to scenario, using their experience and\r\nupgrading their equipment.\r\n\r\nMultiplayer battles can be played on a variety of predesigned or\r\nskirmish maps, on PC or iPad, using Slitherine's award-winning PBEM2\r\nsystem. Players can choose any of the five available factions: Steel\r\nLegion, the Orks, Ultramarines, Salamanders and Blood Angels, with a\r\nhuge variety of units available to each faction.\r\n\r\nOn top all this extensive modding options are available through a\r\npowerful and easy-to-use game editor.\r\n\r\nFeatures\r\n\r\nLarge campaign divided into 3 acts and 18 separate scenarios,\r\nportraying the Second War for Armageddon from the Orks perspective. Any\r\nscenario can also be played individually.\r\n\r\nA bonus tutorial campaign showing Ghazghkull Thraka's rise to power.\r\nFight alongside Ghazghkull Thraka, Mad Dok Grotsnik and other voiced\r\nlegends of the war.\r\n\r\nCarry over battle-hardened veterans from scenario to scenario, using\r\ntheir experience and upgrading their equipment and weaponry.\r\nDetailed combat model with 20 different units stats, custom terrain,\r\ncover and morale effects.\r\n\r\nFight through hostile ash wastes, treacherous volcanic canyons, acid\r\npolluted rivers, dense jungles, the outside and inside of massive Hive\r\ncities.\r\n\r\n400 unit types divided into 7 classes, representing the Orks,\r\nArmageddon Steel Legion, Blood Angels, Ultramarines and Salamanders and\r\neven gigantic Gargants and Titans\r\n\r\n200 weapons, each with their unique stats and graphical effects, with\r\nup to 3 different weapon systems per unit\r\n\r\n10 hand crafted Multiplayer maps, and infinite replay in multiplayer\r\nskirmish mode.\r\n\r\nPowerful and easy-to-use game editor\r\n\r\nINSTALL NOTES\r\n\r\n1. Unpack the release\r\n2. Mount or burn image\r\n3. Install\r\n4. Copy the cracked content from the SKIDROW folder and into the main\r\ninstall folder and overwrite\r\n5. Block the game in your firewall and mark our cracked content as\r\nsecure/trusted in your antivirus program\r\n6. Play the game\r\n7. Support the companies, which software you actually enjoy","torrent":{"xt":"urn:btih:83f71bde50cdb5b4cacb974e9a99e3f7171edbaf","amp;dn":"Warhammer.40000.Armageddon.Da.Orks-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83f71bde50cdb5b4cacb974e9a99e3f7171edbaf","infoHashBuffer":{"type":"Buffer","data":[131,247,27,222,80,205,181,180,202,203,151,78,154,153,227,247,23,30,219,175]},"announce":[],"urlList":[]}}