{"title":"Fundamentals of Nanotechnology - Gabor L. Hornyak et al.","uid":15331423,"size":13556602,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:858bac3cec7d66579cc01f39ea18f9a557238d55&amp;dn=Fundamentals+of+Nanotechnology+-+Gabor+L.+Hornyak+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1468727802,"description":"Fundamentals of Nanotechnology - Gabor L. Hornyak et al. (CRC, 2009).pdf\r\n\r\nISBN 978-1-4200-4804-9\r\n\r\nWINNER 2009 CHOICE AWARD OUTSTANDING ACADEMIC TITLE! Nanotechnology is no longer a subdiscipline of chemistry, engineering, or any other field. It represents the convergence of many fields, and therefore demands a new paradigm for teaching. This textbook is for the next generation of nanotechnologists. It surveys the field’s broad landscape, exploring the physical basics such as nanorheology, nanofluidics, and nanomechanics as well as industrial concerns such as manufacturing, reliability, and safety. The authors then explore the vast range of nanomaterials and systematically outline devices and applications in various industrial sectors.\r\n\r\nThis color text is an ideal companion to Introduction to Nanoscience by the same group of esteemed authors. Both titles are also available as the single volume Introduction to Nanoscience and Nanotechnology\r\n\r\nQualifying instructors who purchase either of these volumes (or the combined set) are given online access to a wealth of instructional materials. These include detailed lecture notes, review summaries, slides, exercises, and more. The authors provide enough material for both one- and two-semester courses","torrent":{"xt":"urn:btih:858bac3cec7d66579cc01f39ea18f9a557238d55","amp;dn":"Fundamentals+of+Nanotechnology+-+Gabor+L.+Hornyak+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"858bac3cec7d66579cc01f39ea18f9a557238d55","infoHashBuffer":{"type":"Buffer","data":[133,139,172,60,236,125,102,87,156,192,31,57,234,24,249,165,87,35,141,85]},"announce":[],"urlList":[]}}