{"title":"Deng Xiaoping: A Revolutionary Life (2015) pdf","uid":11746218,"size":10020335,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:85ef7535151e158dcad16fbff5ec3e7808c9300c&amp;dn=Deng+Xiaoping%3A+A+Revolutionary+Life+%282015%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":1,"time":1426026174,"description":"Deng Xiaoping joined the Chinese Communist movement as a youth and rose in its ranks to become an important lieutenant of Mao's from the 1930s onward. Two years after Mao's death in 1976, Deng became the de facto leader of the Chinese Communist Party and the prime architect of China's post-Mao reforms. Abandoning the Maoist socio-economic policies he had long fervently supported, he set in motion changes that would dramatically transform China's economy, society, and position in the world. Three decades later, we are living with the results. China has become the second largest economy and the workshop of the world. And while it is essentially a market economy (&quot;socialism with Chinese characteristics&quot;), Deng and his successors ensured the continuation of CCP rule by severely repressing the democratic movement and maintaining an iron grip on power. When Deng died at the age of 92 in 1997, he had set China on the path it is following to this day.\n\n Alexander Pantsov and Steven Levine's new biography of Deng Xiaoping does what no other biography has done: based on newly discovered documents, it covers his entire life, from his childhood and student years to the post-Tiananmen era. Thanks to unprecedented access to Russian archives containing massive files on the Chinese Communist Party, the authors present a wealth of new material on Deng dating back to the 1920s. In a long and extraordinary life, Deng navigated one epic crisis after another. Born in 1904, Deng, like many Asian revolutionary leaders, spent part of the 1920s in Paris, where he joined the CCP in its early years. He then studied in the USSR just as Stalin was establishing firm control over the Soviet communist party. He played an increasingly important role in the troubled decades of the 1930s and 1940s that were marked by civil war and the Japanese invasion. He was commissar of a communist-dominated area in the early 1930s, loyal henchman to Mao during the Long March, regional military commander in the anti-Japanese war, and finally a key leader in the 1946-49 revolution. During Mao's quarter century rule, Deng oscillated between the heights and the depths of power. He was purged during the Cultural Revolution, only to reemerge after Mao's death to become China's paramount leader until his own death in 1997.\n\n This objective, balanced, and unprecedentedly rich biography changes our understanding of one of the most important figures in modern history","torrent":{"xt":"urn:btih:85ef7535151e158dcad16fbff5ec3e7808c9300c","amp;dn":"Deng+Xiaoping%3A+A+Revolutionary+Life+%282015%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85ef7535151e158dcad16fbff5ec3e7808c9300c","infoHashBuffer":{"type":"Buffer","data":[133,239,117,53,21,30,21,141,202,209,111,191,245,236,62,120,8,201,48,12]},"announce":[],"urlList":[]}}