{"title":"Robert Spencer - Did Muhammad Exist? (mobi, epub)","uid":7281809,"size":1043148,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86253908a0c084b3a28c570fab47c5a629fb40ca&amp;dn=Robert+Spencer+-+Did+Muhammad+Exist%3F+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":2,"time":1337456364,"description":"Did Muhammad Exist?: An Inquiry into Islam's Obscure Origins \n\nAre jihadists dying for a fiction? Everything you thought you knew about Islam is about to change.\n\nDid Muhammad exist?\n\nIt is a question that few have thought--or dared--to ask. Virtually everyone, Muslim and non-Muslim alike, takes for granted that the prophet of Islam lived and led in seventh-century Arabia.\n\nBut this widely accepted story begins to crumble on close examination, as Robert Spencer shows in his eye-opening new book.\n\nIn his blockbuster bestseller The Truth about Muhammad, Spencer revealed the shocking contents of the earliest Islamic biographical material about the prophet of Islam. Now, in Did Muhammad Exist?, he uncovers that material's surprisingly shaky historical foundations. Spencer meticulously examines historical records, archaeological findings, and pioneering new scholarship to reconstruct what we can know about Muhammad, the Qur'an, and the early days of Islam. The evidence he presents challenges the most fundamental assumptions about Islam's origins.\n\nDid Muhammad Exist? reveals:\n\n* How the earliest biographical material about Muhammad dates from at least 125 years after his reported death \n\n* How six decades passed before the Arabian conquerors--or the people they conquered--even mentioned Muhammad, the Qur'an, or Islam \n\n* The startling evidence that the Qur'an was constructed from existing materials--including pre-Islamic Christian texts \n\n* How even Muslim scholars acknowledge that countless reports of Muhammad's deeds were fabricated \n\n* Why a famous mosque inscription may refer not to Muhammad but, astonishingly, to Jesus \n\n* How the oldest records referring to a man named Muhammad bear little resemblance to the now-standard Islamic account of the life of the prophet \n\n* The many indications that Arabian leaders fashioned Islam for political reasons\n\n* Far from an anti-Islamic polemic, Did Muhammad Exist? is a sober but unflinching look at the origins of one of the world's major religions. While Judaism and Christianity have been subjected to searching historical criticism for more than two centuries, Islam has never received the same treatment on any significant scale.\n\nThe real story of Muhammad and early Islam has long remained in the shadows. Robert Spencer brings it into the light at long last.\n\nAuthor: Robert Spencer\nPublisher: Intercollegiate Studies Institute\nPublication Date: April 23, 2012\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)","torrent":{"xt":"urn:btih:86253908a0c084b3a28c570fab47c5a629fb40ca","amp;dn":"Robert+Spencer+-+Did+Muhammad+Exist%3F+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86253908a0c084b3a28c570fab47c5a629fb40ca","infoHashBuffer":{"type":"Buffer","data":[134,37,57,8,160,192,132,179,162,140,87,15,171,71,197,166,41,251,64,202]},"announce":[],"urlList":[]}}