{"title":"Rome's Gothic Wars- From the Third Century to Alaric by Michael ","uid":11615910,"size":4043674,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:867b22b4a51106714635976d80991399884abb08&amp;dn=Rome%27s+Gothic+Wars-+From+the+Third+Century+to+Alaric+by+Michael+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1417498046,"description":"Late in August 410, Rome was starving, its residents were turning on one another, and, to make matters worse, the Gothic army camped at Rome's gates was restless. The Gothic commander was Alaric, a Roman general and barbarian chieftain. Leading an army that was short of food and potentially mutinous, sacking Rome was his only way forward. The old heart of Rome's empire fell to a conqueror's sword for the first time in eight hundred years. For three days, Alaric's Goths sacked the eternal city. In the words of a contemporary, the mother of the world had been murdered. Alaric's story is the culmination of a long historical journey by which the Goths came to be a part of the Roman world. Whether as friends or foes of the Roman empire, the Goths and their history are entwined with the larger history of Rome in the third and fourth centuries. Rome's Gothic Wars explains how the Goths came into existence on the margins of the Roman world, how different Gothic groups dealt with the enormous power of Rome just beyond their lands, and how, in two traumatic years, thousands of Goths entered the imperial provinces and destroyed the army that was sent to suppress them, leaving the emperor of the eternal city dead on the field of battle. Unlike other histories of the barbarians, Rome's Gothic Wars shows exactly how and why modern historians understand the Goths the way they do and why our understanding is so controversial. Michael Kulikowski is associate professor of history at the University of Tennessee-Knoxville. A recipient of the Solmsen Fellowship at the Institute for Research in the Humanities at the University of Wisconsin, Madison, he is the author of Late Roman Spain and Its Cities, which was awarded an Honorable Mention in Classics and Archaeology from the Association of American University Presses. His scholarly articles have appeared in Early Medieval Europe, Britannia, Phoenix, and Byzantium, and he has appeared on the History Channel's Barbarians series.&quot;","torrent":{"xt":"urn:btih:867b22b4a51106714635976d80991399884abb08","amp;dn":"Rome%27s+Gothic+Wars-+From+the+Third+Century+to+Alaric+by+Michael+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"867b22b4a51106714635976d80991399884abb08","infoHashBuffer":{"type":"Buffer","data":[134,123,34,180,165,17,6,113,70,53,151,109,128,153,19,153,136,74,187,8]},"announce":[],"urlList":[]}}