{"title":"Assessment &amp; Learning Pocketbook, 2E [PDF] [StormRG]","uid":11572127,"size":2306984,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8704b41e15d3f082cd6733ef436364c9b0f8ee11&amp;dn=Assessment+%26amp%3B+Learning+Pocketbook%2C+2E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"krystine","files":-1,"time":1417041357,"description":"Assessment &amp; Learning Pocketbook, 2nd Ed\nAuthor: Ian Smith\nPublished: 2014\nPublisher: Teachers' Pocketbooks\nISBN: 9781906610654\nFormat: Retail PDF\n\n\nGood assessment focuses mainly on improvement and is used to support progress. It helps learners to know how well they have learned and provides feedback on how they can do better; it encourages learners to support and help each other; it builds self-motivation, self-confidence and self-reliance. These are the principles of formative assessment. They lie at the heart of A4L (Assessment for Learning) and they form the core of the Assessment and Learning Pocketbook. The 2nd edition of this Pocketbook begins by explaining the difference - and the tensions - between formative and summative assessment. It contains chapters on sharing learning intentions; tuning into learners' minds; feedback; marking; self- and peer-assessment; and getting started in your own school/classroom. Cartoons, diagrams and visual prompts support the text. The book is rooted in the findings of educational researchers Paul Black and Dylan Wiliam*; its appeal is in turning theory into practice: how do you share success criteria with students so they can recognise their achievements? How do you stimulate the kinds of classroom interaction and discussion that improve the quality of learning? How do you use verbal and written feedback effectively and efficiently to provide learners with information and insight into their own learning? And how can you tap into peer- and self-assessment as a valuable tool for learning? The late Ian Smith ran Learning Unlimited, described by TES Scotland as 'Scotland's most successful teacher development agency'. He worked with over 45,000 Scottish teachers face-to-face and ran training workshops in the US, Hong Kong, China and Russia. * Professor Wiliam kindly provided advice on revisions and amendments to this new edition","torrent":{"xt":"urn:btih:8704b41e15d3f082cd6733ef436364c9b0f8ee11","amp;dn":"Assessment+%26amp%3B+Learning+Pocketbook%2C+2E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8704b41e15d3f082cd6733ef436364c9b0f8ee11","infoHashBuffer":{"type":"Buffer","data":[135,4,180,30,21,211,240,130,205,103,51,239,67,99,100,201,176,248,238,17]},"announce":[],"urlList":[]}}