{"title":"China Beach","uid":5554027,"size":22691689564,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:87377ee4d1c23d8c81b66db469c82ab57ab39389&amp;dn=China+Beach&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":6,"uploader":"sycopathic","files":66,"time":1273629898,"description":"Ok, here's the deal... most of these files were originally provided by barnabooth81: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4065699/CH_NA_BEACH&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4065699/CH_NA_BEACH&lt;/a&gt;\n\nBut, there were several problems w/ this torrent. Episodes were out of order,\nseveral of them waas mislabelled, some had incorrect aspect ratios, one was in MPG format, and they were far larger (~450MB) than required for a 1-hour show.  Especially considering the relatively low quality of the original source.  And worst, there were 7 missing episodes.  These were later put up by Kaycee1357: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4697985&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4697985&lt;/a&gt;\n\nHowever, there were problems with that too.  They were in WMV9 format with  uncompressed audio, making them almost 5x larger than they should have been!  They \nalso were not deinterlaced, causing lines to appear when there was movement in the image.\n\nDespite these issues, I am grateful to them for making this show available.  It's very hard to find and I searched for it for a long time.  But because it's not available from any other source that I know of, I felt the need to correct these issues and provide the best possible collection.\n\nSo I fixed all the processing problems.  I also made sure each episode has the right title.  When the name of the episode didn't show up after the opening theme song, I checked the credits for guest stars and looked them up on imdb.com.  That tells u what episode the guest star was in.  I also searched for audio sync problems and found 1 minor issue that I couldn't quite get right.  And I trimmed the theme song off the beginning of most episodes.  It makes the files smaller and I don't like sitting thru it every time I watch an episode.  But I did leave it on the 1st episode of each season, so u can still see it.\n\nThe original files had this technical info: \nRecorded off History Channel in 2000, 1st generation VHS\nTransferred to DVD on Toshiba DVD recorder converted to mpeg with Ulead video studio converted to wmv9 avi with TMPGEnc4XP\n\nFor my version of these files, I used VirtualDubMod 1.5.10, with Xvid compression and a video bitrate of 910.  The audio is CBR MP3 at 128k.  The sampling rate is either 48kHz or 44.1kHz, depending on the original file.\n\n\nI also found this in the comments on one of these torrents and thought it was interesting:\n\nChina Beach was not released on DVD due to licensing issues for the soundtrack. Since the music is such an intrinsic part of the show, no one felt it was worth going back and re-doing the music. Also, the studio probably feels there is not enough demand to warrant trying to renegotiate licensing for the music (synchronization rights).","torrent":{"xt":"urn:btih:87377ee4d1c23d8c81b66db469c82ab57ab39389","amp;dn":"China+Beach","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87377ee4d1c23d8c81b66db469c82ab57ab39389","infoHashBuffer":{"type":"Buffer","data":[135,55,126,228,209,194,61,140,129,182,109,180,105,200,42,181,122,179,147,137]},"announce":[],"urlList":[]}}