{"title":"Norton Ghost v14.0+Genuine Serial [ kentuckykiid ]","uid":4819091,"size":93611345,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:87adf0a86c5ce3fd6ca4e054f0f04687f7979ddd&amp;dn=Norton+Ghost+v14.0%2BGenuine+Serial+%5B+kentuckykiid+%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"kentucky-kid","files":1,"time":1238668851,"description":"*****     ******                 |        \n*****    ******                 |\n*****   ******                   |       \n*****  ******                   |        \n************                     |       \n***********                     |         \n***********                      |       \n***********                     |        \n***********                      |\n***** ******                    |\n*****  ******                    |\n*****   ******                  |\n*****    ******                  |\n*****     ******                |\n*****      ****** e n t u c k y  |  \n                                |\n*****     ******                 |\n*****    ******                 |\n*****   ******                   |\n*****  ******                   |\n************                     |\n***********                     |\n***********                      |\n***********                     |\n***********                      |\n***** ******                    |\n*****  ******                    |\n*****   ******                  |\n*****    ******                  |\n*****     ******                |\n*****      ****** i d            |\n\n***********************************************************************************\n\nNorton Ghost v14.0 + Serial\n\nNorton Ghost provides advanced backup and recovery for your computer. Protect your documents, financial records, presentations, photos, music, videos, historical documents, or any other kinds of data you keep on your computer by making a backup of your computer's entire hard disk. Or, limit your backup to include only those files and folders that mean the most to you.\n\nYou can schedule backups to capture your changes automatically as you work from day to day. Or start a backup manually at any time. You can also easily configure Norton Ghost to run a backup in response to specific events. For example, a backup can be started when a particular application is started, or when a specified amount of new data has been added to the drive.\n\nWhen you experience a problem with your computer, you can restore a file, folder, or an entire drive, to return your computer to a previous, working state with the operating system, applications, and data files intact. Or if you accidently delete a personal file, get it back with a few simple steps.\n\nUsing easy-to-follow wizards, set up fast and reliable backups that run while you continue to work. Or schedule your backups to run after hours when you are no longer using your computer.\n\nWhen disaster strikes, Norton Ghost helps you recover your computer from the effects of many common problems, including\nÃ‚Â· Virus attacks: Damage might be done before a virus is quarantined.\nÃ‚Â· Faulty software installations: Some software can negatively affect your computer's performance, slowing it down to the point that opening programs or documents can require too much time. But once installed, uninstalling a product might not recover unintentional damage done during an install.\nÃ‚Â· Hard drive failure: Data can become corrupted on your system drive (typically C), making it impossible to start your operating system\nÃ‚Â· Files accidentally deleted or overwritten: Accidental deletion of files is common, but often costly.\nÃ‚Â· Corrupted files: Individual files and folders can become corrupted by viruses, or when a program used to modify them encounters an error\n\n***********************************************************************************\n\nScanned with NOD32 Antivirus  , CLEAN\n\nMore of my uploads : http://thepiratebay.se/user/kentuckyyykiiid/\n\nShould you have any questions or problems regarding my torrent , do leave a comment and i'll try my best to attend to you ASAP\n\nAfter your download , just leave a comment by saying a &quot;thank you&quot; will do , just to encourage me (:\n\nSeed &amp; enjoy (:\n\n***********************************************************************************","torrent":{"xt":"urn:btih:87adf0a86c5ce3fd6ca4e054f0f04687f7979ddd","amp;dn":"Norton+Ghost+v14.0%2BGenuine+Serial+%5B+kentuckykiid+%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87adf0a86c5ce3fd6ca4e054f0f04687f7979ddd","infoHashBuffer":{"type":"Buffer","data":[135,173,240,168,108,92,227,253,108,164,224,84,240,240,70,135,247,151,157,221]},"announce":[],"urlList":[]}}