{"title":"Afrikakorps (History Ebook).pdf","uid":11325088,"size":35593614,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:880276f0f397ef1fdc2815add49ff227cc2d0d56&amp;dn=Afrikakorps+%28History+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1414622239,"description":"pdf / English / 1990 by Time-Life Books / 3rd Reich Series / 192 pages / 33.9 MB\n\nThis book is an excellent starting point to learn about the battles in North Africa in 1941-1942. The book covers the battles in North Africa during the time that Rommel commanded German and Italian forces in that theatre in World War II. The book begins with Rommel's acceptance of a command in Africa in February 1941 and ends in November 1942 when Rommel's armies are outnumbered and overwhelmed near El Alamein.\n\nThe story is primarily told from the divisional level, interspersed with interesting facts about the major figures involved, of whom the focus is on Rommel. (E.g., Rommel, by August 1942, had survived longer (over 18 months by then) than any other field officer over age 40 in Africa in the Wehrmacht, despite his constant, and dangerous, trips to the front; and during the campaigns in Africa became in June 1942, at age 50, the youngest German Field Marshal ever.) The strategy and tactics of the commanders on both sides is well covered, as well as the hardships endured by the Germans and Italians, whose supply lines were subject to frequent disruption by the Allies.\n\nThe photos are extremely well selected, including a couple of rare shots of Rommel in field shorts. There are even a few full-color photos, including an amazing overhead shot of a Me 109 fighter in full camouflage that blends in perfectly with the landscape below. The maps are in color, numerous, and also well done.\n\nThe book even includes an interesting section on the 88-mm Flak batteries effectively used by Rommel, with clear descriptions on how these weapons operated and were used in desert conditions as an extremely effective anti-tank weapon.\n\nAmazon","torrent":{"xt":"urn:btih:880276f0f397ef1fdc2815add49ff227cc2d0d56","amp;dn":"Afrikakorps+%28History+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"880276f0f397ef1fdc2815add49ff227cc2d0d56","infoHashBuffer":{"type":"Buffer","data":[136,2,118,240,243,151,239,31,220,40,21,173,212,159,242,39,204,45,13,86]},"announce":[],"urlList":[]}}