{"title":"Patricia Briggs - Mercy Thompson Book 7 Frost Burned Unabridged","uid":8670589,"size":579699889,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:88489d049e403850c02fa125c10d53a7ee25bdc0&amp;dn=Patricia+Briggs+-+Mercy+Thompson+Book+7+Frost+Burned+Unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"katelynor","files":2,"time":1373489777,"description":"Mercy Thompson returns in the seventh novel in the number-one New York Times best-selling series.\n\nMercy Thompson's life has undergone a seismic change. Becoming the mate of Adam Hauptman - the charismatic Alpha of the local werewolf pack - has made her a stepmother to his daughter, Jesse, a relationship that brings moments of blissful normalcy to Mercy's life. But on the edges of humanity, what passes for a minor mishap on an ordinary day can turn into so much more....\n\nAfter an accident in bumper-to-bumper traffic, Mercy and Jesse can't reach Adam - or anyone else in the pack for that matter. They've all been abducted.\n\nThrough their mating bond, all Mercy knows is that Adam is angry and in pain. With the werewolves fighting a political battle to gain acceptance from the public, Mercy fears Adam's disappearance may be related - and that he and the pack are in serious danger. Outclassed and on her own, Mercy may be forced to seek assistance from any ally she can get, no matter how unlikely.\n\n\n\nFrom my first conversions from audible aa format to mp3 - \nConverted using SoundTaxi 128kbps - \nI checked the beginning and end of each file to make sure the conversion was complete - please let me know if there are any issues.\n","torrent":{"xt":"urn:btih:88489d049e403850c02fa125c10d53a7ee25bdc0","amp;dn":"Patricia+Briggs+-+Mercy+Thompson+Book+7+Frost+Burned+Unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88489d049e403850c02fa125c10d53a7ee25bdc0","infoHashBuffer":{"type":"Buffer","data":[136,72,157,4,158,64,56,80,192,47,161,37,193,13,83,167,238,37,189,192]},"announce":[],"urlList":[]}}