{"title":"Saga (001 - 014) (2012 - ongoing) (- Nem -)","uid":8977216,"size":354750398,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:888fabc6777e53af75d16619becd9f653c08ac98&amp;dn=Saga+%28001+-+014%29+%282012+-+ongoing%29+%28-+Nem+-%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"nemesis43","files":14,"time":1380473576,"description":"Saga is an epic space opera/fantasy comic book series written by Brian K. Vaughan and illustrated by Fiona Staples, published monthly by Image Comics. The series is heavily influenced by Star Wars, and is based on ideas Vaughan conceived both as a child and as a parent. It depicts two lovers from long-warring extraterrestrial races, Alana and Marko, fleeing authorities from both sides of a galactic war as they struggle to care for their newborn daughter, Hazel, who occasionally narrates the series.\n\nThe comic was described in solicitations as &quot;Star Wars meets A Game of Thrones,&quot; and by critics as being evocative of both science fiction and fantasy epics such as The Lord of the Rings and classic works like Romeo &amp; Juliet.It is Vaughan's first creator-owned work to be published through Image Comics, and represents the first time he employs narration in his comics writing.\n\nThe first issue of Saga was published on March 14, 2012, to positive reviews and a sold-out first printing. The first six-issue story arc was widely acclaimed, and was published in trade paperback form in October 2012. The series won three Eisner Awards in 2013, and the first trade paperback collection won the 2013 Hugo Award for Best Graphic Story.","torrent":{"xt":"urn:btih:888fabc6777e53af75d16619becd9f653c08ac98","amp;dn":"Saga+%28001+-+014%29+%282012+-+ongoing%29+%28-+Nem+-%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"888fabc6777e53af75d16619becd9f653c08ac98","infoHashBuffer":{"type":"Buffer","data":[136,143,171,198,119,126,83,175,117,209,102,25,190,205,159,101,60,8,172,152]},"announce":[],"urlList":[]}}