{"title":"N.T. Wright - Galatians, Thessalonians for Everyone (pdf)","uid":8265548,"size":2080545,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:88c7fcfc4d549a77df03cff0ea66184254bcfb02&amp;dn=N.T.+Wright+-+Galatians%2C+Thessalonians+for+Everyone+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pharmakate","files":-1,"time":1363485121,"description":"N. T. Wright - Paul for Everyone: Galatians and Thessalonians (Westminster John Knox Press, 2004). 177 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nThirteenth in the series New Testament for Everyone; click my username to find other volumes in the series. Soon the whole series will be posted on tpb.\n\nBrief commentary on Paul's Letters to Galatians and the two Letters to the Thessalonians.\n\nTom Wright's eye-opening comments on these letters are combined, passage-by-passage, with his fresh and inviting new translation of the Bible text. Making use of his true scholar's understanding, yet writing in an approachable and anecdotal style, Wright captures the tension and excitement of the time as the letters seek to assert Paul's authority and his teaching against other influences.Tom Wright has undertaken a tremendous task: to provide guides to all the books of the New Testament, and to include in them his own translation of the entire text. Each short passage is followed by a highly readable discussion, with background information, useful explanations and suggestions, and thoughts as to how the text can be relevant to our lives today. A glossary is included at the back of the book. The series is suitable for group study, personal study, or daily devotions.\n\nAbout the Author\n\nN.T. (Tom) Wright is the Bishop of Durham in the Church of England. He is a prolific author and noted New Testament scholar, and was named by Christianity Today in 1999 as one of the world's top 5 new theologians. He has written over thirty books, both at the scholarly level (including Jesus and the Victory of God, The Resurrection of the Son of God, and The Meaning of Jesus) and for a popular audience (including The Meal Jesus Gave Us (WJK) and Who Was Jesus?).","torrent":{"xt":"urn:btih:88c7fcfc4d549a77df03cff0ea66184254bcfb02","amp;dn":"N.T.+Wright+-+Galatians%2C+Thessalonians+for+Everyone+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88c7fcfc4d549a77df03cff0ea66184254bcfb02","infoHashBuffer":{"type":"Buffer","data":[136,199,252,252,77,84,154,119,223,3,207,240,234,102,24,66,84,188,251,2]},"announce":[],"urlList":[]}}