{"title":"The Blacklist Complete Season 1","uid":9299094,"size":2762608978,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:88d5a59ac756749b70070e581606eee3c1dc34b2&amp;dn=The+Blacklist+Complete+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"lovinit13","files":10,"time":1386213308,"description":"Season 1 Episode 1 to 10. PLEASE SEED and Comment :)\n\nThe Blacklist is an American drama series that premiered on NBC on September 23, 2013. It stars James Spader, Megan Boone, and Harry Lennix. The pilot episode was written by Jon Bokenkamp and directed by Joe Carnahan. Executive producers for the series include Bokenkamp, John Eisendrath, and John Davis for Sony Pictures Television and Davis Entertainment. On October 4, 2013, NBC gave a back-nine-order, filling out the series' first season.\n\nRaymond &quot;Red&quot; Reddington, one of the FBI's most wanted fugitives, surrenders at FBI Headquarters in Washington, D.C. He claims the FBI and he have similar interests in getting rid of dangerous criminals and terrorists. Reddington will cooperate only with Elizabeth Keen, a rookie FBI profiler. Keen questions Reddington's sudden interest in her, but Reddington will only reveal that she is very special. After the FBI uses Reddington's information to locate a terrorist, Reddington reveals that this terrorist is only the first of many criminals that he will help them neutralize. Over the course of his own criminal career, he has made a list of global criminals who he believes are truly dangerous to society, most of whom are unknown to the FBI. Reddington calls it &quot;The Blacklist&quot;.","torrent":{"xt":"urn:btih:88d5a59ac756749b70070e581606eee3c1dc34b2","amp;dn":"The+Blacklist+Complete+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88d5a59ac756749b70070e581606eee3c1dc34b2","infoHashBuffer":{"type":"Buffer","data":[136,213,165,154,199,86,116,155,112,7,14,88,22,6,238,227,193,220,52,178]},"announce":[],"urlList":[]}}