{"title":"Nosferatu Phantom der Nacht (eng subs) [1979] Werner Herzog","uid":6364525,"size":1311361391,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:89066d05c0aa1a3f6d1b2d88ae275a6afe92f64d&amp;dn=Nosferatu+Phantom+der+Nacht+%28eng+subs%29+%5B1979%5D+Werner+Herzog&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1304459201,"description":" &lt;a href=&quot;http://bayimg.com/dAhnkAaDM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/dAhnkAaDM&lt;/a&gt;\n\nNosferatu: Phantom der Nacht (1979)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0079641/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0079641/&lt;/a&gt;\n\nNosferatu the Vampyre (Ger. Nosferatu: Phantom der Nacht, Eng. Nosferatu: Phantom of the Night) is a 1979 West German vampire horror film, set primarily in nineteenth-century Wismar, Germany and Transylvania, Romania. The film was conceived as a stylistic remake of the 1922 German Dracula adaptation, Nosferatu, eine Symphonie des Grauens. Written and directed by Werner Herzog, Nosferatu the Vampyre stars Klaus Kinski as Count Dracula, Isabelle Adjani as Lucy Harker and Bruno Ganz as Jonathan Harker. The film also features French artist-writer Roland Topor as Renfield.\n\n Klaus Kinski ...  Count Dracula \n Isabelle Adjani ...  Lucy Harker \n Bruno Ganz ...  Jonathan Harker \n Roland Topor ...  Renfield \n Walter Ladengast ...  Dr. Van Helsing \n Dan van Husen ...  Warden \n Jan Groth ...  Harbormaster \n Carsten Bodinus ...  Schrader \n Martje Grohmann ...  Mina \n Rijk de Gooyer ...  Town official (as Ryk de Gooyer) \n Clemens Scheitz ...  Clerk \n Lo van Hensbergen   \n John Leddy ...  Coachman \n Margiet van Hartingsveld ...  Vrouw \n Tim Beekman ...  Coffinbearer \n\nHerzog's production of Nosferatu the Vampyre was very well received by critics but only warmly by filmgoers, enjoying a comfortable degree of commercial success. The film also marks the second of five legendary collaborations between director Werner Herzog and actor Klaus Kinski, immediately followed by 1979's Woyzeck.\n\nAn almost completely unrelated sequel, Vampire in Venice, was released in 1988 by director Augusto Caminito, with only Klaus Kinski returning to reprise his loosely connected role.\n\nWhile Nosferatu the Vampyre's basic story is derived from Bram Stoker's novel Dracula, director Werner Herzog made the 1979 film primarily as an homage remake of F. W. Murnau's seminal silent film, Nosferatu, eine Symphonie des Grauens (1922), which differs somewhat from Stoker's original work. The makers of the earlier film could not obtain the rights for a film adaptation of Dracula, so they changed a number of minor details and character names in an unsuccessful attempt to avoid copyright infringement on the intellectual property owned (at the time) by Stoker's widow. A lawsuit was filed, resulting in an order for the destruction of all prints of the film. Fortunately, some prints survived, and were restored after Florence Stoker had died and the copyright had expired.\n\nHerzog considered Murnau's Nosferatu to be the greatest film ever to come out of Germany, and was keen to make his own version of the film, with the versatile Klaus Kinski in the leading role. In 1979, by which time the copyright for Dracula had entered the public domain, Herzog proceeded with his updated version of the classic German film, which could now include the original character names. Strangely, however, Jonathan Harker's wife was named 'Lucy Harker', even though her name was Mina in the original novel, and a woman named 'Lucy' was a friend of Mina's. In Herzog's production, the reverse is true.\n\nNosferatu the Vampyre was co-produced by Werner Herzog Filmproduktion, Gaumont and ZDF. As was common for German films during the 1970s, Nosferatu the Vampyre was filmed on a minimal budget, and with a crew of just 16 people. Herzog could not film in Wismar, where the original Murnau film was shot, so he relocated production to Delft, the Netherlands. Parts of the film were shot in nearby Schiedam, after Delft authorities refused to allow Herzog to release 11,000 rats for a scene in the film. Dracula's home is represented by locations in Czechoslovakia.\n\nAt the request of distributor 20th Century Fox, Herzog produced two versions of the movie simultaneously, to appeal to western audiences. Scenes with dialogue were filmed twice, in German and in English, meaning that the actor's own voices (as opposed to dubbed dialogue by voice actors) could be included in the English version of the film. However, many consider the performances in the German language version to be superior, as Kinski and Ganz could act more confidently in their native language.\n\nMusic for the film was performed by the German group Popol Vuh, who have collaborated with Herzog on numerous projects.\n\nHerzog's production maintained an element of horror, with numerous deaths and a grim outlook, but it features a more expanded plot than many Dracula productions, with a greater emphasis on emotion and the vampire's tragic loneliness.[6] Graf Orlok (now reverted to Count Dracula) is still a ghastly figure, but he was given a greater sense of pathos; weary, unloved, and doomed to immortality.\n\nKlaus Kinski's Dracula make-up, with black costume, bald head, rat-like teeth and long fingernails, is a suitable imitation of Max Schreck's makeup in the 1922 original. A number of shots in the film are faithful recreations of iconic shots from Murnau's original film, some almost perfectly identical to their counterparts, but this was done as homage rather than imitation.\n\nThe film was released as Nosferatu: Phantom der Nacht in the German language edition and Nosferatu the Vampyre in English language edition. It was a critical success, receiving a Rotten Tomatoes rating of 96%. It is considered by many to be a faithful homage to Murnau's original film, significantly updating the original material, and avoiding the danger of being overly derivative.\n\n\nAcademy of Science Fiction, Fantasy &amp; Horror Films, USA \n1980  Nominated Saturn Award Best Costumes Gisela Storch \n1980  Nominated Saturn Award Best Foreign Film \n\nBerlin International Film Festival \n1979  Won Silver Berlin Bear Outstanding Single Achievement Henning von Gierke For the production design. \n1979   Nominated Golden Berlin Bear Werner Herzog  \n\nCartagena Film Festival \n1980  Won Golden Pelican Best Actor Klaus Kinski \n \nGerman Film Awards \n1979  Won Film Award in Gold Outstanding Individual Achievement: Actor Klaus Kinski  \n\nSant Jordi Awards \n1980  Won Sant Jordi Best Performance in a Foreign Film (Mejor InterpretaciÃƒÂ³n en PelÃƒÂ­cula Extranjera) Klaus Kinski Also for Woyzeck (1979).\n \n","torrent":{"xt":"urn:btih:89066d05c0aa1a3f6d1b2d88ae275a6afe92f64d","amp;dn":"Nosferatu+Phantom+der+Nacht+%28eng+subs%29+%5B1979%5D+Werner+Herzog","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89066d05c0aa1a3f6d1b2d88ae275a6afe92f64d","infoHashBuffer":{"type":"Buffer","data":[137,6,109,5,192,170,26,63,109,27,45,136,174,39,90,106,254,146,246,77]},"announce":[],"urlList":[]}}