{"title":"Larry Niven - Book 3 - Ringworld's Throne","uid":4303187,"size":332179022,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:891cb75437c70223a175f441eca55001bee1e4af&amp;dn=Larry+Niven+-+Book+3+-+Ringworld%5C%27s+Throne&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Ralhsa","files":33,"time":1216413321,"description":"From Publishers Weekly\nAn honored SF writer returns to his best-known creation: the artificial world, built far from Earth by aliens over a half million years ago, in the form of a ring 600 million miles in diameter, hosting an astonishing multitude of inhabitants and cultures. This third fictional voyage to the Ringworld (after Ringworld, 1970, which won both the Hugo and the Nebula for best SF novel of that year, and Ringworld Engineers, 1980) offers two stories crowded into one. A motley array of hominid inhabitants are seeking to defeat a plague of vampires. Meanwhile, returning hero Louis Wu is battling what effectively is a plague of Protectors (superbeings common to many Niven novels) whose rivalries threaten Ringworld&amp;#039;s existence. The battle against the vampires is the more exciting of the two stories, filled with action, scenes of the Ringworld and explorations of ritualistic interspecies sex. Wu&amp;#039;s pursuit of the Protectors displays Niven&amp;#039;s deft hand at portraying aliens, but the dialogue that fills in the backstory slows the narrative. Niven still ranks near the top of the SF field, but this outing is likely to satisfy determined Ringworld fans more than other readers.","torrent":{"xt":"urn:btih:891cb75437c70223a175f441eca55001bee1e4af","amp;dn":"Larry+Niven+-+Book+3+-+Ringworld%5C%27s+Throne","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"891cb75437c70223a175f441eca55001bee1e4af","infoHashBuffer":{"type":"Buffer","data":[137,28,183,84,55,199,2,35,161,117,244,65,236,165,80,1,190,225,228,175]},"announce":[],"urlList":[]}}