{"title":"Blitzen Trapper - VII [2013][EAC,log,cue. FLAC]","uid":8960150,"size":304603234,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:89326b1b044ca03904ad3a962f4b42b3dba59c7a&amp;dn=Blitzen+Trapper+-+VII+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"dickspic","files":15,"time":1380086321,"description":"Artist:Blitzen Trapper\nRelease:VII\nReleased: 2013\nLabel: Vagrant\nCatalog#: VR4119\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:indie,pop,rock,alternative.country,americana\n\n01. Feel The Chill\n02. Shine On\n03. Ever Loved Once\n04. Thirsty Man\n05. Valley of Death\n06. Oregon Geography\n07. Neck Tatts, Cadillacs\n08. Earth (Fever Called Love)\n09. Drive On Up\n10. Heart Attack\n11. Faces Of You\n12. Don't Be A Stranger\n\nVII opens with &quot;Feel The Chill,&quot; a southern adventure complete with a woman in her underwear, deer hunting, and of course drowning at the local bar. Earley takes us down a crooked bend so dark and gloomy you can smell the heat and feel the humidity oppress you. &quot;Each song starts from a small place, a headwater-like remembrance and then widens into a song. For instance, that old wreck of a shack buried in evergreen and murky darkness at the bend in the road up on Jackson Hill where we used to drink, never failed to give me a chill driving by in the old Impala for it's implacable mystery,&quot; Earley notes.\n\nTracks like &quot;Thirsty Man&quot; speak of love in a Dylan-esque fashion where Earley reveals &quot;love like rain falls in the wasteland and slips thru the fingers - for love is a thing that cannot be held, only felt and released&quot;. &quot;Drive On Up&quot; is a soulful, almost bluesy rendition of small town tales of quirkiness. &quot;It seems you're always driving on up to something.&quot; Earley amuses, &quot;into the mountains to see a girlfriend above the reservoir where she lives in a single wide with her mom and a cougar stalks us at fifty yards through the brush, she says to bang sticks but never look it in the eye.&quot;\n\nVII moves effortlessly from track to track, allowing Earley to paint the colorful pictures that play in our head while singing along. &quot;...there are those songs I keep writing over and over again, &quot;Ever Loved Once&quot; with all its regrets and tragic lost love, &quot;Don't be a Stranger&quot; its hopeful cousin but they all still point to the same worn out place in the heart of old E. Earley. And hey, we all have that place, that worn spot on the heart like the chew canister circle on the back pocket of blue jeans, or that one shred in the green felt of the table where you ground the stick in too hard... May these songs minister in ways mysterious and eternal, or at least maybe make you shake a hip.&quot;","torrent":{"xt":"urn:btih:89326b1b044ca03904ad3a962f4b42b3dba59c7a","amp;dn":"Blitzen+Trapper+-+VII+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89326b1b044ca03904ad3a962f4b42b3dba59c7a","infoHashBuffer":{"type":"Buffer","data":[137,50,107,27,4,76,160,57,4,173,58,150,47,75,66,179,219,165,156,122]},"announce":[],"urlList":[]}}