{"title":"Problems_in_Alternating_Current_Machinery_Lyon_edited.pdf","uid":10647369,"size":11999774,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:894c80230e8d47d324efcad155e15d57d51e455b&amp;dn=Problems_in_Alternating_Current_Machinery_Lyon_edited.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"thilanga123","files":1,"time":1406563280,"description":"These problems chiefly concern the theory of the operation of\nalternating current machinery, and are such as we give to the\nfourth year students in electrical engineering in this subject.\nIn each chapter the problems of a similar nature are grouped\ntogether, and those of each group are then arranged in the\napproximate order of their difficulty. The groups in each chapter\nfollow each other in as logical an order as possible, both from point\nof difficulty and the presentation of the subject.\nIn order that this collection of problems may be useful among\ndifferent classes of students a large variety has been included,\nranging from the very simple to those of considerable difficulty.\nWherever it is essential the data have been taken from actual\napparatus. This was possible through the courtesy of two of\nthe large manufacturing companies. In some of the problems\nso few data are given that approximate methods of solution\nmust be used, but care has been taken to so state them that\nthe errors thus introduced need not be large. This lack of data\nis frequently met in practice.\nIt has been thought best not to give introductory paragraphs\nfor each chapter as was done in the preceding volume of problems\ninasmuch as they would have to be of considerable length\nto be of much value.\nThe answers to the problems will probably be ready for\npublication in the fall of 1914. They will be available to all\nbut undergraduate students at a nominal price. Undergraduate\nstudents can obta:in them only on the recommendation of their\ninstructors.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY,\n\nWALDO v. LYON. \n\n","torrent":{"xt":"urn:btih:894c80230e8d47d324efcad155e15d57d51e455b","amp;dn":"Problems_in_Alternating_Current_Machinery_Lyon_edited.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"894c80230e8d47d324efcad155e15d57d51e455b","infoHashBuffer":{"type":"Buffer","data":[137,76,128,35,14,141,71,211,36,239,202,209,85,225,93,87,213,30,69,91]},"announce":[],"urlList":[]}}