{"title":"Soda Stereo - Soda Stereo (1984) WMA320","uid":6112370,"size":87200652,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8a8fc83c9b9b40d86a4292511634c4cd6354c0a5&amp;dn=Soda+Stereo+-+Soda+Stereo+%281984%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1295408005,"description":"El video-clip &quot;DietÃƒÂ©tico&quot; fue difundido por el programa MÃƒÂºsica Total de Canal 9 y tuvo un impacto considerable.[15] Poco despuÃƒÂ©s, en la segunda mitad de 1984, la banda grabÃƒÂ³ su primer ÃƒÂ¡lbum, Soda Stereo, con la producciÃƒÂ³n de Federico Moura, vocalista de Virus, quien habÃƒÂ­a establecido una estrecha relaciÃƒÂ³n artÃƒÂ­stica con Cerati que se expresÃƒÂ³ en el acercamiento entre ambas bandas. La grabaciÃƒÂ³n se realizÃƒÂ³ en los obsoletos estudios de CBS en la calle Paraguay y si bien el resultado obtenido fue un sonido mÃƒÂ¡s frÃƒÂ­o que el de las presentaciones en vivo, los mÃƒÂºsicos quedaron conformes. El trÃƒÂ­o fue acompaÃƒÂ±ado por Daniel Melero en teclados (autor de &quot;TrÃƒÂ¡tame suavemente&quot;) y Gonzo Palacios en saxo, con la categorÃƒÂ­a de &quot;mÃƒÂºsicos invitados&quot;, una prÃƒÂ¡ctica que adoptarÃƒÂ­an en lo sucesivo y que en algunos casos resultaron ser verdaderos miembros de la banda, denominados por los fans y los medios con el tÃƒÂ­tulo de Ã‚Â«cuarto SodaÃ‚Â».[17] [23]\n\nLa presentaciÃƒÂ³n oficial del ÃƒÂ¡lbum se realizÃƒÂ³ el 1 de octubre y fue organizada por Ares como si se tratara de un espectÃƒÂ¡culo, algo que nunca se habÃƒÂ­a hecho en la Argentina hasta entonces. El lugar elegido fue un local cÃƒÂ©ntrico de comida rÃƒÂ¡pida de la cadena Pumper Nic (Suipacha entre Corrientes y Lavalle), la mÃƒÂ¡s popular entre los jÃƒÂ³venes argentinos de los 80, y se proyectÃƒÂ³ el video-clip.[17] La repercusiÃƒÂ³n en la prensa fue buena, aunque momentÃƒÂ¡nea. Al dÃƒÂ­a siguiente el diario ClarÃƒÂ­n publicaba las siguientes declaraciones de la banda:\n\nSomos un conjunto dietÃƒÂ©tico, buscando el paraÃƒÂ­so estÃƒÂ©tico, Nuestra mÃƒÂºsica es diÃƒÂ©tetica. Hace adelgazar comiendo, pero ante cualquier duda consulte a su mÃƒÂ©dico. Tratamos de mantener los cuerpos sanos y las mentes desaceleradas.[12]\nLa creciente adhesiÃƒÂ³n del pÃƒÂºblico se fue manifestando en su actuaciÃƒÂ³n en escenarios cada vez mÃƒÂ¡s amplios: primero La Esquina del Sol en Palermo; el Recital de Los Lagos (1 y 2 de diciembre), su primer escenario multitudinario, junto a otras bandas de primera lÃƒÂ­nea[24] y conducciÃƒÂ³n de BadÃƒÂ­a; y finalmente su primera actuaciÃƒÂ³n en el teatro Astros del 14 de diciembre de 1984 donde el disco fue presentado por primera vez en vivo. La estÃƒÂ©tica fue preparada por Alfredo Lois, quien para la ocasiÃƒÂ³n decidiÃƒÂ³ colocar 26 televisores prendidos y fuera de sintonÃƒÂ­a con el fondo musical del tema &quot;Sobredosis de TV&quot;. Esto, sumado a una gran cantidad de humo, dio un inusual y atrapante efecto visual.[25] Para fin de aÃƒÂ±o Soda Stereo ya era aceptado como la revelaciÃƒÂ³n del aÃƒÂ±o, aunque figuraron segundos en la revista Pelo.[12] Por entonces aparecen los primeros grupos de fans y detractores, asÃƒÂ­ como una supuesta confrontaciÃƒÂ³n que, en la Argentina, resultarÃƒÂ­a clÃƒÂ¡sica: Soda vs. Redondos.[17] [21]\n\nA comienzos de 1985 la banda cambiÃƒÂ³ de agencia, dejando la de RodrÃƒÂ­guez Ares por OhaniÃƒÂ¡n Producciones, dirigida por Alberto OhaniÃƒÂ¡n e incorporaron como invitado en teclados a FabiÃƒÂ¡n &quot;VÃƒÂ¶n&quot; Quintiero (quien luego tocara con Charly GarcÃƒÂ­a y Los Ratones Paranoicos), uno de los mÃƒÂºsicos &quot;invitados&quot; que habrÃƒÂ­a de recibir el tÃƒÂ­tulo de Ã‚Â«cuarto SodaÃ‚Â».[23]\n\nEl 26 de enero salieron de Buenos Aires para tocar en el Festival Rock In Bali de Mar del Plata y el 17 de marzo en el Festival Chateau Rock '85 realizado en el Estadio Chateau Carreras de la provincia de CÃƒÂ³rdoba. La biografÃƒÂ­a oficial de la banda concede gran importancia a esta presentaciÃƒÂ³n indicando que actuaron ante 15 mil personas y que fueron la revelaciÃƒÂ³n del mismo.[26] Sin embargo las fuentes cordobesas indican que hubo la mitad de gente y que Ã‚Â«RaÃƒÂºl Porchetto fue el mÃƒÂ¡s ovacionado y los Soda pasaron casi inadvertidos porque su primer disco llevaba apenas unos meses de editadoÃ‚Â».[7] De todos modos la actuaciÃƒÂ³n en el Chateau iniciÃƒÂ³ una relaciÃƒÂ³n personal de la banda con los jÃƒÂ³venes cordobeses y marcÃƒÂ³ el momento en que la banda comenzÃƒÂ³ a despegar hacia el estrellato nacional.[27]\n\nEl ÃƒÂ©xito del grupo comenzaba en un momento muy particular, relacionado, por una parte con el retorno a la democracia en Argentina (10 de diciembre de 1983) y por el otro con las nociones de posmodernidad y el modo en que los jÃƒÂ³venes de la dÃƒÂ©cada del 80 intentaban pensar su papel en una sociedad democrÃƒÂ¡tica, que salÃƒÂ­a de una cruenta dictadura y de una guerra. AÃƒÂ±os mÃƒÂ¡s tarde Zeta Bosio reflexionaba de este modo sobre ese momento:\n\nLa democracia producÃƒÂ­a la adrenalina de algo nuevo, algo que estaba ocurriendo, que sabÃƒÂ­a que nos iba a modificar sin saber bien cÃƒÂ³mo. HabÃƒÂ­a mÃƒÂ¡s aire para hacer cosas y divagar, y nosotros ÃƒÂ©ramos una banda de pibes que tenÃƒÂ­amos ganas de hacer lÃƒÂ­o. Nuestra atenciÃƒÂ³n estaba en el punk y en tratar de mostrar que habÃƒÂ­a otra cosa que era mÃƒÂ¡s directa.[28]\nLos dÃƒÂ­as 21, 22 y 23 de junio de 1985 volvieron a presentarse en el Teatro Astros de Buenos Aires, adelantando algunos temas de lo que meses mÃƒÂ¡s tarde serÃƒÂ­a su segundo disco de estudio, titulado Nada personal.\n\nEl 13 de octubre de ese aÃƒÂ±o se presentaron ante el gran pÃƒÂºblico de Buenos Aires en el marco de la tercera noche del Festival Rock &amp; Pop realizado en el Estadio JosÃƒÂ© Amalfitani del club VÃƒÂ©lez Sarsfield, compartiendo cartel con INXS, Nina Hagen, Charly GarcÃƒÂ­a, Virus y Sumo, entre otros. Para ese entonces FabiÃƒÂ¡n &quot;VÃƒÂ¶n&quot; Quintiero y el Gonzo Palacios ya eran &quot;invitados estables&quot;.\n\npor WIKIPEDIA\n\nTRACKLIST:\n\n01 - Por Que No Puedo Ser Del Jet-Set.wma                        \n02 - Sobredosis De T.V..wma                                      \n03 - Te Hacen Falta Vitaminas.wma                                \n04 - Tratame Suavemente.wma                                      \n05 - Dietetico.wma                                               \n06 - Tele-Ka.wma                                                 \n07 - Ni Un Segundo.wma                                           \n08 - Un Misil En Mi Placard.wma                                  \n09 - El Tiempo Es Dinero.wma                                     \n10 - Afrodisiacos.wma                                            \n11 - Mi Novia Tiene Biceps.wma    \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:8a8fc83c9b9b40d86a4292511634c4cd6354c0a5","amp;dn":"Soda+Stereo+-+Soda+Stereo+%281984%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a8fc83c9b9b40d86a4292511634c4cd6354c0a5","infoHashBuffer":{"type":"Buffer","data":[138,143,200,60,155,155,64,216,106,66,146,81,22,52,196,205,99,84,192,165]},"announce":[],"urlList":[]}}