{"title":"Maria Callas Convent Garden 1962&amp;1964","uid":6282105,"size":4022759471,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8af7412f1de4da76e2ed20fadbe9c19f69abe852&amp;dn=Maria+Callas+Convent+Garden+1962%261964&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"johnefp","files":-1,"time":1301478806,"description":"Finally we have the 1962 Covent Garden concert on DVD (previously it was available only on VHS). Of course, for many Callas fans, the coulomb lapse at the end of &quot;tu che vanita&quot; is piece of cake, but this is not the only reason to have this sound document. Maria is relaxed and her voice is is good condition (you will not hear any problems in the upper register here). She is happy and that's all we need from and outstanding artist. One should physically see the young Georges Pretre (with whom Callas recorded in these years Carmen).\n\nHe conducts in the very extraordinary way, especially the I and III Act preludes from Carmen. The (1964) II act of Tosca with Gobbi and Cioni is an valuable material where Callas shows that she is still THE Queen. Gobbi is a little in rush and one can see that he was getting old. You cannot compare this performance with the 1958 Paris Gala concert (also with Maria, available on DVD). There is not that charm anymore... But despite all the pros and cans, this DVD is an additional step in the journey of the Callas appreciation; and you know that video is always a big deal in opera. Watch it today and you will be fascinated with the presence of Callas!\n\n\n (Dvd)\n\nVideo: MPEG2 Video 720x480 (4:3) 29.97fps 9800Kbps\nAudio: PCM 48000Hz stereo 1536Kbs\n\nEnjoy it.","torrent":{"xt":"urn:btih:8af7412f1de4da76e2ed20fadbe9c19f69abe852","amp;dn":"Maria+Callas+Convent+Garden+1962%261964","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8af7412f1de4da76e2ed20fadbe9c19f69abe852","infoHashBuffer":{"type":"Buffer","data":[138,247,65,47,29,228,218,118,226,237,32,250,219,233,193,159,105,171,232,82]},"announce":[],"urlList":[]}}