{"title":"Whiskey Tango Foxtrot series by W.J. Lundy","uid":9629342,"size":2170210,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8c1798124c4f4fb61018ee657954453afdc98be4&amp;dn=Whiskey+Tango+Foxtrot+series+by+W.J.+Lundy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"PirateBook","files":9,"time":1392649290,"description":"\nW. J. Lundy is a still serving Veteran of the U.S. Military with service in Afghanistan. He has over 12 years of combined service with the Army and Navy in Europe, the Balkans and Southwest Asia. W.J. is an avid athlete, writer, backpacker and shooting enthusiast. He currently resides with his wife and daughter in Central Michigan.\n\nI developed the Whiskey Tango Foxtrot series from notes and ideas I had put together while deployed to Afghanistan. I had been jokingly asked how we would defend against a zombie attack.\nI wanted to tell a story that portrays the military that I know, that displays our actual capabilities. These are my thoughts, I hope you enjoy them, and thank you for reading.\n\nGenre: Horror, Zombies\n\n\nWhiskey Tango Foxtrot, Escaping the Dead (Whiskey Tango Foxtrot, #1)\n\nWhiskey Tango Foxtrot is a introduction into the apocalyptic world of Staff Sergeant Brad Thompson.\nThe radio goes quiet while on convoy in Afghanistan, a lost patrol alone in the desert. With his unit and his home base destroyed, Staff Sergeant Brad Thompson suddenly finds himself isolated and in command of a small group of men trying to survive in the Afghan wasteland. \n\nThe local population has been afflicted with an illness that turns them into rabid animals. They pursue him and his men at every corner and stop. Struggling to hold his team together and unite survivors, he must fight and evade his way to safety.\n\nTales of the Forgotten (Whiskey Tango Foxtrot, #2)\n\nThe Primal Virus has changed the world -- decimating countries and destroying populations. Sergeant Brad Thompson sets out to find help for his abandoned military unit, but instead finds a horror he could never have imagined...\nTales of the Forgotten (Volume II in the Whiskey Tango Foxtrot Series)\nThe world is at war with the Primal Virus. Military forces across the globe have been recalled to defend the homelands as the virus spreads and decimates populations.\n\nOut on patrol and assigned to a remote base in Afghanistan, Staff Sergeant Brad Thompson's unit was abandoned and left behind, alone and without contact.\nThey survived and have built a refuge, but now they are forgotten. No contact with their families or commands.\nBrad makes a tough decision to leave the safety of his compound to try and make contact with the States, desperate to find rescue for his men. What he finds is worse than he could have ever predicted.\n\nOnly The Dead Live Forever (Whiskey Tango Foxtrot, #3)\n\nThe escape from Afghanistan was only the beginning.\nThe Trio survived the initial fall, and built a refuge, they thought they had reached safety, but only to find themselves once again abandoned and surrounded by the primals. \n\nNo contact with their families or commands, no relief from the rabid enemy. The fight continues as Brad and his men struggle to survive in a post-apocalyptic world where the enemy is far more dangerous than anything they had been trained for.\nOver land sea and air they will do anything to reach home.","torrent":{"xt":"urn:btih:8c1798124c4f4fb61018ee657954453afdc98be4","amp;dn":"Whiskey+Tango+Foxtrot+series+by+W.J.+Lundy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c1798124c4f4fb61018ee657954453afdc98be4","infoHashBuffer":{"type":"Buffer","data":[140,23,152,18,76,79,79,182,16,24,238,101,121,84,69,58,253,201,139,228]},"announce":[],"urlList":[]}}