{"title":"Wall of Voodoo - 1982 Call of the West (Including Excercise)","uid":7640919,"size":51946566,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8c22ca3282173dc02f3ba69dfff21eef1b00bb3f&amp;dn=Wall+of+Voodoo+-+1982+Call+of+the+West+%28Including+Excercise%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"heapgun","files":-1,"time":1347778365,"description":"Wall Of Voodoo\nCall Of The West\n\n\nLabel: I.R.S.\nReleased: 1982\n\n\nWall of Voodoo had its roots in Acme Soundtracks, a film score business started by Stan Ridgway, later the vocalist and harmonica player for Wall of Voodoo. Acme Soundtracks office was across the street from the Hollywood punk club The Masque and Ridgway was soon drawn into the emerging punk/new wave scene. Marc Moreland, guitarist for The Skulls began jamming with Ridgway at the Acme Soundtracks office and the soundtrack company morphed into a New Wave band. In 1977, with the addition of Skulls members Bruce Moreland (Marc Moreland's brother) as bassist and Chas T. Gray as keyboardist, along with Joe Nanini, who had been the drummer for Black Randy and the Metrosquad, the first lineup of Wall of Voodoo was born.\n\nThe band was named Wall of Voodoo before their first gig in reference to a comment made by Joe Berardi, a friend of Ridgway's and member of The Fibonaccis. Berardi was listening to some of the Acme Soundtracks music Ridgway and Moreland had created in their studio. When Ridgway jokingly compared the multiple-drum-machine- and Farfisa-organ-laden recordings to Phil Spector's Wall of Sound, Berardi commented it sounded more like a &quot;wall of voodoo&quot;, and the name stuck.\n\nCall of the West is the 1982 album by Wall of Voodoo. &quot;Mexican Radio&quot; was released as a single (as well as a video that received moderate airplay on MTV), and is the group's most well-known song.\n\nAustralian label Raven Records reissued a digitally remastered CD of Call of the West. It is coupled with the first Wall of Voodoo album, the long out of print Dark Continent.\n\n\nPersonnel\n\nStan Ridgway lead vocals, harmonica, keyboards\nMarc Moreland 6- and 12-string guitars\nJoe Nanini drums, percussion, spoken voice\nChas T. Gray synthesizer, bass, melodica, backing vocals\nRichard Mazda bass\nLouis Rivera percussion\n\n\nTrack Listing\n\n1.Tomorrow 3:03\n2.Lost Weekend 4:59\n3.Factory 5:33\n4.Look at Their Way 3:18\n5.Hands of Love 3:54\n6.Exercise 2:18\n7.Mexican Radio 4:11\n8.Spy World 2:41\n9.They Don't Want Me 4:31\n10.On Interstate 15 2:44\n11.Call of the West 5:59","torrent":{"xt":"urn:btih:8c22ca3282173dc02f3ba69dfff21eef1b00bb3f","amp;dn":"Wall+of+Voodoo+-+1982+Call+of+the+West+%28Including+Excercise%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c22ca3282173dc02f3ba69dfff21eef1b00bb3f","infoHashBuffer":{"type":"Buffer","data":[140,34,202,50,130,23,61,192,47,59,166,157,255,242,30,239,27,0,187,63]},"announce":[],"urlList":[]}}