{"title":"iMacros Enterprise Edition v10.2.2823","uid":10724753,"size":45520572,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8e5dff95e5353e545c3e88eb2ff55cba92203df9&amp;dn=iMacros+Enterprise+Edition+v10.2.2823&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZarkBit","files":2,"time":1407546889,"description":" &lt;a href=&quot;http://s19.postimg.org/ductuoyqr/h3_KVi_WM.gif&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://s19.postimg.org/ductuoyqr/h3_KVi_WM.gif&lt;/a&gt;\n\niMacros is Automation Delivered\n\n Whatever you do with a web browser, iMacros can automate it from web automation/web scripting, to data extraction, to web testing, and much, much more.\n Browser Automation\n\n iMacros lets you record and replay repetitious work and is the only web automation software that works with every website. Use iMacros to:\n Automatically fill-out forms just like an end-user would. You can easily download and upload of text, images, files and web pages, handle PDF files, or take screenshots.\n Import or export data to and from web applications using CSV &amp; XML files, databases, or any other source.\n Update Excel and Access from the web.\n\n iMacros eliminates the tedious repetition of checking the same sites every day, remembering passwords, and filling out web forms. iMacros is the only form filler that can autofill web forms that stretch over several pages. All information is stored in human-readable, plain text files that can be edited easily. Passwords are stored securely with secure 256-Bit AES encryption. Read more.\n Data Extraction\n\n iMacros can also perform tasks that are the exact opposite of form filling, such as: finding and extracting text (prices, product descriptions, stock quotes, etc.) and images from websites. iMacros includes full Unicode support and works with every language, including multi-byte languages such as Chinese. Read more.\n Web Testing\n\n Use iMacros for functional, performance, and regression testing of web applications. iMacros is the only tool that can automate in-browser tests with Internet Explorer, Firefox and Chrome. It is also the only tool to perform in-browser tests of Java, Flash, Flex or Silverlight applets and all AJAX elements. The built-in STOPWATCH command captures exact web page response times for every step of a process. Read more.\n Web Browser API\n\n The iMacros Scripting Interface gives you full programmatic control over the web browser, so even the most complex tasks can be scripted, and there is no scripting language to learn. Use the 32/64 bit iMacros API to remote control the iMacros Browser, Internet Explorer and Firefox. Read more.\n &lt;a href=&quot;\nhttp://s19.postimg.org/s4v4eacwz/image.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s19.postimg.org/s4v4eacwz/image.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:8e5dff95e5353e545c3e88eb2ff55cba92203df9","amp;dn":"iMacros+Enterprise+Edition+v10.2.2823","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e5dff95e5353e545c3e88eb2ff55cba92203df9","infoHashBuffer":{"type":"Buffer","data":[142,93,255,149,229,53,62,84,92,62,136,235,47,245,92,186,146,32,61,249]},"announce":[],"urlList":[]}}