{"title":"Grace To You With John MacArthur - 23 Sermons","uid":7139754,"size":320647786,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8ece85b85fdb9adae553495948b966d38be83e50&amp;dn=Grace+To+You+With+John+MacArthur+-+23+Sermons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TorrentTracts","files":23,"time":1332962218,"description":"------------------------------------------------------------\nGRACE TO YOU WITH JOHN MACARTHUR - 23 SERMONS\n------------------------------------------------------------\n\nJohn Fullerton MacArthur, Jr is a United States evangelical Christian Writer and Minister noted for his internationally known and broadcast radio program titled &quot;Grace To You.&quot;  MacArthur is a popular Author and Conference Speaker and has served as the pastor-teacher of Grace Community Church in Sun Valley, California since February 9th, 1969, and as the president of The Master's College (and the related The Master's Seminary) in Santa Clarita, California.\n\nTheologically, MacArthur is considered a Baptist and Calvinist, and a strong proponent of expository preaching. He has been acknowledged by Christianity Today as one of the most influential preachers of his time, and was a frequent guest on the Larry King Live TV talk show as a representative of an evangelical Christian perspective.\n\nMacArthur has authored or edited more than 150 books, most notably the MacArthur Study Bible, which has sold more than 1 million copies and received a Gold Medallion Book Award. Other best-selling books include his MacArthur New Testament Commentary Series (more than 1 million copies), Twelve Ordinary Men, (more than 500,000 copies), and the children's book A Faith to Grow On, which garnered an ECPA Christian Book Award.\n\nTodays torrent contains 23 sermons preached during 2012.  Each sermon runs for about 29 minutes in time.  Details of all 23 topics can be found in the thread further below.\n\nGod Bless,\nTorrentTracts - March 2012\n","torrent":{"xt":"urn:btih:8ece85b85fdb9adae553495948b966d38be83e50","amp;dn":"Grace+To+You+With+John+MacArthur+-+23+Sermons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ece85b85fdb9adae553495948b966d38be83e50","infoHashBuffer":{"type":"Buffer","data":[142,206,133,184,95,219,154,218,229,83,73,89,72,185,102,211,139,232,62,80]},"announce":[],"urlList":[]}}