{"title":"Advanced Characterization Techniques for Thin Film Solar Cells","uid":15443867,"size":8597189,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f23cfc6e8db254e780eb7b8ae5ed8b746092d76&amp;dn=Advanced+Characterization+Techniques+for+Thin+Film+Solar+Cells&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1469849539,"description":"Advanced Characterization Techniques for Thin Film Solar Cells - Daniel Abou-Ras et al. (Wiley-VCH, 2011).pdf\r\n\r\nWritten by scientists from leading institutes in Germany, USA and Spain who use these techniques as the core of their scientific work and who have a precise idea of what is relevant for photovoltaic devices, this text contains concise and comprehensive lecture-like chapters on specific research methods.\r\nThey focus on emerging, specialized techniques that are new to the field of photovoltaics yet have a proven relevance. However, since new methods need to be judged according to their implications for photovoltaic devices, a clear introductory chapter describes the basic physics of thin-film solar cells and modules, providing a guide to the specific advantages that are offered by each individual method. \r\nThe choice of subjects is a representative cross-section of those methods enjoying a high degree of visibility in recent scientific literature. Furthermore, they deal with specific device-related topics and include a selection of material and surface/interface analysis methods that have recently proven their relevance. Finally, simulation techniques are presented that are used for ab-initio calculations of relevant semiconductors and for device simulations in 1D and 2D.\r\nFor students in physics, solid state physicists, materials scientists, PhD students in material sciences, materials institutes, semiconductor physicists, and those working in the semiconductor industry, as well as being suitable as supplementary reading in related courses","torrent":{"xt":"urn:btih:8f23cfc6e8db254e780eb7b8ae5ed8b746092d76","amp;dn":"Advanced+Characterization+Techniques+for+Thin+Film+Solar+Cells","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f23cfc6e8db254e780eb7b8ae5ed8b746092d76","infoHashBuffer":{"type":"Buffer","data":[143,35,207,198,232,219,37,78,120,14,183,184,174,94,216,183,70,9,45,118]},"announce":[],"urlList":[]}}