{"title":"Concorde Supersonic Speedbird - Bale [Non-Fiction] PDF_(K-Slende","uid":8872050,"size":63360460,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:900d1bf690df0b09e7e772359be4e63ded5d3311&amp;dn=Concorde+Supersonic+Speedbird+-+Bale+%5BNon-Fiction%5D+PDF_%28K-Slende&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"K-Slender","files":3,"time":1378092015,"description":"A wonder of innovation, a symbol of Anglo-French cooperation, an icon of the 20th century - Concorde pushed the boundaries of speed, technology and luxury. The magnificent white bird, travelling at twice the speed of sound between London, Paris and New York represented the pinnacle of commercial air travel.\n\nWhen it first took to the skies in 1969 its systems were the most refined and electronically complex ever seen, its pointed nose, slender fuselage and delta wing gave it the appearance of an arrow pointed at the horizon and its engines powered it to speeds faster than a rifle bullet.\n\nConcorde's passengers were heads of state, royalty, pop stars, millionaires and those so caught up in the dream of supersonic flight that they were willing to part with the enormous cost of a ticket for the greatest airliner ever made.\n\nConcorde: The Dream That Took Flight tells the full story of this incredible aircraft from the plans laid during the darkest days of the Second World War to the international race to create the world's first supersonic transport, the test flights, the controversy over sonic boom shockwaves, the years of service and the disaster that finally brought them to an end. A decade after Concorde's last flight, the chances of Concorde's resurrection are examined and the future of supersonic transport is explored.\n\nThis is the amazing story of a dream that became a reality shared by thousands of admirers all over the world. It is the complete story of Concorde.\n\nBernard Bale has written about everything from crime to politics to show business to sports. He has had 21 books published to date and is also a broadcaster with a number of BBC shows to his credit. Bernard is a Londoner by origin but now lives in Lincolnshire.\n\nDan Sharp has worked as a news journalist for 15 years, specialising in politics, crime and military history. Based in Nottinghamshire, he writes for and edits numerous publications. ","torrent":{"xt":"urn:btih:900d1bf690df0b09e7e772359be4e63ded5d3311","amp;dn":"Concorde+Supersonic+Speedbird+-+Bale+%5BNon-Fiction%5D+PDF_%28K-Slende","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"900d1bf690df0b09e7e772359be4e63ded5d3311","infoHashBuffer":{"type":"Buffer","data":[144,13,27,246,144,223,11,9,231,231,114,53,155,228,230,61,237,93,51,17]},"announce":[],"urlList":[]}}