{"title":"THE Odyssey 1992 Season 1 XviD","uid":5480866,"size":2379779978,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9032dc58f889b1628e8654fe4eeb3063ee770866&amp;dn=THE+Odyssey+1992+Season+1+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"westlock420","files":-1,"time":1270415580,"description":"THE Odyssey 1992 Season 1 XviD\n------------------------------\n\nGeneral Plot\n------------\nFollowing an accident, young Jay Ziegler falls into a coma. While his family and friends must continue their lives in the Real World, Jay finds himself in the magical Downworld on a quest to return home.\n\nSeason 1 Plots\n--------------\nSeason 1, Episode 1: The Fall\nWhen 11-year-old Jay Ziegler falls from a treefort after being pursued by bullies who wanted his father's precious telescope, he ends up in a coma - in the real world (known as the Upworld). In the Upworld, Jay's mother Val, his best friend Donna and the bully Keith all try to cope with their reality. In the Downworld (Jay's mind), Jay finds himself in a world entirely populated by children, where he meets up Alpha and Flash (the Downworld counterparts of Donna and Keith) and the trio embark on a mysterious mission involving a telescope, the land's mysterious leader Brad, and a connection to Jay's father.\n\nSeason 1, Episode 2: No Fair\nIn the Upworld, Jay's coma worsens and he's taken to intensive care, causing Val to be faced with the prospect that her son may never recover. Meanwhile in the Downworld, Jay believes that his connection to home lies in the Tower, so he sets out with his companions to find it.\n\nSeason 1, Episode 3: Out of the Woods\nIn the Upworld, Jay's condition becomes more stabile and his classmates make him get-well-soon cards. Meanwhile, in the Downworld, as Jay and Alpha prepare for re-education at the mission, Flash recruits some tower-resistance fighters to help rescue the pair.\n\nSeason 1, Episode 4: By the Book\nIn the Upworld, Val moves Jay to an experimental private care facility\ncalled Driftwood, where she meets Dr. Max Oswald who has developed some experimental treatments. Meanwhile in the Downworld, the trio make their way to the library club where they can get a map to the tower.\n\nSeason 1, Episode 5: Checkpoint Eagle\nIn the Upworld, when Jay's paternal grandmother isn't up to the task of helping Val with Jay's physiotherapy, Val allows Donna to help in Jay's recovery. Meanwhile in the Downworld, Jay, Alpha and Flash find the first of three checkpoints but have to find the keyholders to get through them.\n\nSeason 1, Episode 6: The Believers\nIn the Upworld, when Val is laid off work due to her spending so much time with comatose Jay, she decides to visit her mother in the country at the family farm. At Driftwood, Donna and Keith continue to help by reading King Arthur stories to Jay. Meanwhile in the Downworld, the trio reach a cornfield where Flash meets Lobelia &amp; Yudo and learn of Yudo's belief of &quot;Big People&quot;.\n\nSeason 1, Episode 7: A Place Called Nowhere\nIn the Downworld, when a mysterious girl named Medea prophecizes that Jay will be the destroyer of their world, she attempts to get rid of him for good. Meanwhile in the Upworld, Donna takes Bentley to visit Jay at Driftwood.\n\nSeason 1, Episode 8: Wanted\nIn the Downworld, when the trio meet up with two freedom fighters, Flash is enlisted into their fight and Jay &amp; Alpha discover their secret ammunitions tent full of explosives. In the Upworld, as part of Jay's therapy, Max suggests they return Jay to the place of the accident.\n\nSeason 1, Episode 9: Galileo &amp; the Gypsies\nIn the Downworld, Jay and Flash break the telescope, which causes the entire Downworld to be in complete darkness. Meanwhile in the Upworld, when visiting Jay, Keith accidentally breaks the telescope and is forced to repair it before anyone finds out.\n\nSeason 1, Episode 10: In the Dark\nIn the Upworld, Max attempts a new technique that immerses Jay into water to isolate his senses. Meanwhile in the Downworld, as he continues to search for Jay, Finger leads his troops to an underground cavern where kid-scientist Fractal is experimenting on a crystal with unknown powers, that causes those who touch it to turn into a zombie.\n\nSeason 1, Episode 11: The Brad Exchange\nIn the Downworld, while in search of the third Checkpoint Jay &amp; his friends visit the Brad Exchange, where Brad's supposed belongings are traded. In the Upworld, Max experiments with some of Jay's possessions to see if he responds, and oddly, he responds only to items that used to belong to his father.\n\nSeason 1, Episode 12: Welcome to the Tower\nIn the Downworld, once inside the tower the trio find that Brad is no longer in power, but instead Macro is running the whole show. In the Upworld, Donna sees images in a mirror that resemble Alpha, Flash and Jay in the other world.\n\nSeason 1, Episode 13: The One Called Brad\nIn the Downworld, Jay finally meets Brad but is shocked to discover he's a 15 year old boy - not his grown father.\n\n\nVIDEO INFORMATION:\n-------------------\nCODEC: XviD = XviD 1.0.3\nRESOLUTION: 448 x 336\nVIDEO BITRATE: 908 kbps\nFPS: 23.976\n\nSCREENSHOTS:\n","torrent":{"xt":"urn:btih:9032dc58f889b1628e8654fe4eeb3063ee770866","amp;dn":"THE+Odyssey+1992+Season+1+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9032dc58f889b1628e8654fe4eeb3063ee770866","infoHashBuffer":{"type":"Buffer","data":[144,50,220,88,248,137,177,98,142,134,84,254,78,235,48,99,238,119,8,102]},"announce":[],"urlList":[]}}