{"title":"A History Of Capitalism, 1500-2000 (2000) - [Qwerty80]","uid":7870064,"size":23241602,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:90682842c99f8b7c530289b4cf34bacf214ee79b&amp;dn=A+History+Of+Capitalism%2C+1500-2000+%282000%29+-+%5BQwerty80%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"KatQwerty80","files":3,"time":1354180206,"description":"Synopsis\nThe conquest of the Americas inaugurated the slow accumulation of resources and the imperceptible structural transformations that culminated in the Industrial Revolution. From that moment on, capitalism grew and expanded with a dynamism and adaptability that are now all too familiar, profiting from wars and even managing to rebound after a series of devastating economic crises.\nIn this highly-anticipated revised edition of the 1981 classic, Beaud extends one of the major strengths of the original: the interweaving of social, political, and economic factors in the context of history. At the same time, Beaud's analysis provides a realistic and thorough examination of the developments of capitalism in the last twenty years, including globalization, the accelerating speed of capital transfer, and the collapse of the Soviet empire and the subsequent absorption of its population into the world market. This new edition also offers a completely revised format that integrates diagrams and flow-charts not previously available in the English-language edition.\nBiography\nMichel Beaud is the retired professor of economics at University of Paris VIII at Vincennes. He is author of several books, including Socialism Tested by History and The Mirage of Growth: The Political Economy of the Left.","torrent":{"xt":"urn:btih:90682842c99f8b7c530289b4cf34bacf214ee79b","amp;dn":"A+History+Of+Capitalism%2C+1500-2000+%282000%29+-+%5BQwerty80%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90682842c99f8b7c530289b4cf34bacf214ee79b","infoHashBuffer":{"type":"Buffer","data":[144,104,40,66,201,159,139,124,83,2,137,180,207,52,186,207,33,78,231,155]},"announce":[],"urlList":[]}}