{"title":"Sociobiology: The New Synthesis [25th An Ed] by E. O. Wilson","uid":10488427,"size":17901454,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91c0f28ba49a29537eb38a6488df4df3eed06a13&amp;dn=Sociobiology%3A+The+New+Synthesis+%5B25th+An+Ed%5D+by+E.+O.+Wilson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"malanzirotti","files":-1,"time":1404514640,"description":"Sociobiology - The New Synthesis [25th Anniversary Edition] (2000) by Edward Osborne Wilson.epub\n\nHarvard University Press is proud to announce the re-release of the complete original version of Sociobiology: The New Synthesis--now available in paperback for the first time. When this classic work was first published in 1975, it created a new discipline and started a tumultuous round in the age-old nature versus nurture debate. Although voted by officers and fellows of the international Animal Behavior Society the most important book on animal behavior of all time, Sociobiology is probably more widely known as the object of bitter attacks by social scientists and other scholars who opposed its claim that human social behavior, indeed human nature, has a biological foundation. The controversy surrounding the publication of the book reverberates to the present day.\n\nIn the introduction to this Twenty-Fifth Anniversary Edition, Edward O. Wilson shows how research in human genetics and neuroscience has strengthened the case for a biological understanding of human nature. Human sociobiology, now often called evolutionary psychology, has in the last quarter of a century emerged as its own field of study, drawing on theory and data from both biology and the social sciences.\n\nFor its still fresh and beautifully illustrated descriptions of animal societies, and its importance as a crucial step forward in the understanding of human beings, this anniversary edition of Sociobiology: The New Synthesis will be welcomed by a new generation of students and scholars in all branches of learning. \n\n720 pages\nPublisher: Belknap Press; New edition edition (April 23, 2000)\nLanguage: English\nISBN-10: 0674002350\nISBN-13: 978-0674002357","torrent":{"xt":"urn:btih:91c0f28ba49a29537eb38a6488df4df3eed06a13","amp;dn":"Sociobiology%3A+The+New+Synthesis+%5B25th+An+Ed%5D+by+E.+O.+Wilson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91c0f28ba49a29537eb38a6488df4df3eed06a13","infoHashBuffer":{"type":"Buffer","data":[145,192,242,139,164,154,41,83,126,179,138,100,136,223,77,243,238,208,106,19]},"announce":[],"urlList":[]}}