{"title":"Adam Clarks (2014) (phillywilly) cbr","uid":11592830,"size":91130511,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:937f40ecef943a3e9383b32881e343a5bec50c24&amp;dn=Adam+Clarks+%282014%29+%28phillywilly%29+cbr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GP67","files":-1,"time":1417246844,"description":"Society columnist, spy or burglar... Adam Clarks is a difficult man to pin down!\nIn a fantastic twenty-first century where the Cold War still rages alongside the conquest of mars, at a cocktail party for this world's movers and shakers is where the enigmatic Adam Clarks shows his true face. One might think him rather occupied with kissing up to the powerful and to flirting with femme fatales. But he never loses sight of his true objective, a priceless 100 carat ruby on public display: the de Long Star. That night, Adam uses all his skills as a cat-burglar to steal the jewel. No-one sees or hears a thing. No-one? Don't be so sure... Now the target of both the KGB and the CIA, Adam will have to play both sides to make it out alive. With Adam Clark, Hautiere introduces us to a classy and charismatic hero, a mix of Arsene Lupin and Mad Men, living in the world of yesteryear's spy films. A worthy representative of the stylised and elegant line of the &quot;atom&quot; school, Antonio Laporte expertly illustrates this wonderful uchronic atmosphere, blending futurism with the aesthetics of the 1960s\n\nenjoy","torrent":{"xt":"urn:btih:937f40ecef943a3e9383b32881e343a5bec50c24","amp;dn":"Adam+Clarks+%282014%29+%28phillywilly%29+cbr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"937f40ecef943a3e9383b32881e343a5bec50c24","infoHashBuffer":{"type":"Buffer","data":[147,127,64,236,239,148,58,62,147,131,179,40,129,227,67,165,190,197,12,36]},"announce":[],"urlList":[]}}