{"title":"The Myths of Creativity by David Burkus","uid":9642318,"size":759852,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9398c437a38de1400fa2952cdf5904da1fafcc79&amp;dn=The+Myths+of+Creativity+by+David+Burkus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"PirateBook","files":3,"time":1392943534,"description":"\nHow to get past the most common myths about creativity to design truly innovative strategies We tend to think of creativity in terms reminiscent of the ancient muses: divinely-inspired, unpredictable, and bestowed upon a lucky few. But when our jobs challenge us to be creative on demand, we must develop novel, useful ideas that will keep our organizations competitive. \n\nThe Myths of Creativity demystifies the processes that drive innovation. Based on the latest research into how creative individuals and firms succeed, David Burkus highlights the mistaken ideas that hold us back and shows us how anyone can embrace a practical approach, grounded in reality, to finding the best new ideas, projects, processes, and programs. Answers questions such as: What causes us to be creative in one moment and void in the next? \n\nWhat makes someone more or less creative than his or her peers? Where do our flashes of creative insight come from, and how can we generate more of them? Debunks 10 common myths, including: the Eureka Myth; the Lone Creator Myth; the Incentive Myth; and The Brainstorming Myth Written by David Burkus, founder of popular leadership blog LDRLB For anyone who struggles with creativity, or who makes excuses for delaying the work of innovation, The Myths of Creativity will help you overcome your obstacles to finding new ideas.\n\nGenre: Non Fiction | Psychology | Self Help | Buisiness","torrent":{"xt":"urn:btih:9398c437a38de1400fa2952cdf5904da1fafcc79","amp;dn":"The+Myths+of+Creativity+by+David+Burkus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9398c437a38de1400fa2952cdf5904da1fafcc79","infoHashBuffer":{"type":"Buffer","data":[147,152,196,55,163,141,225,64,15,162,149,44,223,89,4,218,31,175,204,121]},"announce":[],"urlList":[]}}