{"title":"Mattafix-Signs_Of_A_Struggle-(Advance)-2005-RNS","uid":3401029,"size":95510170,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:93ee2a873fa3bac0e1deff8db4ca264f1ddd3e10&amp;dn=Mattafix-Signs_Of_A_Struggle-%28Advance%29-2005-RNS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"jeffthedrunk","files":17,"time":1130212424,"description":"ARTIST: Mattafix\nTITLE: Signs Of A Struggle\nLABEL: Buddhist Punk\nGENRE: R&amp;B\nBITRATE: 207kbps avg\nPLAYTIME: 1h 01min total\nRELEASE DATE: 2005-10-31\nRIP DATE: 2005-10-24\n\nTrack List\n----------\n01. Gangster Blues                  4:19\n02. Big City Life                   4:00\n03. Passer By                       3:33\n04. To &amp; Fro                        4:04\n05. Everyone Around You             4:58\n06. Clear And Present Danger        4:20\n07. Older                           2:50\n08. I To You                        4:21\n09. Impartial                       3:55\n10. The Means                       4:09\n11. 1130                            3:28\n12. Forgotten                       3:52\n13. 555                             6:33\n14. Cool Down The Place             7:02\n\nRelease Notes:\n\nThe previous release tagged as advance was a 5 track sampler.\nEnjoy the actual advance.\n\nBio -\n\nSigns of a Struggle, Preetesh and I feel like it's the perfect\nname for this album. Not only have we faced challenges\ncreatively but we have written this album with a backdrop of\ninternational turmoil. Its difficult not to believe in fate\nwhen I look back at the creation of these songs. Many of the\ntracks deal with the individual struggles that both myself and\nPreetesh have experienced. In many respects they are the\ntypical issues that two young men deal with in a 21st century\nenvironment; the turbulent relationships, the family feuds and\ntrying to find a voice in situations where the opinions of\nyoung people are not always encouraged. And at the epicenter\nof our work is a belief that creativity can bring great\nchange. Our story may not be unique, but we have tried to tell\nit as if it were.\n\nRoots and a sense of belonging are themes that appear\nlyrically from time to time. Both of Pre's parents were born\nin India and, after much travelling, they settled in London\nwhere Pre was born. This background has given him a broad\nappreciation for all types of music from traditional Ragas\nand old school Bollywood soundtracks to hip hop, rock, and\ndance.\n\nI was born in the same part of London but moved to my\nmother's homeland in the West Indies (St. Vincent and the\nGrenadines) with her as a young child. I moved back to\nLondon in my late teens with a heavy influence of reggae,\ndancehall, and hip hop. Since then we have immersed\nourselves in all genres of music from blues to classical.\n\nThe past two years have been spent trying to merge all of\nthese elements into our own style of music. The creative\nprocess is not always clear and many of our break throughs\nhave come about through coincidences and mistakes. When I\nmet Pre (on a visit back to London) he was working at a\nrecording studio where, for the next four years, he learnt\nthe art of sound. Around the same time I was playing tenor\nin a Steel Band in St. Vincent. In my spare time I was\nwriting rap verses and poetry. By the time I left St.\nVincent and reunited with Pre we both had visions of a\nfresh sound. We have both been extremely fortunate to\nhave played a role in the creation of that sound.\n\nMarlon Roudette\n\n","torrent":{"xt":"urn:btih:93ee2a873fa3bac0e1deff8db4ca264f1ddd3e10","amp;dn":"Mattafix-Signs_Of_A_Struggle-%28Advance%29-2005-RNS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93ee2a873fa3bac0e1deff8db4ca264f1ddd3e10","infoHashBuffer":{"type":"Buffer","data":[147,238,42,135,63,163,186,192,225,222,255,141,180,202,38,79,29,221,62,16]},"announce":[],"urlList":[]}}