{"title":"The Beatles - Let It Be... Naked 2CD Set [V0](Big Papi)","uid":10124178,"size":104141086,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:94319bf773b6a76458a23c81cfb2862e2eef73c0&amp;dn=The+Beatles+-+Let+It+Be...+Naked+2CD+Set+%5BV0%5D%28Big+Papi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1399737116,"description":"The Beatles - Let It Be... Naked 2CD Set [V0](Big Papi) Fly On The Wall\n\n\nHi guys. This upload has a very long review because the CD has a history behind it even more than being &quot;Re-recorded, remixed, overdubbed and repackaged&quot;.. Disc 2 is a &quot;behind the scenes&quot; look at The Beatles in the recording studio. I hope you enjoy.\n\nAs always, thanks for your generous seeding. Oh, and typical with Big Papi, tags have been edited so Disc 1 and Disc 2 show up under 1 Album in the player.\n\n- Big Papi\n\n\n\n\n\nMurrayTheCat\n\nThe Beatles rejected the GET BACK album upon its completion in 1969 and again in 1970. The project (renamed LET IT BE) then got the Phil Spector treatment, with Paul being kept completely in the dark about it. Many have called the Spector album shoddy, but most Beatles fans bought it and enjoyed it despite the consensus that it was not top-notch.\n\nAt one time The Beatles were capable of producing much magic &quot;live&quot; in the studio--and they had done it often. But after they quit touring, the lack of playing together eventually took its toll, John admitting that &quot;The Beatles musically weren't as together in the last few years.&quot; John also said that these sessions had &quot;lousy feeling.&quot; But within the album notes to this new release, marketing mentality strikes once again and, rather typically, attempts to put a spin on these &quot;raw and unadorned&quot; sessions, saying that this is what the group wanted. &quot;Raw and unadorned&quot; shouldn't be confused with &quot;careless and crude.&quot; The latter two are not what the group was shooting for, but a fair amount of that made it onto the tapes because of their lack of desire to focus on making music. (Just a few months later they did focus on making music and produced ABBEY ROAD!)\n\nI still look at LET IT BE as a compilation of rehearsals; little of it sounds finished. Though the songs themselves are great, the performances are not, for the most part, of the highest Beatles standard. Sure, there are many magical moments throughout; but the magic is fleeting, and we are continually reminded of a great producer's absence--George Martin! These recordings are culled from sessions that, had the proper commitment been there, should have produced a remarkable Beatles album along the lines of what we were accustomed to. Each attempt at presenting these sessions only leaves me wondering what could have been if George Martin had been allowed to fully produce them. That said, here's what we get this time around:\n\n&quot;Get Back&quot; is noticeably cleaner than the previous releases. But this version fades out quickly before Paul's &quot;ooo-oo,&quot; leaving it sounding truncated--annoyingly unresolved. Overall, I still prefer the 1969-single version with its very satisfying ending, the version we fans thrilled to for a full year before the Spector LP appeared.\n\nThe electric piano in &quot;Dig A Pony&quot; is more prominent here; otherwise, there is not much difference between this account and Spector's. &quot;For You Blue&quot; reveals little difference as well.\n\n&quot;The Long And Winding Road&quot; is a different take from Spector's, and, as another reviewer astutely points out, we get lots of rehearsal-like &quot;plinky dink&quot; playing, unworthy of a finished Beatles song. It is typical for musicians to play with this type of uncertainty when the arrangement is still in the building stage, and here the uncertain piano fills don't carry the song's emotion between Paul's vocal lines. The tempo surges at times, and this whole take is pretty much a rough run-through. Though the combination of orchestra and choir on Spector's version periodically strikes me as being unnatural, I never thought that it transported the song to the world of Mantovani. In fact, I never realized just how much I love the Spector account until I sat and compared these two versions at length.\n\n&quot;Two Of Us&quot; reveals no significant variation except that it fades out before the guitars stop and before John's whistling goes charmingly out of tune, present on the Spector version.\n\nWe are given a different rendition of &quot;I've Got A Feeling.&quot; It is not quite as hot, matching neither the emotion in the vocals nor the intensity and drive of the performance Spector chose for his album. I also like Preston's piano line better on the Spector track.\n\nTop honors go to NAKED for the better mix of &quot;One After 909.&quot; The song really comes alive here. One very consequential difference is that Ringo's bass drum has punch on NAKED; on the Spector it's pure mud. The added punch gives the song an infectious--even delirious--drive that it never had before. Unfortunately, the fade at the end is quick so as not to catch the live atmosphere.\n\nThis take of &quot;Don't Let Me Down&quot; is rehearsal quality all the way; it pales in every respect compared with the glorious single version released in 1969.\n\nOn Spector's &quot;I Me Mine,&quot; the strings are heard where, on this new mix, the organ pops through more noticeably.\n\nAnd here, &quot;Across The Universe&quot; is back to its original speed. Though the Spector treatment sounds neither preferable nor wrong (John certainly liked it), this NAKED one sounds, well, naked. I still prefer the original version found on PAST MASTERS VOLUME TWO. That one sounds closer to the John of early 1968 who made bizarre requests of George Martin, wanting a song &quot;to sound like an orange&quot; and such.\n\nFinally, this remix of the title track brings the organ up front more, we miss the electric piano on the first walk-down before the guitar solo, and the brass is gone. The new version also omits the third-verse edit found in the Spector version. But this mix bewilders me: Is it substantive and worthwhile? Or is it a run-of-the-mill account, one more from a potentially endless parade of remixes? George's guitar solo is different yet again. So what? If you ask me, the single version (found on PAST MASTERS VOLUME TWO and the SINGLES boxed set) still says it best.\n\nThough I still prefer Spector's LET IT BE, I cannot recommend it over this cleaned-up version to all listeners. Each has strengths; neither is perfect.\n\nThe album notes assert that this edition reveals how the album was meant to be. Didn't the Spector album make the same assertion? So much for promises.\n\n\n\n\n---------------------------------------------------------------------\nBeatles, The - Let It Be... Naked\n---------------------------------------------------------------------\n\nArtist...............: Beatles, The\nAlbum................: Let It Be... Naked\nGenre................: Rock\nSource...............: CD\nYear.................: 2003\n\nMP3 V0 (Highest Quality Available For MP3)\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 257kbps)\nChannels.............: Joint Stereo / 44100 hz\n\n---------------------------------------------------------------------\nDisc 1\n---------------------------------------------------------------------\n\n1. Beatles, The - Get Back [02:34]\n2. Beatles, The - Dig a Pony [03:38]\n3. Beatles, The - For You Blue [02:27]\n4. Beatles, The - The Long and Winding Road [03:34]\n5. Beatles, The - Two of Us [03:21]\n6. Beatles, The - I've Got a Feeling [03:30]\n7. Beatles, The - One After 909 [02:44]\n8. Beatles, The - Don't Let Me Down [03:18]\n9. Beatles, The - I Me Mine [02:21]\n10. Beatles, The - Across the Universe [03:38]\n11. Beatles, The - Let It Be [03:55]\n\nPlaying Time.........: 35:04\nTotal Size...........: 65.21 MB\n\n---------------------------------------------------------------------\nDisc 2\n---------------------------------------------------------------------\n\n1. Beatles, The - Fly On The Wall [21:58]\n\nPlaying Time.........: 21:58\nTotal Size...........: 33.82 MB","torrent":{"xt":"urn:btih:94319bf773b6a76458a23c81cfb2862e2eef73c0","amp;dn":"The+Beatles+-+Let+It+Be...+Naked+2CD+Set+%5BV0%5D%28Big+Papi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94319bf773b6a76458a23c81cfb2862e2eef73c0","infoHashBuffer":{"type":"Buffer","data":[148,49,155,247,115,182,167,100,88,162,60,129,207,178,134,46,46,239,115,192]},"announce":[],"urlList":[]}}