{"title":"Jeffrey Archer - Cometh the Hour (The Clifton Chronicles #6)","uid":14632832,"size":195535818,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:943a69f181e1c995ea649d0a737d1260615dc32e&amp;dn=Jeffrey+Archer+-+Cometh+the+Hour+%28The+Clifton+Chronicles+%236%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Cybotage","files":2,"time":1463371644,"description":"Cometh the Hour opens with the reading of a suicide note, which has devastating consequences for Harry and Emma Clifton, Giles Barrington, and Lady Virginia. Giles must decide if he should withdraw from politics and try to rescue Karin, the woman he loves, from behind the Iron Curtain. But is Karin truly in love with him, or is she a spy?\r\n\r\nLady Virginia is facing bankruptcy and can see no way out of her financial problems until she is introduced to the hapless Cyrus T. Grant III from Baton Rouge, Louisiana, who's in England to see his horse run at Royal Ascot.\r\n\r\nSebastian Clifton is now the chief executive of Farthings Bank and a workaholic whose personal life is thrown into disarray when he falls for Nadira, a beautiful Indian girl. But her parents have already chosen the man she is going to marry. Meanwhile, Sebastian's rivals, Adrian Sloane and Desmond Mellor, are still plotting to bring him and his chairman, Hakim Bishara, down, so they can take over Farthings.\r\n\r\nHarry Clifton remains determined to get Anatoly Babakov released from a gulag in Siberia following the international success of his acclaimed book, Uncle Joe. But then something unexpected happens that none of them could have anticipated.\r\n\r\nCometh the Hour is the penultimate book in the Clifton Chronicles and, like the five previous novels - all of which hit the New York Times best-seller list - showcases Jeffrey Archer's extraordinary storytelling with his trademark twists. \r\n\r\nRead by Alex Jennings\r\nFormat: MP3\r\nBitrate: 32 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:943a69f181e1c995ea649d0a737d1260615dc32e","amp;dn":"Jeffrey+Archer+-+Cometh+the+Hour+%28The+Clifton+Chronicles+%236%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"943a69f181e1c995ea649d0a737d1260615dc32e","infoHashBuffer":{"type":"Buffer","data":[148,58,105,241,129,225,201,149,234,100,157,10,115,125,18,96,97,93,195,46]},"announce":[],"urlList":[]}}