{"title":"Deadfall Adventures-RELOADED","uid":9198657,"size":7269792112,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:948ff90b71edd512c62d2f7ec8355d6042c5afa4&amp;dn=Deadfall+Adventures-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"HeroMaster","files":-1,"time":1384538651,"description":"nERv\n\nDeadfall Adventures (c) Nordic Games\n\n11/2013: RELEASE.DATE .. PROTECTION: Steam\n1: DISC(S) .. GAME.TYPE: Action, Adventure\nNote: This release comes packed with the zero day update for this game\n\nDeadfall Adventures is an action-driven first-person shooter, spiced up with\nelements from action-adventure games. Become an adventurer, hunt for\ntreasures, explore unknown regions of the world and rescue the damsel in\ndistress from the clutches of enemies, both earthly and not-so-earthly. Join\nJames Lee Quatermain on his journey across the globe!\n\nThe StoryThe year is 1938. James Lee Quatermain is a man of many talents, yet\nholding on to money isn't one of them. James is an adventurer by trade, just\nlike his legendary great-grandfather Allan Quatermain. And he knows how to\nsqueeze money out of this famous name of his, while at the same time\ndespising it. Despising those who believe his great-grandfather's tales of\nthe supernatural and those who make fun of them alike\n\nAccordingly, Quatermain isn't all too keen on escorting Jennifer Goodwin, an\nUS agent and former colleague of his, to an Egyptian temple structure in\norder to retrieve an ancient artifact - The Heart of Atlantis. Neither does\nhe believe in the reputed invigorating qualities of this artifact, nor does\nhe care the least that a division of the Ahnenerbe, the Nazi department\nspecialized in the occult, is after The Heart as well\n\nBut life has its ways of changing one's perspective. Quatermain soon finds\nhimself part of a hunt across the globe - from the stormy deserts of Egypt to\nthe icy depths of the Arctic, and all the way to the steaming jungles of\nGuatemala. In long forgotten temple structures the thrill of the chase\nawakens the true adventurer in Quatermain, as he and agent Goodwin strive to\nbe one step ahead of the Nazis and the Russians, one step closer to obtaining\nthe Heart of Atlantis. And deep in these temples, where age-old guardians\nawake from their eternal slumber, James soon learns that his\ngreat-grandfather's stories are not as crazy as he had always believed. For\nall things live forever, though at times they sleep and are forgotten\n\nKey Features\n* Action -Adventure gameplay from a first-person perspective\n* Set in the Quatermain-universe, created by H. R. Haggard\n* Fast-paced action and intense, accurate FPS gun battles\n* Adventurer equipment: compass, treasure maps, notebook and flashlight\nnecessary to solve ancient puzzles, find treasures and even to defeat certain\ntypes of enemies\n* Puzzles that encourage you to explore the game environment and interact\nwith it\n* Environmental traps that can be used to eliminate enemies in many\nspectacular ways\n* Exotic, picturesque locations from around the world Egypt, Arctic and\nforgotten\nMayan ruins in the jungles of Guatemala\n* Compelling story faithful to the spirit of classic action-adventure movies\n* 1930's setting, including detailed weapon designs\n* Unique adventurer-style multiplayer features and modes\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT!\n\n\nSystem Requirements:\n\nOS: Windows XP SP 3, Windows Vista/7/8 \nProcessor: Intel Core 2 Duo @ 2 GHz / AMD Athlon 64 X2 equivalent \nMemory: 2 GB RAM \nGraphics: NVIDIA GeForce 9600GT / ATI Radeon HD 3830, 256 MB VRAM, \nShader Model 3 support \nDirectX: 9.0c \nHard Drive: 6.5 GB HD space \nSound: DirectX Compatible \nAdditional: Initial installation requires one-time internet connection \nfor Steam authentication, Software installations required (included with \nthe game): STEAM Client, Microsoft DirectX, Visual C++ 2010 Redistributable, \nVisual C++ 2005 SP1 Redistributable\n\n\nPoster:\n\n &lt;a href=&quot;\nhttp://i.imgur.com/4nteexk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/4nteexk.jpg&lt;/a&gt;\n\n\nScreenshots:\n\n &lt;a href=&quot;\nhttp://i.imgur.com/wxs6wm2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/wxs6wm2.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://i.imgur.com/61dSISV.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/61dSISV.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://i.imgur.com/PWkxJtv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/PWkxJtv.jpg&lt;/a&gt;\n\n\nSEED AND ENJOY!","torrent":{"xt":"urn:btih:948ff90b71edd512c62d2f7ec8355d6042c5afa4","amp;dn":"Deadfall+Adventures-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"948ff90b71edd512c62d2f7ec8355d6042c5afa4","infoHashBuffer":{"type":"Buffer","data":[148,143,249,11,113,237,213,18,198,45,47,126,200,53,93,96,66,197,175,164]},"announce":[],"urlList":[]}}