{"title":"MASS EFFECT 3 - XPADDER PROFILES FOR XBOX PS3 CONTROLLERS","uid":7108729,"size":1923981,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:957c2a6549b356471e53e4636fda7eaf2f2f0c60&amp;dn=MASS+EFFECT+3+-+XPADDER+PROFILES+FOR+XBOX+PS3+CONTROLLERS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"jlocust","files":5,"time":1331961337,"description":"THIS CUSTOM XPADDER PROFILE WILL ALLOW YOU TO PLAY MASS EFFECT 3 (PC) WITH YOUR WIRED XBOX AND PS3 CONTROLLERS. I HAVE INCLUDED THE XPADDER PROGRAM AND INSTRUCTIONS IF YOU DON'T HAVE IT ALREADY.\n\nEVERYTHING TESTED AND WORKS GREAT JUST FOLLOW THE INSTRUCTIONS.\n\n1. SKIP IF YOU HAVE XPADDER ALREADY INSTALLED... Before anything, first make sure you have already installed the necessary drivers for your game controller. (Drivers for a Original Microsoft Wired Xbox controller can be found at &lt;a href=&quot;\nhttp://www.microsoft.com/hardware/en-us/p/xbox-360-controller-for-windows#support)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.microsoft.com/hardware/en-us/p/xbox-360-controller-for-windows#support)&lt;/a&gt;\n\nNow place the Xpadder5.7 folder in the directory where you would like to have it installed. (xpadder is a stand-alone app that does not require an install wizard) just place the folder on your hard drive wherever you like and always launch xpadder by right clicking and choosing RUN AS ADMIN.\n\n2. Place the controller file(Mass Effect 3 RJ2.xpaddercontroller) &amp; the mass effect 3 profile (Mass Effect 3 RJ MAPPINGS3.xpadderprofile) in your xpadder folder or wherever you save your xpadder profiles and controller mappings.\n\n3.Plug in your controller\n\n4.Right click xpadder5.7 and choose &quot;run as admin&quot;\n\n5.After xpadder launches, There are 2 drop downs at the top of the window. The left one is for controller mappings and the right one is for specific game profiles.\n\nFIRST - Click the little controller icon on the top left, and choose OPEN, Now browse your system for the &quot;Mass Effect 3 RJ2.xpaddercontroller&quot;\n\nSECOND - Click the little page icon to the left of the second white box at the top of the window... CHOOSE OPEN, and browse for the\nMass Effect 3 RJ MAPPINGS3.xpadderprofile\n\nafter both files are loaded in xpadder you should be able to move your mouse cursor with the right stick... if its working your ready to play...\n\n6. Minimize Xpadder and launch Mass Effect 3...\n\nMASS EFFECT 3 Controller set up for XBOX\n\n- Left stick = Move Character (click in = Round Corner while in cover)\n\n- Right stick = Look/Move Mouse Cursor (Click in = Call your teamates to form up on you (Rally)\n\n- Left Trigger = Aim/Zoom\n\n- Right Trigger = Fire/Select in menu (left click)\n\n- Left Back Button = HOLD THE BUTTON TO USE QuICK ABILITY KEYS 1-8... When holding the LB button THE X,Y,A,B buttons trigger quick abilities 1-4 and the the directional-pad will trigger quick keys 5-8. You must hold the LEFT BACK BUTTON AS YOU PRESS THE QUICK ABILITY BUTTON YOU WANT... X-1,A-2,B- 3,Y-4,LEFT ON DPAD = 5, DOWN DPAD = 6, ETC. CLICK-IN ON THE RIGHT STICK WHILE HOLDING THE LB BUTTON TO ISSUE ENTIRE TEAM TO ATTACK TARGET.\n\n(QUICK KEYS CAN BE ASSIGNED BY DRAGGING THE ABILITY IN YOUR HUD MENU TO THE QUICK KEY 1-8 SLOTS IN THE TOP LEFT OF YOUR SCREEN.)\n\n- Right Back Button = Toggles the COMBAT HUD on/off (while the HUD is active you can HOLD the Left Trigger and use the right stick to look around/choose targets... Use Right Trigger to select abilities, issue orders, etc.)\n\n- X = Reload\n\n- A = Sprint/Take Cover/Use\n\n- B = Objectives and Navigation Assistance\n\n- Y = Melee Attack (hold for heavy Melee attack)\n\nDPAD UP = Issue Squad member 1 to move or while an enemy is highlighted to attack\nDown = Issue Squad member 2 to move or while an enemy is highlighted to attack\nLeft = Previous Weapon\nRight = Next Weapon\n\nBack Button = Swap Weapon (primary/secondary)\n\nStart = ESC button Brings up menu\n\n- IF YOU PLAY INVERTED OR AIMING IS TOO SENSITIVE OR SLUGGISH, JUST ADJUST THE MOUSE INVERSION SETTINGS AND SENSATIVITY INSIDE OF MASS EFFECT 3\n\nTHATS ABOUT IT ... FEEL FREE TO CONFIGURE THE CONTROLLER HOW YOU LIKE IT... AT LEAST THE MAPPING IS LAYED OUT FOR YOU AND IS READY TO GO. ;)","torrent":{"xt":"urn:btih:957c2a6549b356471e53e4636fda7eaf2f2f0c60","amp;dn":"MASS+EFFECT+3+-+XPADDER+PROFILES+FOR+XBOX+PS3+CONTROLLERS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"957c2a6549b356471e53e4636fda7eaf2f2f0c60","infoHashBuffer":{"type":"Buffer","data":[149,124,42,101,73,179,86,71,30,83,228,99,111,218,126,175,47,47,12,96]},"announce":[],"urlList":[]}}