{"title":"Gabe Quinn Series (Thriller) - Keith Houghton ","uid":9550399,"size":1618971,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:95ae2fedaa1c196fc50819faed485a38d3f9e8f7&amp;dn=Gabe+Quinn+Series+%28Thriller%29+-+Keith+Houghton+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1391240931,"description":"Killing Hope (Gabe Quinn #1)\nOne man stands in the way of countless deaths ...\nOne man will try to stop him ...\nOnly one will succeed ...\n\n&quot;Celebrity Cop&quot; Gabe Quinn is back working Robbery-Homicide after a personal tragedy has left him emotionally bare.\n\nHe's raw, but resolved to catch a serial killer stalking the streets of two major cities.\n\nWith cryptic clues left at each crime scene, Gabe is faced with the seemingly impossible task of piecing together the bizarre puzzle - following signs that point toward a killer whose motive questions everything he believes in ...\n\n'If you could save a million lives by taking one ... would you?'\n\nCrossing Lines (Gabe Quinn #2)\nWhen a mutilated body is washed up on a picturesque Florida beach it marks the beginning of the end for &quot;Celebrity Cop&quot; Gabe Quinn. Nothing is quite what it seems and never will be again. What follows is an explosive game of cat and mouse and a death race to save a woman's life from the hands of a madman. But this is no ordinary kidnapper. This is Gabe's nemesis - the murderer of his wife, the monster responsible for killing Hope: The Maestro. And he has returned with an old score to settle. One that will force Gabe to cross every line he has ever made, begging the question ...\n\n'How far would you go to protect your children?'\n\nTaking Liberty (Gabe Quinn #3)\n&quot;When you're going through hell, keep going ...&quot;\n\nOne man is on the hunt ...\nOne man intends to take his liberty ...\nOnly one will succeed ...\n\nImprisoned for the attempted murder of a federal agent, former homicide detective Gabe Quinn is keen to make amends for his mistakes - so when a gruesome murder forces his freedom, he is determined to do everything in his power to bring the killer to justice and prove himself to the FBI.\n\nBut the road to hell is paved with good intentions, and the killer has something else in mind for Gabe Quinn, something that will raze everything he knows to the ground.\n\nDrawn into a desperate chase against the killer's deadline, Gabe is forced to stand accountable for the decisions of his past and face the ultimate question ...\n\n'Could you give your life to save someone else?'","torrent":{"xt":"urn:btih:95ae2fedaa1c196fc50819faed485a38d3f9e8f7","amp;dn":"Gabe+Quinn+Series+%28Thriller%29+-+Keith+Houghton+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95ae2fedaa1c196fc50819faed485a38d3f9e8f7","infoHashBuffer":{"type":"Buffer","data":[149,174,47,237,170,28,25,111,197,8,25,250,237,72,90,56,211,249,232,247]},"announce":[],"urlList":[]}}