{"title":"Nini Rosso - Digital best TQMP","uid":4678730,"size":277314375,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:95afc464b3e459b71c83ecf1715aec05d13dde28&amp;dn=Nini+Rosso+-+Digital+best+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"zootallure","files":21,"time":1232995841,"description":"Is there anybody out there whoe does not know &quot;Il Silenzio&quot;? If you don't dl it here and you will not be disappointed, if you know...enjoy in both cases ;-)\n\nRaffaele Celeste &quot;Nini&quot; Rosso, born 19 September 1926 was an Italian jazz trumpeter and composer.\nBorn in Turin, Rosso's parents had attempted to send him to university, but at 19 he chose the trumpet over academia, and left home. After his employment in a nightclub was terminated by the police, he returned home, but soon after departed again to relaunch his career. He soon became one of the best-known jazz trumpeters in Italy, reaching the crest of his popularity in the 1960s. He became known in the UK in 1962 when his recording of &quot;Concerto Disperato&quot; was covered by Ken Thorne and his Orchestra and became a hit under the title &quot;The Theme from 'The Legion's Last Patrol'&quot;. Rosso's original was quickly released on the little-known Durium label and also made the charts, but was less successful than the bland cover version. His 1965 worldwide hit &quot;Il Silenzio&quot; went to #1 in Italy, Germany, Austria, and Switzerland, and sold over ten million copies. He also acted in the 1960s.\nRosso died of a tumor in 1994.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se  (Simply use the TQMP searchtag :)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:95afc464b3e459b71c83ecf1715aec05d13dde28","amp;dn":"Nini+Rosso+-+Digital+best+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95afc464b3e459b71c83ecf1715aec05d13dde28","infoHashBuffer":{"type":"Buffer","data":[149,175,196,100,179,228,89,183,28,131,236,241,113,90,236,5,209,61,222,40]},"announce":[],"urlList":[]}}