{"title":"Documentary Pack  (Including Subtitle Files in Many Languages)","uid":5100926,"size":17671329094,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:95c844c5f560d96966835c7803d07849da9be385&amp;dn=Documentary+Pack++%28Including+Subtitle+Files+in+Many+Languages%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"eddie1969","files":179,"time":1253974252,"description":"******************** PLEASE READ FIRST ******************** \n\nCompilation of some very interesting and mind-blowing documentary films.\n\nSubtitles in several languages are included (mainly portuguese, spanish, english, german, french, greek, russian, turkish, czech and others - please check the list below).\n\nEnglish audio. \n\n\n\nThe purpose of this compilation is to facilitate the access to a series of contents which may be a starting point to get people questioning and rethinking the society, economy, environment and values in which they live.\n\nIt is essential to research and educate ourselves, to be aware of what surrounds us, to ask questions and search for answers. CRITICAL THINKING is of the utmost importance. Don't give in to apathy!\n\n&quot;A great revolution in just one single individual will help achieve a change in the destiny of a society and, further, will enable a change in the destiny of humankind.&quot; - Daisaku Ikeda (Japanese Peace Activist)\n\nIf you find any of these documentaries or its contents to be of interest, please be so kind to SEED. Thanks.\n\n\n******************** DOCUMENTARIES AND SUBTITLES INCLUDED ******************** \n\n[1996] The Money Masters [subtitles: english, portuguese, russian, serbian]\n\n[2002] Bowling for Columbine [subtitles: chinese, czech, english, hebrew, hungarian, portuguese, slovak, spanish, swedish, turkish] \n\n[2003] Earthlings [subtitles: chinese, czech, english, french, german, greek, hungarian, portuguese, romanian, russian, slovak, spanish]\n\n[2004] Fahrenheit 911 [subtitles: chinese, english, estonian, german, hebrew, korean, portuguese, slovak, spanish, turkish]\n\n[2004] The Corporation [subtitles: czech, french, german, hebrew, hungarian, portuguese, spanish, turkish] \n\n[2006] Iraq for Sale - The War Profiteers [subtitles: portuguese, spanish]\n\n[2006] Jesus Camp [subtitles: czech, english, french, italian, portuguese, romanian, russian, spanish]\n\n[2006] Who killed the Electric Car [subtitles: english, finnish, french, greek, hungarian, portuguese, slovak, spanish] \n\n[2006] Why We Fight [subtitles: dutch, english, french, greek, hungarian, portuguese, spanish]\n\n[2007] Endgame - Blueprint for Global Enslavement [subtitles: english, finnish, polish, portuguese, russian, serbian, spanish, swedish]\n\n[2007] Loose Change Final Cut [subtitles: dutch, greek, portuguese, spanish]\n\n[2007] Sicko [subtitles: arabic, danish, english, french, hebrew, portuguese, russian, spanish, turkish]\n\n[2007] Taking Liberties Since 1997 [subtitles: dutch]\n\n[2007] TerrorStorm 2nd Edition [subtitles: portuguese, spanish] \n\n[2007] Zeitgeist - Final Edition [subtitles: czech, danish, english, finnish, french, german, greek, hebrew, hungarian, italian, portuguese, serbian, spanish] \n\n[2008] Flow For the Love of Water [subtitles: spanish]\n\n[2008] Wake Up Call - Remastered Edition [subtitles: portuguese]\n\n[2008] Zeitgeist Addendum [subtitles: croatian, czech, danish, english, finnish, french, german, greek, hebrew, italian, portuguese, romanian, russian, spanish, turkish] \n\n[2009] HOME [subtitles: arabic, bulgarian, croatian, czech, dutch, english, german, polish, portuguese, romanian, spanish]] \n\n\n******************** IMPORTANT INFO ********************\n\n::::::::::DVD-RIPS:::::::::: \nThese documentary films circulate on the web thanks to the ones who had the generosity of spirit to rip and share them.\nAll the credits go to them. \n\n::::::::::SUBTITLES::::::::::\nIn order to make these documentaries accessible to as many people as possible, subtitles in several languages were included.\n\nThese files were collected from free websites. They may contain some spelling/translation errors. \n\nAll of them were checked and are synchronized with the respective video.\n\nPlease remember these subtitles were made by volunteers, who generously gave their time and effort to create them, so that these contents could reach more people.\nAll the credits go to them.\n\nThese are all external subtitles (.srt files). \n\nThe reason why some of the films have considerably less subtitles included is that I really couldn't find other languages anywhere. \n\nIt is possible that someone has since made more subtitles available on the web, so, if you need them, try to google it.\n\n::::::::::PLEASE SEED:::::::::\nIf you find any value in any of these, please seed and spread the word. \nAny help in keeping the torrent alive is most welcome.\n\nThanks.\nPeace and all the best.","torrent":{"xt":"urn:btih:95c844c5f560d96966835c7803d07849da9be385","amp;dn":"Documentary+Pack++%28Including+Subtitle+Files+in+Many+Languages%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95c844c5f560d96966835c7803d07849da9be385","infoHashBuffer":{"type":"Buffer","data":[149,200,68,197,245,96,217,105,102,131,92,120,3,208,120,73,218,155,227,133]},"announce":[],"urlList":[]}}