{"title":"Disaster At Stalingrad - An Alternate History (2013) By Peter Ts","uid":9590111,"size":17210291,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:960d268b8302f550daf29d8172d539119dca9417&amp;dn=Disaster+At+Stalingrad+-+An+Alternate+History+%282013%29+By+Peter+Ts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"GoonerTPB","files":3,"time":1391889671,"description":"Format: mobi/epub/azw3\nLength: 256 pages\nGenre: Alternate History\nDate: 18 December 2013\n\nIt is early September 1942 and the German commander of the Sixth Army, General Paulus, assisted by the Fourth Panzer Army, is poised to advance on the Russian city of Stalingrad. His primary mission was to take the city, crushing this crucial centre of communication and manufacturing, and to secure the valuable oil fields in the Caucasus. \n\nWhat happens next is well known to any student of modern history: a brutal war of attrition, characterised by fierce hand-to-hand combat, that lasted for nearly two years, and the eventual victory by a resolute Soviet Red Army. A ravaged German Army was pushed into full retreat. This was the first defeat of Hitler's territorial ambitions in Europe and a critical turning point of WWII. \n\nBut the outcome could have been very different, as Peter Tsouras demonstrates in this fascinating alternate history of this fateful battle. By introducing minor - and realistic - adjustments, Tsouras presents a scenario in which the course of the battle runs quite differently, which in turn throws up disturbing possibilities regarding the outcome of the whole war.\n\nAuthor:\n\nPeter Tsouras is a respected military historian and the author of Disaster at D-Day, Hitler Victorious, Gettysburg: An Alternate History, Third Reich Victorious and Cold War Hot. \n","torrent":{"xt":"urn:btih:960d268b8302f550daf29d8172d539119dca9417","amp;dn":"Disaster+At+Stalingrad+-+An+Alternate+History+%282013%29+By+Peter+Ts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"960d268b8302f550daf29d8172d539119dca9417","infoHashBuffer":{"type":"Buffer","data":[150,13,38,139,131,2,245,80,218,242,157,129,114,213,57,17,157,202,148,23]},"announce":[],"urlList":[]}}