{"title":"Android Application Development for Dummies (7Summits)","uid":7000673,"size":10376146,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:963d7d3807c302c3ff2764e7ef5667c65c7b4991&amp;dn=Android+Application+Development+for+Dummies+%287Summits%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"7_summits","files":-1,"time":1328044166,"description":"Publisher: For Dummies, 2010 | ISBN: 978-0-470-77018-4 | 388pages | PDF | 9.89MB\n\nThe fun and friendly guide to creating applications on the Android platform\n\nThe popularity of the Android market is soaring with no sign of slowing down. The open nature of the Android OS offers programmers the freedom to access the platform's capabilities and this straightforward guide walks you through the steps for creating amazing Android applications. Android programming expert Donn Felker explains how to download the SDK, get Eclipse up and running, code Android applications, and submit your finished products to the Android Market. Featuring two sample programs, this introductory book explores everything from the simple basics to more advanced aspects of the Android platform.\n\n   - Takes you soup through nuts of developing applications for the Android platform\n   - Begins with downloading the SDK, then explains how to code Android applications and submit projects to the Android Market\n   - Written by Android guru Donn Felker, who breaks every aspect of developing applications for the Android platform into easily digestible pieces\n\nNo matter your level of programming experience, Android Application Development For Dummies is an ideal guide for getting started with developing applications for the Android platform.","torrent":{"xt":"urn:btih:963d7d3807c302c3ff2764e7ef5667c65c7b4991","amp;dn":"Android+Application+Development+for+Dummies+%287Summits%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"963d7d3807c302c3ff2764e7ef5667c65c7b4991","infoHashBuffer":{"type":"Buffer","data":[150,61,125,56,7,195,2,195,255,39,100,231,239,86,103,198,92,123,73,145]},"announce":[],"urlList":[]}}