{"title":"John Anthony West - Magical Egypt A Symbolist Tour Of Ancient Eg","uid":8537748,"size":5872139096,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:96590c759d64a9b748ea98df6e2b516bca607e67&amp;dn=John+Anthony+West+-+Magical+Egypt+A+Symbolist+Tour+Of+Ancient+Eg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Jehuti","files":-1,"time":1370303116,"description":"If you like this please consider buying the full DVD set at John Anthony Wests website http://www.jawest.net/\n\n\n\n\nRuntime: 8 x 60 minutes aprox\n\nFrame Rate: 656w x 480h\n\nBitrate: 1763kbps\n\nAudio: 192 kbps 48KHz MP3\n\nOriginal Release Date: 2006\n\n\nMagical Egypt 1: The Invisible Science \n\n\nA growing body of evidence us suggesting a missing chapter in human history. Symbolist author and Egyptologist John Anthony West explores evidence of a sophisticated science behind the unexplainable accomplishments of Ancient Egypt. Was Ancient Egypt the inheritor of a body of scientific and spiritual knowledge from an even earlier civilization? Author / Mathematician Michael S Schneider discusses organic geometry and the role of the Fibonacci number series in growing life. West then demonstrates the presence of the Fibonacci series in the stages of construction of the temple of Karnak, also known as the &quot;House of Life&quot;. Featuring: Michael S Schneider - &quot;A Beginner's Guide to Constructing the Universe&quot; - Starring: John Anthony West - &quot;Mystery of the Sphinx&quot; \n\n \nMagical Egypt 2: The Old Kingdom &amp; The S... \n\n\nJohn Anthony West explores architectural anomalies and other evidence of an advanced civilization pre-dating the ancient Egyptians. Across Egypt, the many architectural engineering artistic and scientific wonders still defy explanation. They mysterious Oserion appears to already have been an ancient ruin when it was &quot;uncovered&quot; by Seti I during the construction of the Temple of Abydos in the first Dynasty. New developments in the &quot;age of the sphinx? Debate. In the Cairo museum is a Stella, which describes reparations to the great sphinx performed by the Father of the traditionally credited builder. Does the great sphinx conceal its own date of construction in the age of Leo? -- Featuring: John Anthony West - &quot;Mystery of the Sphinx&quot;\n\n \nMagical Egypt 3: Descent \n\n\nAn obscure and very ancient ruin in the deep of the Egyptian desert is found to contain an accurate sculpture of our Milky Way as well as 23 of its neighbours. It also shows the trajectory and accurate distances to significant stars in the constellation of Orion. Astrophysicist and areche-astronomer Thomas G Brophy present his bombshell discovery. -- Featuring: Dr. Thomas Brophy - &quot;The Mechanism Demands a Mysticism&quot; \n \n \nMagical Egypt 4: The Temple In Man \n\n\nThe temple was the teaching&quot; A look at the ancient Egyptian temple as an interactive repository of ancient teaching. After more than 17 years onsite at Luxor Temple, the enigmatic mathematician philosopher and modern-day alchemist R.A. Schwaller de Lubics discovered a key that unlocks a timeless teaching encoded in stone. Does Luxor temple conceal and ancient teaching about the metaphysical anatomy of man? West explores the controversial findings of Schwaller de Lubics and the biometric data he discovered hidden in this remarkable temple. -- Featuring: John Anthony West - &quot;Mystery of the Sphinx&quot;\n\n \nMagical Egypt 5: Navigating The Afterlife... \n\n\nDid the ancient Egyptian technology extend into mastery of the afterlife? In the Valley of the Kings, the tomb of Seti I and Tuthmosis III have been closed to the public for over a decade. Arcane funerary texts cover the walls of the tombs with a bewildering list of spell and secrets that all the deceased to navigate the afterlife. Dr Rick Strassman, author of &quot;DMT: The Spirit Molecule&quot; discuss the biochemistry of the death experience and the role of the mysterious pineal gland. Our powerful interaction with DMT is shedding new light on the ancient understanding of the &quot;third eye&quot; or pineal gland as the seat of consciousness. Lon Milo Duquette discusses the strange state of consciousness known as lucid dreaming and its unexpected relationship with the afterlife experience. -- Featuring&quot; Dr. Rick Strassman - &quot;DMT The Spirit Molcule&quot; &amp; Lon Milo DuQuette -&quot;Angelsm Demons &amp; God of the New Millennium&quot;\n\n \nMagical Egypt 6: Legacy \n\n\nThe ancient Arabic name for Egypt was &quot;Khemet&quot;, or &quot;The Black Land&quot;. The western continuation of the Egyptian magical arts was called &quot;Al-Khemet&quot;, meaning &quot;from the Black Land&quot;. The cradle of civilization is also the ancestral home of a high science of magic. We explore the many modern encarnations of the ancient science of perfection and the transformation of the 'materia prima&quot; of the Alchemists. From Alchemy to Tarot, and in the many modernpar esoteric and mystical societies existing today, we explore the hidden thread that connects modern and ancient magic-The occultpar idea that consciousness is the materia prima. The coal that turns into a diamond. The lead that becomes gold. -- Featuring: Lon Milo DuQuette -&quot;Angelsm Demons &amp; God of the New Millennium&quot;\n\n \nMagical Egypt 7: Illumination \n\n\nTwice a year, on the anniversary of the Ramses birth and coronation day, the rising sun penetrates the temple to illuminate the four gods of creation situated at it's very core. As we witness this rare spectacle, we gain an understanding of the ancient temple, not just as a place of worship, but as an essential mechanism of the ancient magical practices. West is joined by bestselling author researcher Robert Bauval at the temple of Abu Simbel. We look at the temple, statuary and hieroglyphs as examples of talismanic technology. Lon Milo Duqette discusses modernpar applications of talismanic technology. -- Featuring: Robert Bauval -&quot;Talisman&quot; &amp; Lon Milo DuQuette -&quot;Angelsm Demons &amp; God of the New Millennium&quot; \n\n \nMagical Egypt 8: Cosmology \n\n\nA comparison of ancient and modern models of the structure of the universe reveal unexpected similarities. As our most recent scientific understanding is bringing the subatomic realms into ever clearer focus, the strange world of quantum mechanics and string theory are finding a remarkable consistent echo in the cosmology, or creation myth the ancient Egyptians. Could there be complex scientific notation hidden in ancient hieroglyphics? Author/researcher Laird Scranton demonstrates an unexplainable accurate description of subatomic structure, quantum physics, cellular biology and even string par theory, hidden in ancient accounts of the formation of the universe. If Scranton's discovery proves true, it may be the most important breakthrough in Egyptology sincepar the discovery of the Rosetta Stone. -- Featuring: Laird Scanton - &quot;Hidden Meanings&quot;","torrent":{"xt":"urn:btih:96590c759d64a9b748ea98df6e2b516bca607e67","amp;dn":"John+Anthony+West+-+Magical+Egypt+A+Symbolist+Tour+Of+Ancient+Eg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96590c759d64a9b748ea98df6e2b516bca607e67","infoHashBuffer":{"type":"Buffer","data":[150,89,12,117,157,100,169,183,72,234,152,223,110,43,81,107,202,96,126,103]},"announce":[],"urlList":[]}}