{"title":"Minidoka - Edgar Rice Burroughs rarest!","uid":11740292,"size":869276,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96c9d29bbc35a47825562233b5d8e963304a350f&amp;dn=Minidoka+-+Edgar+Rice+Burroughs+rarest%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"amontoth","files":2,"time":1425763091,"description":"Minidoka - Edgar Rice Burroughs\nFirst ePUB Edition 2012\nFirst Release March 2015\n\n\nThis is one the 35 projects I was workign on when Demonoid and my Rareities thread went down for a few years.\nEven after the site came back, I had other disasters happening in my life and just couldn't get back into the mood.\n-Amontoth\n\n\nERB Scholar David Adams in his Chattering From The Shoulder:\n&quot;The Wizards of California: Baum &amp; Burroughs&quot; column in ERBzine 0303 suggests:\n\n&quot;The amazing thing about Minidoka is the fact that it is kind of an Ur-text or a primitive template from which all of his subsequent stories are drawn.  It might just be a line here or a line there, but it all sounds strangely familiar.\n\n&quot;There are flying monkeys in Minidoka.  When Minidoka, Bodine, and Rhi visit  Nevaeh (&quot;heaven&quot; spelled backwards) it is a yawning abyss leading to the center of the Earth. Here they meet Tnias Retep (a reverse Saint Peter) who introduces them to Anthropop, the father of monkeys, (Ape-Adam) who had been in Nevaeh so long that he knew more about it and all the animals there than anyone else.  This Adam is now a winged monkey who had worked up to the seventh cube and had earned his angel wings.  He acts as a Virgil-guide in this Hell for animal abusers, who  are punished by the very animals they were cruel to while on Earth.\n\n          'Til every snarling skull, with moans, And ghastly groans, each sin atones.'\n\nFish catch the humans who caught them on Earth and tear the hooks from their cheeks. Hunters are the hunted.  Dogs kick half-starved men who return to lick the paw that bruised them.  'Down one great avenue fled the shades of a thousand-thousand-thousand women pursued by the beasts and birds whose furs and feathers had bedecked the women on Earth.'  Maybe we aren't so far from Caspak and the Wieroos after all.&quot;\n Minidoka: An Early Catalogue of ERB's Themes\n\n\nEVERY WRITER has a first work. These first works explore the subconscious mind, mining a wealth images lurking there, and if the writer can put those thoughts and images down on paper in an interesting way, he or she may become an author.. It is this early exploration and struggle with primal images and themes that often form or suggest the body of work for the rest of the author's life.\n Minidoka is a story Burroughsian scholars might explore line-by-line by should one have the time and inclination. Many of the themes found in ERB's later novels are present in embryonic form, awaiting a birth that will begin to take place in 1911's A Princess of Mars.\n\n--http://www.erblist.com/erbmania/nkima/nkimaminidoka.html","torrent":{"xt":"urn:btih:96c9d29bbc35a47825562233b5d8e963304a350f","amp;dn":"Minidoka+-+Edgar+Rice+Burroughs+rarest%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96c9d29bbc35a47825562233b5d8e963304a350f","infoHashBuffer":{"type":"Buffer","data":[150,201,210,155,188,53,164,120,37,86,34,51,181,216,233,99,48,74,53,15]},"announce":[],"urlList":[]}}