{"title":"Kane and Lynch 2 [PAL][PS3][Multi6][Spanish][www.consolasatope.c","uid":5865367,"size":9071552022,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:970a25eb38cd5604f54e30e8370fec234f0ff4f1&amp;dn=Kane+and+Lynch+2+%5BPAL%5D%5BPS3%5D%5BMulti6%5D%5BSpanish%5D%5Bwww.consolasatope.c&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":6,"uploader":"consolasatope","files":499,"time":1286143278,"description":"Release name: Kane.and.Lynch.2.PAL.JB-DNL \nPlataforma: PS3\nGÃƒÂ©nero: AcciÃƒÂ³n-Shooter\nRegiÃƒÂ³n: EUR\nLanguages: ENG GER SPA IT JAP RUS (EspaÃƒÂ±ol 100%)\nFormato: FullBluRay\nTamaÃƒÂ±o Desomprimido: 8,48 GB\nCompresiÃƒÂ³n: Rar\nMÃƒÂ©todo de carga: Ps3key vers firm 2.1 disco duro externo e interno funcionando OK\n\n\n\nPonte en la piel de dos de los delincuentes mÃƒÂ¡s inquietantes y realistas del mundo de los videojuegos. ConviÃƒÂ©rtete en Lynch, un impulsivo e imprudente psicÃƒÂ³pata automedicado, o en Kane, un calculador estratega y ex mercenario. Vive su desesperada lucha por huir por callejones y tejados en el descarnado mundo de Shangai. No pueden fiarse de nadie, ni siquiera del otro, ya que la cordura de Lynch y la estabilidad de Kane pronto empezarÃƒÂ¡n a desquebrajarse. Es matar o morir.\n\nKane &amp; Lynch 2: Dog Days es un sangriento shooter totalmente brutal diseÃƒÂ±ado para enfrentarse a una experiencia aÃƒÂºn mÃƒÂ¡s intensa, siguiendo los pasos de dos de los criminales mÃƒÂ¡s perturbados de los videojuegos, a travÃƒÂ©s del peligroso mundo del hampa de Shanghai. Kane &amp; Lynch 2: Dog Days presenta una experiencia visual completamente innovadora, inspirada en los documentales y las pelÃƒÂ­culas experimentales. Cada faceta del juego se ha diseÃƒÂ±ado para imprimir una nueva perspectiva a los tÃƒÂ©rminos &quot;intensidad&quot; y &quot;realismo&quot; en los videojuegos. MÃƒÂ¡s allÃƒÂ¡ de su particular estilo y su violento argumento, Kane &amp; Lynch 2: Dog Days ofrece acciÃƒÂ³n total para un jugador, modo cooperativo online y offline y renovados modos multijugador, como el regreso del aclamado Alianza FrÃƒÂ¡gil, junto al nuevo modo Poli infiltrado, y la modalidad de PolicÃƒÂ­as y Ladrones, cada una de las cuales aumentarÃƒÂ¡n los niveles de avaricia, traiciÃƒÂ³n y venganza\n","torrent":{"xt":"urn:btih:970a25eb38cd5604f54e30e8370fec234f0ff4f1","amp;dn":"Kane+and+Lynch+2+%5BPAL%5D%5BPS3%5D%5BMulti6%5D%5BSpanish%5D%5Bwww.consolasatope.c","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"970a25eb38cd5604f54e30e8370fec234f0ff4f1","infoHashBuffer":{"type":"Buffer","data":[151,10,37,235,56,205,86,4,245,78,48,232,55,15,236,35,79,15,244,241]},"announce":[],"urlList":[]}}