{"title":"Cultural Mythology and Global Leadership,2010","uid":6220201,"size":7534085,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98036b855f26d037748c13d6be4570242c58dd99&amp;dn=Cultural+Mythology+and+Global+Leadership%2C2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"lionzbay","files":1,"time":1299304622,"description":"Author(s): Eric H. Kessler\nPublisher: Edward Elgar Publishing\nDate: 2010-07-28\nFormat: pdf\nLanguage: English\nISBN10: 1849801800\nPages: 416\nISBN13: 9781849801805\n\nProduct Description: 'Essential reading for all practitioners and researchers who seek to gain greater insights on cultural differences and leadership competencies.'\n- Rosalie Tung, Simon Fraser University, Past President, Academy of Management and author of 11 books including Learning from World Class Companies\n\n`This fascinating collection of local mythology shows how widely leadership models differ across nations, and how deeply these differences are rooted. True global leadership is based on empathy with local variety.'\n- Geert Hofstede, Maastricht University, The Netherlands, author of Culture's Consequences: Comparing Values, Behaviors, Institutions and Organizations Across Nations\n\n`I have yet to come across a more captivating study of global leadership patterns. The reader is taken into largely unchartered territory linking globalisation, culture and leadership. Delving deep into folklore, mythology and spirituality we begin to understand how these are manifested in human behaviour and are exhibited in leadership styles. A must-read!'\n- S. Ramadorai, CEO of Tata Consultancy Services\n\nThis ground-breaking book explains how deep-seated cultural mythologies shape contemporary global leaders and provides insights into navigating the dynamics and complexities in today's era of globalization. The authors use myths to uncover core characteristics and values from 20 different cultural contexts spanning all major regions of the world - the Americas, Europe, Africa and the Middle East, and Asia and the Pacific Rim - that have evolved over generations and continue to shape global leadership models. Commentaries are included from practicing managers and leaders to provide real world insights on the implications of the ideas discussed. International managers and executives, public officials, business consultants and corporate trainers will welcome the insights on cross-cultural leadership styles. The book will also find interest from researchers and students across a broad array of professional and social science disciplines.","torrent":{"xt":"urn:btih:98036b855f26d037748c13d6be4570242c58dd99","amp;dn":"Cultural+Mythology+and+Global+Leadership%2C2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98036b855f26d037748c13d6be4570242c58dd99","infoHashBuffer":{"type":"Buffer","data":[152,3,107,133,95,38,208,55,116,140,19,214,190,69,112,36,44,88,221,153]},"announce":[],"urlList":[]}}