{"title":"U.S. Founding Fathers and Religion","uid":15277716,"size":242652355,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98160ed977ef55027a1a6e7a9ea02428c99e6a5a&amp;dn=U.S.+Founding+Fathers+and+Religion&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"jesus_malverde","files":25,"time":1468317525,"description":"A small selection of essential texts about the issue of religious freedom in the Revolutionary Era. The included books by no means exhaust the subject, either in the historical or historiographical sense. Much has been written and more will be added, whether or not it enhances the debate. \r\nLazy minds divide the issue into two neat and discrete categories that defy historical accuracy: America’s founders never did anything without a Bible at hand and were constantly attended by angels; or, America’s revolutionary leaders were closet atheists who despised religion and would have explicitly abolished all religion had they known how credulous future generations would be. These depictions are hyperbole, of course, yet the views they invoke are likewise absurd exaggerations of the facts. \r\nI believe that one of these camps is indeed closer to the truth than the other and that this may be discovered through study of the sources. Yet, for all the shrillness of the debate, it seems to me that both sides in our contemporary contest might have something to learn from the other. Whether they will is another matter. Perhaps we can all agree that though we should not necessarily be ruled in all things by the thought of the past, there are many occasions when we may profit from its wisdom. It is in this spirit that this torrent is offered.\r\nThomas S. Kidd, God of Liberty\r\nMatthew L. Harris &amp; Thomas S. Kidd, The Founding Fathers and the Debate Over Religion in Revolutionary America\r\nSteven Green, Inventing a Christian America\r\nSidney Ahlstrom, A Religious History of the American People\r\nPhilip Hamburger, Separation of Church and State\r\nForrest Church, So Help Me God\r\nEdwin Gaustad, Sworn on the Altar of God\r\nLester Cappon, The Adams-Jefferson Letters\r\nFrank Lambert, The Founding Fathers and the Place of Religion in America\r\nJohn Fea, Was America Founded as a Christian Nation?\r\nGregg Frazer, Religious Beliefs of America’s Founders\r\nJohn Ragosta, Religious Freedom, Jefferson’s Legacy\r\nThomas Paine, Age of Reason (the most widely reprinted religious text of the era)","torrent":{"xt":"urn:btih:98160ed977ef55027a1a6e7a9ea02428c99e6a5a","amp;dn":"U.S.+Founding+Fathers+and+Religion","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98160ed977ef55027a1a6e7a9ea02428c99e6a5a","infoHashBuffer":{"type":"Buffer","data":[152,22,14,217,119,239,85,2,122,26,110,122,158,160,36,40,201,158,106,90]},"announce":[],"urlList":[]}}