{"title":"Thrillville Off The Rails [English][PSP]","uid":3841642,"size":426573215,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:98383596604cbfb432be63242dc6a25f59652fae&amp;dn=Thrillville+Off+The+Rails+%5BEnglish%5D%5BPSP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"changoboy","files":30,"time":1192358944,"description":"Thrillville: Off the Rails amps up the family-friendly mix of gameplay with some of the most outlandish roller-coaster concepts ever imagined, as well as new ways to talk to park guests and a new array of carnival games. 20 death-defying rides so outrageous inspire the same word from every park visitor who sees them: &quot;WHOA!&quot; Build incredible &quot;WHOA Coasters&quot; to leap from one track to another, launch through the air like cannonballs, blast through a burning ring of fire and more. A new lighthearted story ties together more than 100 missions, complete with 34 playable multiplayer theme-park games and social interaction with park guests thats better than ever. The in-depth conversations both advance the plot and suggest better ways to manage the park but is every guest to be trusted Smarter guests, better dialogue and more focused two-way conversation make Thrillvilles socialization aspects even more amusing than before Conversation more directly impacts the story than in the original Thrillville Play 34 minigames - 14 new, 20 returning from the original Thrillville with new levels such as Robo K.O., Sparkle Quest, Bandito Chinchilla and Tank Frenzy.","torrent":{"xt":"urn:btih:98383596604cbfb432be63242dc6a25f59652fae","amp;dn":"Thrillville+Off+The+Rails+%5BEnglish%5D%5BPSP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98383596604cbfb432be63242dc6a25f59652fae","infoHashBuffer":{"type":"Buffer","data":[152,56,53,150,96,76,191,180,50,190,99,36,45,198,162,95,89,101,47,174]},"announce":[],"urlList":[]}}