{"title":"The Forts of Celtic Britain","uid":11829896,"size":56772040,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9847dd6dcf35c038933f9878880e46ecab30960d&amp;dn=The+Forts+of+Celtic+Britain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429593803,"description":"Half a millennium before the Romans first arrived in Britain an even more ferocious people arrived in what is now south-eastern England after migrating from the mainland of Europe. This civilisation, known as the Celts first arrived in Britain in the 6th century BC, and within 300 years had made the island their own. The Celts remained in Britain long after the Romans departed, and although driven into the remoter corners of the island by English invaders the people who remained clung onto their Celtic heritage, and defended their remaining lands against all-comers. In order to defend their lands from other tribes or outside invaders these people established powerful fortified sites that served as places of refuge in wartime and as administrative and trading centres in times of peace. Above all these came to symbolise tribal power, a dramatic symbol of territorial ownership and military might. These forts varied considerably from region to region, from the mysterious brochs and duns found in northern Britain to the promontory forts that formed powerful coastal strongholds all around the island's shores. Even more commonly these Celtic strongholds took the form of hill-forts, ranging in size from small, fortified hilltop villages to sprawling military citadels. These are the forts that form the subject of this fascinating Fortress series title","torrent":{"xt":"urn:btih:9847dd6dcf35c038933f9878880e46ecab30960d","amp;dn":"The+Forts+of+Celtic+Britain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9847dd6dcf35c038933f9878880e46ecab30960d","infoHashBuffer":{"type":"Buffer","data":[152,71,221,109,207,53,192,56,147,63,152,120,136,14,70,236,171,48,150,13]},"announce":[],"urlList":[]}}