{"title":"MILF 1713 - Cum Draining Physical - Rachel Steele (540p)","uid":15231358,"size":345866688,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:98ec3fb7e39feb5c39a7f0f8a79ae643900db704&amp;dn=MILF+1713+-+Cum+Draining+Physical+-+Rachel+Steele+%28540p%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"ElitePorn","files":1,"time":1467827613,"description":"MILF 1713 - Cum Draining Physical - Rachel Steele (540p)\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\nSexy high school nurse Rachel Steele believes she can judge a young man's physical condition by tasting his cum. Today she has the pleasure of testing a student who needs her to give him a clean bill of health before he can join the school's basketball team. When he turns up at Rachel's office, she first gets him to sign a form. Part of its small-print says that he grants her permission to carry out whatever tests she feels are necessary.\r\n\r\nFrom that moment on, Rachel is safe to get as naughty as she likes. It does not take her long to do so. After a routine check of the young man's heart-rate, she pulls his cock out of his pants and begins stroking it. Not once does her professional manner slip. Rather she reminds the student of his responsibilities to cooperate with her and let her finish her examination. While she continues her skilful and sensual handjob, Rachel becomes impressed and excited by the signs of vitality in the young man - by the constant hardness and hot throbbing of his cock. This leads to her removing her blouse and kicking off her shoes.\r\n\r\nOut of her own horniness and a desire to arouse the student further, she pulls her nipples out of her bra cups and shows off her bare stocking-clad feet. Having briefly rubbed them against his balls, she gets down on her knees and eagerly takes his cock into her mouth. Eagerly and for a long time she licks and sucks it - relishing its taste.\r\n\r\nAt last, following further cock-stroking and nursely lecturing, she causes the student to blast a load of creamy cum into a condom. This she raises above her head and then tips upside down so that the contents pour into her open, welcoming mouth! Rachel tastes and swallows it all with wicked delight. Her verdict: the young man is in the best of health. Afterwards, she hands him some papers giving him the all-clear to play basketball. Putting her clothes back on when she is alone, Rachel smiles broadly to herself. She sure loves her job! \r\n\r\nScreenshots:\r\n~~~~~~~~~~~~ \nhttp://picturevip.com/x/clean/kJs\r\n \nhttp://picturevip.com/x/clean/kJz\r\n \nhttp://picturevip.com/x/clean/kJS\r\n \nhttp://picturevip.com/x/clean/kJ5\r\n \nhttp://picturevip.com/x/clean/kJB\r\n \nhttp://picturevip.com/x/clean/kJK\r\n\r\n\r\nVideos Info:\r\n~~~~~~~~~~~~\r\nSize: 330 MB\r\nDuration: 28:12 min \t\r\nResolution: 720x540\r\n\r\n\r\nShow Your Appreciation - BitCoin: 1JxUQqRrvGC6txChvaZEbqSSsq9wtswoto","torrent":{"xt":"urn:btih:98ec3fb7e39feb5c39a7f0f8a79ae643900db704","amp;dn":"MILF+1713+-+Cum+Draining+Physical+-+Rachel+Steele+%28540p%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98ec3fb7e39feb5c39a7f0f8a79ae643900db704","infoHashBuffer":{"type":"Buffer","data":[152,236,63,183,227,159,235,92,57,167,240,248,167,154,230,67,144,13,183,4]},"announce":[],"urlList":[]}}