{"title":"Discrete &amp; Computational Geometry (2011)","uid":6543009,"size":7272409,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:990349050350a44c0e3c6bed3dccf973e21fe136&amp;dn=Discrete+%26+Computational+Geometry+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"theLEAK","files":-1,"time":1310759209,"description":"Discrete geometry is a relatively new development in pure mathematics, while computational geometry is an emerging area in applications-driven computer science. Their intermingling has yielded exciting advances in recent years, yet what has been lacking until now is an undergraduate textbook that bridges the gap between the two. Discrete and Computational Geometry offers a comprehensive yet accessible introduction to this cutting-edge frontier of mathematics and computer science.\n\nThis book covers traditional topics such as convex hulls, triangulations, and Voronoi diagrams, as well as more recent subjects like pseudotriangulations, curve reconstruction, and locked chains. It also touches on more advanced material, including Dehn invariants, associahedra, quasigeodesics, Morse theory, and the recent resolution of the Poincare conjecture. Connections to real-world applications are made throughout, and algorithms are presented independently of any programming language.\n\nThis richly illustrated textbook also features numerous exercises and unsolved problems. The essential introduction to discrete and computational geometry Covers traditional topics as well as new and advanced material Features numerous full-color illustrations, exercises, and unsolved problems Suitable for sophomores in mathematics, computer science, engineering, or physics Rigorous but accessible","torrent":{"xt":"urn:btih:990349050350a44c0e3c6bed3dccf973e21fe136","amp;dn":"Discrete+%26+Computational+Geometry+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"990349050350a44c0e3c6bed3dccf973e21fe136","infoHashBuffer":{"type":"Buffer","data":[153,3,73,5,3,80,164,76,14,60,107,237,61,204,249,115,226,31,225,54]},"announce":[],"urlList":[]}}