{"title":"Strategic Air Command (Jimmy Stewart, 1955)","uid":4542862,"size":762437977,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9955f9aaf3e178de2b5a2d5958d135f1c85cd997&amp;dn=Strategic+Air+Command+%28Jimmy+Stewart%2C+1955%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GungaDan","files":75,"time":1228010212,"description":"This is a very interesting piece of Cold War propaganda from Hollywood, showing the importance of accepting a call back to service to prevent a third world war, and how the wife of an officer recalled should support her husband in doing so. \n\nIn addition to this theme, for aviation buffs, there is interesting footage of three key aircraft. First is the B-36, a giant six-prop bomber (with a couple of jets for added thrust during takeoff), which was the first aircraft in service of the United States Military that had been designed specifically to deliver nuclear weapons. The second is the B-47 Stratojet, which was a much more capable (range, speed, altitude, and duration) bomber than the B-36, and served as a stop-gap aircraft until the B-52 Stratofortress was ready for service. Incidentally, the B-52 is still in service today. Finally there is one segment which shows a great many of the C-124 Globemaster cargo aircraft, being loaded. This is the aircraft my father worked on, in the USAF during the Cuban Missile Crisis.\n\nThis is a great film for anyone with an interest in the Cold War, and particularly in Cold War aviation and its important role in US military doctrine of the age, as dictated by technology.","torrent":{"xt":"urn:btih:9955f9aaf3e178de2b5a2d5958d135f1c85cd997","amp;dn":"Strategic+Air+Command+%28Jimmy+Stewart%2C+1955%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9955f9aaf3e178de2b5a2d5958d135f1c85cd997","infoHashBuffer":{"type":"Buffer","data":[153,85,249,170,243,225,120,222,43,90,45,89,88,209,53,241,200,92,217,151]},"announce":[],"urlList":[]}}