{"title":"Thanos: The Mad Titan - Infinity Trilogy and Appearances","uid":5586795,"size":6240956519,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:99891748981683f828b8421f1b7aa79f8bc8ae34&amp;dn=Thanos%3A+The+Mad+Titan+-+Infinity+Trilogy+and+Appearances&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"brodahisou","files":-1,"time":1274722194,"description":"Thanos was created by writer-artist Jim Starlin and first appeared in Iron Man  #55 (Feb. 1973). The character's name is a derivation of Thanatos, the personification of death and mortality in Greek mythology.\n\nOn Saturn's moon of Titan lived a colony of Eternals, and Thanos was born as one of the last sons of the original colonists, Mentor and Sui-San.  Due to a genetic quirk, Thanos is born with the Deviant gene and as such resembles the Deviants - the Eternals' cousin race - more than his own people. Although treated fairly by his race, Thanos is mindful of his appearance and becomes distant, only keeping company with his brother Eros (Starfox). Thanos matures to adulthood, and via the use of bionics and mysticism augments his abilities to become the most powerful of the Titanian-born Eternals, and is often referred to as the Mad Titan.\n\nBitter at being an outsider, Thanos becomes fascinated with nihilism  and a worshipper of Death, embarking on his quest to &quot;please&quot; death by destroying all life in the universe.  Thanos has threatened the universe several times, most notably in the Cosmic Cube, Infinity Gems and Annihilation storylines.  \n\nThis torrent contains all of the Thanos's appearances and the complete storylines of The Infinity Gauntlet, The Infinity War, The Infinity Crusade and Blood and Thunder, as well as reading orders for each storyline and a Thanos Chronological Reading Order.\n\n\nReleased on &lt;a href=&quot; http://ComicPirates.info&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://ComicPirates.info&lt;/a&gt;","torrent":{"xt":"urn:btih:99891748981683f828b8421f1b7aa79f8bc8ae34","amp;dn":"Thanos%3A+The+Mad+Titan+-+Infinity+Trilogy+and+Appearances","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99891748981683f828b8421f1b7aa79f8bc8ae34","infoHashBuffer":{"type":"Buffer","data":[153,137,23,72,152,22,131,248,40,184,66,31,27,122,167,159,139,200,174,52]},"announce":[],"urlList":[]}}