{"title":"Journey Through the Past (1974) Neil Young","uid":3658056,"size":904706387,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9a144b840a8e41a07ff1566f271eac8733d8f5f6&amp;dn=Journey+Through+the+Past+%281974%29+Neil+Young&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Sheena1959","files":1,"time":1175967922,"description":"It&amp;#039;s been almost 30 years since I&amp;#039;ve seen this, so my memories are very foggy. It&amp;#039;s comprised of lots of footage of Neil Young and band members (including Crosby, Stills and Nash) in concert and rehearsing (I can clearly remember them rehearsing the song &quot;Alabama&quot; in a barn somewhere in Alabama). But the film is mostly a cornucopia of Neil Young&amp;#039;s eye view of the rural South circa 1972. Lots of rainy footage from the band&amp;#039;s bus: that sort of thing. There&amp;#039;s footage of an American Legion meeting with a rather healthy, corn-fed, white audience singing &quot;God Bless America&quot;. That&amp;#039;s interspersed with footage of the poverty-ridden conditions of the neighboring black towns (the South was still very segregated, and there were still significant numbers of people living in what was akin to Third World living conditions). There are two other scenes that I can recall. One is a scene with Neil and his wife (girlfriend?) eating strawberries, which is only memorable because it&amp;#039;s so lonnnnng! The other scene is a very trippy one, with guys dressed up as Ku Klux Klan members riding on horses on a beach, while the soundtrack from &quot;King of Kings&quot; is playing. Outrageous and fantastic! As memory serves, I don&amp;#039;t think it was a great film, but it was a rare opportunity to see glimpses of America not shown by Hollywood or on television. And if you&amp;#039;re a fan of Neil Young, it&amp;#039;s a chance to see him performing relatively early in his career. I think the film would be more essential to audiences today, because while the new young generation is always putting down on the &quot;hippie&quot; generation of the sixties, they&amp;#039;ve no idea what it REALLY was like, and how much it has changed - thanks to activists who fought the system and demanded change.\n\nI had the soundtrack record to this back in the seventies. It was quite good! It&amp;#039;s a shame it was never released on CD. A CD of that, and a DVD of this film is long overdue!","torrent":{"xt":"urn:btih:9a144b840a8e41a07ff1566f271eac8733d8f5f6","amp;dn":"Journey+Through+the+Past+%281974%29+Neil+Young","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a144b840a8e41a07ff1566f271eac8733d8f5f6","infoHashBuffer":{"type":"Buffer","data":[154,20,75,132,10,142,65,160,127,241,86,111,39,30,172,135,51,216,245,246]},"announce":[],"urlList":[]}}