{"title":"Joseph Campbell - World Mythology &amp; the Individual Adventure 2-2","uid":5989747,"size":430030252,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9a753868ddd143045a928a30146e3f7368d24387&amp;dn=Joseph+Campbell+-+World+Mythology+%26+the+Individual+Adventure+2-2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"geogaddi000","files":6,"time":1290846994,"description":"Volume 1 available here:\nhttp://thepiratebay.se/torrent/5989738/Joseph_Campbell_-_World_Mythology__amp__the_Individual_Adventure_1-2\n\n\nWorld Mythology and the Individual Adventure II\n\nJOSEPH CAMPBELL (1904 - 1987) was an anthropologist, mythologist, passionate teacher and masterful storyteller. Through his work, he brings nourishment to the spirit. He reconnects the mystery, the magic and the mythic heritage of our inner life to the cosmic life of the universe. He reawakens our curiosity in the ancient voices that knew truths that are as relevant to our lives today as they were in the distant past.\n\nJungian Psychology 1 1/2 Hours\n\nCampbell addresses Jung's view of myths as verbal mandalas, personifications of the individual's attempt to throw off the limits of social conditioning and attain full self-knowledge. The Jungian concepts of archetype, self, introversion, extroversion, animus. anima, ego and shadow are discussed in detail and related to mythology.\n\nThomas Mann &amp; fames Joyce 1 1/2 Hours\n\nCambell focuses on the work of Thomas Mann and |ames Joyce, two authors who have combined mythological themes and symbols with a naturalistic style of writing. For Mann, the contradictions of life are resolved through the attitude of &quot;erotic irony&quot;, the loving but critical acceptance of reality as it is, whereas for Joyce, the resolution is to be found in the conscious creation of artistic symbols that transcend duality.\n\nThe Grail Legends 1 1/2 Hours\n\nCampbell discusses the Grail legends and their concern with the conflict between the free spirit of nature and the organized structure of society. In these legends, the Grail, a symbol of spiritual freedom and enlightenment, is hidden in an enchanted castle. Campbell describes the quest of the knights in King Arthur's court, who seek to release the Grail from its enchantment.\n\nMan &amp; Myth Through the Ages - I &amp; II       3 Hours\n\nCampbell describes how mythology reflects culture, and how one of the best ways to understand the changes humanity has gone through during the last two million years is to look at the evolution of mythical symbols. Our present culture is experiencing alienation because the scientific method has stripped our mythology of historical and cosmological significance.","torrent":{"xt":"urn:btih:9a753868ddd143045a928a30146e3f7368d24387","amp;dn":"Joseph+Campbell+-+World+Mythology+%26+the+Individual+Adventure+2-2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a753868ddd143045a928a30146e3f7368d24387","infoHashBuffer":{"type":"Buffer","data":[154,117,56,104,221,209,67,4,90,146,138,48,20,110,63,115,104,210,67,135]},"announce":[],"urlList":[]}}