{"title":"Gothic Cathedrals (2015) (Pdf and Epub) Gooner","uid":14407516,"size":45829363,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b13c4fb8a97b18ff8f6161055ed13af0eed7118&amp;dn=Gothic+Cathedrals+%282015%29+%28Pdf+and+Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"GoonerTPB","files":2,"time":1461426670,"description":"Gothic Cathedrals - A Guide to the History, Places, Art and Symbolism (2015) (Pdf &amp; Epub) Gooner\r\n\r\nPublisher: Ibis Press (April 15, 2015)\r\nLanguage: English\r\nISBN-10: 0892541733\r\nISBN-13: 978-0892541737\r\n\r\nCross the threshold into the world of the High Middle Ages and explore the illuminating wisdom, beauty and art of the Gothic cathedrals, stunning wonders of the medieval era for all to see today. From bejewelled stained glass windows to a pilgrimage &quot;on the road&quot; to Compostela, the wonders of Gothic architecture continue to inspire many worldwide.\r\n\r\nFrom the 12th century, the Gothic architectural style continued to spread throughout Europe. Highly-regarded medievalist Dr. Karen Ralls explores the legacy of this exquisite architectural period, whose artistic beauty and expert craftsmanship have served for centuries to inspire feelings of spiritual reverence and aesthetic wonder. She details the relationship between architecture, geometry, and music; explores the concept of the labyrinth; pilgrimage; Black Madonnas; astronomical calculations in the design and location of cathedrals; stone and wood carvings; gargoyles; the teachings of Pythagoras and the later Neo-Platonists, and more. For the general reader and specialist alike, Dr. Ralls guides the reader through the history, places, art, and symbolism of these unique &quot;books in stone&quot;, providing a lively portal and solid resource for all.\r\n\r\nLavishly illustrated with color photographs, a recommended reading section, lists of the major European cathedral sites and a full Bibliography, Gothic Cathedrals is a fascinating showcase of the mystic and spiritual symbolism found in these great structures of Europe, information that will help modern readers visit these sites and share in the energy of the sacred they continue to radiate","torrent":{"xt":"urn:btih:9b13c4fb8a97b18ff8f6161055ed13af0eed7118","amp;dn":"Gothic+Cathedrals+%282015%29+%28Pdf+and+Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b13c4fb8a97b18ff8f6161055ed13af0eed7118","infoHashBuffer":{"type":"Buffer","data":[155,19,196,251,138,151,177,143,248,246,22,16,85,237,19,175,14,237,113,24]},"announce":[],"urlList":[]}}