{"title":"Power Rangers Ninja Storm (Legacy Collection and Beyond)","uid":11745870,"size":14648075824,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9b1d59d7589ea0e4233004c32086ab77407eb7bc&amp;dn=Power+Rangers+Ninja+Storm+%28Legacy+Collection+and+Beyond%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"CeraKesh","files":39,"time":1426015342,"description":"Rangers Forever! Earth's defenders never surrender!\n\nThese are HQ x264 rips from the Power Rangers Legacy Collection DVDs.\n\n[img]http://vignette1.wikia.nocookie.net/powerrangers/images/5/5c/Ninja_Storm_poster.jpg/revision/latest?cb=20120120084931[/img]\nPower Rangers: Ninja Storm (often abbreviated as &quot;PRNS&quot;) was the eleventh incarnation of the Power Rangers TV series, based on the Super Sentai series NinpÅ« Sentai Hurricaneger (English: Covert Wind Squadron Hurricaneger)\n\nAfter acquiring Power Rangers in 2002 as part of their purchase of the Fox Kids franchise, Disney decided to cancel the show at the conclusion of Power Rangers Wild Force, but were convinced to continue with the show when informed they could produce it for a fraction of the previous cost by moving production to New Zealand. As well as this, Disney chose to make the show non-union, which resulted in much of the crew (including long-time producer Jonathan Tzachor) being let go. Ninja Storm was based on the Super Sentai series NinpÅ« Sentai Hurricanger. A subsidiary of Disney named Buena Vista Entertainment managed the Power Rangers property after Disney took over, and MMPR Productions was dissolved. Doug Sloan, the production manager from the show's inception until the midway mark of Turbo, and Ann Austen (another past production team member) returned to Power Rangers for the first time in years as the head of the show for Disney. A few past writers were also brought back into the fold. Jackie Marchand returned to be the story editor. Koichi Sakamoto (the leader of Alpha Stunts team and producer) remained on the show. Ninja Storm brought a lot of lightheartedness to Power Rangers. This was met with mixed reception from fans. Nevertheless, Ninja Storm aired on ABC and ABC Family like Wild Force before it. Due to union and cost issues, Ninja Storm was the first season to not feature a teamup with the previous year's team since the trend began in Lost Galaxy. Due to the new ownership and its lighthearted story, the series brought new interest to the franchise as ratings and toy sales went up.\n\nDoug Sloan would interact heavily with fans at this point, posting on Rangerboard and the Newsgroup. Sally Martin and Jason Chan (Tori and Cam on Ninja Storm) would also make appearances at Rangerboard. Doug would interact with fans for the rest of his run until the end of Dino Thunder.\n\nAn early episode in Ninja Storm's run was cut by the censors. It was later reedited and shown out of production order. Originally it dealt with a peace conference to avoid a war, however was held back due to the outbreak of the Iraq War  as it was felt an anti-war message would not be appropriate. The episode, 'Snip It, Snip It Good' aired later in the run, with the peace conference substituted with an environmental conference.\n\nA skateboarder (Shane Clarke), a surfer (Tori Hanson) and a dirtbiker (Dustin Brooks), are students of the Wind Ninja Academy, under the tutelage of Sensei Kanoi Watanabe and his son Cam. Although it seems as if they will never be good enough to be full-fledged ninja, they are the only three left when the evil ninja master, Lothor arrives on Earth and captures all the other students. Their sensei, who was transformed into a guinea pig by Lothor, decided that they would become Wind Power Rangers and gave them Wind Morphers to allow them to transform. As the Wind Rangers, they fought to save the world from Lothor and his space minions, using Zords created by Cam for emergencies.  Over time, they were joined by the Thunder Rangers, Hunter and Blake, as well as Cam, who gained Green Samurai powers in a trip to the past","torrent":{"xt":"urn:btih:9b1d59d7589ea0e4233004c32086ab77407eb7bc","amp;dn":"Power+Rangers+Ninja+Storm+%28Legacy+Collection+and+Beyond%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b1d59d7589ea0e4233004c32086ab77407eb7bc","infoHashBuffer":{"type":"Buffer","data":[155,29,89,215,88,158,160,228,35,48,4,195,32,134,171,119,64,126,183,188]},"announce":[],"urlList":[]}}