{"title":"Los Archivos del Cardenal Season 01 (Temporada 1)","uid":6788185,"size":14356878133,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9c17d1f6310e877187545adfd7c97c8a56d2fe0a&amp;dn=Los+Archivos+del+Cardenal+Season+01+%28Temporada+1%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":7,"uploader":"rupturesan","files":12,"time":1320175458,"description":"Videos tomados de chilecomparte.cl\n--------\nDe Wikipedia:\n\nLos archivos del Cardenal es una serie de televisiÃƒÂ³n chilena, estrenada el 21 de julio de 2011. Esta serie de televisiÃƒÂ³n estÃƒÂ¡ basada en el trabajo de defensa de los derechos humanos que realizÃƒÂ³ la VicarÃƒÂ­a de la Solidaridad durante la Dictadura Militar chilena (1973-1990).\nTransmitida por TelevisiÃƒÂ³n Nacional de Chile, su primera temporada cuenta con 12 episodios.\n\nLos archivos del Cardenal es una serie de ficciÃƒÂ³n, pero estÃƒÂ¡ basada en hechos reales.\nLa serie cuenta la historia del abogado RamÃƒÂ³n Sarmiento (BenjamÃƒÂ­n VicuÃƒÂ±a) y la asistente social Laura Pedregal (Daniela RamÃƒÂ­rez), ambos trabajadores de la VicarÃƒÂ­a de la Solidaridad, organismo fundado por el cardenal RaÃƒÂºl Silva HenrÃƒÂ­quez y que tenÃƒÂ­a como misiÃƒÂ³n la defensa de los derechos humanos durante la dictadura militar chilena, existente entre 1973 y 1990. En esta instituciÃƒÂ³n las asistentes sociales tenÃƒÂ­an como tarea el recibir a perseguidos polÃƒÂ­ticos y a los familiares de ÃƒÂ©stos, especialmente de los detenidos desaparecidos. Posteriormente, los abogados tenÃƒÂ­an el trabajo de interponer acciones legales como recursos de amparo que tenÃƒÂ­an por objeto la protecciÃƒÂ³n de las personas.\nLa serie parte con RamÃƒÂ³n Sarmiento, abogado y miembro de una familia de clase alta que habÃƒÂ­a sufrido la expropiaciÃƒÂ³n de sus haciendas durante la Reforma agraria de Eduardo Frei Montalva. Investigando respecto a la apariciÃƒÂ³n de osamentas en una hacienda cercana a la suya, Sarmiento conoce a Laura Pedregal, quien trabaja en la VicarÃƒÂ­a junto a su padre, Carlos Pedregal (Alejandro Trejo). Juntos comienzan a involucrarse en la historias de los perseguidos por los agentes de seguridad de la dictadura, como la Central Nacional de Informaciones, con la direcciÃƒÂ³n del vicario CristiÃƒÂ¡n (Francisco Melo), papel inspirando en la historia del padre CristiÃƒÂ¡n Precht.","torrent":{"xt":"urn:btih:9c17d1f6310e877187545adfd7c97c8a56d2fe0a","amp;dn":"Los+Archivos+del+Cardenal+Season+01+%28Temporada+1%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c17d1f6310e877187545adfd7c97c8a56d2fe0a","infoHashBuffer":{"type":"Buffer","data":[156,23,209,246,49,14,135,113,135,84,90,223,215,201,124,138,86,210,254,10]},"announce":[],"urlList":[]}}