{"title":"American Indian Religious Traditions: An Encyclopedia","uid":4705668,"size":7154712,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d0b20c0b1cf1d6dda906bcf979c13e770b85caa&amp;dn=American+Indian+Religious+Traditions%3A+An+Encyclopedia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"timnehguy","files":2,"time":1233853491,"description":"American Indian Religious Traditions: An Encyclopedia,\nby Suzanne Crawford (Editor), Dennis Kelley (Editor) \n\nPDF, 1340 pp. (Printed in three volumes)\n\nThe purpose of this work is to compile a &quot;set of articles to define the study of American Indian religious traditions&quot; as they are understood by the people within the communities. More than half of the nearly 100 authors are of Native American descent. The editors felt that it was important to represent the true nature and context of Native religious life, and to that end, they have taken some liberties with the encyclopedia format, making the index in the third volume essential for locating specific information. In some entries, first-person accounts and the citing of Native elders as authoritative sources represent further departures from standard encyclopedia conventions. \n\nIn general, content is presented in long entries covering topics broadly rather than in short, dictionary-style treatments. Coverage of topics such as dance, ritual and ceremony, and religious leadership is divided by geographic region (for example, Religious leadership, Alaska; Religious leadership, Great Lakes). Each entry is followed by suggestions for further reading and research. Names and terminologies are given in their original language (Kwakwak'wakw instead of Kwakiutl), but the index helps alleviate confusion. \n\nPreceding the entries is a regional survey with maps. A table of contents is repeated at the beginning of each volume, and an appendix at the end of volume 3 lists the 500 tribes recognized by the U.S Bureau of Indian Affairs. The encyclopedia includes a wide variety of black-and-white photos. \n","torrent":{"xt":"urn:btih:9d0b20c0b1cf1d6dda906bcf979c13e770b85caa","amp;dn":"American+Indian+Religious+Traditions%3A+An+Encyclopedia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d0b20c0b1cf1d6dda906bcf979c13e770b85caa","infoHashBuffer":{"type":"Buffer","data":[157,11,32,192,177,207,29,109,218,144,107,207,151,156,19,231,112,184,92,170]},"announce":[],"urlList":[]}}