{"title":"Swan Lake anime 1981 rare","uid":4292773,"size":1288996931,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9d229ebd39f1bef25e26c4ae16d02af170c87ae3&amp;dn=Swan+Lake+anime+1981+rare&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"SajukkTheEternal","files":6,"time":1215967043,"description":"Swan Lake\n(Hakucho no Mizumi, 1981 Toei Animation)\n\n[Technical data]\n\nRipped from DVD (h.264, 720x544, 1:14:25)\nOriginal Japanese audio (mp3, 320 VBR)\nHard subtitles for karaoke\nSoft English subtitles for dialogue (SRT)\nOptional extra: English dub track (see section [OPTIONAL]) (mp3, 320 VBR)\nRarity value: Extremely rare\n\n[Information]\n\nThis animated rendering of Tchaikovsky\\&amp;#039;s ballet classic was of astounding quality back when it was released as a theatrical feature. It was extremely faithful to the original, with the background music almost entirely composed of the original Swan Lake score, rendered by the Vienna Symphony Orchestra. The insert song and the outro are also Jpop-ized versions of the Swan Lake theme songs.\n\nMany would have watched this Swan Lake anime in the early days of their youth, in the English dubbed form. Some have attempted to track it down after so many years, and found it extremely difficult. They have sought VHS-transferred DVDs on ebay, they have tried buying ex-rental VHS\\&amp;#039;s for a hundred bucks...but ever wondered what the original Japanese sounded like? Ever wanted to be able to watch it without having to dust off an old VHS? Ever wanted a version of the anime without the deteriorating effects of ageing?\n\nAlthough the video quality in this release is not remastered (its age is immediately apparent), it represents the best quality of this film available on the market today. Until such time that Toei Animation decides to remaster and re-release this film, this is IT. More detail is visible, there is better colour fidelity, and lines are noticeably sharper than the alternative VHS rips. In terms of audio, the quality is similarly superior to VHS transfers. Prior to this, it was almost impossible to find the original Japanese sound.\n\n[Subtitles]\n\nTimed to the Japanese audio, the soft-subs (SRT) are very flexible. Their appearance may be customised according to your needs -- you only have to tweak DirectVobSub options to modify how they look. They may also be opened in notepad for any editing or correction needed. Please note that the subtitles are released under copyleft licensing. They may not be used for commercial purposes or profit. Modification and re-release and redistribution is allowed, but only under the condition that the copyleft licensing remains intact, and the original credits (to pireze) are left untouched.\n\nThe subtitles are an original translation, although it should be noted that the English dubs stuck surprisingly close to the original Japanese script. A dubtitle could have easily passed for subtitles, but in this case, I did translations separately from the dubbed translation.\n\nKaraoke effects were made using simple modifications to existing Automation examples in Aegisub.\n\n","torrent":{"xt":"urn:btih:9d229ebd39f1bef25e26c4ae16d02af170c87ae3","amp;dn":"Swan+Lake+anime+1981+rare","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d229ebd39f1bef25e26c4ae16d02af170c87ae3","infoHashBuffer":{"type":"Buffer","data":[157,34,158,189,57,241,190,242,94,38,196,174,22,208,42,241,112,200,122,227]},"announce":[],"urlList":[]}}