{"title":"Brighton Rock - 2 Albums 1988 - 1991 [FLAC] - Kitlope","uid":7011661,"size":673328765,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9dc0cea0641e2a72b42bdbd2123dcedaac1cfc73&amp;dn=Brighton+Rock+-+2+Albums+1988+-+1991+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Kitlope","files":29,"time":1328488923,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: 9DC0CEA0641E2A72B42BDBD2123DCEDAAC1CFC73\nFile Size: 642.13 MB\nLabel: WEA\n\n\nAlbums, Years &amp; Catalog # In This Torrent:\n\n\nTake A Deep Breath 1988 576330T W2 55969 *\nLove Machine 1991 CD 74987 *\n\n\n* Denotes My Rip\n\n\n\n\nIf anybody has anymore Brighton Rock please do make available in lossless, especially the first album, Young Wild &amp; Free.\n\n\nKit \n\n\n\n\n\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nBrighton Rock are a Canadian glam metal band who released three albums in their home country during the 1980s and 90s. They broke up in 1991 before reuniting and releasing a live album in 2002.\n\nFormed in Niagara Falls by guitarist Greg Fraser and bassist Stevie Skreebs in 1982, the band also included vocalist Gerry McGhee, keyboardist Martin Victor and drummer Mark Cavarzan. After their song &quot;Barricade&quot; was selected for CILQ's Q107 Homegrown album in 1984, they independently released a self-titled EP the following year.\n\nThey subsequently signed to WEA for their full-length debut, Young, Wild and Free, in 1986, adding Johnny Rogers on keyboards replacing Martin Victor. That album spawned the Canadian hit singles &quot;We Came to Rock&quot; and &quot;Can't Wait for the Night&quot;. The band followed up with Take a Deep Breath in 1988 which sold 70,000 copies in Canada. While writing for 1991's Love Machine, Rogers left the band. Gerry McGhee stated, &quot;We didn't really feel that keyboards were part of us anymore. There's really no place for them in our musical direction now.&quot; Rogers was replaced for touring purposes by a second guitar player, Greg Bioleau, who previously played with McGhee in his first band, The Rockers.[1] The band broke up after the tour to support Love Machine.\n\nIn 1992, guitarist Greg Fraser joined Helix, replacing Paul Hackman. Fraser remained with Helix for four years.[2] Also in 1992, McGhee auditioned for MÃƒÂ¶tley CrÃƒÂ¼e who were replacing their departed singer, Vince Neil. The band regrouped for a reunion tour in 2001, releasing the live album A Room for Five Live in 2002. In 2006 a greatest hits package was released titled The Essentials. In January 2007, Fraser and Skreebs formed a new project known as Fraze Gang.[3] The album Jackhammer came out in early 2008.[4] An EP called Don't Call Us was released in late 2009.[5]\n\nThe band regrouped again Thursday October 30, 2008 at the Phoenix Concert Theatre in Toronto for a benefit concert for fellow Canadian rocker Carl Dixon who was injured in a car crash.[6]\n\nIn late Jan 2012 it was confirmed that the band would perform at the Firefest Festival in Nottingham, England in October 2012. \n\n\n\n\n\n\n\nTake A Deep Breath 1988\n\n\n\nTake a Deep Breath is the second full length album by Canadian glam metal band, Brighton Rock. The album was released in 1988. Take a Deep Breath is Brighton Rock's most commercially successful album, peaking at #22 on the Canadian album chart. The album was also certified Gold by the CRIA[1].\n\n\nTracks: \n\n\n1.\t&quot;Can't Stop the Earth from Shaking&quot; - 4:28\n2.\t&quot;Outlaw&quot; - 4:57\n3.\t&quot;Hangin' High 'N' Dry&quot; (McGhee, Fraser, Johnny Rogers) - 3:54\n4.\t&quot;One More Try&quot; (McGhee, Rogers) - 3:53\n5.\t&quot;Ride the Rainbow&quot; - 4:19\n6.\t&quot;Rebels With a Cause&quot; - 4:21\n7.\t&quot;Power Overload&quot; (Greg Boileau, McGhee, Fraser) - 4:18\n8.\t&quot;Who's Foolin' Who&quot; - 4:21\n9.\t&quot;Love Slips Away&quot; - 4:13\n10.\t&quot;Shootin' for Love&quot; - 4:03\n11.\t&quot;Unleash the Rage&quot; - 5:13\n\n\n\n\n\n\n\n\n\nLove Machine 1991\n\n\n\nLove Machine is the third full length album by Canadian glam metal band, Brighton Rock. The album was released in 1991.\n\nBefore the album was recorded, the band's keyboardist, Johnny Rogers, departed the band. Brighton Rock wanted a harder sound, with lead vocalist Gerry McGhee stating, &quot;We didn't really feel that keyboards were part of us anymore. There's really no place for them in our musical direction now.&quot; Rogers was replaced for touring purposes by a second guitar player, Greg Bioleau, who previously played with McGhee in his first band, The Rockers.[1]\n\nThe album failed to chart, but the single &quot;Hollywood Shuffle&quot; charted at #6 on the Cancon: To Watch chart. In 1992 the album was nominated for a Juno Award for Hard Rock Album of the Year. Cocaine was recorded live in the studio with one take.\n\n\nTracks: \n\n\n1.\t&quot;Bulletproof&quot;\n2.\t&quot;Hollywood Shuffle&quot;\n3.\t&quot;Love Machine&quot;\n4.\t&quot;Still the One&quot;\n5.\t&quot;Mr. Mistreater&quot;\n6.\t&quot;Nightstalker&quot;\n7.\t&quot;Love in a Bottle&quot;\n8.\t&quot;Nothin' to Lose&quot;\n9.\t&quot;Heart of Steel&quot;\n10.\t&quot;Cocaine&quot;\n11.\t&quot;Magic is Back&quot;\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:9dc0cea0641e2a72b42bdbd2123dcedaac1cfc73","amp;dn":"Brighton+Rock+-+2+Albums+1988+-+1991+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dc0cea0641e2a72b42bdbd2123dcedaac1cfc73","infoHashBuffer":{"type":"Buffer","data":[157,192,206,160,100,30,42,114,180,43,219,210,18,61,206,218,172,28,252,115]},"announce":[],"urlList":[]}}