{"title":"George Michael and Quenn - Five Live [Mp3 320 kbps] TNT Village","uid":6424675,"size":67434321,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9e96bd04f3f4bdd0608b6a8561db76707f159bf3&amp;dn=George+Michael+and+Quenn+-+Five+Live+%5BMp3+320+kbps%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"l.diliberto","files":7,"time":1306370478,"description":"George Michael and Quenn - Five Live [Mp3 320 kbps] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=63710&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=63710&lt;/a&gt;\n\nFive Live, released in 1993, features five (in some countries, where it is considered to be a reduced-length long-playing album, six) tracks, performed by George Michael, Queen, and Lisa Stansfield. &quot;Somebody to Love&quot; and &quot;These Are the Days of Our Lives&quot; (both also available on video) were recorded at the Freddie Mercury Tribute Concert, held on 20 April 1992, at Wembley Stadium. In particular, the live performance of the opener gave Michael a lot more credibility as an adult artist, making him one of the few acts of the evening to be praised for fitting Mercury's shoes.\n\nAll proceeds from the sale of the EP benefited the Mercury Phoenix Trust. Sales of the record were in fact very strong throughout Europe, where it debuted at Number One, in the UK Singles Chart, and several European countries, either considered as a single, an extended play, or an LP. Chart success in the U.S. was far less spectacular, but the EP still peaked at Number 30 on the Billboard 200.\n\nAn edited shorter version of &quot;Killer&quot; and &quot;Papa Was a Rollin' Stone,&quot; a live medley already (performed by George at the Wembley Arena), was released by George Michael as a further independent single, in some territories only. The singer also shot a video for it, where he did not appear personally though (it was during the time when the artist refused to exploit his outward look, which he thought would distract the audience from the music, his main concern). The video was directed by Marcus Nispel.\n\nWhile &quot;These Are the Days of Our Lives,&quot; played by Queen, is actually a duet between George Michael and Lisa Stansfield, the sixth optional track is represented by a short performance by Queen, entitled &quot;Dear Friends,&quot; originally sung by Freddie Mercury himself. Recorded in 1974, this constitutes the one studio recording on the record.\n\nUsually, countries where the six-track work is distributed consider it to be as a short LP, whereas those where the five-track (hence, its title) work is available generally tend to see it as an EP or even (if &quot;Killer/Papa Was a Rollin' Stone&quot; was not marketed independently in those same territories) as a particularly long or content-rich single. However, no matter its status, whether an EP, a short album or a long single, the work as a whole sold an estimated 5 million copies worldwide\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img176.imageshack.us/img176/5033/queenegeorgekz0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img176.imageshack.us/img176/5033/queenegeorgekz0.jpg&lt;/a&gt;\n\n.: TrackList :.\n\n01 - Somebody to love (Freddie Mercury)\n02 - Killer (Tinley/Seal)\n03 - Papa was a rollin' stones (Norman Whitfield/Barrett Strong)\n04 - These are the days of our lives with Lisa Stansfield (Queen)\n05 - Calling you (Bob Telson)\n06 - Dear friends (Performed by Queen) (May)\n","torrent":{"xt":"urn:btih:9e96bd04f3f4bdd0608b6a8561db76707f159bf3","amp;dn":"George+Michael+and+Quenn+-+Five+Live+%5BMp3+320+kbps%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e96bd04f3f4bdd0608b6a8561db76707f159bf3","infoHashBuffer":{"type":"Buffer","data":[158,150,189,4,243,244,189,208,96,139,106,133,97,219,118,112,127,21,155,243]},"announce":[],"urlList":[]}}