{"title":"Hacking Exposed, 6th Edition {BBS}","uid":6813557,"size":15567368,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ec29c1713ea8fcffe9c8cad49c1bcdd0205a227&amp;dn=Hacking+Exposed%2C+6th+Edition+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1321116365,"description":"The world's bestselling computer security book--fully expanded and updated &quot;Right now you hold in your hand one of the most successful security books ever written. Rather than being a sideline participant, leverage the valuable insightsHacking Exposed 6provides to help yourself, your company, and your country fight cyber-crime.&quot; --From the Foreword by Dave DeWalt, President and CEO, McAfee, Inc. &quot;For security to be successful in any company, you must 'think evil' and be attuned to your 'real risk'...Hacking Expose 6defines both.&quot; --Patrick Heim, CISO, Kaiser Permanente &quot;The definitive resource to understanding the hacking mindset and the defenses against it.&quot; --Vince Rossi, CEO &amp; President, St. Bernard Software &quot;Identity theft costs billions every year and unless you understand the threat, you will be destined to be a victim of it.Hacking Exposed 6gives you the tools you need to prevent being a victim.&quot; --Bill Loesch, CTO, Guard ID Systems &quot;This book is current, comprehensive, thoughtful, backed by experience, and appropriately free of vendor-bias-prized features for any security practitioner in need of information.&quot; --Kip Boyle, CISO, PEMCO Mutual Insurance Company &quot;The Hacking Exposed series has become the definitive reference for security professionals from the moment it was first released, and the 6th edition maintains its place on my bookshelf,&quot; --Jeff Moss, Founder of the popular Black Hat Security Conference Meet the formidable demands of security in today's hyperconnected world with expert guidance from the world-renowned Hacking Exposed team. Following the time-tested &quot;attack-countermeasure&quot; philosophy, this 10th anniversary edition has been fully overhauled to cover the latest insidious weapons in the hacker's extensive arsenal. New and updated material: New chapter on hacking hardware, including lock bumping, access card cloning, RFID hacks, USB U3 exploits, and Bluetooth device hijacking Updated Windows attacks and countermeasures, including new Vista and Server 2008 vulnerabilities and Metasploit exploits The latest UNIX Trojan and rootkit techniques and dangling pointer and input validation exploits New wireless and RFID security tools, including multilayered encryption and gateways All-new tracerouting and eavesdropping techniques used to target network hardware and Cisco devices Updated DoS, man-in-the-middle, DNS poisoning, and buffer overflow coverage VPN and VoIP exploits, including Google and TFTP tricks, SIP flooding, and IPsec hacking Fully updated chapters on hacking the Internet user, web hacking, and securing code \n\n\nPrint Length: 720 pages\n\nLanguage: English\n\nPublisher: McGraw-Hill Osborne Media; 6 edition (January 26, 2009)","torrent":{"xt":"urn:btih:9ec29c1713ea8fcffe9c8cad49c1bcdd0205a227","amp;dn":"Hacking+Exposed%2C+6th+Edition+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ec29c1713ea8fcffe9c8cad49c1bcdd0205a227","infoHashBuffer":{"type":"Buffer","data":[158,194,156,23,19,234,143,207,254,156,140,173,73,193,188,221,2,5,162,39]},"announce":[],"urlList":[]}}