{"title":"Steve Holy Discography (2000-2011)","uid":8704897,"size":310132911,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9f3d27c79ad173942f1e2ccebb7d8137ec03f09b&amp;dn=Steve+Holy+Discography+%282000-2011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Cubby2868","files":-1,"time":1374124221,"description":"All 3 Steve Holy albums from 2000-2011. Please seed!\n\nBiography:\n\n&quot;His stance is Elvis Presley meets Dwight Yoakam and his voice is Ricky Nelson meets Chris Isaak. A little bit of the old mingles with a dash of the new.&quot; -Mario Tarradell, The Dallas Morning News\n\nWith his blend of 50's rock and roll, pop and traditional country, Steve Holy has crafted a unique sound that has won fans over across the nation. Refusing to be labeled musically and sticking to his country roots, Steve sites country greats Charlie Rich, Mickey Gilley and John Conlee as his influences, but is quick to add that Elvis, Sam Cooke, and a variety of Doo-Wop bands play a major role in his vocal style and on-stage persona.\n\n&quot;I really don't want to be 'labeled'. The majority of my influences are from the traditional country genre, but I feel a connection to the music made in the 50's and 60's. My heart is there in that style of music. It was really heartfelt back then and I'm into the simplicity of the music. It's how I want to make music- simply heartfelt.&quot;\n\nSteve's engaging stage performance alone has created a loyal following. Although, his primary objective is to connect with them on an up-close and personal basis, he naturally and unconsciously dazzles fans and listeners alike, capturing them immediately. Steve Holy is charming, charismatic and captivating.\n\nIn 1997, Steve signed with Curb Records. He launched his debut album Blue Moon (as produced by Wilbur Rimes--who guided his daughter LeAnn Rimes' career to become one of country music's most talented and influential artists) in October 2000. The initial offering, dubbed &quot;5090&quot; by Rack Clark of Dick Clark Productions for its tribute to both the 1950's and 1990's era, included a swing-driven single entitled &quot;Don't Make Me Beg&quot; which was released as Steve's debut single from the album to set his course in motion.\n\nSteve has enjoyed incredible success to jump-start his musical career. His second single from the album, &quot;Blue Moon,&quot; featuring more traditional country sounds was released in April 2000 and climbed all the way to Number 19 on the charts. His third single, &quot;The Hunger,&quot; delivered a pop-folk feel and made it to Number 20; and just eighteen months after the release of the album, Steve's fourth single &quot;Good Morning Beautiful,&quot; for which he is most widely recognized, charted at Number 1 for five straight weeks in 2002.\n\nSteve's long awaited 2nd CD, &quot;Brand New Girlfriend&quot; was released August 8, 2006. The album debuted at number two on the country charts. Singles from this CD included &quot;Brand New Girlfriend,&quot; &quot;Come On Rain,&quot; and his current single &quot;Might Have Been&quot;. Steve earned his second number one single with &quot;Brand New Girlfiend.&quot; This song was also the number one dance song for 2006.\n\nBlue Moon (2000)\n\nBlue Moon\nOne Beat at a Time\nCold Kisses\nJust a Kiss\nThe Hunger\nTear One\nShe's So\nYou're Gonna Miss My Love\nSomeone's out to Get Me\nIf That's What You Want\nDon't Make Me Beg\nGood Morning Beautiful\n\nBrand New Girlfriend (2006)\n\nBrand New Girlfriend\nCome on Rain\nHurry up\nBaby Don't Go\nA Cliff in Colorado\nMen Buy The Drinks (Girls Call The Shots)\nGood Night to Be Lonely\nLead Me on\nOnly The Lonely Talking\nWrap Around\nMemory on The Run\nAll for The Love of Sunshine\nWhat Could I Do Different Tonight\n\nLove Don't Run (2011)\n\nIf It Gets You Where You Wanna Go\nLove Don't Run\nHauled Off and Kissed Me\nUntil the Rain Stops\nHeart of a Hero\nEvery Day Should End Like This\nWonders\nLet the Sun Shine In\nLike I'm Famous\nHelp Me Make It Through the Night\nGood Morning Beautiful&quot; (acoustic version)\n\n\n\n\n\n","torrent":{"xt":"urn:btih:9f3d27c79ad173942f1e2ccebb7d8137ec03f09b","amp;dn":"Steve+Holy+Discography+%282000-2011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f3d27c79ad173942f1e2ccebb7d8137ec03f09b","infoHashBuffer":{"type":"Buffer","data":[159,61,39,199,154,209,115,148,47,30,44,206,187,125,129,55,236,3,240,155]},"announce":[],"urlList":[]}}