{"title":"The Secret Relationship between Blacks and Jews. (E-Book)","uid":6205022,"size":2466119,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f4e9fec5534e1d9c37a5ae9b4ccad0ff15b5580&amp;dn=The+Secret+Relationship+between+Blacks+and+Jews.+%28E-Book%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"samjoe88","files":2,"time":1298760463,"description":"\n\n\n\nThe Secret Relationship between Blacks and Jews. Vol 1 (E-Book)\n\n\nThis book has been published fifteen years ago in the United States, at a\ntime when the Black Movement was reaching a new phase in the century-old\nstruggle for freedom. It created a huge scandal and all the resources of the Zion-\nist lobby were directed against this book, to destroy it in order to keep the Afro-\nAmericans under the traditional yoke of submissiveness to the interest of the\nJewish community, a situation which had become obvious to all in the US.\nThe controversy, the important role played by The Nation of Islam in the\nliberation struggle of the Black Men, did not spill over in Europe. We brought\nback the book from Chicago but failed, at the time, to procure the funding for a\ntranslation and a publication in Europe's languages. The time was not ripe. The\nliberation forces were divided and weak. But the craving for freedom was sim-\nmering among the oppressed. Slowly, bit by bit, a Black Liberation Movement\nrose up again. Particularly in France, it has reached a stage where it plays a\npolitical role. \n\nTraditional political forces, and particulalrly, traditional enemies \nof freedom are lauching offensives, one after the other, to gain control over this\nnew-born potential political giant, while it is still in infancy. We have reached a\nsituation where the book penned by the Research Department of the Nation of\nIslam has become an urgent political necessity in the struggle to maintain the\nindependence of the Freedom Movement. This made us bold enough to put on-\nline the original book and decide to translate it. There is no other material possibility to spread the book around in our region. The translation will be put online\nas soon as it becomes available.\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:9f4e9fec5534e1d9c37a5ae9b4ccad0ff15b5580","amp;dn":"The+Secret+Relationship+between+Blacks+and+Jews.+%28E-Book%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f4e9fec5534e1d9c37a5ae9b4ccad0ff15b5580","infoHashBuffer":{"type":"Buffer","data":[159,78,159,236,85,52,225,217,195,122,90,233,180,204,173,15,241,91,85,128]},"announce":[],"urlList":[]}}