{"title":"Diesel Engine Reference Book 2nd Edition{BBS}","uid":6635431,"size":56620576,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f508fe24a053759cef74b7c16c7c08b2ed66769&amp;dn=Diesel+Engine+Reference+Book+2nd+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314540116,"description":"The Diesel Engine Reference Book, Second Edition, is a comprehensive work covering the design and application of diesel engines of all sizes. The first edition was published in 1984 and since that time the diesel engine has made significant advances in application areas from passenger cars and light trucks through to large marine vessels. The Diesel Engine Reference Book systematically covers all aspects of diesel engineering, from thermodynamics theory and modelling to condition monitoring of engines in service. It ranges through subjects of long-term use and application to engine designers, developers and users of the most ubiquitous mechanical power source in the world. The latest edition leaves few of the original chapters untouched. The technical changes of the past 20 years have been enormous and this is reflected in the book. The essentials however, remain the same and the clarity of the original remains. Contributors to this well-respected work include some of the most prominent and experienced engineers from the UK, Europe and the USA. Most types of diesel engines from most applications are represented, from the smallest air-cooled engines, through passenger car and trucks, to marine engines. The approach to the subject is essentially practical, and even in the most complex technological language remains straightforward, with mathematics used only where necessary and then in a clear fashion. The approach to the topics varies to suit the needs of different readers. Some areas are covered in both an overview and also in some detail. Many drawings, graphs and photographs illustrate the 30 chapters and a large easy to use index provides convenient access to any information the readers requires.\nProduct Details\n\n    * Hardcover: 682 pages\n    * Publisher: Butterworth-Heinemann Ltd; 2 edition (May 1999)\n    * Language: English\n    * ISBN-10: 0750621761\n    * ISBN-13: 978-0750621762","torrent":{"xt":"urn:btih:9f508fe24a053759cef74b7c16c7c08b2ed66769","amp;dn":"Diesel+Engine+Reference+Book+2nd+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f508fe24a053759cef74b7c16c7c08b2ed66769","infoHashBuffer":{"type":"Buffer","data":[159,80,143,226,74,5,55,89,206,247,75,124,22,199,192,139,46,214,103,105]},"announce":[],"urlList":[]}}