{"title":"The History of Science - Antiquity to 1700","uid":4551760,"size":693803489,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9fe01ea1f062af8a4a0f47dc83417d49027a17bc&amp;dn=The+History+of+Science+-+Antiquity+to+1700&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dougietrotter","files":219,"time":1228332842,"description":"18 Full Length CD's ripped to MP3. Also includes 300dpi scanned cover and backs.\n &lt;a href=&quot;\nhttp://www.teach12.com/ttcx/coursedesclong2.aspx?cid=1200&amp;pc=History%20-%20Ancient%20and%20Medieval&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.teach12.com/ttcx/coursedesclong2.aspx?cid=1200&amp;pc=History%20-%20Ancient%20and%20Medieval&lt;/a&gt;\n\n\nProfessor Lawrence M. Principe, who is Professor of both Chemistry and the History of Science, Medicine, and Technology at Johns Hopkins University, is a winner of the Templeton Foundation's prestigious award for courses dealing with science and religion. He has also won several teaching awards bestowed by Johns Hopkins and in 1999 was chosen Maryland Professor of the Year by the Carnegie Foundation.\n\nDr. Principe gives living order to science's story by considering it in terms of several penetrating questions, two of which are especially important. Who pursued science and why? What happened and why?\n\nAs he notes, &quot;Science is a dynamic, evolving entity, tightly connected to the needs and commitments of those who pursue it. The real context of even familiar scientific developments will frequently come as a surprise and can suggest alternative ways for present-day thinking and science to develop.&quot;\n\nYou will see how many scientific discoveries originated from ideas that might be considered ridiculous or humorous from today's perspective of &quot;cutting-edge technology,&quot; as science's earliest thinkers worked under the limitations imposed by the knowledge and culture of their times.\n\nBut you'll also see that many of these early principles are still relevant and embraced today.\n\nA real treat for those who are interested in following the age long struggle of science over superstition as championed in our modern age by such giants as Professor Richard Dawkins.","torrent":{"xt":"urn:btih:9fe01ea1f062af8a4a0f47dc83417d49027a17bc","amp;dn":"The+History+of+Science+-+Antiquity+to+1700","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fe01ea1f062af8a4a0f47dc83417d49027a17bc","infoHashBuffer":{"type":"Buffer","data":[159,224,30,161,240,98,175,138,74,15,71,220,131,65,125,73,2,122,23,188]},"announce":[],"urlList":[]}}