{"title":"Rise of the New World Order - J. Micha-el Thomas Hays","uid":11710323,"size":3850776,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a00ccf7d185ac4c152751ad4305e906369560129&amp;dn=Rise+of+the+New+World+Order+-+J.+Micha-el+Thomas+Hays&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starxteel","files":2,"time":1424309463,"description":"Rise of the New World Order: The Culling of Man\n\nThe same occult group of people who have been ruling over humanity for thousands of years continue to do so to this day. The one world government prophesized in the Bible is unfolding behind the scenes right under your nose as you read this, and was given the catchy name of the 'New World Order'. Currently, the technology exists to fulfill all aspects of the Biblical prophecies regarding the End Times, including the resurrection of the original Antichrist, who was the architect of the New World Order over 4,000 years ago. This tyrant will be brought back to life using modern DNA technology, fulfilling the prophecy of Revelation 17:8 &quot;The beast, which you saw, once was, now is not, and will come up out of the Abyss and go to his destruction. The inhabitants of the earth whose names have not been written in the book of life from the creation of the world will be astonished when they see the beast, because he once was, now is not, and yet will come.&quot; This is all revealed in my book, including who the Antichrist is, how the New World Order started, who ran it through history, who runs it today, and what is to happen in the future. You can learn right now all of the most important components of the NWO and how they interlock to form a pyramidal, compartmentalized conspiracy run by the Luciferian elites, to the ultimate benefit of only a few thousand of the people involved with bringing the one world government in. Please read the book reviews for this book here on Amazon and you will see that this is a highly important book for you to not only read, but to make others aware of its existence. The time for a mass-awakening of humanity is short and I need your help! I'm working on the sequel to this book right now. Please support my efforts by purchasing a copy of my book. My book is exactly the 'red pill', but there's a happy ending full of hope and promise if you understand what is REALLY going on, that which is laid out in my book. Thanks for reading. God bless. -Jeff\n\n\nAbout the author:\nFrom the Author:\nMy name is Jeff Hays and I'm the author of the in-progress 'Rise of the New World Order' series. The cover art for my books is done by political artist David Dees. I live in the greater Seattle area in Washington state, USSA. I had sensed all my life that something wasn't quite right in the world, some dark, evil power was in control of us and our society. I had an awakening and found out exactly what that evil was: The New World Order. I found out about the New World Order in 2007 and had an epiphany that I needed to learn everything about it so I could write a book and warn my family and friends, which is exactly what I did","torrent":{"xt":"urn:btih:a00ccf7d185ac4c152751ad4305e906369560129","amp;dn":"Rise+of+the+New+World+Order+-+J.+Micha-el+Thomas+Hays","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a00ccf7d185ac4c152751ad4305e906369560129","infoHashBuffer":{"type":"Buffer","data":[160,12,207,125,24,90,196,193,82,117,26,212,48,94,144,99,105,86,1,41]},"announce":[],"urlList":[]}}