{"title":"The Mote in God's Eye (mp3 audiobook) by Larry Niven and Jerry P","uid":10520451,"size":902410518,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a0155ad9e53be9a554f53b025628cf2cceb04eec&amp;dn=The+Mote+in+God%27s+Eye+%28mp3+audiobook%29+by+Larry+Niven+and+Jerry+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"33f432","files":78,"time":1404967413,"description":"MP3 Audiobook\n\n---\n\nWriting separately, Larry Niven and Jerry Pournelle are responsible for a number of science fiction classics, such as the Hugo and Nebula Award-winning Ringworld, Debt of Honor, and The Integral Trees. Together they have written the critically acclaimed bestsellers Inferno, Footfall, and The Legacy of Heorot, among others.\nThe Mote In God's Eye is their acknowledged masterpiece, an epic novel of mankind's first encounter with alien life that transcends the genre.\n\n---\n\nIn the year 3016, the Second Empire of Man spans hundreds of star systems, thanks to the faster-than-light Alderson Drive. No other intelligent beings have ever been encountered, not until a light sail probe enters a human system carrying a dead alien. The probe is traced to the Mote, an isolated star in a thick dust cloud, and an expedition is dispatched.\n\nIn the Mote the humans find an ancient civilization--at least one million years old--that has always been bottled up in their cloistered solar system for lack of a star drive. The Moties are welcoming and kind, yet rather evasive about certain aspects of their society. It seems the Moties have a dark problem, one they've been unable to solve in over a million years.\n\nThis is the first collaboration between Niven and Pournelle, two masters of hard science fiction, and it combines Pournelle's interest in the military and sociology with Niven's talent for creating interesting, believable aliens. The novel meticulously examines every aspect of First Contact, from the Moties' biology, society, and art, to the effects of the meeting on humanity's economics, politics, and religions. And all the while suspense builds as we watch the humans struggle toward the truth. --Brooks Peck ","torrent":{"xt":"urn:btih:a0155ad9e53be9a554f53b025628cf2cceb04eec","amp;dn":"The+Mote+in+God%27s+Eye+%28mp3+audiobook%29+by+Larry+Niven+and+Jerry+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0155ad9e53be9a554f53b025628cf2cceb04eec","infoHashBuffer":{"type":"Buffer","data":[160,21,90,217,229,59,233,165,84,245,59,2,86,40,207,44,206,176,78,236]},"announce":[],"urlList":[]}}