{"title":"Rossana - Tutti i Torrent della Serie Completa [SATrip ITA] TNT ","uid":6371914,"size":1748715,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a05ec9e50d3a4e9014ec7fcf5b4f212d36c5dce9&amp;dn=Rossana+-+Tutti+i+Torrent+della+Serie+Completa+%5BSATrip+ITA%5D+TNT+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"l.diliberto","files":17,"time":1304706803,"description":"Rossana - Tutti i Torrent della Serie Completa [SATrip ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=250753&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=250753&lt;/a&gt;\n\n.: Trama :.\n\nRossana (SANA) ÃƒÂ¨ una simpatica ragazzina di 11 anni, apparentemente non ha niente di speciale, ma invece ÃƒÂ¨ giÃƒÂ  una star affermata con tanto di agente e figlia adottiva di una madre autrice di best-sellers, ed ÃƒÂ¨ un po' la &quot;leader&quot; del programma televisivo &quot;Evviva l'allegria&quot; (in giapponese si chiamava &quot;Giocattolo per bambini&quot; da cui prende il nome la serie &quot;kodomo no omocha&quot;) . Tutto nella sua vita sembra perfetto, eccetto che a scuola, infatti i ragazzi, capitanati dal piÃƒÂ¹ terribile di tutti, Heric (AKITO), ne combinano di tutti i colori e i prof. non possono fare assolutamente nulla dato che Heric li ricatta con delle foto che li ritraggono in atteggiamenti leggermente &quot;equivoci&quot;...\nSana a un certo punto non ce la fa piÃƒÂ¹ e pensa ad un modo per fermare lo scalmanato Heric: si puÃƒÂ² dire che lo ripaga con la sua stessa moneta visto che anche lei scatta con l'aiuto dell'amico Terence (TSUYOSHI) una foto al ragazzo in boxer e minaccia di farla vedere a tutti se non la smetterÃƒÂ  di ricattare gli insegnanti. La minaccia Heric sembra passata, ma in seguito Sana scopre che l'atteggiamento del ragazzo era dovuto a un pessimo ambiente familiare (la mamma di Heric era morta dandolo alla luce). Grazie a una fiction girata da Sana tutto si risolve per il meglio. Col passare del tempo tra i 2 ragazzi si instaura una splendida amicizia ed Heric finisce per baciarla per ben 2 volte. Giungono alle medie Sana conosce una nuova amica, Funny (FUKA), ma poi deve partire per andare a girare un film &quot;la casa nel bosco&quot; con il suo amico di infanzia e attore Charles (NAOZUMI). Nel posto in cui si svolgono le riprese non ci sono mezzi di comunicazione e cosÃƒÂ¬ gli amici di Sana finiscono per credere ai giornali di spettegolezzi che sostengono che si sia fidanzata con Charles, il co-protagonista. Heric ne rimane turbato e decide di mettersi con Funny. La reazione di Sana quando lo viene a sapere ÃƒÂ¨ molto violenta: si accorge finalmente di amare davvero Heric e che in fondo lo ha sempre amato. Per cercare di dimenticarlo lei e Charles partono per l'America dove il ragazzo conosce la sua vera famiglia (queste puntate nel manga nn ci sono proprio!) al loro ritorno i 2 ragazzi sembrano molto uniti, cosÃƒÂ¬ come lo sembrano Heric e Funny. Dopo un po' perÃƒÂ² Charles e Funny si rendono conto che Sana e Heric sono ancora profondamente innamorati e cosÃƒÂ¬ li lasciano liberi di seguire il loro cuore. Dopo alcune peripezie i due ragazzi si baciano nuovamente sul tetto della scuola e finalmente possono consolidare il loro amore!!!\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img91.imageshack.us/img91/8526/locandinararossanaiy1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img91.imageshack.us/img91/8526/locandinararossanaiy1.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nTitolo originale: Kodomo no Omocha\nTratto dal manga di: Obana Miho\nProdotto nel: 1996-98\nNumero di episodi: 102\nRegia: Heitaro Daichi\nAssistente alla regia: Ryosuke Takahashi\nCharacter design: Hajime Watanabe\nDirettore delle animazioni: Noriyuki Tokinaga\nDirettore della fotografia: Yasunori Hayama\nMusiche: Keiichi Tomita\nProduttori esecutivi: Takako Kobayashi (TV Tokyo), Yoko Matsushita (NAS)\nProdotto da: TV Tokyo/NAS Sony.\nGenere: Comedy, Drama, Romance, Shoujo, Slice of Life\n\n0=============================0\n\n.: Info Ripping :.\n\n.: Dati medi del ripping episodi :.\n\nFilesize.....: 228 MB\nFiletype.......: OpenDML AVI\nVideo Codec..: DivX 5.0\nVideo Codec 4CC: DX50/divx\nAspect ratio: 640x480 (1.33:1) [=4:3]\nRuntime......: 00:19:12\nVideo Bitrate: 1497 kb/s\nFPS: 25.000\nFrame Quality: 0.195 bits/pixel\n\nAudio Codec..: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate: 160 kb/s (80/ch, stereo) CBR\nSample freq...: 44100 Hz","torrent":{"xt":"urn:btih:a05ec9e50d3a4e9014ec7fcf5b4f212d36c5dce9","amp;dn":"Rossana+-+Tutti+i+Torrent+della+Serie+Completa+%5BSATrip+ITA%5D+TNT+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a05ec9e50d3a4e9014ec7fcf5b4f212d36c5dce9","infoHashBuffer":{"type":"Buffer","data":[160,94,201,229,13,58,78,144,20,236,127,207,91,79,33,45,54,197,220,233]},"announce":[],"urlList":[]}}