{"title":"Amped. Unabridged.","uid":7345516,"size":502323063,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a0adff3ad028d84a7c30a9ddef9c54bfc9818009&amp;dn=Amped.+Unabridged.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Starvic","files":2,"time":1339373469,"description":"Technology makes them superhuman. But mere mortals want them kept in their place. The New York Times best-selling author of Robopocalypse creates a stunning, near-future world where technology and humanity clash in surprising ways. The result? The perfect summer blockbuster. \n\nAs he did in Robopocalypse, Daniel Wilson masterfully envisions a frightening near-future world. In Amped, people are implanted with a device that makes them capable of superhuman feats. The powerful technology has profound consequences for society, and soon a set of laws is passed that restricts the abilities - and rights - of &quot;amplified&quot; humans. \n\nOn the day that the Supreme Court passes the first of these laws, 29-year-old Owen Gray joins the ranks of a new persecuted underclass known as &quot;amps.&quot; Owen is forced to go on the run, desperate to reach an outpost in Oklahoma where, it is rumored, a group of the most enhanced amps may be about to change the world - or destroy it. \n\nOnce again, Daniel H. Wilson's background as a scientist serves him well in this technologically savvy thriller that delivers first-rate entertainment, as Wilson takes the &quot;what if&quot; question in entirely unexpected directions. Fans of Robopocalypse are sure to be delighted, and legions of new fans will want to get &quot;amped&quot; this summer.\n","torrent":{"xt":"urn:btih:a0adff3ad028d84a7c30a9ddef9c54bfc9818009","amp;dn":"Amped.+Unabridged.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0adff3ad028d84a7c30a9ddef9c54bfc9818009","infoHashBuffer":{"type":"Buffer","data":[160,173,255,58,208,40,216,74,124,48,169,221,239,156,84,191,201,129,128,9]},"announce":[],"urlList":[]}}