{"title":"DAZ3D - Poser - Rani for V4 (RO 62800) ZIP","uid":11194213,"size":59746183,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a15f55bd5e8a275f98165069a6d7b86a586fce50&amp;dn=DAZ3D+-+Poser+-+Rani+for+V4+%28RO+62800%29+ZIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"AtaraHen","files":-1,"time":1413055767,"description":"Rani\nA characterset for Victoria 4\n\nRani, alternatively spelled Ranee, is the female equivalent of Raja. In many Indo-Aryan languages it can mean &quot;queen&quot; or &quot;lady&quot;.\n\nAdd the glamour and charme of Bollywood movies to your runtime with this photorealistic character for Victoria.\n\nRani's face is a combination of a custom morph and DAZ-morphs that will give V4 a completely new look. Her body was sculpted by hand to give her the slender, natural shape of a dancer.\n\nYou can use the morphs &quot;as is&quot; or combine them with your own settings to achieve new, unique looks.\n\n\nThis character set is tested in and made for Poser 6 and 7 - you are able to use this pack in Poser 5, too, but some features like Ambient Occlusion will not show up.\n\nWe recommend the use of the Firefly Renderer to get the most out of this package!\n\nRani's morphs and textures where made with a close look on the stars you know from the colorful, romantic indian movies.\nHer golden skin, the spectacular make-ups and her expressive eyes will add a touch of orient to your renders.\n\nOf course you get natural face textures, too: Undone, just lipgloss and a combination of kajal and lipgloss.\n\nTo complete the look Rani comes with her own traditional Henna/Mehndi for feet and hands, created and painted by Digital-Lion - and with two fantasy Mehndis in metallic gold and silver!\n\n\nAll textures are enhanced with advanced material settings, specular- and bump maps.\n\nUsing Rani with V4.2:\nRani will work flawless with Victoria 4.2 - all you have to do is preload the Base V4 and Morphs++ V4-morphs.\n\nWe have added two handy poses within Rani's folder that make loading V4.2's morphs comfortable.\n\nLook what you get:\n2 Injection files to preload the V4.2 Base and ++ morphs.\n2 Injection/REM files to load the Rani's body- and head-morphs seperatly.\n1 Injection/REM file to load a body morphed with DAZ-morphs to make dressing Rani more easy.\n1 Injection/REM file to add longer nails.\n\n7 eye-textures based on macro-photos\n2 lash variations: fine natural lashes and mascara-style\n\n2 x 11 glamorous MakeUps and 2 natural head-textures, one version with the traditional Tilaka and one without.\n\n12 Nail laquers and a natural nail-texture\n12 Bindi-props coming with 6 different gems and two metal variations.\n\nPlease see addtional promos for renders and details!\n\nHair and clothes and jewellery (beside the bindi) used in the promotional images are not included!\n\nUsed items for the promotional images:\nBackground brush by Stephanie Shimerdla/obsidiandawn.com\nVayne Braid by AprilYSH\nDestiny Jewels by HMann\nBollywood Dreams by tabala\nColoration VayneBraid by PG-Graphics\n\nAll images rendered in Poser 7 Firefly with Encore Lights and IBL Magicby SaintFox &amp; Digital-Lion.","torrent":{"xt":"urn:btih:a15f55bd5e8a275f98165069a6d7b86a586fce50","amp;dn":"DAZ3D+-+Poser+-+Rani+for+V4+%28RO+62800%29+ZIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a15f55bd5e8a275f98165069a6d7b86a586fce50","infoHashBuffer":{"type":"Buffer","data":[161,95,85,189,94,138,39,95,152,22,80,105,166,215,184,106,88,111,206,80]},"announce":[],"urlList":[]}}