{"title":"Branford Marsalis - Contemporary Jazz (1999) [Jazz][mp3 320][h33","uid":4713300,"size":178933060,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a1e0c09975671132ce349a399db2e2717489b8a4&amp;dn=Branford+Marsalis+-+Contemporary+Jazz+%281999%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"schon55","files":14,"time":1234151849,"description":"Branford Marsalis - Contemporary Jazz\nOriginal Release Date: August 15, 2000 \nLabel: Columbia \nTotal time: 73:54\nBitrate: 320 kbps\n\nThis album was much anticipated, for it would be Branford Marsalis's first since the death of his longtime pianist Kenny Kirkland.  Happily, it is a knockout.  While no one can entirely recreate the famed chemistry that existed between Kirkland and Marsalis, pianist Joey Calderazzo does a marvelous job handling the extraordinary complexity, energy, and beauty of Marsalis's music.  Bassist Eric Revis and drummer Jeff 'Tain' Watts, both of whom played on 1999's Requiem (which wound up being the last recording of Kirkland's life), carry on here in the spirit of their departed friend, fleshing out Marsalis's increasingly challenging ensemble concepts and -- most importantly -- swinging like men possessed.  'In the Crease' and 'Tain Mutiny,' with their unpredictable twists and turns, are indicative of the gravitas of Marsalis's work ever since he left his post at The Tonight Show.  But the album's high point is a lengthy take of 'Elysium,' a tune that appeared on Requiem as a trio piece, an aesthetic choice necessitated by the sudden death of Kirkland who never had a chance to play on the track.  Here the full quartet weighs in, deftly executing a dizzying series of tempo shifts and subtle cues, all seamlessly worked into a fabric of extended, burning improvisation.  Finally, 'Sleepy Hollow,' a slow blues tucked away at the end of the program as a hidden track, sounds as though the band just let the tape roll as they warmed down from the session.  It's a delightfully unrehearsed moment, perhaps a closing homage to Kirkland, drawn from deep down in the tradition. ~ David R. Adler, AMG \n\nThe playing of Branford and Jeff 'Tain' Watts is outstanding on this disc. The compositions are really good. Unfortunately, Joey Calderazzo passed his 'audition' with Branford somehow, and he is unfortunately part of his quartet now. Amazingly, this CD also won a grammy award this year, ahead of some albums that are much better, including Dave Holland's Prime Directive, a really great disc compared to this one. ~ john lucey\n\nPersonnel:\nBranford Marsalis (Saxophones) \nJoey Calderazzo (Piano) \nJeff 'Tain' Watts (Drums) \nEric Revis (Double Bass) \n\nBranford Marsalis - Contemporary Jazz Tracks:\n01 In The Crease (Branford Marsalis) 6:49 \n02 Requiem (Branford Marsalis) 10:19 \n03 Elysium (Branford Marsalis) 16:03\n04 Cheek To Cheek (Irving Berlin) 8:47 \n05 Tain Mutiny (Branford Marsalis) 8:23 \n06 Ayanna (Eric Revis) 6:03 \n07 Countronious Rex (Jeff Watts) 17:26","torrent":{"xt":"urn:btih:a1e0c09975671132ce349a399db2e2717489b8a4","amp;dn":"Branford+Marsalis+-+Contemporary+Jazz+%281999%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1e0c09975671132ce349a399db2e2717489b8a4","infoHashBuffer":{"type":"Buffer","data":[161,224,192,153,117,103,17,50,206,52,154,57,157,178,226,113,116,137,184,164]},"announce":[],"urlList":[]}}