{"title":"The Millennium - Begin (1968) [FLAC]","uid":8033898,"size":448102753,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a204f39fa398f8a70892b84fc359b623b44b200e&amp;dn=The+Millennium+-+Begin+%281968%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":30,"time":1358478289,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\n01. Prelude (1:18)\n02. To Claudia On Thursday (3:26)\n03. I Just Want To Be Your Friend (2:37)\n04. 5 A.M. (2:39)\n05. I'm With You (2:35)\n06. The Island (3:19)\n07. Sing To Me (2:16)\n08. It's You (3:21)\n09. Some Sunny Day (3:21)\n10. It Won't Always Be The Same (2:58)\n11. The Know It All (2:41)\n12. Karmic Dream Sequence #1 (5:56)\n13. There Is Nothing More To Say (2:24)\n14. Anthem (Begin) (2:42)\nBonus Tracks\n15. Just About The Same (2:21)\n16. Blight (3:02)\n17. It's You (Mono Single Version) (3:13)\n18. I Just Want To Be Your Friend (Mono Single Version) (2:35)\n19. 5 A.M. (Mono Single Version) (2:44)\n20. Prelude (Mono Single Version) (1:18)\n21. It Won't Always Be The Same (Mono Single Version) (3:00)\n22. To Claudia On Thusday (Mono Single Version) (3:09)\n23. There Is Nothing More To Say (Mono Single Version) (2:25)\n\nThe Millennium looms large in the hearts of fans of the '60s sunshine pop genre. The studio group was the creation of legendary tunesmith/studio genius Curt Boettcher, who had previously been instrumental in the formation of the fabled '60s cult acts the Ballroom and Sagittarius. In 1968, Boettcher assembled a group of talented California singers and musicians (including singer/guitarists Lee Mallory, Sandy Salisbury, Joey Stec and Michael Fennelly and Music Machine drummer Ron Edgar) to record the Millennium's sole album, Begin.\nBegin, produced by Curt Boettcher and Keith Olsen, with assistance by California rock legend Gary Usher, is an exquisite progressive pop opus, combining breezy melodies, ambitious baroque arrangements, stirring psychedelic touches and angelic vocal harmonies to create a suite-like concept album that perfectly captures the optimistic mood of the time in which it was made.\nAt the time the most expensive rock album that Columbia Records had ever financed, Begin proved to be too melodic for the emerging underground FM radio format and too avant-garde for AM Top 40. Although it didn't find a large audience at the time of its release, Begin is now acknowledged as a landmark work and a sunshine-pop cornerstone. It retains a loving place in the hearts and minds of its fans, who hold it in the same high esteem as the works of such harmony-driven '60s acts as the Beach Boys, the Left Banke and the Mamas and the Papas.","torrent":{"xt":"urn:btih:a204f39fa398f8a70892b84fc359b623b44b200e","amp;dn":"The+Millennium+-+Begin+%281968%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a204f39fa398f8a70892b84fc359b623b44b200e","infoHashBuffer":{"type":"Buffer","data":[162,4,243,159,163,152,248,167,8,146,184,79,195,89,182,35,180,75,32,14]},"announce":[],"urlList":[]}}