{"title":"St. Francis de Sales - Introduction to the Devout Life (pdf)","uid":8622204,"size":2534106,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a282297cee2d8fc0b11c9efb997adff9a0ef3a28&amp;dn=St.+Francis+de+Sales+-+Introduction+to+the+Devout+Life+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pharmakate","files":-1,"time":1372405772,"description":"St. Francis de Sales (John K. Ryan, trans.) - Introduction to the Devout Life (Image, 1966).\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nClassic counter-reformation exhortation and instruction guide to living a life of holiness for beginners. Despite the conventions of the age, still valuable and interesting.\n\ndescription:\n\nIn Introduction to the Devout Life, 17th-century French clergyman Francis de Sales addresses himself to the mass of Christians who do not believe it possible that they could live a devout life while also struggling to make their way in the world. He contends that devotion is not a state necessarily relegated to monks in cloisters, but can be a quality of life to which everyone can aspire. Accordingly, the book is arranged as a self-help guide to lead the reader through the process of developing a life lived in accordance with God. Christians seeking a deeper connection with the divine will find this an inspiring read. \n\nFrench bishop and Roman Catholic saint FRANCIS DE SALES (1567-1622) is known for his work converting Protestants to Catholicism. He was a renowned preacher and writer; among his works is Treatise on the Love of God.","torrent":{"xt":"urn:btih:a282297cee2d8fc0b11c9efb997adff9a0ef3a28","amp;dn":"St.+Francis+de+Sales+-+Introduction+to+the+Devout+Life+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a282297cee2d8fc0b11c9efb997adff9a0ef3a28","infoHashBuffer":{"type":"Buffer","data":[162,130,41,124,238,45,143,192,177,28,158,251,153,122,223,249,160,239,58,40]},"announce":[],"urlList":[]}}