{"title":"Sleep Hacking ","uid":9670790,"size":678189905,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a2a6e656fcd0b4c8d0a2107a85c770097b66dc38&amp;dn=Sleep+Hacking+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MucGar","files":-1,"time":1393457513,"description":"Sleep Hacking - Have More Energy Spend Less Time in Bed With Scott Britton\n\n\n \nWEB-Rip | MP4 | AVC1 @ 1 Mbit/s | 1080x676 | AAC Stereo @ 128 Kbit/s 48 KHz | 4+ Hours | 646 MB\n\n\nGenre: Health Sleeping | Language: English | PDFs Included\n\n\n\nDo you wish you had BOUNDLESS ENERGY?\nDo you wish you had more time to be productive and do the things you love?\nAre you curious about those people who seem to operate on far less sleep but are still somehow able to be incredibly productive?????\nUmmmm yeah..\n\nThen join more than 1000+ people whove taken this course and gotten hours more waking time each week while having more energy each day.\nThe Magical Tale of This Class (and my sleep hacking adventure)\nI used to spend an average of 7.5-8 hours a night sleeping....\nEven though by medical standards this was classified as a sufficient amount I still found myself tired at times (ARGHH). I was frustrated which is why I started to study and experiment with sleep.\nThrough countless self-experimentations and optimizations over the past year Ive cut down my sleep time down to about 6 hours of sleep and have never had more energy. If you compound this difference over the course of a year thats more than 4 weeks of additional waking time THAT I GET TO SPEND DOING THINGS I LOVE.\nDoes 4 additional weeks this year sound interesting to you? How would you spend them?\nI wanted to save everyone interested in having more time and energy the countless hours and mistakes I made so I decided to create a brief presentation on it to share with friends. Turns out some really interesting people thought it was pretty good","torrent":{"xt":"urn:btih:a2a6e656fcd0b4c8d0a2107a85c770097b66dc38","amp;dn":"Sleep+Hacking+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2a6e656fcd0b4c8d0a2107a85c770097b66dc38","infoHashBuffer":{"type":"Buffer","data":[162,166,230,86,252,208,180,200,208,162,16,122,133,199,112,9,123,102,220,56]},"announce":[],"urlList":[]}}