{"title":"Copeland - Ixora (2014) [FLAC]","uid":11620969,"size":249726257,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a2e08715470b0e446d6f991e572132c6335372c1&amp;dn=Copeland+-+Ixora+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1417549167,"description":"\n  Copeland - Ixora (2014) [FLAC]\n\n  Genre: Rock\n  Style: Indie\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 Have I Always Loved You\n  02 Disjointed\n  03 I Can Make You Feel Young Again\n  04 Erase\n  05 Lavender\n  06 Ordinary\n  07 Like a Lie\n  08 Chiromancer\n  09 World Turn\n  10 In Her Arms You Will Never Starve\n\n  Vocalist Aaron Marsh, bassist James Likeness, guitarist Bryan Laurenson, and drummer Jon Bucklew (formerly of the Christian rock act Denison Marrs) are the members of Copeland, an earnest-sounding alternative rock band that took root in Marsh's home state of Florida in 2000. Maryland native Laurenson and original drummer Rusty Fuller were added to the lineup just in time for the recording of Copeland's first release. Produced by Matt Goldman, who would later go on to helm records for Denison Marrs, the EP (which the group split with Pacifico) was issued in 2001. A year later, Copeland signed with The Militia Group, an artist development company located in southern California, and relocated to Atlanta to begin work on a proper studio effort.\n\n  Bucklew stepped in to replace the departing Fuller (who later joined the Beautiful Mistake), and Goldman climbed aboard as producer for the emotionally driven punk-pop stylings of 2003's Beneath Medicine Tree. Tours with the Juliana Theory, Mae, Hopesfall, Switchfoot, and the Early November followed, while an EP of cover songs, Know Nothing Stays the Same, was released in August 2004 to maintain Copeland's rising popularity. In March 2005, the band released its long-awaited sophomore album, In Motion. The ten-song set debuted at number 115 on Billboard's Top 200 album chart within a week of its release, and Eat, Sleep, Repeat fared similarly after its Halloween release in 2006. Two weeks later, the band announced it had joined the major-label ranks of Columbia Records; the partnership didn't last long, however, and Copeland realigned themselves with Tooth &amp; Nail Records for 2008's You Are My Sunshine","torrent":{"xt":"urn:btih:a2e08715470b0e446d6f991e572132c6335372c1","amp;dn":"Copeland+-+Ixora+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2e08715470b0e446d6f991e572132c6335372c1","infoHashBuffer":{"type":"Buffer","data":[162,224,135,21,71,11,14,68,109,111,153,30,87,33,50,198,51,83,114,193]},"announce":[],"urlList":[]}}