{"title":"The.Smart.State.2015.1080p.WEBRip.x264-AUSHD","uid":15502949,"size":526236252,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a36f4494df17714b3c0f494ab0874cdf3f575d47&amp;dn=The.Smart.State.2015.1080p.WEBRip.x264-AUSHD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"djflickit","files":1,"time":1470541811,"description":"Technologies like personal computers and smart phones have reshaped every corner of society. Figures like Apple co-founders Steve Jobs and Steve Wozniak are commonly heralded as the god-like innovators of these planet shifting technologies, but the new documentary The Smart State makes a much different and far less popular argument.\r\n\r\nWhile private industry figureheads like Jobs and Wozniak are to be credited for their keen foresight, aggressive marketing skills and sleekly attractive packaging, the bulk of the advanced technologies they employed in their products resulted from the sweat and ingenuity of the public sector. In the opening moments of the film, a technology expert dissects the innards of a smart phone. The origin of each working part becomes clear through every step of his examination.\r\n\r\nThe development of the phone's camera was sponsored by the U.S. State Department and proved particularly useful in wartime situations. The GPS technology was also a remnant of conflict, and its invention dates back to the Cold War. Each of these technological features, including Bluetooth, internet, wifi, touch screen, and voice activation, found their roots in the public sector.\r\n\r\nThe film challenges the common perception that the public sector's role in the creation of new technologies is one of funder and facilitator. In fact, in many instances, the opposite has been true. Government funding of public universities and research centers has led to many of the breakthrough advancements of our time in both the fields of domestic technologies, workplace robotics and medicine. But who actually profits from all of this invention and productivity, and what arrangement would best ensure the future vitality of innovation?\r\n\r\nThose are the central questions posed by The Smart State. Private industry not only receives the bounty of acclaim for new technologies, but the vast majority of profits and government tax cuts as well. In the end, the film's expert interview subjects urge for a more collaborative existence between the private and public sectors much like what exists in Denmark. In plotting a future full of energy innovation and free from carbon emissions, the country has found its greatest success when the investment, creation and rewards of new technologies are shared.\r\n\r\n\r\nGeneral\r\nFormat                      : Matroska\r\nFormat version              : Version 4 / Version 2\r\nFile size                   : 502 MiB\r\nDuration                    : 47 min\r\nOverall bit rate            : 1 462 kb/s\r\nWriting application         : x264lib0.1\r\nWriting library             : x264lib0.1 / x264lib0.1\r\n\r\nVideo\r\nID                          : 1\r\nFormat                      : x264\r\nCodec ID                    : V_X264\r\nDuration                    : 47 min\r\nWidth                       : 1 920 pixels\r\nHeight                      : 1 080 pixels\r\nDisplay aspect ratio        : 16:9\r\nFrame rate mode             : Constant\r\nFrame rate                  : 25.000 FPS\r\nDefault                     : Yes\r\nForced                      : No\r\n\r\nAudio\r\nID                          : 2\r\nFormat                      : Opus\r\nCodec ID                    : A_OPUS\r\nDuration                    : 47 min\r\nChannel(s)                  : 2 channels\r\nChannel positions           : Front: L R\r\nSampling rate               : 48.0 kHz\r\nBit depth                   :  bit0\r\nCompression mode            : Lossy\r\nDefault                     : Yes\r\nForced                      : No","torrent":{"xt":"urn:btih:a36f4494df17714b3c0f494ab0874cdf3f575d47","amp;dn":"The.Smart.State.2015.1080p.WEBRip.x264-AUSHD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a36f4494df17714b3c0f494ab0874cdf3f575d47","infoHashBuffer":{"type":"Buffer","data":[163,111,68,148,223,23,113,75,60,15,73,74,176,135,76,223,63,87,93,71]},"announce":[],"urlList":[]}}