{"title":"(Blues) Mississippi John Hurt - 1928 Sessions","uid":6150832,"size":91316597,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a4293bfaeef34bd0876accc7d65ef8736b415285&amp;dn=%28Blues%29+Mississippi+John+Hurt+-+1928+Sessions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1296875047,"description":"mp3 Album: 1928 Session/Avalon Blues \nGenre: Blues\nStyles: Prewar Acoustic Country Blues, Prewar Delta Blues \nRecorded: 1928\nReleased: 1988\nLabel: Yazoo  \n\n\nmp3   320kbps\n\n\n1. Candy Man Blues - 2:44\n2. Blessed be The Name - 2:46\n3. Nobody's Dirty Business - 2:52\n4. Louis Collins - 2:57\n5. Praying On The Old Camp Ground - 2:35\n6. Spike Driver Blues - 3:13\n7. Avalon Blues - 3:01\n8. Ain't No Tellin' - 2:54\n9. Blue Harvest Blues - 2:51\n10. Frankie - 3:21\n11. Big Leg Blues - 2:51\n12. Stack O'Lee - 2:55\n13. Got The Blues (Can't Be Satisfied) - 2:50\n\nPersonnel:\nMississippi John Hurt - Guitar, Vocal\n\n No blues singer ever presented a more gentle, genial image than Mississippi John Hurt. A guitarist with an extraordinarily lyrical and refined fingerpicking style, he also sang with a warmth unique in the field of blues, and the gospel influence in his music gave it a depth and reflective quality unusual in the field. Coupled with the sheer gratitude and amazement that he felt over having found a mass audience so late in life, and playing concerts in front of thousands of people - for fees that seemed astronomical to a man who had always made music a sideline to his life as a farm laborer - these qualities make Hurt's recordings into a very special listening experience.Hurt's dexterity as a guitarist, coupled with his plain-spoken nature, were his apparent undoing, at least as a popular blues artist, at the time. His playing was too soft and articulate, and his voice too plain to be taken up in a mass setting, such as a dance; rather, his music was best heard in small, intimate gatherings. In that sense, he was one of the earliest blues musicians to rely completely on the medium of recorded music as a vehicle for mass success;\nMississippi John Hurt's latter-day recordings after his rediscovery have somewhat obscured the importance of these debut sides - the ones that made his rediscovery an idea initially worth pursuing. Archival recordings such as this, are the collector's items that made his rep in the first place, and stand as some of the most poetic and beautiful of all country blues recordings. Hurt's playing is sheer musical perfection, with a keen sense of chord melody structure to make his bouncy, rhythmic execution of it sound both elegant and driving. Mississippi John's voice - he was 36 at the time of these recordings - was already a warm and friendly one, imbued with the laid-back wistfulness that would earmark his rediscovery recordings half-a-lifetime later.These are the ones to hear, although all Hurt is worth listening to.\n\n","torrent":{"xt":"urn:btih:a4293bfaeef34bd0876accc7d65ef8736b415285","amp;dn":"%28Blues%29+Mississippi+John+Hurt+-+1928+Sessions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4293bfaeef34bd0876accc7d65ef8736b415285","infoHashBuffer":{"type":"Buffer","data":[164,41,59,250,238,243,75,208,135,106,204,199,214,94,248,115,107,65,82,133]},"announce":[],"urlList":[]}}