{"title":"Harry.Potter.Y.el.Misterio.del.Principe.2009.SPANiSH.DVDRip.XviD","uid":5161833,"size":1477795840,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a4bb1874b354ea9476b772d6e1d666dcdec3c50c&amp;dn=Harry.Potter.Y.el.Misterio.del.Principe.2009.SPANiSH.DVDRip.XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Morck22","files":1,"time":1258194708,"description":"\nHarry Potter and the Half-Blood Prince (2008) / David Yates / Consulta sobre Harry Potter y el misterio del prÃƒÂ­ncipe en IMDb\nNacionalidad: Reino Unido, EEUU / Rodada en formato 2.35:1\nColor / 153 minutos / Aventuras, drama, fantÃƒÂ¡stica, misterio\nDaniel Radcliffe, Emma Watson, Rupert Grint, Helena Bonham Carter, Alan Rickman, Jim Broadbent, Bonnie Wright, Jessie Cave, Timothy Spall, Tom Felton, David Thewlis, Maggie Smith, Warwick Davis, Michael Gambon, Helen McCrory, Robbie Coltrane, Julie Walters, Evanna Lynch, Natalia Tena, Katie Leung, Matthew Lewis, Mark Williams\nProduce: Warner Bros. Pictures, Heyday Films\nDistribuida en salas espaÃƒÂ±olas por Warner Home Video\nEstreno oficial, nunca antes se ha proyectado en salas comerciales a nivel mundial.\nSinopsis\nVoldemort estrecha su dominio sobre el mundo mÃƒÂ¡gico y el de los muggle y Hogwarts ya no es el refugio seguro que era antes. Harry sospecha que los peligros pueden estar dentro del castillo, pero Dumbledore estÃƒÂ¡ mÃƒÂ¡s atento a prepararle para la batalla final que sabe que se avecina. Trabajan juntos para encontrar la llave que libera las defensas de Voldemort y, para este fin, Dumbledore cuenta con su viejo amigo y colega, el sibarita, confiado e influyente profesor Horace Slughorn, del que Dumbledore cree que posee informaciÃƒÂ³n crucial.\n\nMientras tanto, los estudiantes sufren el ataque de un adversario muy diferente cuando las hormonas adolescentes atraviesan las murallas con furia. Harry se siente cada vez mÃƒÂ¡s atraÃƒÂ­do por Ginny, al igual que Dean Thomas. Y Lavender Brown ha pensado que Ron es el chico ideal para ella, pero no ha contado con los bombones de Romilda Vane. Finalmente, Hermione arde de celos, pero estÃƒÂ¡ decidida a no mostrar sus sentimientos. Y mientras el amor florece, un estudiante permanece apartado. EstÃƒÂ¡ dispuesto a dejar su sello, uno muy oscuro. El amor flota en el aire, pero la tragedia le ha tomado ventaja y tal vez Hogwarts no vuelva a ser lo mismo nunca mÃƒÂ¡s.\n","torrent":{"xt":"urn:btih:a4bb1874b354ea9476b772d6e1d666dcdec3c50c","amp;dn":"Harry.Potter.Y.el.Misterio.del.Principe.2009.SPANiSH.DVDRip.XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4bb1874b354ea9476b772d6e1d666dcdec3c50c","infoHashBuffer":{"type":"Buffer","data":[164,187,24,116,179,84,234,148,118,183,114,214,225,214,102,220,222,195,197,12]},"announce":[],"urlList":[]}}