{"title":"Rayman Arena [Multi3]","uid":5875629,"size":809495201,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a4dd539701024298658d4f65320c59771ed21506&amp;dn=Rayman+Arena+%5BMulti3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ADHDerby","files":-1,"time":1286624978,"description":"Developer: Ubi Soft\nRelease Date: September 30, 2002\nLanguages: English, French, Spanish\nOS: Windows 95/98/2K/ME/XP/Vista/7\n\n\nRaymans world kicks into multiplayer overdrive in this total competition crash course with the cast of Rayman 2. Smoke the competition on mind-bending racecourses, or spark up a lum-flinging firefight in the battle arena. And with 8 characters, 24 maps and up to 4 combatants, now Rayman got more ways to reign supreme than ever.\n\nThe game offers two main modes of play, with a foot race and a deathmatch mode. The racing mode of the game has Rayman and his associates running through interactive levels that can be altered with switches and other devices to change the course mid-race. The shooter mode is imbued with a Rayman style as well, by offering themed devices and quirky power-ups.\n\n\nFeatures:\n\nFurious Footraces:\nTake risks, use tricks, and trip up opponents as you sprint, slide, climb, and helicopter through 12 courses in an all-out rush for the checkered flag.\n\nBlistering Battles:\nRepresent through 12 gladiator-style arenas in a frenzied firefight with power-ups, traps, and special ammo to get the most lums and reign victorious.\n\nUnleash new characters:\nChoose from eight playable characters, including the cast of Rayman 2 and all-new characters.\n\nMultiplayer Madness:\nCompete with up to four players in intense, multiplayer action via LAN or fight and race against a friend in two-player splitscreen mode.\n\n\nExtras:\n\n- 9 High Quality Icons (256x256 PNG Compressed)\n- Savegame with all Levels, Additional Modes, Characters and Skins unlocked\n\n\nInstall:\n\n1) Extract to any folder of your choice\n2) Open the Language directory and click the language that you want to use\n3) Run RM_Setup_DX8.exe to configure the graphics and network settings\n4) Start the game with R_Arena.exe (NoCD/Fixed EXE by me) :)\n\n\nCheers,\n\nADHDerby","torrent":{"xt":"urn:btih:a4dd539701024298658d4f65320c59771ed21506","amp;dn":"Rayman+Arena+%5BMulti3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4dd539701024298658d4f65320c59771ed21506","infoHashBuffer":{"type":"Buffer","data":[164,221,83,151,1,2,66,152,101,141,79,101,50,12,89,119,30,210,21,6]},"announce":[],"urlList":[]}}