{"title":"Iron.Horse.1924.US.Version.DVDRip.x264-HANDJOB.mkv","uid":11801960,"size":3298014977,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a4ee66f5c537362f6280ce6672958e4f10cc5643&amp;dn=Iron.Horse.1924.US.Version.DVDRip.x264-HANDJOB.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mfccorrea","files":1,"time":1428423167,"description":"In Springfield, the surveyor Brandon dreams on building the first transcontinental railroad while his skeptical friend Thomas Marsh, who is a small constructor, believes he is nothing but a dreamer chasing a rainbow; their children Davy Brandon and Miriam Marsh are best friends. Brandon heads with Davy to the west, where he finds a possible pass for the railroad. However, a group of Cheyenne led by a white renegade kills and scalps Brandon; Davy, who is hidden, sees that the killer has only two fingers in his right hand. In June 1862, President Abraham Lincoln authorizes the construction of two railroads: the Union Pacific from Omaha, Nebraska, to West; and the Central Pacific, from Sacramento, California, to East. His old friend Thomas Marsh is responsible for the construction of the Union Pacific and his daughter Miriam is engaged of his engineer Jesson. After many incidents during the construction, Thomas Marsh is short of money and he needs to find a shortcut other than the original route through Smoky River. However, the powerful Bauman that owns the lands where the railroad should pass, bribes Jesson to keep the original route. When the grown-up Davy appears in the town bringing the mail, Miriam is glad in meeting him and he tells to Thomas that his father had discovered a pass through the Black Hills. Thomas assigns Jesson to ride with Davy to check the ravine, but Bauman convinces the engineer to kill the rival. Jesson cuts the rope that Davy is using to descent to the pass; returns to town and tells that Davy had an accident and died. However, when Davy returns to town, he discloses the truth and the situation of the engineer becomes unbearable. The desperate Bauman uses the two fingered renegade to convince the Cheyenne to war against the workers and Davy has the chance to meet the killer of his father. On 10 May 1869, the locomotives 116 and Jupiter meets each other in the intersection of the Union Pacific and the Central Pacific. \n\nRip Specs (DVD Rip)\n\nGeneral           : Iron.Horse.1924.US.Version.DVDRip.x264-HANDJOB.mkv\nFormat            : Matroska at 2 939 Kbps\nLength            : 3.07 GiB for 2h 29mn 38s 45ms\n\nVideo #0          : AVC\nAspect            : 720 x 480 (1.333) at 23.976 fps\n\nAudio #0          : AC-3 at 448 Kbps\nInfos             : 6 channels, 48.0 KHz\nLanguage          : en\n\nAudio #1          : AAC\nInfos             : 2 channels, 48.0 KHz\nLanguage          : en\n\nText #0           : VobSub\nLanguage          : es\n\nText #1           : VobSub\nLanguage          : fr\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0015016/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0015016/&lt;/a&gt;\n\nAudio: Silent (Musical score)\nSubtitles: English intertitles, French and Spanish embedded","torrent":{"xt":"urn:btih:a4ee66f5c537362f6280ce6672958e4f10cc5643","amp;dn":"Iron.Horse.1924.US.Version.DVDRip.x264-HANDJOB.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4ee66f5c537362f6280ce6672958e4f10cc5643","infoHashBuffer":{"type":"Buffer","data":[164,238,102,245,197,55,54,47,98,128,206,102,114,149,142,79,16,204,86,67]},"announce":[],"urlList":[]}}