{"title":"The Essential George Gershwin","uid":5142681,"size":217554677,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a534aa548639d47719c14fff5eed0c7a6ba86263&amp;dn=The+Essential+George+Gershwin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"dougietrotter","files":-1,"time":1257032565,"description":"Given his seemingly effortless ability at melding such disparate forms as jazz and gospel with his own rare melodic gifts, it's not hard to view George Gershwin as America's first classical crossover artist. But as this glorious, 41-track double-disc introduction to Gershwin's epochal repertoire quickly demonstrates, that assessment woefully shortchanges the sheer grandeur of &quot;Rhapsody in Blue&quot; or the sultry earthiness of &quot;Summertime.&quot; \n\nSinger and pop musicologist Michael Feinstein produced the set (as well as contributing a new recording of &quot;Home Blues&quot;), and under his guidance it understandably leans toward Gershwin's remarkable body of songcraft, though it also includes more concert-oriented pieces such as the &quot;Rhapsody&quot; and &quot;Prelude No. 2,&quot; both in original performances by the composer. But Feinstein's loving sense of American pop song history ensures that the performances here are both inspired and enlightening. \n\nIndeed, his choices represent not only a who's who of 20th-century pop and saloon singers - spanning a rich pantheon that includes Jolson, Kelly, Astaire, Holliday, Sinatra, Bennett, Waters, Torme, Clooney, Day, Vaughan, and Fitzgerald - but deftly underscore Gershwin's transcendent synthesis of style, era, and distinctly American subject matter. \n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:a534aa548639d47719c14fff5eed0c7a6ba86263","amp;dn":"The+Essential+George+Gershwin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a534aa548639d47719c14fff5eed0c7a6ba86263","infoHashBuffer":{"type":"Buffer","data":[165,52,170,84,134,57,212,119,25,193,79,255,94,237,12,122,107,168,98,99]},"announce":[],"urlList":[]}}