{"title":"DNP Capstone Projects (Nursing) [PDF] [StormRG]","uid":11253890,"size":1240457,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a5e6c2a59a9937757648a47e70a94c6c98841770&amp;dn=DNP+Capstone+Projects+%28Nursing%29+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"0xmovva","files":-1,"time":1413871634,"description":"TITLE/EDITION DNP Capstone Projects: Exemplars of Excellence in Practice\nAuthor: Barbara A. Anderson DrPH CNM FACNM FAAN (Editor), Joyce M. Knestrick PhD CRNP FAANP (Editor), Dr. Rebeca Barroso DNP CNM (Editor)\nPaperback: 206 pages\nPublisher: Springer Publishing Company; 1 edition (September 22, 2014)\nLanguage: English\nISBN-10: 0826130259\nISBN-13: 978-0826130259\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nWith a unique focus on exemplary, completed DNP capstone projects, this book delivers key information on designing, constructing, and completing a high quality capstone project. It demonstrates the impact that a well-conceived capstone project can have on facilitating change and addresses all program, administrative, policy, and clinical issues that DNP students may encounter during the capstone process. The book examines a variety of capstone projects from across the U.S.--quality improvement projects, strategic plans, advocacy, clinical case narratives, and other innovations--that demonstrate efficacy in clinical nursing practice outcomes and positive impact upon the health care environment.\n\nThe book analyzes the components of these exemplary capstones to demonstrate how each has provided leadership for change in practice, promoted interdisciplinary collaboration, contributed to advocacy and policy change, and enhanced quality improvement in health care systems.\n\nKey Features:\n\nFocuses on a wide range of exemplary, completed DNP capstone projects\nProvides a roadmap for excellence in creating capstone projects\nAnalyzes components of capstones that have effected positive change\nIncludes strategies for implementing evidence-based practices for nurses and other health care providers\nHighlights DNP leadership and resulting positive changes in clinical practice","torrent":{"xt":"urn:btih:a5e6c2a59a9937757648a47e70a94c6c98841770","amp;dn":"DNP+Capstone+Projects+%28Nursing%29+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5e6c2a59a9937757648a47e70a94c6c98841770","infoHashBuffer":{"type":"Buffer","data":[165,230,194,165,154,153,55,117,118,72,164,126,112,169,76,108,152,132,23,112]},"announce":[],"urlList":[]}}