{"title":"Brandy - Never Say Never","uid":6611863,"size":552000680,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a640188b4dbb4a3fd8444612052f0cec05b4b28d&amp;dn=Brandy+-+Never+Say+Never&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"cdda-flac","files":-1,"time":1313626565,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/5147pfzEYPL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/5147pfzEYPL._SS500_.jpg&lt;/a&gt;\n\n\nTitle: Never Say Never\nArtist: Brandy\nAudio CD (June 9, 1998)\nOriginal Release Date: June 9, 1998\nNumber of Discs: 1\nGenre: R&amp;B\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Intro\n02. Angel in Disguise\n03. The Boy Is Mine [Duet with Monica]\n04. Learn the Hard Way\n05. Almos Doesn't Count\n06. Top of the World [Feat. Mase]\n07. U Don't Know Me (Like U Used To)\n08. Never Say Never\n09. Truthfully\n10. Have You Ever?\n11. Put That on Everything\n12. In the Car Interlude\n13. Happy\n14. One Voice\n15. Tomorrow\n16. Everything I Do (I Do for You)\n\n\nAmazon Review:\nBrandy has a lot to prove. She's had five Grammy nominations; she's won one Billboard Music Award, one American Music Award, and several Image and Soul Train awards; and she's sold over 4 million records -- all by the age of 19. Never Say Never enters the scene after four years of sophomore jitters and plain old fear. And it enters with a bang. Brandy's voice suggests serious vocal training from her father, and strong songs -- some written by her now-19-year-old woman-child self -- attempt to take R&amp;B back to its proper plateau. The album's first single, &quot;The Boy Is Mine,&quot; and the Mase duet &quot;Top of the World&quot; serve as proof that Brandy still has the chops, determination, and cuteness to take a record to the top.\n\nAllmusic Review:\nShortly after the release of her eponymous debut in 1995, Brandy became a star. Not only did the album sell well, but she starred on UPN's Moesha and Disney's made-for-TV Cinderella, all before she released her second album, Never Say Never, in 1998. Needless to say, there was much more riding on the second record than the debut and, fortunately, she follows through with Never Say Never, delivering an album that rivals her first. Brandy wisely decides to find a middle ground between Mariah Carey and Mary J. Blige -- it's adult contemporary with a slight streetwise edge. As with most adult contemporary albums, the record is bogged down by some filler, but Brandy's delivery has improved and her subdued vocals can make mediocre material sound convincing. Still, what makes Never Say Never a winning record is the quality songs and production. The smooth Monica duet &quot;The Boy Is Mine&quot; and the tripped-out &quot;Top of the World&quot; (which features a rap from Mase) are two examples of what Brandy can achieve when everything's in the right place, and they help make Never Say Never a better, more adventurous record than her debut.","torrent":{"xt":"urn:btih:a640188b4dbb4a3fd8444612052f0cec05b4b28d","amp;dn":"Brandy+-+Never+Say+Never","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a640188b4dbb4a3fd8444612052f0cec05b4b28d","infoHashBuffer":{"type":"Buffer","data":[166,64,24,139,77,187,74,63,216,68,70,18,5,47,12,236,5,180,178,141]},"announce":[],"urlList":[]}}