{"title":"Star Wars Clone Wars (2003-2005) All Torrent [DVD5  Eng Ita Esp]","uid":6589268,"size":361634,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a67cd3c450dacd6042a05ba72130786085a01126&amp;dn=Star+Wars+Clone+Wars+%282003-2005%29+All+Torrent+%5BDVD5++Eng+Ita+Esp%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"l.diliberto","files":2,"time":1312750021,"description":"Star Wars Clone Wars (2003-2005) All Torrent [DVD5  Eng Ita Esp] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=261417&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=261417&lt;/a&gt;\n\n.: Plot :.\n\nThe original series consists of 20 three-minute installments for seasons 1 and 2 (later collectively known as Volume 1), and five 12-to-15 minute installments for Season 3 (later called Volume 2). The series follows the Jedi in their exploits fighting the Separatist movement against the Galactic Republic. The 25 episodes are mostly energetic set-piece battles. Many characters from the films are featured prominently, while other episodes feature minor characters from the films and/or those from the Expanded Universe. Since much emphasis is placed on action, the story and plot is less developed than in the films.\n\nSeason One and Season Two/DVD Volume One: The main storyline features Obi-Wan Kenobi being assigned to lead an assault on the planet Muunilist, with his apprentice Anakin Skywalker leading the battle in space above. Meanwhile, Separatist leader Count Dooku takes in the Dark Jedi Asajj Ventress as his apprentice and sends her off to assassinate Anakin. Anakin diverts his attention in the middle of battle to pursue Ventress to Yavin 4, where he manages to defeat her in a lightsaber duel, though only through the means of fear and anger, the path to the dark side of the Force. Surrounding this storyline are various different battles focusing on other Jedi and their clone troops, including:\n\n    Obi-Wan Kenobi confronting the Gen'Dai bounty hunter Durge on Muunilinst\n    Kit Fisto leading an underwater assault on Mon Calamari\n    Mace Windu single-handedly destroying a seismic tank on Dantooine\n    Yoda and PadmÃƒÂ© Amidala rescuing Luminara Unduli and her apprentice Barris Offee on Ilum\n    Ki-Adi-Mundi, Shaak Ti, K'Kruhk and Aayla Secura ambushed by droid commander General Grievous on Hypori\n\nSeason Three/DVD Volume Two: The story picks up directly from Anakin's defeat of Ventress and Obi-Wan's victory on Muunilist. With General Grievous emerging to claim victories for the Separatists, the Republic needs more Jedi Knights. After much consideration, the Jedi Council decides to promote Anakin to a Knight. Three years later, Anakin and Obi-Wan are assigned to find General Grievous on the planet Nelvaan, but end up liberating a group of Nelvaanians enslaved and mutated by the Techno Union instead. Meanwhile, General Grievous leads an assault on Coruscant and, despite the best efforts of Yoda, Mace Windu, Shaak Ti and others, kidnaps Supreme Chancellor Palpatine for his master Count Dooku. Anakin manages to rescue the Nelvaan warriors, though he once again draws upon his anger, then sets out with Obi-Wan to rescue the Chancellor over Coruscant (as seen in the opening minutes of Star Wars Episode III: Revenge of the Sith).\n\n.: Trama :.\n\nLa serie originale consiste in 20 episodi della durata di tre minuti, che compongono la stagione uno e due (poi conosciute con il nome di Volume 1), e 5 episodi della durata variabile tra i dodici e i quindici minuti, che vanno a comporre la terza stagione (poi conosciuta come Volume 2). I 25 episodi sono per la maggior parte composti da enfatizzate scene d'azione, battaglie e scontri, a discapito di un minor sviluppo della trama.\n\nLo show segue i Jedi nella loro battaglia contro la Confederazione dei Sistemi Indipendenti, guidati da Dooku. Molti personaggi principali apparsi nei film, ritornano nella serie, come Anakin Skywalker, Obi-Wan Kenobi, Yoda, Mace Windu, Palpatine, Dooku, Grievous, C-3PO, R2-D2 e PadmÃƒÂ© Amidala. Alcuni episodi, inoltre, si concentrano sulle avventure in solitario di personaggi minori apparsi nei film, come Kit Fisto, Ki-Adi-Mundi, Shaak Ti e Aayla Secura.\n[modifica] Stagioni\n\nStagione Uno e Due/DVD Volume I - Le prime due stagioni sono strutturate con una trama principale, dalla quale si ramificano una serie di battaglie in solitario dei vari Jedi. Il Conte Dooku sta cercando (su ordine del suo maestro), sul pianeta Rattatak, un cacciatore di taglie per i suoi scopi. Per individuare il piÃƒÂ¹ forte fa li fa scontrare l'uno contro l'altro in una grande arena. Una misteriosa figura, Asajj Ventress, riesce ad uccidere tutti gli assassini che si erano presentati nell'arena. Impressionato, Dooku le affida il compito di uccidere Anakin Skywalker. Ella, quindi, tende una trappola al giovane Jedi e lo conduce su Yavin IV, Dove i due lottano furiosamente. Anakin emerge vittorioso, nonostante, per battere il suo avversario, abbia fatto emergere il suo Lato Oscuro.\n\nOltre a questa trama, vengono narrate altre storie parallele, incluse la battaglia di Windu su Dantooine, la lotta tra Obi-Wan e il cacciatore di taglie Durge, lo scontro tra Kit Fisto e i Quarren su Mon Calamari e la battaglia su Hypori dove Grievous fa la sua prima apparizione nell'universo di Guerre stellari.\n\nStagione Tre/DVD Volume II - La terza stagione si concentra sulle avventure di Obi-Wan Kenobi and Anakin Skywalker nei territori dell'Orlo Esterno[3]. Anakin viene promosso a cavaliere Jedi e Coruscant viene attaccata dalla Confederazione dei Sistemi Indipendenti, come diversivo per nascondere l'atterraggio del Generale Grievous, sceso sulla capitale per catturare il Cancelliere Palpatine.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img838.imageshack.us/img838/8690/starwarsclonewars1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img838.imageshack.us/img838/8690/starwarsclonewars1.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nAutori: George Lucas supervisore creativo\nGenndy Tartakovsky co-creatore\nHenry Gilroy co-creatore\nRegia: Genndy Tartakovsky\nDave Bullock\nGeorge Samilski\nDave Filoni 6 Episodi\nBrian O'Connell 2 Episodi\nSoggetto: George Lucas Storia e personaggi\nGenndy Tartakovsky\nPaul Rudish\nSceneggiatura: Genndy Tartakovsky\nPaul Rudish\nHenry Gilroy\n[img][/img]\n\n0=============================0\n\n.: Caratteristiche del DVD 1 :.\n\nNumero episodi: 20 (di 25)\nDurata approssimativa episodi: 5 min circa\n\nCommento audio di Hyperspace\nFeaturette &quot;Connessioni con la Saga: da Clone Wars a Episodio III, la Vendetta dei Sith&quot;\nTrailer del videogioco di Episodio III\nTrailer del videogioco Star Wars Republic Commando\nDemo di Star Wars Republic Commando per XBOX\nFeaturette: Dietro le quinte\nAnteprima di Star Wars Episodio III: la Vendetta dei Sith\nEaster Egg\nDallo Storyboard allo Schermo\nGalleria Fotografica\n\nDurata: 107 minuti circa\nLingue: Italiano, Inglese, Spagnolo 2.0 Surround\nSottotitoli: Italiano, Inglese, Spagnolo\nCompressione: MenÃƒÂ¹, Main Movie e Extras TUTTI al 100%\nProgrammi utilizzati: AnyDvD + DvD Shrink\n\n.: Caratteristiche del DVD 2 :.\n\nNumero episodi: 5 (di 25)\nDurata approssimativa episodi: 5 min circa\n\nContenuti Extra\nLa Connessione\nRevenge of the Brick\nTrailer del videogioco Battlefront 2\nTrailer del videogioco Star Wars Empire at War\nTrailer di Episodio III\nDemo per VBOX di Battlefront 2\nEster Egg\nGalleria Fotografica\n\nDurata: 60 minuti circa\nLingue: Italiano, Inglese, Spagnolo 2.0 Surround\nSottotitoli: Italiano, Inglese, Spagnolo\nCompressione: MenÃƒÂ¹ 60.4% - Main Movie e Extras 100%\nProgrammi utilizzati: AnyDvD + DvD Shrink","torrent":{"xt":"urn:btih:a67cd3c450dacd6042a05ba72130786085a01126","amp;dn":"Star+Wars+Clone+Wars+%282003-2005%29+All+Torrent+%5BDVD5++Eng+Ita+Esp%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a67cd3c450dacd6042a05ba72130786085a01126","infoHashBuffer":{"type":"Buffer","data":[166,124,211,196,80,218,205,96,66,160,91,167,33,48,120,96,133,160,17,38]},"announce":[],"urlList":[]}}