{"title":"performance_flying_paragliding_xc_siv_acro_audio_eng_fre_ger_ita","uid":7844506,"size":736369688,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a6eafdb658cc18c49955280e8b66b1d100b53cb8&amp;dn=performance_flying_paragliding_xc_siv_acro_audio_eng_fre_ger_ita&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"nookix","files":1,"time":1353434385,"description":" When it comes to making paragliding films, Jocky Sanderson doesn't pull any punches. The suave Englishman's slick productions skills were first evidenced in his debut films, Security in Flight and Speed to Fly. Jocky's latest film, produced with Ozone's test team, hones in on the finer piloting skills of flying XC, Acro and SIV.\n\nIndeed Performance Flying is set to redefine what's possible in free flight cinematography. A high speed laboratory camera has been employed to capture the clearest slow motion sequences of paragliding manouvres in existence. On-board and air-to-air POV cameras get you right in close during loops, SATs, Helicopters and all the popular Acro manouvres, plus the SIV essentials like Spin Recovery, symmetric tucks, twists and stalls.\nJocky is one of the world's most celebrated advanced instructors. In Performance Flying's XC section, the FAI Bronze Medallist will help you improve your thermalling, scratching, transitions and use of speed bar and help you understand more about inversions, the second climb, what to do at base, flatland techniques and lots more.\n\nLanguages available: English, French, Italian and German.","torrent":{"xt":"urn:btih:a6eafdb658cc18c49955280e8b66b1d100b53cb8","amp;dn":"performance_flying_paragliding_xc_siv_acro_audio_eng_fre_ger_ita","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6eafdb658cc18c49955280e8b66b1d100b53cb8","infoHashBuffer":{"type":"Buffer","data":[166,234,253,182,88,204,24,196,153,85,40,14,139,102,177,209,0,181,60,184]},"announce":[],"urlList":[]}}