{"title":"George Orwell - 1984    (BBC 1954 - Peter Cushing)","uid":5047177,"size":1466636288,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a76cf7e5721260bfd0ab415d9772bd255ca68f77&amp;dn=George+Orwell+-+1984++++%28BBC+1954+-+Peter+Cushing%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"eddie1969","files":1,"time":1249694773,"description":"I had heard of this programme but never seen it so was very pleased when BBC4 screened it recently. In many ways the play was shockingly 'modern' with its allusions to sex and pornography...even the word 'orgasm' is mentioned which must have caused a few raised eyebrows in English drawing rooms! ('ask your father, dear....') \n\nWhat struck me more though was how BBC drama has changed since this was broadcast in 1954. While the production values are minimal (the sets of Victory Mansions for example look like something out of a primary school play, and the opening 'exterior' shot of the Ministry of Love looks like it was drawn with crayon) the acting is superb and unlike anything you would get on a modern tv drama. \n\nThe sense of claustrophobia is intense and the 'stagey' feel adds to this. Cushing is brilliant as are the majority of the cast. While set in 1984 the atmosphere is clearly that of bombed out, austere post war London - the dinner lady 'Them's stew with salt; them's stew without' has an Edwardian proletarian twang which has now utterly gone from English speech. \n\nMy one dislike was the scene when the 'proles' were reading a pornographic book - this looked like three RADA students pretending to be 'common'. \n\nWilfred Brambell as the old man was suspiciously like 'Steptoe' - did Galton and Simpson get the idea from this, I wonder...! And Orwell's story comes across excellently - the sense of hopelessness in the face of grinding totalitarianism - he would have been proud.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:a76cf7e5721260bfd0ab415d9772bd255ca68f77","amp;dn":"George+Orwell+-+1984++++%28BBC+1954+-+Peter+Cushing%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a76cf7e5721260bfd0ab415d9772bd255ca68f77","infoHashBuffer":{"type":"Buffer","data":[167,108,247,229,114,18,96,191,208,171,65,93,151,114,189,37,92,166,143,119]},"announce":[],"urlList":[]}}