{"title":"Les Negresses Vertes - Mlah TQMP","uid":4549232,"size":356693619,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a787abd2ca4d2ed6d495367ea69a8cf0f2cb07c9&amp;dn=Les+Negresses+Vertes+-+Mlah+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"zootallure","files":19,"time":1228243848,"description":"My upload speed is 50 Kb/s, so patience is required :-)  I will seed it for the time necessary, don't worry!\n\n\nLes Negresses Vertes, formed in 1987, are a French music group who are best described as a fusion of world music and some aspects of alternative rock. Their particular musical influences were Gypsy music, Punk rock, Algerian rai, Mediterranean and South American music and French cafe music.\n\nTheir tracks often feature acoustic guitar and accordion, as well as some tracks containing many other 'traditional' instruments such as piano and brass. Their style is fairly upbeat and energetic on the majority of their tracks, with unusual rhythms, vocals delivered with a generous dose of zeal and vibrant energy, and accompaniment melodies ranging from lilting and distant to eccentric and fast-paced. These two factors give many of their pieces a strong sense of direction.\n\n\nFormed in 1987, Les Negresses Vertes arose from the alternative music scene in Paris. The original line-up included singer Helno (born Noel Rota in Paris, December 25, 1963 - January 22, 1993, also known as Helno Rota de Lourcqua), Jo Roz (also known as l'Ami Ro; real name Joe Ruffier des Aimes) (piano), Stefane Mellino (guitar), Jean-Marie Paulus (bass), Gaby (drums), Matthias Canavese (accordion), Michel Ochowiak (trumpet), Abraham Sirinix (also known as Abraham Braham) (trombone) and Iza Mellino (backing vocals).\n\nThe original members were a group of friends, many of whom had not played their instruments before forming the band. The group's name translates as &quot;green black women&quot;; it arose from abuse hurled at them at one of their first concerts. They were initially signed to the independent Off The Track label, and released the punk protest song &quot;200 Ans D'Hypocrisie&quot; in response to their country's French Revolution bicentennial celebrations.\n\nIn 1989 they released their first album, Mlah, to good reviews in both France and the UK, where the single &quot;Zobi La Mouche&quot; just failed to reach the charts and where they toured and played the WOMAD festival. They also made a controversial tour of Lebanon. Their second album, Famille Nombreuse, in 1991, featured new drummer ZÃƒÆ’Ã‚Â© Verbalito.\n\nHelno was by this time struggling with serious heroin addiction, and Stefane Mellino and Canavese replaced him as the main songwriters. Helno died at his parents' house on January 22, 1993.\n\nSeveral members left the band after Helno's death, but Les Negresses Vertes continued around the nucleus of Mellino, Canavese, Ochowiak and Paulus. In 1995 they released the album Zig-Zague, followed by the live album Green Bus. By 2000's Trabendo, the group's style had shifted to a dub-orientated lounge style.\n\n\n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se  (Simply use the TQMP searchtag :)\n\t\t\nEnjoy!!\n\nP.S Say &quot;thank you&quot; by seeding...just seed :-)","torrent":{"xt":"urn:btih:a787abd2ca4d2ed6d495367ea69a8cf0f2cb07c9","amp;dn":"Les+Negresses+Vertes+-+Mlah+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a787abd2ca4d2ed6d495367ea69a8cf0f2cb07c9","infoHashBuffer":{"type":"Buffer","data":[167,135,171,210,202,77,46,214,212,149,54,126,166,154,140,240,242,203,7,201]},"announce":[],"urlList":[]}}