{"title":"Salt v1.3.0.0","uid":11388481,"size":60978757,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a79d9581692936dc0792f17c8e74ffab56ddcc24&amp;dn=Salt+v1.3.0.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Lamasu","files":-1,"time":1415298274,"description":"&quot;Salt is a game based around exploration and adventure where you sail across a vast ocean exploring different islands. The world of Salt is procedurally generated, providing you with an endless amount of exploration. During your adventure you will meet various challenges and obstacles that you will have to overcome, as well as discovering the real story behind the world of Salt. You will fight pirates, hunt animals for food, defend yourself from enemies at night, sail the ocean waves, craft items from resources you find throughout the world, and discover mysterious places throughout your adventure.&quot;\nMore info at https://saltthegame.com/pages/saltoverview/\n\n- Changelog -\nv1.3.0.0a:\n- Flag items will now save properly in your inventory.\n- Ships no longer build up force while paused with sails raised.\n- Ship helms now pause properly.\n- Large spiders no longer let loose a pirate grunt when they see you.\nv1.3.0.0:\n- Added merchant quests.\n- Added new items.\n- Added a new ship.\n- The game now pauses when you open the escape menu.\n- Updated the icon for the Pardon Pusher.\n- Gold count now saves immediately when purchasing from a merchant. This fixes an exploit where you could purchase items then regain the lost gold.\n- Pop-up text now draws on top of the health and food bars.\nv1.2.9.6b:\n- Fixed an issue that would cause the ocean to look glitchy on some systems.\nv1.2.9.6a:\n- Fixed a bug that caused your boat to sometimes launch into the air when boarding it.\n- Disabled some controller input by default, and added option to re-enable it. This may help with players who experienced problems with character spinning. *Note that controllers are not yet fully supported.\n- Performance improvements.\n- Increased the value of bamboo fishing poles.\n- Adjusted shadow view distances.\n- Added a new fish.\n- Added a new herb.\nv1.2.9.6:\n- Added options for Field of View and Look Sensitivity.\n- Improved performance of AI units. They should now cause less lag in general, especially around large islands.\n- Improved boat pushing mechanic. It now applies force in the direction that you are looking.\n- Repaired pirate ships are now a little more stable in the water.\n- Deer are now less likely to just stand there when they should run (they try harder to find a valid navigation path).\n- Fixed an error that would happen if you saved close to water and reloaded underneath a wave.\n- Repaired boats no longer make floating calculations when you are far away from them, improving performance if you left one behind.\n- Added a note in the help journal about boats being able to be re-summoned.\nv1.2.9.5a:\n- Changed the defaults for th graphics options.\n- Fixed the text going past the end of the book in the initial crafting journal.\n- Added a new fish.\n- Added options to invert mouse Y axis.\n\nIf you like the game, support the developer, buy it! &lt;a href=&quot;\nhttps://saltthegame.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://saltthegame.com&lt;/a&gt;\t &lt;a href=&quot;\nhttp://store.steampowered.com/app/327860/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/327860/&lt;/a&gt;","torrent":{"xt":"urn:btih:a79d9581692936dc0792f17c8e74ffab56ddcc24","amp;dn":"Salt+v1.3.0.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a79d9581692936dc0792f17c8e74ffab56ddcc24","infoHashBuffer":{"type":"Buffer","data":[167,157,149,129,105,41,54,220,7,146,241,124,142,116,255,171,86,221,204,36]},"announce":[],"urlList":[]}}