{"title":"La Commune (Paris, 1871) by Peter Watkins [FR with ENG hardsubs]","uid":7892396,"size":2115238401,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a893c03dfd366f4623482bf213f6657dca6baa82&amp;dn=La+Commune+%28Paris%2C+1871%29+by+Peter+Watkins+%5BFR+with+ENG+hardsubs%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"loninappleton","files":4,"time":1354755016,"description":"\nPeter Watkins' La Commune (Paris, 1871) French dialog with hardsub English translation\n\nLa Commune Part 1\nLA commune Part 2\nand\nThe Universal Clock \n\nIn English with hardsub French translation.\n\nThe torrent is given in compact form for easy download.\n\n\nRecommended viewing:\n\n  The Universal Clock Run time:  1:16\n  La Commune Part 1   Run time:  2:44:22\n  La Commune Part 2   Run time:  3:01:29\n\nThe Universal Clock (notes below) is a documentary about the making of &quot;La Commune&quot; and it's significance.  For this reason it should be viewed first.\n\nIn brief, La Commune is a collective re-enactment of the Paris Commune of 1871.\nOver 200 hundred non and semi professional actors who performed the five hour re-enactment in 13 days.  Many details are given about this extraordinary achievement in The Universal Clock.\n\n&quot;La Commune&quot; is recorded in black and white and features contemporary media in the \nform of 'State' and &quot;Commune TV' broadcasts in which the reporters take on roles in the re-enactmment.\n\nThe significance of &quot;La Commune&quot; is its multi-layered narrative of the historical event and also how the production influenced the actors.  The actors did their own research.  The dialog, aside from historical readings, is improvised.  And the actors tell of how they have learned their own history as a result of the experience.\n\n\nAn important element in Watkins' work is refusal to use familiar television and Hollywood standard devices.  The film is longer by design to allow for various deliberations by the actors as the re-enactment progresses.\n\n\n\nThe Universal Clock (2000)\nby  Geoff Bowie\nNational Film Board of Canada \n\nRuntime: 1:16:27\n\n621mb\n\n\n&quot;The Universal Clock&quot; is a documentary which accompanies the boxed dvd set of \nPeter Watkins' &quot;La Commune (Paris, 1871).&quot;  The author of The Universal Clock (UC)\ntakes us through both the production process of La Commune and the commercial barriers to having WatkinS' re-creation of the Paris Commune shown after it was created.\n\nThe Universal Clock refers to the standardization of video content on the \n47 minute model (with commercial and public service announcements taking up\nthe balance of the time.)  Watkins calls this the 'monoform' and is shown describing his concept.\n\nIn documenting the process of making &quot;La Commune&quot; UC has interviews with members of the cast who were non-professionals participating in this group project.  These Parisians and immigrants talk about how being a part of the performance changed the way they view themselves and the media around them.\n\nMore discussion of &quot;La Commune&quot; can be found here:\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/La_Commune_(Paris,_1871)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/La_Commune_(Paris,_1871)&lt;/a&gt;\n\nand especially in Peter Watkins' notes here:\n &lt;a href=&quot;\nhttp://www.mnsi.net/~pwatkins/commune.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mnsi.net/~pwatkins/commune.htm&lt;/a&gt;\n\nLa Commune itself is available in the torrent community.\n\nOther works available about non-standard theater performance are\n\nMarat/Sade\nSignals Through The Flames.\n\nThese pieces show the relevance of performance experimentation from the past\nand the present.\n\nWatkins has brought a new form of television making into being with &quot;La Commune.&quot;\nBut there is reference to the concept of modern media reporting on historic events\nas far back as the 1940's.  &quot;You Are There&quot; used the technique first on broadcast radio on the CBS network.  The noted filmmaker John Frankenheimer brought &quot;You Are There&quot; to television and it ran for 4 years on the network.  Such directors as Sidney Lumet did episodes of &quot;You Are There&quot; before they began their formal film careers.  &quot;You Are There&quot; is available on dvd media.\n\nAll these works are teaching tools for experimental theater and media production.\n\n\n\nDecember 5th, 2012","torrent":{"xt":"urn:btih:a893c03dfd366f4623482bf213f6657dca6baa82","amp;dn":"La+Commune+%28Paris%2C+1871%29+by+Peter+Watkins+%5BFR+with+ENG+hardsubs%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a893c03dfd366f4623482bf213f6657dca6baa82","infoHashBuffer":{"type":"Buffer","data":[168,147,192,61,253,54,111,70,35,72,43,242,19,246,101,125,202,107,170,130]},"announce":[],"urlList":[]}}