{"title":"Dragon's Lair + Dragon's Lair II + Space Ace [DVD-VIDEO]","uid":4991567,"size":12606541824,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:a897532ab21305b452759c07dfbad013db032311&amp;dn=Dragon%5C%27s+Lair+%2B+Dragon%5C%27s+Lair+II+%2B+Space+Ace+%5BDVD-VIDEO%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"camilaacolide","files":128,"time":1247073242,"description":"Dragon's Lair [DVD-VIDEO]\n\nYou control the actions of Dirk the Daring, a valiant knight on a quest to\nrescue a fair princess from the clutches of an evil dragon. Fight your way\nthrough the castle of the dark wizard who has enchanted it with treacherous\nmonsters and obstacles. Lead on brave adventurer... your quest awaits!\n\n\nDragon's Lair II: Time Warp [DVD-VIDEO]\n\nPrincess Daphne has been spirited away to a wrinkle in time by the\nEvil Wizard Mordroc who plans to force her into marriage.\nOnly you, Dirk the Daring, can save her.\n\nTransported by a bumbling old time machine, you begin the rescue mission.\nBut you must hurry, for once the Casket of Doom has opened, Mordroc will\nplace the Death Ring upon Daphne's finger in marriage and she will be\nlost forever in the Time Warp!\n\n\nSpace Ace [DVD-VIDEO]\n\nThe evil commander Borf has kidnapped Ace's girlfriend, the beautiful\nKimberley, and is plotting to enslave the Earth using his dreaded\n&quot;Infanto Ray&quot;, a weapon that changes everyone it blasts into a\nhelpless baby. Armed with only a laser gun, Ace must find and\ndestroy the Infanto Ray, rescue Kimberley and save the Earth.\nAll in a day's work for a superhero, right?\n\n\n------\nF.A.Q.\n------\n\n\n1. What is this DVD-VIDEO version?\n\nThere are two versions of these games in the market. There is the DVD-ROM\nversion which must be installed and requires Windows 95/98 to run, and there\nis the DVD-VIDEO version which can instantly run in any DVD player, such as\ntraditional HOME players, the XBOX360 and the PLAYSTATION2.\n\nBoth versions are manufactured by Digital Leisure.\nThis version is the DVD-VIDEO version.\n\n\n2. What are the advantages/disadvantages of this DVD-VIDEO version?\n\n- Doesn't require a computer to run, works on most DVD players.\n- Has a WATCH feature that allows you view the entire animation.\n- Includes some EXTRAS with interviews with the creators of the game.\n- With a few DVD players there is a 2-3 second gap between movements.\n- No random game play as the original. You must play sequentially.\n\n\n3. Since this is a DVD-VIDEO, what are the specifications?\n\nFormat: NTSC Color\nLanguage: English (Dolby Digital 2.0)\nAspect Ratio: 4:3 (1.33)\nRegion: All\n\n\n4. I have a BLURAY player.\n\nFor your own sake, DON'T download this version.\nDigital Leisure has released a remastered version of these games in BLURAY,\nwith MUCH sharper and cleaner images, crisp 5.1 sound and widescreen format,\nwithout any of the disadvantages of the old DVD format listed above.\n\nBuy the BLURAY version and support them.\nThe experience is incomparable.\n\n\n5. The download is slow.\n\nMy upload bandwidth is only 32Kb/s, so it might take some time.\nI will keep seeding for as long as it's necessary.\nBut please, help me seed when finished.\n","torrent":{"xt":"urn:btih:a897532ab21305b452759c07dfbad013db032311","amp;dn":"Dragon%5C%27s+Lair+%2B+Dragon%5C%27s+Lair+II+%2B+Space+Ace+%5BDVD-VIDEO%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a897532ab21305b452759c07dfbad013db032311","infoHashBuffer":{"type":"Buffer","data":[168,151,83,42,178,19,5,180,82,117,156,7,223,186,208,19,219,3,35,17]},"announce":[],"urlList":[]}}