{"title":"Little Big Adventure Relentless Twinsen's Adventure GOG","uid":7861589,"size":294823192,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a92efd8bfa4100f666631eed827c67a4e688ab50&amp;dn=Little+Big+Adventure+Relentless+Twinsen%27s+Adventure+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"AN0NYMOUS142857","files":-1,"time":1353945794,"description":"genre: adventure / action / puzzle\ndownload size: 416 MB\nrelease date: October 10, 1994\ncompatible with: Windows XP, Windows Vista, Windows 7 (32 &amp; 64 bit)\nlanguages: Audio and Text: English, German, French Text: Spanish, Italian\ndeveloper / publisher: Adeline Software International / Didier Chanfray SARL\ngame modes: single-player\n\nBonus content included for FREE with the game:\nmanual\nwallpaper\n10 avatars\n26 artworks\n66 cinematic shots\nhigh-res artworks\n31 design sketches\ndev team photo\n\nWhat's cool about it:\n\n    Well-written story, memorable characters, and surreal environment will give you an adventure you will never forget\n    Huge world to explore with many secrets to uncover, places to visit, and mysteries to solve\n    Clever puzzles with multiple solutions: the crazier you think the easier it is to solve them\n\nOverview:\n\nChilling dreams of destruction and doom fill your mind. You feel compelled to warn the world, but in so doing are imprisoned by the tyrannous Dr. Funfrock. Imprisoned because of a dream? You know in your soul that you must escape somehow and discover the meaning behind this mystery.\n\nAs Twinsen, prophet and savior, you embark on a surreal and suspense-filled journey. You cross continents in your quest to save the world and stop your evil nemesis. At any moment, your enemies may overtake you, stopping you in your pursuit of the Legend. Relentless you must be, for only those who remain pure can overcome the peril that awaits.\n\nLittle Big Adventure is a real gem in the genre. There is nothing else like it. The game is filled with surreal action and adventure that will make you laugh many times because you can hardly believe the kind of crazy things they've thought up. So if you are in a mood for a crazy adventure with great story, clever puzzles with more than one solution, and open world then you canï¿½t go wrong with this masterpiece of a game.\n\nAge requirements: ESRB Rating: TEEN with Animated Violence.\n\nMinimum system requirements: Windows XP or Windows Vista, 1.8 GHz Processor, 512MB RAM (1 GB recommended), 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended), 2GB HDD, Mouse, Keyboard.\n\nInstallation\n\n1. Double click the .exe\n2. Click next, accept the EULA, select which path you want the game installed to, ect.\n3. Play\n","torrent":{"xt":"urn:btih:a92efd8bfa4100f666631eed827c67a4e688ab50","amp;dn":"Little+Big+Adventure+Relentless+Twinsen%27s+Adventure+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a92efd8bfa4100f666631eed827c67a4e688ab50","infoHashBuffer":{"type":"Buffer","data":[169,46,253,139,250,65,0,246,102,99,30,237,130,124,103,164,230,136,171,80]},"announce":[],"urlList":[]}}