{"title":"Wuthering Heights - Emily Bronte  (BBC Audio)","uid":5109933,"size":272899581,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a93f110772167a4dcca5fe7e574f19f236cecc25&amp;dn=Wuthering+Heights+-+Emily+Bronte++%28BBC+Audio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"eddie1969","files":-1,"time":1254678214,"description":"Emily Bronte - Wuthering Heights - BBC Radio Full-Cast Drama\n\nA tale of passion and brutality on the Yorkshire moors...\n\nPublished a year before her death at the age of thirty, Emily Bronte's only novel is set in the wild, bleak Yorkshire Moors. Depicting the stormy relationship of Cathy and Heathcliff, Wuthering Heights creates a world of its own, conceived with an instinct for poetry and for the dark depths of human psychology. This full-cast epic features all of the quality and high production values associated with BBC Radio dramatizations.\n\n&quot;The sound effects of this production create a completely absorbing experience. Appropriately haunting pieces of music connect the episodes, and the ensemble cast is perfectly matched to deliver the characters of The Grange and Wuthering Heights.&quot; (Audiofile)\n\nDramatised by Bryony Lavery and produced by Janet Whitaker.\n\nFive episodes of approximately one hour each in high quality MP3.\n\n\n\nEpisode 1:\nMr Lockwood meets the strange haunted household at Wuthering Heights, and learns how Heathcliff arrived there.\n\nEpisode 2:\nHeathcliff is already plotting his revenge on Hindley for his degradation, but it now tears Cathy and him apart.\n\nEpisode 3:\nHeathcliff runs off with Isabella, leaving Cathy seriously ill, after she has confessed she loves Heathcliff and not Edgar.\n\nEpisode 4:\nSixteen years have passed since Cathy's death and her daughter Catherine is now 16. But Heathcliff's revenge is taking effect.\n\nEpisode 5:\nNelly Dean concludes her story to Mr Lockwood.\n\n\n\nWith:\nJohn Duttine and Amanda Root play Heathcliff and Cathy, with Emma Fielding, Sharon Duce, Gary Cady and Paul Rhys. The director was Janet Whitaker. Other members of the cast include: John Turner, Geoffrey Whitehead, Steve Hodson, David Collings, Jonathan Keeble, John Hartley, Becky Hindley, Tessa Worsley, Patience Tomlinson, Jilly Bond, Sheridan Smith , Daniel Evans, James Cohen, Emily Watson, Liam Barr, Kirsty Adams, Felix Bell, Ryan Tebbut, Atase Mora and Naomi Bell.\n\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:a93f110772167a4dcca5fe7e574f19f236cecc25","amp;dn":"Wuthering+Heights+-+Emily+Bronte++%28BBC+Audio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a93f110772167a4dcca5fe7e574f19f236cecc25","infoHashBuffer":{"type":"Buffer","data":[169,63,17,7,114,22,122,77,204,165,254,126,87,79,25,242,54,206,204,37]},"announce":[],"urlList":[]}}