{"title":"A Bend in the River - V.S. Naipaul.epub","uid":8881245,"size":1938847,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a975aac03c0b621afb4ea37b758f53d7c97ea497&amp;dn=A+Bend+in+the+River+-+V.S.+Naipaul.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1378327160,"description":"&quot;I had to be the man who was doing well and more than well, the man whose drab shop concealed some bigger operation that made millions. I had to be the man who had planned it all, who had come to the destroyed town at the bend in the river because he had foreseen the rich future. &quot;\n\n'Salim, the narrator, is a young man from an Indian family of traders long resident on the coast of Centeral Africa. Salim has left the coast to make his way in the interior, there to take on a small trading shop of this and that, sudries, sold to the natives. The place is &quot;a bend in the river&quot;; it is Africa. The time is post-colonial, the time of Independence. The Europeans have withdrawn or been forced to withdraw and the scene is one of chaos, violent change, warring tribes, ignorance, isolation, poverty and a lack of prepartion for the modern world they have entered, or partially assumed as a sort of decoration. It is a story of historical upheaval and social breakdown. Naipaul has fashioned a work of intense imaginative force. It is a haunting creation, rich with incident and human bafflement, played out in an immense detail of landscape rendered with a poignant brilliance.' &quot; Elizabeth Hardwick &quot;\n\n'Always a master of fictional landscape, Naipaul here shows, in his variety of human examples and in his search for underlying social causes, a Tolstoyan spirit' &quot;John Updike &quot;","torrent":{"xt":"urn:btih:a975aac03c0b621afb4ea37b758f53d7c97ea497","amp;dn":"A+Bend+in+the+River+-+V.S.+Naipaul.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a975aac03c0b621afb4ea37b758f53d7c97ea497","infoHashBuffer":{"type":"Buffer","data":[169,117,170,192,60,11,98,26,251,78,163,123,117,143,83,215,201,126,164,151]},"announce":[],"urlList":[]}}