{"title":"Brainwave Tuner (Full Version) v3.9 Final By bobiras2009","uid":7623577,"size":8889297,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:a9a6c4829a552905665b347e8c70ab00561685c9&amp;dn=Brainwave+Tuner+%28Full+Version%29+v3.9+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1347383732,"description":"Follow my uploads here:              &lt;a href=&quot;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/member.php?action=profile&amp;uid=311481&lt;/a&gt;    \n\nYou can make requests here:               &lt;a href=&quot;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/forumdisplay.php?fid=4&lt;/a&gt;\n                 \n\n                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nRequirements: Android 1.5 and up\nOverview: Brainwave Tuner - Just put on the earphones and let Brainwave Tuner turn you on!\nWant to relax? Meditate? Learn faster? Focus attention? Increase your awareness? Try self-hypnosis? Just put on the earphones and let Brainwave Tuner turn you on.\n\nBrainwave Tuner is a brain wave stimulation application that generates tones with binaural beats, which can change your brain frequency towards the desired state, be it relaxation or enhanced attention.\n20 Preset Sound Patterns in 3 categories are included in Brainwave Tuner Full Version!\n\nSleep and Healing\n- Headache Therapy: Helps alleviating headaches with a mixture of steady low theta (5Hz) and mid-alpha (10Hz) waves.\n- Sleep Induction: Gently slows the brain frequency down to 3Hz delta wave, which usually occurs in a deep sleep thus to gradually induce one's sleepiness.\n- Edge of Consciousness: Discover the true meaning of life and consciousness with this track taking you to the very edge of the conscious mind.\n- Earth Peace Night: This is an Earth Meditation track that helps relax and mediate.\n- High Frequencies: Generates very high-frequency sounds which, according to scientific\n- Ocean Waves: This preset demonstrates the most basic noise-modulation effect: ocean waves.\n\nFocus and Learning\n- Attention Increase: Helps focusing by bringing the brain to a high beta frequency. The frequency is lowered briefly once every 15 seconds to keep the brain more receptive.\n- Intelligent Increase: This 10Hz alpha tone helps increase the blood flow in the brain, promote dendrite and synapse growth, increase IQ points and cognitive abilities...\n- Creativity Enhancing: Induces a state of enhanced creativity with three varying theta tones.\n- The Awakened Mind: Attempts to induce a brain state that is often described as beyond normal meditates states, being characteristic to advanced mediators who want to attain higher levels of enlightenment.\n- Schumann Mix: Helps meditating with a mixture of various frequencies including Schumann Resonance, about to enhance the latter's effect.\n- Quick Mental Refresher: A quick way to refresh yourself mentally. It brings the brain frequency down to a 10Hz alpha wave while brings it back up to a 15Hz beta wave at the end.\n- Learning Aid I (for subliminal): Helps to learn and memorize new materials when listened to for learning something.\n- Learning Aid II (for studying): Helps to learn and memorize new materials when listened to for learning something.\n\nWhat's in this version:\n- 6 new items added to the Full Version;\n- Supports Japanese Language\n\n                                By bobiras2009\t\t","torrent":{"xt":"urn:btih:a9a6c4829a552905665b347e8c70ab00561685c9","amp;dn":"Brainwave+Tuner+%28Full+Version%29+v3.9+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9a6c4829a552905665b347e8c70ab00561685c9","infoHashBuffer":{"type":"Buffer","data":[169,166,196,130,154,85,41,5,102,91,52,126,140,112,171,0,86,22,133,201]},"announce":[],"urlList":[]}}