{"title":"Family Guy (Season 1- 8)","uid":7390593,"size":25218224058,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:aa53e9cedf2ea9bbfadcd595a400a595d010239c&amp;dn=Family+Guy+%28Season+1-+8%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"n17n3uq","files":144,"time":1340760398,"description":"Family Guy is an American animated sitcom created by Seth MacFarlane for the Fox Broadcasting Company. The series centers on the Griffins, a dysfunctional family consisting of parents Peter and Lois; their children Meg, Chris, and Stewie; and their anthropomorphic pet dog Brian. The show is set in the fictional city of Quahog, Rhode Island, and exhibits much of its humor in the form of cutaway gags that often lampoon American culture.\n\nThe family was conceived by MacFarlane after developing two animated films, The Life of Larry and Larry &amp; Steve. MacFarlane redesigned the films' protagonist, Larry, and his dog, Steve, and renamed them Peter and Brian, respectively. MacFarlane pitched a seven-minute pilot to Fox on May 15, 1998. The show was given the green light and started production. Shortly after the third season of Family Guy aired in 2001, Fox canceled the series. However, favorable DVD sales and high ratings for syndicated reruns on Adult Swim convinced the network to renew the show in 2004.\n\nFamily Guy has been nominated for 12 Primetime Emmy Awards and 11 Annie Awards, and has won three of each. In 2009, it was nominated for an Emmy for Outstanding Comedy Series, the first time an animated series was nominated for the award since The Flintstones in 1961. Family Guy has also received criticism, including unfavorable comparisons for its similarities to The Simpsons.\n\nMany tie-in media have been released, including Stewie Griffin: The Untold Story, a straight-to-DVD special released in 2005; Family Guy: Live in Vegas, a soundtrack-DVD combo released in 2005, featuring music from the show as well as original music created by MacFarlane and Walter Murphy; a video game and pinball machine, released in 2006 and 2007, respectively; since 2005, six books published by Harper Adult based on the Family Guy universe; and Laugh It Up, Fuzzball: The Family Guy Trilogy (2010), a series of parodies of the original Star Wars trilogy. In 2008, MacFarlane confirmed that the cast was interested in producing a feature film and that he was working on a story for a film adaptation. A spin-off series, The Cleveland Show, premiered on September 27, 2009, as a part of the &quot;Animation Domination&quot; lineup on Fox. The eighth season of Family Guy premiered the same night. Family Guy holds a TV-PG and TV-14 rating, with the latter being used more often.","torrent":{"xt":"urn:btih:aa53e9cedf2ea9bbfadcd595a400a595d010239c","amp;dn":"Family+Guy+%28Season+1-+8%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa53e9cedf2ea9bbfadcd595a400a595d010239c","infoHashBuffer":{"type":"Buffer","data":[170,83,233,206,223,46,169,187,250,220,213,149,164,0,165,149,208,16,35,156]},"announce":[],"urlList":[]}}