{"title":"LAUREL AND HARDY COLLECTION BOXSET VOLUME 1 IN XVID BY WINKER@KI","uid":5647256,"size":2529509009,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aaa2cb0d136411b544171b8375d3c5340a811e15&amp;dn=LAUREL+AND+HARDY+COLLECTION+BOXSET+VOLUME+1+IN+XVID+BY+WINKER%40KI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"alanwatson","files":-1,"time":1277329790,"description":"Great Guns (Dir. Monty Banks, 1941): Stan Laurel and Oliver Hardy join the army to protect their country...but who will protect the army from them?\n\nIn Great Guns, the comic team play a chauffeur and a gardener whose hypochondriac employer (Dick Nelson), a wealthy young man with little experience, is drafted. Convinced that he needs them in order to survive in the service, they join up as well. Of course, the Texas cavalry post to which they're all assigned is made far worse for the wear by the presence of these well-meaning troublemakers, and there is never a dull moment in this classic featuring two of the cinema's most revered comic actors!\n\nJitterbugs (Dir. Malcolm St. Clair, 1943): Considered the best of the Laurel and Hardy projects filmed at Twentieth Century Fox, this energetic musical comedy also introduces singer Vivian Blaine.\n\nStan and Oliver star as a traveling two-man jitterbug band, who operate out of a dilapidated jalopy and form an unlikely partnership with a likable con man (Bob Bailey). When the trio joins a carnival, they meet Susan, a naive young singer (Vivian Blaine), whose mother has been swindled by grifters. Suddenly chivalrous, the three orchestrate a sting operation using disguises - with Laurel dressed as Susan's disheveled aunt and Hardy as a rich Texan - to get the woman's money back. Although things don't go as planned, the inimitable comedy duo provide nonstop laughs from start to finish in this delightful caper.\n\nThe Big Noise (Dir. Malcolm St. Clair, 1944): The zany antics of legendary comedians Stan Laurel and Oliver Hardy come to life in this romp about two phony private detectives.\n\nThe duo play janitors accidentally hired as sleuths to protect a new super-bomb destined for the War Department in Washington, D.C. However, the bomb's inventor has loaded his house with crazy contraptions that entrap and confuse the protectors. Meanwhile, next door is the biggest threat of all - a gang of crooks determined to get their hands on the inventor's deadly creation. Through a series of crazy misadventures, our heroes end up in a remote-controlled airplane, along with the bomb, and head straight for trouble.","torrent":{"xt":"urn:btih:aaa2cb0d136411b544171b8375d3c5340a811e15","amp;dn":"LAUREL+AND+HARDY+COLLECTION+BOXSET+VOLUME+1+IN+XVID+BY+WINKER%40KI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaa2cb0d136411b544171b8375d3c5340a811e15","infoHashBuffer":{"type":"Buffer","data":[170,162,203,13,19,100,17,181,68,23,27,131,117,211,197,52,10,129,30,21]},"announce":[],"urlList":[]}}