{"title":"The Courier by Andrew Britton (ePub Retail)","uid":9418868,"size":924467,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aabd38d724231fdfbbc3ea2813ada9a8f32745ea&amp;dn=The+Courier+by+Andrew+Britton+%28ePub+Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TxJag","files":3,"time":1388515436,"description":"Ryan Kealey now knows he'll never really put the game behind him. He's seen too much, and the instinct is too deeply hardwired. But the game itself has changed. Between tense interagency &quot;cooperation&quot; that gums the works, and an overreliance on data-crunching and wiz-kid tech, today's US intelligence service has lost a step to its ever-bolder, viciously adaptable global enemies. And thanks to an incredible discovery in the Arctic, those enemies now have a nuke - capable of unleashing unthinkable terror. To hunt down the devastating package before it can be used, Kealey forms an unlikely partnership with the young Farsi-speaking nuclear physicist Rayhan Jafari. But once on the ground, with technology and their by-the-numbers command failing them, they're on their own - trusting only their guts and each other - to conduct the dirty business of combating horrific destruction.\n\nFull Retail. ePub and Calibre reader ready. Metadata is complete and up to date.","torrent":{"xt":"urn:btih:aabd38d724231fdfbbc3ea2813ada9a8f32745ea","amp;dn":"The+Courier+by+Andrew+Britton+%28ePub+Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aabd38d724231fdfbbc3ea2813ada9a8f32745ea","infoHashBuffer":{"type":"Buffer","data":[170,189,56,215,36,35,31,223,187,195,234,40,19,173,169,168,243,39,69,234]},"announce":[],"urlList":[]}}