{"title":"Terra Nova: Strike Force Centauri 2.0.0.1 (GOG)","uid":15807134,"size":695340056,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:aac6b3f9ac0c7ffa9ee1c80a65469c770f86ca42&amp;dn=Terra+Nova%3A+Strike+Force+Centauri+2.0.0.1+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"tsdckrd","files":1,"time":1473565686,"description":"How did the world get so ugly so fast? We were almost there, and then Gomez got scragged by a heavy turret and Slugger learned the difference between horseshoes and hand grenades. That left Rossi and me.\r\n&quot;There's the dropship!&quot; Rossi screams. &quot;We're outta here, Nik!&quot;\r\n&quot;Rossi wait!&quot; But it's too late. A particle beam turns Rossi into a smear on the landscape. The pirate sniper makes a quick sprint for cover... not quick enough.\r\n&quot;Get aboard, Nikola!&quot; your radio squawks. Suddenly, a hulking tank crests the hill launching a deadly hail of missiles at your position.\r\nThe radio crackles: &quot;Nikola? Nikola, are you there? Come in Squad Leader...&quot;\r\n\r\nIn Terra Nova: Strike Force Centauri you lead an elite fighting team battling for freedom from the sinister forces of the Earth Hegemony. Engage in combat on the bloody battlefields of four unique worlds. Encased in your Power Battle Armour you are an unstoppable fighting force. Which is just as well, for as your colony prospers a new breed of pirate has emerged. More organised and armed with powerful weapons, these new pirates have prompted the Centauri government to establish an elite fighting force, the Strike Force Centauri.\r\nLead your team against the new threat to Centauri peace and discover the dark secret behind the pirates' growing military might...\r\n\r\n-Battle to save your colony in over 30 missions, including recon, search and rescue, night raids, and full scale battles.\r\n-Create your own missions with the Random Scenario Generator.\r\n-Suit up in Scout, Standard or Heavy Hi-Tech Powered Battle Armor depending upon your mission","torrent":{"xt":"urn:btih:aac6b3f9ac0c7ffa9ee1c80a65469c770f86ca42","amp;dn":"Terra+Nova%3A+Strike+Force+Centauri+2.0.0.1+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aac6b3f9ac0c7ffa9ee1c80a65469c770f86ca42","infoHashBuffer":{"type":"Buffer","data":[170,198,179,249,172,12,127,250,158,225,200,10,101,70,156,119,15,134,202,66]},"announce":[],"urlList":[]}}