{"title":"Charles Lloyd - Soundtrack 1968 / 2013","uid":9826678,"size":96307048,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ac1cd4dc24010f8065033b321d5479900393791d&amp;dn=Charles+Lloyd+-+Soundtrack+1968+%2F+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Drebben","files":6,"time":1395790178,"description":"\nCharles Lloyd\n\nSoundtrack\n\n1968\n\n\nCD / 2013 / Remastered / 320Kbps\n\n\nTracklist:\n1. Sombrero Sam\n2. Voice in the Night \n3. Pre-Dawn\n4. Forest Flower '69\n\n\nRecorded on November 15, 1968 at the Town Hall, NYC\n\n\nPersonnel:\nCharles Lloyd - tenor saxophone, flute\nKeith Jarrett - piano\nRon McClure - bass\nJack DeJohnette - drums\n\n\nSoundtrack is a live album by jazz saxophonist Charles Lloyd recorded at The Town Hall in 1968 by the Charles Lloyd Quartet featuring Keith Jarrett, Ron McClure, and Jack DeJohnette.\n\nThe gig, which is presented here as Soundtrack, stomps with all the fury of a live gospel choir trying to claim Saturday night for God instead of the other guy. McClure's particular strength is in his hard-driving blues style that adds a deep groove to any time signature or dynamic. And, judging by how deep Lloyd, Jarrett, and DeJohnette took their playbook, he was just what the doctor ordered. \n\nThe band is in a heavy Latin mood, where the blues, samba, bossa, hard bop, modal, and even soul are drenched in the blues. With only four tunes presented, the Charles Lloyd Quartet, while a tad more dissonant than it had been in 1966 and 1967, swings much harder, rougher, and get-to-the-groove quicker than any band Lloyd had previously led. Most notable here are &quot;Sombrero Sam&quot; for its eerie yet funky flute solo (Hubert Laws stole more from this solo than he did from his flute teachers) and the revisited &quot;Forest Flower,&quot; now entitled &quot;Forest Flower '69.&quot; On the latter, the lovely swinging progressive jazz of the former is replaced with a poignant, torchy, bullish blues groove provided by Jarrett and DeJohnette, who trade time signatures all over the place as Lloyd tries to shove the mode along through no less than five key changes looking for the &quot;right&quot; harmony (they're all right).\n \nThis band would split soon after, when Jarrett left to play with Miles Davis, but if this was a live swansong, they couldn't have picked a better gig to issue.\n\n\n\nStraight, no chaser.\n:)\n \n","torrent":{"xt":"urn:btih:ac1cd4dc24010f8065033b321d5479900393791d","amp;dn":"Charles+Lloyd+-+Soundtrack+1968+%2F+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac1cd4dc24010f8065033b321d5479900393791d","infoHashBuffer":{"type":"Buffer","data":[172,28,212,220,36,1,15,128,101,3,59,50,29,84,121,144,3,147,121,29]},"announce":[],"urlList":[]}}