{"title":"Our Divided Political Heart - E. J. Dionne - Audiobook MP3","uid":10326954,"size":320094759,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ac5212c09064638a5b74616ffd750a8ea7f50494&amp;dn=Our+Divided+Political+Heart+-+E.+J.+Dionne+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1402367878,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Smart AudioBook Player or Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nOur Divided Political Heart: The Battle for the American Idea in an Age of Discontent\n\nWritten by: E. J. Dionne\nNarrated by: Michael Kramer\nLength: 11 hrs and 4 mins\nFormat: Unabridged\nRelease Date:06-25-12\nProgram Type: Audiobook\n\nOur Divided Political Heart will be the must-listen book of the 2012 election campaign. Offering an incisive analysis of how hyper-individualism is poisoning the nation's political atmosphere, E. J. Dionne Jr. argues that Americans can't agree on who we are because we can't agree on who we've been, or what it is, philosophically and spiritually, that makes us Americans.\n\nDionne takes on the Tea Party's distortions of American history and shows that the true American tradition points not to radical individualism, but to a balance between our love of individualism and our devotion to community.\n\nDionne offers both a fascinating tour of American history - from the Founding Fathers to Clay and Lincoln and on to the Populists, the Progressives, and the New Dealers - and also an analysis of our current politics that shatters conventional wisdom. The true American idea, far from endorsing government inaction or indifference, has always viewed the federal government as an active and constructive partner with the rest of society in promoting prosperity, opportunity, and American greatness.\n\nThe ability of the American system to self-correct is its greatest asset, and Dionne challenges progressives to embrace the American story. Our fractious but productive past offers us the resources both to rediscover the idea of progress and to put an end to our fears of decline. Our Divided Political Heart will be required listening for all who seek a path out of our current impasse. ","torrent":{"xt":"urn:btih:ac5212c09064638a5b74616ffd750a8ea7f50494","amp;dn":"Our+Divided+Political+Heart+-+E.+J.+Dionne+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac5212c09064638a5b74616ffd750a8ea7f50494","infoHashBuffer":{"type":"Buffer","data":[172,82,18,192,144,100,99,138,91,116,97,111,253,117,10,142,167,245,4,148]},"announce":[],"urlList":[]}}