{"title":"Active Boot Disk Suite 7.5.3.0","uid":9153877,"size":193896248,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ac7fa7fd6e588a218f9f6cd157d41566ff07e208&amp;dn=Active+Boot+Disk+Suite+7.5.3.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"nikita200","files":-1,"time":1383697637,"description":"Active@ Boot Disk contains a collection of powerful utilities to perform data recovery, data imaging, secure data erasure and a number of other tasks all from a bootable CD/DVD or USB flash media. The self-contained boot environment by-passes the operating system allowing you to boot previously unbootable PCs. &quot; Finally, we come to a boot disc that offers useful tools, is easy to use, and can be created from virtually any XP or Vista computer. &quot; Active@ Boot Disk is a complete and functioning computer operating system on CD/DVD/USB disk. You simply insert a boot disk into your computer, and reboot.\n\nWhile a live CD does not modify the operating system already installed on a computer's hard drive, it includes many tools to boot up a computer and fix most startup, PC configuration, and system management problems. Active@ Boot Disk is based on lightweight Windows 7, SP1 (WinPE 3.1) operating system environment. It contains disk image, data recovery, password resetting, data erasure, network access tools and system utilities. Active@ Boot Disk is a custom configured system. Necessary drivers and scripts can be installed. One may add an alternate language keyboard layout.\n\nFeatures:\t\n- Ability to start non-bootable PC for full access to it\n- Boot Disk media may be removed from the system after successfully booting the system \n- Start from a CD, DVD or USB flash drive (appropriate BIOS settings required)\n- Multi-boot or dual-boot functionality (DOS + Windows) \n- Anti-virus setup guide\n- Boot Disk has a user friendly interface\n- Boot Disk allows specifying boot settings\n- &quot;Allows addition of drivers, scripts and other user files&quot;\n- Recovery utilities recover deleted files, or recover data from deleted/damaged partitions\n- Ability to backup and restore data (Disk Image) \n- Creating, deleting and formatting partitions on hard disk drives, as well as most USB media\n- Recover deleted partitions by using either automated partition or via low-level HEX editor software\n- Utility for resetting your Windows user passwords including Administrator account\n- Supports: FAT12, FAT16, FAT32, NTFS, NTFS5, NTFS+EFS; advanced search of deleted files; all types of Flash Memory Cards; compressed, encrypted and fragmented files on NTFS, IDE / ATA / SCSI drives\n- DoD-compliant disk erasing &amp; wiping of free space on PC disks\n- Securely erase data\n- Hard Disk Drive temperature and S.M.A.R.T attributes monitoring utility\n- Terminal client, Web browser, Telnet &amp; FTP Clients, and other connectivity tools\n- Paint, Notepad, WordPad Calculator, Task Manager, Registry Editor, HEX editor and other PC tools\n- Disk Defragmenter provides high speed file optimizing to improve read/write operations from a hard disk\n- Network access via TCP/IP, network configurator\n- Ability to load additional drivers on-the-fly\n- Data CD/DVD burning capable\n- A File Manager (Xplorer) allows you to browse directories, search, copy and move files and folders\n\nThe latest software versions:\n Latest Active@ Disk Image 5.5.2\n Latest Active@ KillDisk 7.5.0\n Latest Active@ File Recovery 11.0.5\n Latest Active@ Partition Recovery 9.0.4\n Latest Active@ Data Burner 4.0.5\n Latest Active@ Partition Recovery 2.6.5\n Latest Active@ Disk Editor 3.0.9\n\nHomepage: boot-disk.com","torrent":{"xt":"urn:btih:ac7fa7fd6e588a218f9f6cd157d41566ff07e208","amp;dn":"Active+Boot+Disk+Suite+7.5.3.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac7fa7fd6e588a218f9f6cd157d41566ff07e208","infoHashBuffer":{"type":"Buffer","data":[172,127,167,253,110,88,138,33,143,159,108,209,87,212,21,102,255,7,226,8]},"announce":[],"urlList":[]}}