{"title":"Two_Fingers-Two_Fingers-(Advance)-2009-RAGEMP3","uid":4720451,"size":58451331,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ac81deb6caef0808514a436743cfceda4ddf9564&amp;dn=Two_Fingers-Two_Fingers-%28Advance%29-2009-RAGEMP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"cyclo666","files":15,"time":1234488691,"description":"Imagine if Timbaland were kidnapped and held hostage in a\ncouncil flat in Tottenham. Imagine then, that elite robot\nagents aligned to the New World Order were sent into rescue\nhim with laser cannons little knowing that the kidnappers were\nin fact an underground cell of benefit-cheat Jedi. Imagine hip\nhop recapturing the sheer brutality of classic-era Public\nEnemy without it becoming a retread. Imagine if &quot;urban&quot; music\nwas made not for the charts but the heart. Imagine &quot;Two\nFingers&quot;.\n\nTwo Fingers are Brazilian beat-adventurer Amon Tobin and Joe\n&quot;Doubleclick&quot; Chapman. The pair met when Tobin lived in\nBrighton and bonded over an interest in music that ran way\nbeyond the boundaries of &quot;electronica&quot;. In Montreal they\napplied production techniques associated with UK styles like\ndrum &amp; bass to the template of hip hop. It was an experiment\nwith explosive results. MOBO-winner Sway (now signed to Akon's\nKonvict label in the US) heard what was brewing he was so\ntaken with it, he flew straight out to Montreal and recorded\nseven tracks with them, showing a harsher, more serious side\nto his personality whilst offering wry social commentary on\neverything from the way young Black men are treated (&quot;What You\nKnow&quot;) to crazy girls who do too many pills (&quot;That Girl&quot;). The\nremaining rhythms were voiced by sometime Missy protÃƒÅ¡gÃƒÅ¡ Ms\nJade and dancehall legend Ce'Cile. A couple of instrumental\nrhythms were added and this, first stage of a continuing\nproject, was complete.\n\n&quot;Two Fingers&quot; is a project unlike anything that any of the\nthree main players has ever made before, a unique, utterly\nuncompromising, brutal and beautiful record that could only\nhave grown out of the UK and the internationalism of those\ninvolved. If it's not hip hop as we know it, then nor is it\ndrum &amp; bass or grime. Like all the best music it transcends\ngenre to stand on its own ÃƒÂ» icy, transcendent, brilliant.","torrent":{"xt":"urn:btih:ac81deb6caef0808514a436743cfceda4ddf9564","amp;dn":"Two_Fingers-Two_Fingers-%28Advance%29-2009-RAGEMP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac81deb6caef0808514a436743cfceda4ddf9564","infoHashBuffer":{"type":"Buffer","data":[172,129,222,182,202,239,8,8,81,74,67,103,67,207,206,218,77,223,149,100]},"announce":[],"urlList":[]}}