{"title":"Ramit Sethi - Brain Trust Interviews Ryan Holiday","uid":13837980,"size":3506086689,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:acb5d019f23727ed92b76b17a6251f4a55fe154e&amp;dn=Ramit+Sethi+-+Brain+Trust+Interviews+Ryan+Holiday&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"acer47x","files":8,"time":1457781418,"description":"MP4 (1280 x 720 @ 23.976 fps) + MP3 (192 Kbps) + PDF (Transcript) | Duration: 1 hr &amp; 12 mins\r\n\r\nHi, I'm Ramit Sethi, New York Times bestselling author and founder of I Will Teach You To Be Rich. I'd like to show you how you can connect with top performers, deconstruct their success secrets, and build an amazing career for yourself. That's why I invited Ryan Holiday, an author, marketing strategist, and marketing Director at American Apparel to share his juiciest insights and strategies. \r\n\r\nHe dropped out of college at 19 to work with Robert Greene (&quot;48 Laws of Power&quot;). He'd already worked with Tucker Max. And just two years later, Ryan became the Director of Marketing at American Apparel and created the infamous American Apparel ads featuring Sasha Grey.\r\n\r\nRyan wasn't born wealthy. He didn't go to the country's best college. His parents had no special connections. If you dig in, you'll find out that Ryan isn't just a marketing guy, he's a deep thinker who reads over 100 books a year.\r\n\r\nIn this Ramit's BrainTrust interview, Ryan divulges the systems and principles you can use to overcome barriers, position yourself for incredible success, escape a boring career, dominate your industry, and make yourself smarter. \r\n\r\nYou'll discover:\r\n\r\n&gt;How to deal with negative feedback - without being paralyzed\r\n&gt;The right way to connect with famous people and industry experts - and reap massive rewards down the road (there's NO instant way, just 1 way that actually works)\r\n&gt;How to deal with parents and other family members when they don't support your decisions\r\n&gt;How to add value and forge relationships so people pitch you on jobs\r\n&gt;A counter intuitive take on safety and risk-taking that's key to Ryan's success at a young age\r\n&gt;What you can do to make sure you don't get stuck in your job - especially if you're just starting out\r\n&gt;And much more","torrent":{"xt":"urn:btih:acb5d019f23727ed92b76b17a6251f4a55fe154e","amp;dn":"Ramit+Sethi+-+Brain+Trust+Interviews+Ryan+Holiday","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acb5d019f23727ed92b76b17a6251f4a55fe154e","infoHashBuffer":{"type":"Buffer","data":[172,181,208,25,242,55,39,237,146,183,107,23,166,37,31,74,85,254,21,78]},"announce":[],"urlList":[]}}