{"title":"Ride the High Country 1962 BrRip Mp4 Lee1001","uid":9829236,"size":702952201,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ae17191930ace984d9730b4a748f333a1a2257d4&amp;dn=Ride+the+High+Country+1962+BrRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"xultfoad","files":1,"time":1395815087,"description":"Ride the High Country 1962 BrRip Mp4 Lee1001 (released in the UK as Guns in the Afternoon) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0056412/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0056412/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Ride_the_High_Country&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Ride_the_High_Country&lt;/a&gt;\nTwo ageing gunslingers cross swords over a cache of gold. Western in the classic style starring Joel McCrea and Randolph Scott, and directed by Sam Peckinpah.\n\nThe first classic of Sam Peckinpah's explosive career, Ride The High Country stars genre veteran Randolph Scott as a former lawman-turned-carnival sharpshooter who plans to steal the gold when he signs up with his one-time colleague Joel McCrea (his finest performance this side of Sullivan's Travels) to transport bullion from a remote mining camp to a small-town bank.\n\nThe film that brought together future Peckinpah favourites such as Warren Oates, RG Armstrong, LQ Jones, John Chandler and DP Lucien Ballard, 'Bloody Sam' built his reputation on High Country, arguably the last of the great old school Westerns. Fortunately for film fans the world over, Peckinpah had more to offer than old-fashioned stories addressing previously explored issues. Seven years later he would make The Wild Bunch. And after that, the Western would never be the same again.\n\nHad Peckinpah not made The Wild Bunch and Pat Garrett &amp; Billy The Kid, Ride The High Country would be sufficient for him to sit at the top table alongside the genre's other great filmmakers.\n\nPeckinpah's superb second film, a nostalgic lament for the West in its declining years, with a couple of great set pieces (the bizarre wedding in the mining camp, the final shootout among the chickens). Affectionately funny as Scott and McCrea, once more hired and temporarily in harness, creak rheumatically while climbing off their horses, turn aside from the trail to bathe aching feet, and sport long woolly combinations for bed. But also achieving an almost biblical grandeur as the two oldtime lawmen, fallen upon hard times and suddenly realising that the world has left them behind, contrive not to fall from grace and self-respect when a tempting gold shipment comes between them. Truly magnificent camerawork from Lucien Ballard. \n\nA much-loved revisionist Western, director Peckinpah's second feature film proved to be a bittersweet swan song for the Old West and a classy farewell to the screen for actors Scott and McCrea. \nA superior Western featuring two of that genre's greats, Joel McCrea and Randolph Scott, who were both in their 60s at the time...\n\nVIDEO\nSize.... 670mb\nDuration.... 01:33:48\nCodec.... h264\nFrame Width..... 720\nFrame Height.... 304\nData Rate.... 911kbps\nFrame Rate.... 23 F/S\nAUDIO\nBit Rate.... 82kbps\n1 Channel mono\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:ae17191930ace984d9730b4a748f333a1a2257d4","amp;dn":"Ride+the+High+Country+1962+BrRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae17191930ace984d9730b4a748f333a1a2257d4","infoHashBuffer":{"type":"Buffer","data":[174,23,25,25,48,172,233,132,217,115,11,74,116,143,51,58,26,34,87,212]},"announce":[],"urlList":[]}}