{"title":"Fantastic Four 01-50 + Ann 01-03 (1961-1966, Dgtl, TLK-E)","uid":9504659,"size":1380932647,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ae65429026f6743e386f0bc328b217dde790747f&amp;dn=Fantastic+Four+01-50+%2B+Ann+01-03+%281961-1966%2C+Dgtl%2C+TLK-E%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1390293769,"description":"Stan Lee and Jack Kirby's tremendously creative partnership was best represented by their creation and initial run on the Fantastic Four. These four individuals were a decidedly new brand of hero, a true band of family and friends that were irrevocably altered by the fates (and of course, the ever-useful &quot;cosmic rays&quot; of science!). These first 50 issues and 3 annuals, presented in new digital rips, embody the best of the writing and art of the 1960's. Some of the classic stories contained in this torrent are: the team-up with Daredevil, &quot;...And A Blind Man Shall Lead Them&quot;; the introduction of the Inhumans; classic clashes with Doctor Doom among others and last but certainly not least, the famed &quot;Galactus Trilogy&quot; which closes out this collection - giving us Uatu the Watcher, the Silver Surfer and the unquenchable Galactus, Devourer of Worlds. The 3 annuals also have some amazing stories, such as one of the best battles with Doom and the wedding of Sue and Reed that degenerates into an all-out brawl with nearly every major superhero in Marvel's stable present and participating. Massive thanks to TLK-Empire for these pristine copies - PLEASE seed this one, as assembling this collection was a major pain due to the lapsed seeding of hitlists and the slow downloads of filelockers. I really hope you enjoy these, and Excelsior true believer! :-) ","torrent":{"xt":"urn:btih:ae65429026f6743e386f0bc328b217dde790747f","amp;dn":"Fantastic+Four+01-50+%2B+Ann+01-03+%281961-1966%2C+Dgtl%2C+TLK-E%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae65429026f6743e386f0bc328b217dde790747f","infoHashBuffer":{"type":"Buffer","data":[174,101,66,144,38,246,116,62,56,111,11,195,40,178,23,221,231,144,116,127]},"announce":[],"urlList":[]}}