{"title":"Plutocrats by Chrystia Freeland (ePUB/Mobi) [Req]","uid":7775605,"size":1456630,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af1527b218e59c076a36474a4df3b6e8c17dd05a&amp;dn=Plutocrats+by+Chrystia+Freeland+%28ePUB%2FMobi%29+%5BReq%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"azizex666","files":-1,"time":1351645259,"description":"Plutocrats - The Rise of the New Global Super Rich and the Fall of Everyone Else\n \nIn the last few decades what it means to be rich has changed dramatically. Forget the 1%; it's the wealthiest .01% who are fast outpacing the rest of us. Today's colossal fortunes are amassed by the diligent toiling of smart, perceptive businessmen who see themselves as deserving victors in a cutthroat international competition.\n \nCracking open this tight-knit world is Chrystia Freeland, an acclaimed business journalist. At ease in Davos or Dubai, Freeland has reported on the lives and minds of these new super-elites for nearly a decade. Grounding her interviews in the economics and history of modern capitalism, she provides examples of the new wealth and its consequences. She showcases the $3 million birthday party of a New York financier months before the financial meltdown; details the closed-door 2005 SEC meeting where the US government allowed investment banks to write their own regulatory laws; and tells how the Bank of Canada's Mark Carney became a key figure in the central battle between the plutocracy and the rest of us.\n \nBrightly written and powerfully researched, Freeland's Plutocrats will be a lightning rod event in the midst of the US election season.\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n                All my Ebook uploads are separated by Genre Tags \n\n \n            **Support Your Favorite Authors By Buying Their Books**\n\n\n                Check out all my Magazine and ebook uploads here.\n\n                    &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;\t","torrent":{"xt":"urn:btih:af1527b218e59c076a36474a4df3b6e8c17dd05a","amp;dn":"Plutocrats+by+Chrystia+Freeland+%28ePUB%2FMobi%29+%5BReq%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af1527b218e59c076a36474a4df3b6e8c17dd05a","infoHashBuffer":{"type":"Buffer","data":[175,21,39,178,24,229,156,7,106,54,71,74,77,243,182,232,193,125,208,90]},"announce":[],"urlList":[]}}