{"title":"Environmental Applications of Nanomaterials","uid":15390118,"size":7629070,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af4485811dc65a02888ed7f489f9f114b94acee7&amp;dn=Environmental+Applications+of+Nanomaterials&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1469325940,"description":"Environmental Applications of Nanomaterials - Synthesis, Sorbents and Sensors - Glen E. Fryxell, Guozhong Cao (ICP, 2007).pdf\r\n\r\nThis volume is concerned with functional nanomaterials: materials containing specific, predictable nanostructure whose chemical composition or interfacial structure enable them to perform a specific job — destroy, sequester or detect some material that constitutes an environmental threat. Nanomaterials have a number of features that make them ideally suited for this job: high surface area, high reactivity, easy dispersability, and rapid diffusion. The purpose of this book is to showcase how these features can be tailored to address some of the environmental remediation and sensing/detection problems faced today. The leading researchers contributing to this volume paint a picture of diverse synthetic strategies, structures, materials and methods. The book is organized into sections on nanoparticle-based remediation strategies, nanostructured inorganic materials (such as layered materials like the apatites), nanostructured organic/inorganic hybrid materials, and the use of nanomaterials to enhance the performance of sensors. The chemistries captured by the contributors form a rich and colorful tapestry","torrent":{"xt":"urn:btih:af4485811dc65a02888ed7f489f9f114b94acee7","amp;dn":"Environmental+Applications+of+Nanomaterials","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af4485811dc65a02888ed7f489f9f114b94acee7","infoHashBuffer":{"type":"Buffer","data":[175,68,133,129,29,198,90,2,136,142,215,244,137,249,241,20,185,74,206,231]},"announce":[],"urlList":[]}}