{"title":"Sinister (2012)","uid":8277066,"size":890630108,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:af59b96a82336b9a32a92ceb270b806f7d2527cb&amp;dn=Sinister+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"AMTorrent","files":-1,"time":1363739640,"description":"Sinister\n2012\nMP4\n110 Minutes\n720p\n\n\n\n           Ten years ago, true crime writer Ellison Oswald made his reputation with a best-Â­selling account of a notorious murder. Now, desperate to replicate the critical and financial success of his first book, he moves his loyal wife, over-anxious son and artistic daughter into a home where a suburban family was brutally executed and a child disappeared, hoping to find inspiration in the crime scene. Instead he discovers a mysterious box containing Super 8 footage of the murders-plus several more equally gruesome homicides. As he watches the carnage unfold on film, Ellison realizes he has stumbled onto evidence of a decades-long killing spree. But rather than going to the local authorities, he keeps the movies to himself, hoping to publish another acclaimed book based on the crimes. As Ellison starts to piece together the mind-bending truth about the crimes and the murderer, unseen intruders and inexplicable goings-on disrupt his once peaceful household. Slowly, he begins\tto realize\tthat his ambition has placed\t him and his family in the path of an ancient and bloodthirsty adversary who has marked them as his next victims.  \t ","torrent":{"xt":"urn:btih:af59b96a82336b9a32a92ceb270b806f7d2527cb","amp;dn":"Sinister+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af59b96a82336b9a32a92ceb270b806f7d2527cb","infoHashBuffer":{"type":"Buffer","data":[175,89,185,106,130,51,107,154,50,169,44,235,39,11,128,111,125,37,39,203]},"announce":[],"urlList":[]}}