{"title":"2008 Sideline Secrets Parts I And II (USA)","uid":7958686,"size":1649274298,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:af9950dccb68d64b2d54939cb4c7125a282973e9&amp;dn=2008+Sideline+Secrets+Parts+I+And+II+%28USA%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Alexa0411","files":2,"time":1356517954,"description":"PART I http://www.imdb.com/title/tt0413268/\n\n&quot;Sideline Secrets&quot; follows the story of high-schooler Devon Tyler. With the perfect girlfriend, a successful family, being at the top of his class and about to graduate, all seems perfect. However underneath it all, all is not what it seems. With the heightened awareness of his sexual identity, the screaming and slamming doors of his feuding parents and an overbearing persona of his girlfriend put forth, things couldn't get more difficult... or so he thinks. That is until a new boy enters his life and proves to be the missing key that brings everything together... Full of romance, suspense and secrets abound, &quot;Sideline Secrets&quot; is sure to leave you on the sidelines wanting more!\n\n\n01:36:01\n560x432\n23.976 FPS\n\n\n\n\nPART II http://www.imdb.com/title/tt1186797/\n\nPETER a young traffic cop, is asked to look through hours of sex tapes the late psychiatrist Dr Tyler and his associate Detective Cunningham made of his unwilling male patients. Having both been killed in the first film they have left behind unanswered questions about one particular missing boy. During his search for the boy, Peter finds himself both repulsed and intrigued in the sexual perversion of Dr Tyler's videos. After watching tape after tape Peter soon succumbs to his own dark and seedy side and hatches his own twisted plot . Peter is infatuated with his straight roommate TODD and with the secrets learned from the good doctor he plans on luring Todd into his bed. But sex with Todd is only the beginning... \n\n\n\n01:09:01\n680x496\n29.97 FPS","torrent":{"xt":"urn:btih:af9950dccb68d64b2d54939cb4c7125a282973e9","amp;dn":"2008+Sideline+Secrets+Parts+I+And+II+%28USA%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af9950dccb68d64b2d54939cb4c7125a282973e9","infoHashBuffer":{"type":"Buffer","data":[175,153,80,220,203,104,214,75,45,84,147,156,180,199,18,90,40,41,115,233]},"announce":[],"urlList":[]}}