{"title":"Constantine[HDrip][AC 3 Spanish]","uid":5132154,"size":2026090496,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:af9a5e59fda81fa8904cd50efa2cbb3398a9d580&amp;dn=Constantine%5BHDrip%5D%5BAC+3+Spanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"sahae","files":1,"time":1256147173,"description":"TÃƒÂ­tulo original: Constantine\nAÃƒÂ±o: 2005\nPaÃƒÂ­s: USA\nDuraciÃƒÂ³n: 120 min\nEstreno en EspaÃƒÂ±a: 18-02-2005\nEstreno en USA: 18-02-2005\nDirector: Francis Lawrence\nReparto: Keanu Reeves, Rachel Weisz, Shia LaBeouf, Tilda Swinton, Pruitt Taylor Vince, Djimon Hounsou, Gavin Rossdale, Peter Stormare\nProductora: Warner Bros. Pictures\nGÃƒÂ©nero: FantÃƒÂ¡stico - AcciÃƒÂ³n \t\n\t\nSinopsis: John Constantine (Keanu Reeves) ha estado en el infierno y ha vuelto. Nacido con un don que no deseaba, la capacidad de reconocer claramente a los ÃƒÂ¡ngeles y a los demonios hÃƒÂ­bridos que andan por la tierra bajo un aspecto humano, Constantine se vio empujado a quitarse su propia vida para escapar de la atormentadora claridad de su visiÃƒÂ³n. Pero fracasÃƒÂ³. Resucitado en contra de su voluntad, se encontrÃƒÂ³ de nuevo en el mundo de los vivos. Ahora, marcado por su intento de suicidio con una esperanza de vida temporal, patrulla la frontera terrenal entre el cielo y el infierno, esperando en vano ganarse el camino a la salvaciÃƒÂ³n enviando a los esbirros del diablo de vuelta a las profundidades. Pero Constantine no es ningÃƒÂºn santo. Desilusionado por el mundo que le rodea y enfrentado con el del mÃƒÂ¡s allÃƒÂ¡, es un hÃƒÂ©roe amargado que bebe en exceso, lleva una vida dura y desprecia la sola idea de heroÃƒÂ­smo. Constantine lucharÃƒÂ¡ para salvar tu alma pero no quiere tu admiraciÃƒÂ³n ni tu agradecimiento, y por supuesto no quiere tu simpatÃƒÂ­a. Todo lo que quiere es un aplazamiento. Cuando una desesperada pero escÃƒÂ©ptica detective de policÃƒÂ­a, Angela Dodson (Rachel Weisz), consigue su ayuda para resolver la misteriosa muerte de su querida hermana gemela (tambiÃƒÂ©n interpretada por Weisz), su investigaciÃƒÂ³n les lleva a travÃƒÂ©s del mundo de demonios y ÃƒÂ¡ngeles que subyace justo bajo el paisaje de la actual ciudad de Los Angeles. Atrapados en una catastrÃƒÂ³fica serie de acontecimientos sobrenaturales, los dos se encuentran inextricablemente involucrados y tratan de encontrar su propia paz a cualquier precio.\n\n","torrent":{"xt":"urn:btih:af9a5e59fda81fa8904cd50efa2cbb3398a9d580","amp;dn":"Constantine%5BHDrip%5D%5BAC+3+Spanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af9a5e59fda81fa8904cd50efa2cbb3398a9d580","infoHashBuffer":{"type":"Buffer","data":[175,154,94,89,253,168,31,168,144,76,213,14,250,44,187,51,152,169,213,128]},"announce":[],"urlList":[]}}