{"title":"Programming Windows Azure","uid":6488752,"size":6940744,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:afc77cf221366a74654e4d9289ae8849876516a0&amp;dn=Programming+Windows+Azure&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TheBookie","files":-1,"time":1308806849,"description":"Programming Windows Azure: Programming the Microsoft Cloud By Sriram Krishnan\n\nPublisher: OReilly Media 2010 | 368 Pages | ISBN: 0596801971 \n\nLearn the nuts and bolts of cloud computing with Windows Azure, Microsofts new Internet services platform. Written by a key member of the product development team, this book shows you how to build, deploy, host, and manage applications using Windows Azures programming model and essential storage services.\nChapters in Programming Windows Azure are organized to reflect the platforms buffet of services. The books first half focuses on how to write and host application code on Windows Azure, while the second half explains all of the options you have for storing and accessing data on the platform with high scalability and reliability. Lots of code samples and screenshots are available to help you along the way. Learn how to build applications using the Windows Azure toolset Discover how Windows Azure works under the hood, and learn the how and the why behind several features Choose to write application code in .NET or other languages such as C/C++, PHP, or Ruby Understand the various options for managing your service Get up to speed on Azure's storage services, including blobs, queues, and tables Build a secure backup system, and learn about cloud application security, cryptography, and performance ","torrent":{"xt":"urn:btih:afc77cf221366a74654e4d9289ae8849876516a0","amp;dn":"Programming+Windows+Azure","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afc77cf221366a74654e4d9289ae8849876516a0","infoHashBuffer":{"type":"Buffer","data":[175,199,124,242,33,54,106,116,101,78,77,146,137,174,136,73,135,101,22,160]},"announce":[],"urlList":[]}}