{"title":"Sri Sri Ravishankar - Art of Living -18_Principles.pdf","uid":4358474,"size":106091,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b025df89f166a13b9eb2b75a29421f858f93ee44&amp;dn=Sri+Sri+Ravishankar+-+Art+of+Living+-18_Principles.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"welovesrisri","files":1,"time":1219525590,"description":"18 Principles of a Spiritual Life\nBy H. H. Sri Sri Ravi Shankar\n\nSri Sri Ravi Shankar is both visionary and practical. At the dawn of the new millennium, he calls for a return to the timeless values common to all religious traditions as a means to resolving conflict in the world today. He recognizes that this begins with individuals who embody those values in their own lives. In guiding people around the globe to finding this life for themselves, Sri\nSri offers the eighteen principles of the spiritual path.\n\nWhen attention is given to the spiritual aspect of one?s life, it brings responsibility, a sense of belongingness, and compassion and caring for the whole of humanity. Spirit upholds and sustains life. It makes you strong and solid. It breaks down the narrow boundaries of cast, creed, religion\nand nationality and gives you an awareness of life present everywhere. It is only through this awareness, this uplifting of consciousness, that wars can be eliminated and human rights restored in the world today.\nHow can these things be achieved? What are the main principles of a spiritual life?\n\nConfidence\n\nThe first principle of the spiritual path is to have confidence in yourself. Without confidence, achievement does not come. Doubt is what opposes confidence. Once you eliminate the negative, you will see that the positive has already happened. When doubt clears, confidence is there. So to gain confidence, you must understand what doubt is.\n\nIf you observe the nature of doubt, it is always about something positive. You never doubt what is negative. You know this from your experience. You doubt someone?s honesty, but you never doubt dishonesty. You doubt the goodness of other people, but you never doubt their bad qualities. If someone says, ?I love you very much,? you say, ?Really?? But if someone says, ?I hate you,? you never say, ?Do you really??\n\nUnderstand you r doubt as questioning the positive and having confidence in the negative, and know that if you are having doubt, there must be something good present. Approached in this way, doubt gives you a means to move ahead. I am not telling you to drop your doubt. Doubt as much as you can! Give it your 100%. That will help you through it. Once you cross this barrier of doubt, then further progress comes.\n\nStop Blaming Others and Yourself\n\nThe next principle is to stop blaming others and yourself. The spiritual journey is a journey to the Self, and when you are engaged in blaming yourself, you will not want to approach the Self.\n\n\nKriya,Sudarshan,Sri,Ravi,Shankar,Ravishankar,Jai,Gurudev,knowledge,higher,wisdom,love,peace,joy,smile,Rishi,\n\nSri Sri Ravi Shankar 's Sudarshan Kriya Does the Magic!\n\nI mean... every one loves Guruji and His amazing knowledge !\n\n\nJai Gurudev!\n:)\n &lt;a href=&quot;\nhttp://www.artofliving.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.artofliving.org/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.iahv.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.iahv.org/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.yesplus.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.yesplus.org/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.artoflivingpune.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.artoflivingpune.org/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.artoflivingprojects.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.artoflivingprojects.org/&lt;/a&gt;\n\nWe hope you enjoy being \nTotally Taken Care Of \nBy our beloved Master:\nSri Sri Ravishankar ji!\n\nENJOY!!!\n","torrent":{"xt":"urn:btih:b025df89f166a13b9eb2b75a29421f858f93ee44","amp;dn":"Sri+Sri+Ravishankar+-+Art+of+Living+-18_Principles.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b025df89f166a13b9eb2b75a29421f858f93ee44","infoHashBuffer":{"type":"Buffer","data":[176,37,223,137,241,102,161,59,158,178,183,90,41,66,31,133,143,147,238,68]},"announce":[],"urlList":[]}}