{"title":"BBC Horizon 2002 Parallel.Universes Xvid MP3","uid":4235415,"size":735787008,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b05b979230a263a72991587ae6a5fe72bee83c75&amp;dn=BBC+Horizon+2002+Parallel.Universes+Xvid+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"circlensess","files":1,"time":1213282546,"description":"HORIZON 2002 Parallel Universes\n\n\n\nInformation\n\nBBC Two 9.00pm Thursday 14 February 2002\n\nEverything you&amp;#039;re about to read here seems impossible and insane, beyond science fiction. Yet it&amp;#039;s all true.\n\nScientists now believe there may really be a parallel universe - in fact, there may be an infinite number of parallel universes, and we just happen to live in one of them. These other universes contain space, time and strange forms of exotic matter. Some of them may even contain you, in a slightly different form. Astonishingly, scientists believe that these parallel universes exist less than one millimetre away from us. In fact, our gravity is just a weak signal leaking out of another universe into ours.\n\nThe same but different\n\nFor years parallel universes were a staple of the Twilight Zone. Science fiction writers loved to speculate on the possible other universes which might exist. In one, they said, Elvis Presley might still be alive or in another the British Empire might still be going strong. Serious scientists dismissed all this speculation as absurd. But now it seems the speculation wasn&amp;#039;t absurd enough. Parallel universes really do exist and they are much stranger than even the science fiction writers dared to imagine.\n\n\n\nGreater dimensions\n\nIt all started when superstring theory, hyperspace and dark matter made physicists realise that the three dimensions we thought described the Universe weren&amp;#039;t enough. There are actually 11 dimensions. By the time they had finished they&amp;#039;d come to the conclusion that our Universe is just one bubble among an infinite number of membranous bubbles which ripple as they wobble through the eleventh dimension.\n\nA creative touch\n\nNow imagine what might happen if two such bubble universes touched. Neil Turok from Cambridge, Burt Ovrut from the University of Pennsylvania and Paul Steinhardt from Princeton believe that has happened. The result? A very big bang indeed and a new universe was born - our Universe. The idea has shocked the scientific community; it turns the conventional Big Bang theory on its head. It may well be that the Big Bang wasn&amp;#039;t really the beginning of everything after all. Time and space all existed before it. In fact Big Bangs may happen all the time.\n\n\n\nOf course this extraordinary story about the origin of our Universe has one alarming implication. If a collision started our Universe, could it happen again? Anything is possible in this extra-dimensional cosmos. Perhaps out there in space there is another universe heading directly towards us - it may only be a matter of time before we collide.\n\n\nTechnical Specs\n\nVideo Codec: XviD\nVideo Bitrate: 1948 kb/s\nVideo Resolution: 640x480\nVideo Aspect Ratio: 4:3\nAudio Codec: LAME MP3\nAudio BitRate: 192 kb/s CBR\nAudio Channels: 2\nRunTime Per Part: 44m 35s\nNumber Of Parts: 1\nPart Size: 701mb\nRipped by jvt40\n\n","torrent":{"xt":"urn:btih:b05b979230a263a72991587ae6a5fe72bee83c75","amp;dn":"BBC+Horizon+2002+Parallel.Universes+Xvid+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b05b979230a263a72991587ae6a5fe72bee83c75","infoHashBuffer":{"type":"Buffer","data":[176,91,151,146,48,162,99,167,41,145,88,122,230,165,254,114,190,232,60,117]},"announce":[],"urlList":[]}}