{"title":"Ang lalake sa parola (eng subs) [2007] Joselito Altarejos","uid":6861688,"size":737729851,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b08c9e268f8083e6cecaeee6ca6102ccf06b8e70&amp;dn=Ang+lalake+sa+parola+%28eng+subs%29+%5B2007%5D+Joselito+Altarejos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1322924092,"description":" &lt;a href=&quot;http://bayimg.com/OalKCAaDD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/OalKCAaDD&lt;/a&gt;\n\nAng lalake sa parola (2007) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1082022/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1082022/&lt;/a&gt;\n\nDirector: Joselito Altarejos\n\nTagalog language with hard English subtitles\n\nMateo (Harry Laurel) is a lighthouse caretaker dating the beautiful teacher Suzette (Jennifer Lee). The small town they are in is trying to get tourism to increase beyond religious festivals. Mateo has no family, just an absentee father who will be returning to town from Dubai after a fifteen year absence. Jerome (Justin de Leon) is an ad copywriter vacationing from Manila, and stumbles across Mateo and Suzette having sex. He, er, tops off his tank as well, but the viewer isn't sure who he was listening to more until further into the film.\n\nThe town has a gay man dressed in drag (Monti Parungao), who pays local teenage boys for sexual favors. He is abused by one of these boys, and talks to Mateo about the negatives of being gay in the Philippines. Bookending these plotlines, as Mateo and Jerome become closer, is the oddest aspect of the film- Mateo is seen talking to the elderly cemetery caretaker Tisho (Crispin Pineda) about the &quot;lighthouse fairy.&quot;\n\nAccording to local legend, the lighthouse fairy shows herself to only certain men she desires. That man gives himself to the fairy, and never marries. Mateo's burgeoning relationship with Jerome mirrors Tisho's story of his life with best friend Fidel, and Mateo must discover just exactly who he is inside.\n\nShot on video by co-writer Joselito Altarejos, &quot;The Man in the Lighthouse&quot; is definitely different. The entire fairy subplot, while kind of explained in the end of the film, is still a bizarre piece of storytelling. The central plot, the relationship between Mateo and Jerome, moves in fits and starts.\n\nThe music is over the top, as are some of the performances, but Altarejos does a nice job with just a few locations and small cast. Laurel makes a handsome leading man, but his acting when he arrives in Manila turns leaden. The sex scenes here are surprisingly explicit, both straight and gay, stopping just short of hardcore. The subtitles are sometimes off, or incorrect, but listening to the Tagalog language, I also picked up many English words, as well as Spanish.\n\n","torrent":{"xt":"urn:btih:b08c9e268f8083e6cecaeee6ca6102ccf06b8e70","amp;dn":"Ang+lalake+sa+parola+%28eng+subs%29+%5B2007%5D+Joselito+Altarejos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b08c9e268f8083e6cecaeee6ca6102ccf06b8e70","infoHashBuffer":{"type":"Buffer","data":[176,140,158,38,143,128,131,230,206,202,238,230,202,97,2,204,240,107,142,112]},"announce":[],"urlList":[]}}