{"title":"Bull.2016.S01E01.720p.HDTV.X264-DIMENSION","uid":15872423,"size":990372850,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:b09458b4c83f72b426ff4d727d3c46f61b3b066d&amp;dn=Bull.2016.S01E01.720p.HDTV.X264-DIMENSION&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":null,"files":1,"time":1474451830,"description":"SCREENS:\r\n\r\nBULL stars Michael Weatherly as Dr. Jason Bull in a drama inspired by the early career of Dr. Phil McGraw, the founder of one of the most prolific trial consulting firms of all time. Brilliant, brash and charming, Dr. Bull is the ultimate puppet master as he combines psychology, human intuition and high-tech data to learn what makes jurors, attorneys, witnesses and the accused tick. Bull employs an enviable team of experts at Trial Analysis Corporation to shape successful narratives down to the very last detail. They include his quick-witted brother-in-law, Benny Colón, who plays a defense attorney in mock trials; Marissa Morgan, a cutting-edge neurolinguistics expert from the Department of Homeland Security; former NYPD detective Danny James, the firm's tough but relatable investigator; haughty millennial hacker Cable McCrory, who is responsible for gathering cyber intelligence; and Chunk Palmer, a fashion-conscious stylist and former All-American lineman who fine-tunes clients' appearances for trial. In high-stakes trials, Dr. Bull's combination of remarkable insight into human nature, three Ph.D.s and top-notch staff creates winning strategies that tip the scales of justice in his clients' favor","torrent":{"xt":"urn:btih:b09458b4c83f72b426ff4d727d3c46f61b3b066d","amp;dn":"Bull.2016.S01E01.720p.HDTV.X264-DIMENSION","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b09458b4c83f72b426ff4d727d3c46f61b3b066d","infoHashBuffer":{"type":"Buffer","data":[176,148,88,180,200,63,114,180,38,255,77,114,125,60,70,246,27,59,6,109]},"announce":[],"urlList":[]}}