{"title":"Paul Chambers - Bass On Top 1957 / RVG 2007","uid":9630085,"size":102380114,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b149294f263f08b8dcdfb4fce8975ca1212be5f5&amp;dn=Paul+Chambers+-+Bass+On+Top+1957+%2F+RVG+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Drebben","files":9,"time":1392776051,"description":" \nPaul Chambers Quartet, Bass On Top, 1957\nBlue Note / RVG 2007\nBlue Note BLP 1569\n\n\n\nIn July of 1957, when Paul Chambers recorded &quot;Bass on Top,&quot; his third and final Blue Note release as a leader, he was already in his third year with the most influential jazz group of the time, the first great Miles Davis Quintet; he had just taken part in the Davis/Gil Evans Orchestra sessions that led to the classic &quot;Miles Ahead&quot; album; and he was appearing with the Davis Quintet and its new saxophonist Sonny Rollins at the Cafe Bohemia in New York. Chambers was twenty-two years old and firmly established as one of the top bass players in jazz.\n\nChambers had obviously learned a great deal during his time with the pathbreaking Davis Quintet and its young saxophone phenom John Coltrane. Indeed &quot;Bass on Top&quot; sounds very much like an extension of the Davis group's work, although with a more minimal lineup of just bass, drums, piano and guitar. The song selection also reflects Miles' influence. Along with one Davis composition, &quot;The Theme,&quot; Chambers tackles &quot;Dear Old Stockholm,&quot; a regular on Davis' set list for years, and &quot;Chasin' the Bird,&quot; which Miles had recorded years earlier with Charlie Parker. A dramatic reading of Jerome Kern's &quot;Yesterdays&quot; opens the album, followed by an upbeat version of Cole Porter's &quot;You'd Be So Nice to Come Home To.&quot; &quot;Chamber Mates,&quot; a previously unreleased original by Chambers and Kenny Burrell, appears for the first time on the CD reissue.\n\n&quot;Bass on Top&quot; is a remarkably mature musical statement for anyone, let alone someone so young. As the album title suggests, this is not simply a session led by a bassist, it is one in which the bass is the dominant instrument, playing the melodies and taking most of the solos. And Chambers, whether playing with a bow or pizzicato, soloing or accompanying the rest of the quartet, is brilliant. The absence of any horns lends the session an almost chamber jazz feel, as does the presence of masterful guitarist Burrell and the most sophisticated and eloquent of jazz pianists, Hank Jones. Art Taylor, who had temporarily replaced Philly Joe Jones in Davis' group at the time, rounds out the quartet on drums. This is quiet, thoughtful, and intelligent music played at a tremendously high level by all the musicians.\n\n\n\nCD / Blue Note / 2007 / 320Kbps\n\n\n\nTracklist:\n01.&quot;Yesterdays&quot; (Harbach, Kern) - 5:53\n02. &quot;You'd Be So Nice to Come Home To&quot; (Porter) - 7:16\n03. &quot;Chasin' the Bird&quot; (Parker) - 6:18\n04. &quot;Dear Old Stockholm&quot; (Traditional) - 6:44\n05. &quot;The Theme&quot; (Davis) - 6:15\n06. &quot;Confessin'&quot; (Doc Daugherty, Ellis Reynolds, Neiburg) - 4:13\n07. &quot;Chamber Mates&quot; (Burrell, Chambers) - 5:08\n\n\n\nPersonnel:\nPaul Chambers - bass\nHank Jones - piano\nKenny Burrell - guitar\nArt Taylor - drums.\n\n\n \nRecorded on July 14, 1957 at the Van Gelder Studio, Hackensack, NJ\nTrack 7 is a bonus track, not part of original LP.\n\n\n\nShaken, not stirred.\n\n\n:)\n\n","torrent":{"xt":"urn:btih:b149294f263f08b8dcdfb4fce8975ca1212be5f5","amp;dn":"Paul+Chambers+-+Bass+On+Top+1957+%2F+RVG+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b149294f263f08b8dcdfb4fce8975ca1212be5f5","infoHashBuffer":{"type":"Buffer","data":[177,73,41,79,38,63,8,184,220,223,180,252,232,151,92,161,33,43,229,245]},"announce":[],"urlList":[]}}