{"title":"Peter Weiss - Marat/Sade (1963 play)","uid":11403378,"size":1682948,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b19054f2a4bc6ba2c082300388f0f9865f34bdc2&amp;dn=Peter+Weiss+-+Marat%2FSade+%281963+play%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"workerbee","files":-1,"time":1415446326,"description":"\nPeter Weiss - The Persecution and Assassination of Jean-Paul Marat As Performed by the Inmates of the Asylum of Charenton Under the Direction of the Marquis de Sade [MARAT/SADE] (Atheneum, 1965).  English version by Geoffrey Skelton; verse adaptation by Adrian Mitchell.  Introduction by Peter Brook.  128 pp. -- PDF\n\n\nMARAT/SADE, the shortened form of the title, is a 1963 play by the German author PETER WEISS (1916-1982).  Staged by Peter Brook and the Royal Shakespeare Company in 1964, and on Broadway in 1965, it won the Tony Award for Best Play, the New York Drama Critics' Circle Award for Best Play, and a host of other honors. \n\nSet in the historical Charenton lunatic asylum, it is almost entirely a &quot;play within a play&quot;.  The main story takes place in July 1808, after the French Revolution; the play directed by Marquis de Sade within the story takes place during the Revolution, in the middle of 1793, culminating in the assassination of Jean-Paul Marat, then quickly brings the audience up to date (1808).  The actors are the inmates of the asylum, and the nurses and supervisors occasionally step in to restore order.  The bourgeois director of the hospital, Coulmier, supervises the performance, accompanied by his wife and daughter.  He is a supporter of the post-revolutionary government led by Napoleon, in place at the time of the production, and believes the play he has organised to be an endorsement of his patriotic views.  His patients, however, have other ideas, and they make a habit of speaking lines he had attempted to suppress, or deviating entirely into personal opinion.\n\nIncorporating dramatic elements characteristic of both Artaud and Brecht, the play is a bloody and unrelenting depiction of class struggle and human suffering which asks whether true revolution comes from changing society or changing oneself.  Are the same things true for the masses and for their leaders?  And where, in modern times, lie the borderlines of sanity?\n\n\nSee also the acclaimed 1967 film adaptation by Peter Brook available here: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/9803680/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/9803680/&lt;/a&gt;\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                            &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!","torrent":{"xt":"urn:btih:b19054f2a4bc6ba2c082300388f0f9865f34bdc2","amp;dn":"Peter+Weiss+-+Marat%2FSade+%281963+play%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b19054f2a4bc6ba2c082300388f0f9865f34bdc2","infoHashBuffer":{"type":"Buffer","data":[177,144,84,242,164,188,107,162,192,130,48,3,136,240,249,134,95,52,189,194]},"announce":[],"urlList":[]}}