{"title":"Conn Iggulden, Stormbird (Wars of the Roses 1) 2013 epub mobi do","uid":9067688,"size":1988466,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1a2209bbf83ec635688ef7dc6d9df8fbaa57303&amp;dn=Conn+Iggulden%2C+Stormbird+%28Wars+of+the+Roses+1%29+2013+epub+mobi+do&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dovah12","files":-1,"time":1382138126,"description":"Stormbird (Wars of the Roses #1)\n\n\nAuthor : Conn Iggulden\n\n\n\nasin : B00CUTLML0\nformat : Kindle Edition &amp; epub\nPublished October 10th 2013 by Penguin\n\n\n\n\nWars of the Roses: the brand new historical series from Conn Iggulden internationally best-selling author of the Emperor and Conqueror series.\n===============\n\nKing Henry V - the great Lion of England - is long dead.\n\nIn 1437, after years of regency, the pious and gentle Henry VI, the Lamb, comes of age and accedes to the English throne. His poor health and frailty of mind render him a weakling king -Henry depends on his closest men, Spymaster Derry Brewer and William de la Pole, Duke of Suffolk, to run his kingdom.\n\nYet there are those, such as the Plantagenet Richard, Duke of York, who believe England must be led by a strong king if she is to survive. With England's territories in France under threat, and rumours of revolt at home, fears grow that Henry and his advisers will see the country slide into ruin. With a secret deal struck for Henry to marry a young French noblewoman, Margaret of Anjou, those fears become all too real.\n\nAs storm clouds gather over England, King Henry and his supporters find themselves besieged abroad and at home. Who, or what can save the kingdom before it is too late?\n\n'This is energetic, competent stuff; Iggulden knows his material and his audience' Independent 'A thrilling journey, rippingly told . . . Iggulden's most satisfying to date' Telegraph 'Iggulden is in a class of his own when it comes to epic, historical fiction' Daily Mirror 'Iggulden...tells an absolutely cracking story' The Times\n\nConn Iggulden is the author of the best-selling Emperor and Conqueror historical fiction series and also the co-author (with his brother Hal), of 2006's British Book of The Year, The Dangerous Book for Boys.\n\nBorn in London, Conn Iggulden read English at London University and worked as a teacher for seven years before becoming a full time writer. He is married and lives in Hertfordshire with his wife and children.\n================\n\nDovah","torrent":{"xt":"urn:btih:b1a2209bbf83ec635688ef7dc6d9df8fbaa57303","amp;dn":"Conn+Iggulden%2C+Stormbird+%28Wars+of+the+Roses+1%29+2013+epub+mobi+do","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1a2209bbf83ec635688ef7dc6d9df8fbaa57303","infoHashBuffer":{"type":"Buffer","data":[177,162,32,155,191,131,236,99,86,136,239,125,198,217,223,143,186,165,115,3]},"announce":[],"urlList":[]}}