{"title":"Rumble Fish {1983} DvDivX [Francis Ford Coppola]","uid":4614013,"size":734229318,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b1dadb3a8b9c272996b13d3ab2a6e3b07f1126c6&amp;dn=Rumble+Fish+%7B1983%7D+DvDivX+%5BFrancis+Ford+Coppola%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"seraphim911","files":5,"time":1230743482,"description":"Rumble Fish is a 1983 film directed, produced and co-written by Francis Ford Coppola. It is based on the novel Rumble Fish by S.E. Hinton, who also co-wrote the screenplay. The film centers on the relationship between the Motorcycle Boy (Mickey Rourke), a revered former gang leader, and his younger brother, Rusty James (Matt Dillon), who can't live up to his brother's great reputation, nor can his brother live it down. Coppola wrote the screenplay for the film with Hinton on his days off from shooting The Outsiders. He made the films back-to-back, retaining much of the same cast and crew. The film is notable for its avant-garde style, shot on stark high-contrast black-and-white film, using the spherical cinematographic process with allusions to French New Wave cinema and German Expressionism. Rumble Fish features an experimental score by Stewart Copeland, drummer of the musical group The Police, who used a Musync, a new device at the time.\n\nRumble Fish was booed when it debuted at the New York Film Festival. It took part in the San Sebastian International Film Festival, where it won the International Critics' Big Award. It went on to gross only $2.5 million domestically, well below its estimated $10 million budget. Most mainstream reviewers reacted negatively to Coppola's film, criticizing its overt style and lack of characterization.\n\n","torrent":{"xt":"urn:btih:b1dadb3a8b9c272996b13d3ab2a6e3b07f1126c6","amp;dn":"Rumble+Fish+%7B1983%7D+DvDivX+%5BFrancis+Ford+Coppola%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1dadb3a8b9c272996b13d3ab2a6e3b07f1126c6","infoHashBuffer":{"type":"Buffer","data":[177,218,219,58,139,156,39,41,150,177,61,58,178,166,227,176,127,17,38,198]},"announce":[],"urlList":[]}}