{"title":"Unsolved Mysteries of World War II: Occult and Secrets","uid":4852844,"size":912111933,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b303d454221b8389ef440df7b105268f29a2a9d3&amp;dn=Unsolved+Mysteries+of+World+War+II%3A+Occult+and+Secrets&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Katkwaraye","files":-1,"time":1239940856,"description":"Source: DVD\nFormat: mkv (because Matroska is how I roll)\nRunning Time: 1:41:43\nOrg Year: 2006\nSize: 869 MB\nripped by myself\n\nHitler's Secret Weapons-\nWhy did the Germans spend so much time and effort developing a space age weapon only to arm it with less than one ton of conventional explosives? Did Hitler have plans to arm the rocket with a more sinister and deadly warhead?\n\nEnigma Of The Swastika-\nWhat are the origins of this dreaded symbol of National Socialism? How did the Swastika change from a Buddhist sign of good fortune to the Nazi emblem, striking terror in the hearts of millions?\n\nHimmler's Castle-\nWhat were the mysterious ceremonies performed in the castle crypt? Did Himmler really believe that the castle would be the spiritual focal point of the final great battle between East and West? What became of the contents of Himmler's secret safe hidden deep in the castle vaults and removed in 1945?\n\nThe Eagle And The Swastika-\nWhy Hitler unilaterally declared war on the most powerful neutral nation on Earth is a mystery compounded by Hitler's own later observation that, &quot;This war with America is a tragedy; illogical, devoid of fundamental reality.&quot;\n\nThe Last Days Of Hitler-\nMystery still surrounds his fate, even today. Did he escape from the ruins of of his chancellery and seek refuge in South America or did he take his own life? What did happen to Adolf Hitler in those last desperate days of the Reich?\n\nIf you need a seed, PM me here: http://suprbay.org/member.php?u=74576","torrent":{"xt":"urn:btih:b303d454221b8389ef440df7b105268f29a2a9d3","amp;dn":"Unsolved+Mysteries+of+World+War+II%3A+Occult+and+Secrets","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b303d454221b8389ef440df7b105268f29a2a9d3","infoHashBuffer":{"type":"Buffer","data":[179,3,212,84,34,27,131,137,239,68,13,247,177,5,38,143,41,162,169,211]},"announce":[],"urlList":[]}}