{"title":"Stephen Deas - Silver Kings (ePub, Mobi) - sum1_here","uid":9101976,"size":2731221,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b34dfd38dd14532a8aff029d9e290c37a83ae1b1&amp;dn=Stephen+Deas+-+Silver+Kings+%28ePub%2C+Mobi%29+-+sum1_here&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"sum1_here","files":-1,"time":1382747449,"description":":General:\nComplete name: Stephen Deas - Silver Kings (ePub, Mobi) - sum1_here\nFormat: mobi, epub\nSize: 2.60 mb \nLanguage: English\nEncoder: sum1_here\n\n\n\nPlot:\n\nREQUEST\n\nThe Black Mausoleum - Book 01\nSkorl is an Ember, a soldier trained from birth to fight dragons. He is a living weapon, one-shot only, saturated with enough dragon-poison to bring down a monster all on his own. Misanthrope, violent and a drunk, to fulfil his purpose and slay a dragon, means to be eaten. Now Skorl has a choice: he can hang for his crimes, or he can go with the last of the Adamantine Men, fighting against an enemy he was born to face.\n\nRat is an Outsider. He's on the run and he's stumbled onto something that's going to make him rich beyond all his dreams. It's just a shame that the end of the world has started without him.\n\nKataros is an alchemist, one of the order responsible for keeping the dragons in check. One of the order that has just failed, and disastrously so.\n\nTwo men, one woman. One chance to save the world from a storm of dragons...\n\nDragon Queen - Book 02\nPraised by the likes of Joe Abercrombie and Brent Weeks, Stephen Deas has made dragons his own.\n\nIn the years before the Dragons laid waste to man's empire, the fearsome monsters were used for war and as gifts of surpassing wealth to buy favour in the constant political battles that tore at the kingdoms.\n\nNotorious in these battles was the Dragon Queen. And now she is a prisoner. But no-one is more dangerous than when caged...\n\nThe critics, fellow authors and readers alike are agreed - if you love dragons and epic fantasy, Stephen Deas is the writer for you. The man who brought dragons back to their full glory, might and terror.","torrent":{"xt":"urn:btih:b34dfd38dd14532a8aff029d9e290c37a83ae1b1","amp;dn":"Stephen+Deas+-+Silver+Kings+%28ePub%2C+Mobi%29+-+sum1_here","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b34dfd38dd14532a8aff029d9e290c37a83ae1b1","infoHashBuffer":{"type":"Buffer","data":[179,77,253,56,221,20,83,42,138,255,2,157,158,41,12,55,168,58,225,177]},"announce":[],"urlList":[]}}