{"title":"Various Artists - Quiet About It: A Tribute To Jesse Winchester ","uid":11699571,"size":268920161,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b371162351915a347bc6c8436667c9d385e2d661&amp;dn=Various+Artists+-+Quiet+About+It%3A+A+Tribute+To+Jesse+Winchester+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":16,"time":1423888787,"description":"FLAC / Lossless / Log (100%) / Cue \nLabel/Cat#: Mailboat Records / MBD 7000\nCountry: USA\nYear: 2012\nGenre: folk\nFormat:CD\n\n1James Taylor - Payday 3:08\n2Rosanne Cash - Biloxi 3:23\n3Jimmy Buffett - Gentleman of Leisure 4:36\n4Allen Toussaint - I Wave Bye Bye 3:33\n5Vince Gill - Talk Memphis 4:27\n6Mac McAnally - Defying Gravity 3:56\n7Lyle Lovett - Brand New Tennessee Waltz 3:52\n8Lucinda Williams - Mississippi You're on My Mind 4:25\n9Rodney Crowell feat. Emmylou Harris &amp; Vince Gill - Dangerous Fun 3:35\n10Little Feat - Rhumba Man 5:52\n11Elvis Costello - Quiet About It 3:09\n\nTo many, Jesse Winchester is still best known for his ideals rather than his music -- in 1967, rather than join the military and fight in Vietnam, he emigrated to Canada, and spent most of the '70s as an exile of conscience. If Winchester had been a protest singer in the manner of Phil Ochs, this might have made him a hero, but his songs rarely reflected his political views, and instead were compact, painterly meditations on life in the South and the mysteries of life and love (though his physical and emotional distance from his birthplace in Memphis certainly provided a powerful subtext to his music of the '70s). If Winchester's music never quite clicked with a mass audience due to his inability to tour the United States during the '70s or the shifting tides of popular taste, he's long been a favorite among his fellow songwriters, and 11 noted performers interpret some of Winchester's best songs on Quiet About It: A Tribute to Jesse Winchester. Quiet About It is that rare tribute album that gives each artist room to find their own musical personality in these songs, while the 11 tracks still cohere into a whole that reveals the depth and lyricism of Winchester's work. This hardly represents every worthwhile tune in his songbook, but the 11 here are all winners, and the songs bring out the best in the artists. Lyle Lovett (who was clearly influenced by Winchester's vocal style) finds every bit of sad beauty in &quot;Brand New Tennessee Waltz,&quot; Vince Gill brings just the right swagger to &quot;Talk Memphis,&quot; Allen Toussaint's version of &quot;I Wave Bye Bye&quot; is lovely and heartfelt, Lucinda Williams is all rough-hewn grace on &quot;Mississippi You're On My Mind,&quot; and Elvis Costello's lo-fi take on &quot;Quiet About It&quot; is stylistically bold but true to the song's nature. James Taylor gives one of his best and liveliest performances in ages with his cocksure version of &quot;Payday,&quot; and Jimmy Buffett (who spearheaded the project) reminds us that he was a gifted singer before he discovered how well singing about aquatic alcoholism could pay with a sharp take on &quot;Gentleman of Leisure.&quot; Quiet About It came about when Winchester revealed he'd been diagnosed with esophageal cancer, and the artists involved banded together as a show of support (and to generate some songwriting royalties); thankfully, by the time the album appeared, Winchester was in remission, and this splendid celebration of an underappreciated talent arrived while the man who inspired it is still around to take a bow. If you don't know Winchester's work, Quiet About It is a sure convincer of his talents as a songwriter, and if you're a fan, you'll revel in some top-notch interpretations of his songs. Either way, Quiet About It is a must, and one of the finest tribute albums of recent memory","torrent":{"xt":"urn:btih:b371162351915a347bc6c8436667c9d385e2d661","amp;dn":"Various+Artists+-+Quiet+About+It%3A+A+Tribute+To+Jesse+Winchester+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b371162351915a347bc6c8436667c9d385e2d661","infoHashBuffer":{"type":"Buffer","data":[179,113,22,35,81,145,90,52,123,198,200,67,102,103,201,211,133,226,214,97]},"announce":[],"urlList":[]}}