{"title":"Fundamentals of Information Systems (8th  Ed)(gnv64)","uid":13302178,"size":36785633,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b485ec3217f7483a1d1e44b38236c1f032e67e32&amp;dn=Fundamentals+of+Information+Systems+%288th++Ed%29%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"gnv65","files":5,"time":1453712337,"description":"Fundamentals of Information Systems (8th  Ed)\r\nby Ralph M. Stair and George W. Reynolds\r\nCengage Learning | January 2015 | ISBN-10: 1305082168 | PDF | 560 pages | 34.4 mb\r\n\r\nFundamentals of Information Systems, 8th Edition, offers the traditional coverage of computer concepts, but places the material within the context of meeting business and organizational needs. Placing information systems concepts within this context and taking a management perspective has always set this text apart from other computer texts, thus making it appealing not only to MIS majors but also to students from other fields of study. The text is not overly technical, but rather deals with the role that information systems play in an organization and the key principles a manager or technology specialist needs to grasp to be successful. The principles of IS are brought together and presented in a way that is understandable, relevant, and interesting. In addition, the text offers an overview of the entire IS discipline, while giving students a solid foundation for further study in more advanced IS courses such as programming, systems analysis and design, project management, database management, data communications, Web site design and development, electronic and mobile commerce, decision support, and informatics. As such, it serves the needs of both general business managers and those who aspire to become IS professionals\r\n\r\nAbout the Authors\r\nRalph Stair received a B.S. in Chemical Engineering from Purdue University, an M.B.A. from Tulane University, and a Ph.D. from the University of Oregon. Dr. Stair has focused his teaching and research on information systems. He has endowed the Ralph Stair Prize in Innovative Education at Florida State University. He also provided funding for the Stair-Harkrider scholarship and the Ralph Stair Prize in Academic Improvement at his high school in Wisconsin.\r\nProfessor George Reynolds brings a wealth of business, teaching, and writing experience to this book. His successful business career spans four decades of working in government, institutional, and business IS organizations. He combines this business and industry experience with exceptional teaching skills to deliver a text that is both practical and focused on the needs of today's student. Professor Reynolds has taught IS at the University of Cincinnati, Xavier University (Ohio), Miami University (Ohio), the College of Mount St. Joseph, and Strayer University. Professor Reynolds has authored more than two dozen popular textbooks addressing various aspects of today's information technology and business.\r\n\r\nCONTENTS\r\nPART 1 Information Systems in Perspective 1\r\nChapter 1 An Introduction to Information Systems in\r\nOrganizations 2\r\nPART 2 Technology 59\r\nChapter 2 Hardware and Software 60\r\nChapter 3 Database Systems and Applications 128\r\nChapter 4 Telecommunications and Networks 170\r\nPART 3 Business Information Systems 235\r\nChapter 5 Electronic and Mobile Commerce and Enterprise\r\nSystems 236\r\nChapter 6 Information and Decision Support Systems 288\r\nChapter 7 Knowledge Management and Specialized\r\nInformation Systems 342\r\nPART 4 Systems Development 389\r\nChapter 8 Systems Development 390\r\nPART 5 Information Systems in Business and Society 431\r\nChapter 9 The Personal and Social Impact of Computers 432\r\nGlossary 490\r\nSubject Index 498\r\nCompany Index 510\r\n \nhttp://s29.postimg.org/ctfzpjxxj/Fundamentals_of_Information_Systems_8th_Ed.jpg","torrent":{"xt":"urn:btih:b485ec3217f7483a1d1e44b38236c1f032e67e32","amp;dn":"Fundamentals+of+Information+Systems+%288th++Ed%29%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b485ec3217f7483a1d1e44b38236c1f032e67e32","infoHashBuffer":{"type":"Buffer","data":[180,133,236,50,23,247,72,58,29,30,68,179,130,54,193,240,50,230,126,50]},"announce":[],"urlList":[]}}