{"title":"Kursk-The Greatest Tank Battle","uid":5486248,"size":20115143,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b5a0124cb4a6a69d94bae1e955f4d7dd32df70e5&amp;dn=Kursk-The+Greatest+Tank+Battle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"artpepper","files":-1,"time":1270735932,"description":"Kursk - The Greatest Tank Battle 1943\n\nIan Allan Publishing | 2002 | ISBN: 0711728680 | English | 162 Pages | PDF | \n\n19,2 MB\n\n\n\nIn July 1943 the German Army launched what proved to be its last great offensive on the Eastern Front against the Kursk salient. Kursk: The Greatest Tank Battle Ever Fought 1943 is a comprehensive account of the last time that Germany held the strategic initiative in the war against the Soviet Union, which, once lost, would lead to the inevitable destruction of the Nazi state by the vengeful Red Army. \n\n\n\nThe book begins with a study of the background to the battle and a description of the events on the Eastern Front before the opening of the offensive, including the decisive battle for Stallngrad that had finished only a few months beforehand. \n\n\n\nThe strategic importance of the Kursk salient is considered, as are the factors that caused the Germans to delay their offensive, even when the element of surprise had been lost. \n\n\n\nThe extensive Soviet defensive preparations are covered in depth, as are the strength of both sides and the new equipment, such as the Panther tank that the Germans were using for the first time. Kursk: The Greatest Tank Battle Ever Fought 1943 shows how a bitter struggle developed between the Soviet and German forces, which sucked in huge numbers of tanks and men into a small area, so that it became the greatest armoured battle of the war. \n\n\n\nThe Red Army of 1943 was very different from the force that reeled before the German onslaught in 1941, and its new found professionalism wore down the attackers until all their momentum was lost. The final chapter discusses the full implications of the battle for the Germans and for the Russians. \n\nThe book's authoritative text is complemented with detailed maps that explain the troop movements that took place during the battle. The book also includes appendices with information on orders of battle, losses and equipment.\n\n","torrent":{"xt":"urn:btih:b5a0124cb4a6a69d94bae1e955f4d7dd32df70e5","amp;dn":"Kursk-The+Greatest+Tank+Battle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5a0124cb4a6a69d94bae1e955f4d7dd32df70e5","infoHashBuffer":{"type":"Buffer","data":[181,160,18,76,180,166,166,157,148,186,225,233,85,244,215,221,50,223,112,229]},"announce":[],"urlList":[]}}