{"title":"Birdsong - Sebastian Faulks  (Unabridged)","uid":6838151,"size":446713143,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b5cd33c181e8b8245b9793bf973371af042dd4a3&amp;dn=Birdsong+-+Sebastian+Faulks++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rosie1966","files":20,"time":1322076880,"description":"About The Book\nIn 1910 a young Englishman, Stephen Wraysford, goes to Picardy, France, to learn the textile business. While there he plunges into a love affair with the young wife of his host, a passion so imperative and consuming that it changes him forever. Several years later, with the outbreak of World War I, he finds himself again in the fields of Picardy, this time as a soldier on the Western Front. A strange, occasionally bitter man, Stephen is possessed of an inexplicable will to survive. He struggles through the hideously bloody battles of the Marne, Verdun, and the Somme (in the last named, thirty thousand British soldiers were killed in the first half hour alone), camps for weeks at a time in the verminous trenches, and hunkers in underground tunnels as he watches many of the companions he has grown to love perish. In spite of everything, Stephen manages to find hope and meaning in the blasted world he inhabits.\n\nSixty years after war's end, his granddaughter discovers, and keeps, Stephen's promise to a dying man. Sebastian Faulks brings the anguish of love and war to vivid life, and leaves the reader's mind pulsating with images that are graphic and unforgettable.\n\n\nAbout The Author\nSebastian Faulks was born in Donnington in Berkshire on April 20, 1953. He became a full-time writer in 1991, he worked as a journalist. His French trilogy - The Girl at the Lion d'Or, Birdsong and Charlotte Gray (1989-1997) - established him in the front rank of British novelists. UK sales of Birdsong exceed 2,500,000 copies, and for this novel he was named &quot;Author of the Year&quot; by the British Book Awards in 1995. It is regularly voted one of the nation's favourite books. Charlotte Gray has also sold over a million copies and was filmed with Cate Blanchett in the main part. Sebastian Faulks lives with his wife in London and was awarded the CBE in 2002.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:b5cd33c181e8b8245b9793bf973371af042dd4a3","amp;dn":"Birdsong+-+Sebastian+Faulks++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5cd33c181e8b8245b9793bf973371af042dd4a3","infoHashBuffer":{"type":"Buffer","data":[181,205,51,193,129,232,184,36,91,151,147,191,151,51,113,175,4,45,212,163]},"announce":[],"urlList":[]}}