{"title":"Peter Hook - Unknown Pleasures: Inside Joy Division","uid":7758201,"size":2711199,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b653286e19ea6ff042d78672847c6b371c533fe2&amp;dn=Peter+Hook+-+Unknown+Pleasures%3A+Inside+Joy+Division&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MrShite","files":2,"time":1351160968,"description":"PLEASE SEED, DON&quot;T BE SELFISH AND HIT &amp; RUN!!!!!!!!!!!!!\n\nAnd if you like this torrent, check out my other torrents here: http://thepiratebay.se/user/MrShite/\n\nAuthor: Peter Hook, Co-founder and former bassist for Legendary Manchester bands Joy Division and New Order.\n\nTitle: Unknown Pleasures: Inside Joy Division\n\nNOTE: In .epub format, suitable for Apple's iOS-based app &quot;iBooks&quot; and other such e-Readers.\n\nJoy Division changed the face of music. Godfathers of the current alternative scene, they reinvented rock in the post-punk era, creating a new sound - dark, hypnotic, intense - that would influence U2, R.E.M., Radiohead and many others. Inspired by the attitude and energy of punk, Peter Hook and school friend Bernard Sumner joined lead-singer and lyricist Ian Curtis and drummer Stephen Morris, and with some cobbled-together instruments, they created their own unique sound. In 1980 they had released two albums and were on the cusp of touring America when Ian Curtis committed suicide. In this no-holds-barred account, Peter Hook gives us the inside story of life with Joy Division. He talks with candour and reflection about Curtis's suicide and covers the band's friendships and fall-outs; their rehearsals and recording sessions; and the many larger-than-life characters who formed a vital part of the Joy Division legend.","torrent":{"xt":"urn:btih:b653286e19ea6ff042d78672847c6b371c533fe2","amp;dn":"Peter+Hook+-+Unknown+Pleasures%3A+Inside+Joy+Division","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b653286e19ea6ff042d78672847c6b371c533fe2","infoHashBuffer":{"type":"Buffer","data":[182,83,40,110,25,234,111,240,66,215,134,114,132,124,107,55,28,83,63,226]},"announce":[],"urlList":[]}}