{"title":"(PSX-PSP) Moto Racer converted properly [ResourceRG Games by Klo","uid":5040488,"size":414858520,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:b70dde60f03c46950d3bb16719e92437722ed1f3&amp;dn=%28PSX-PSP%29+Moto+Racer+converted+properly+%5BResourceRG+Games+by+Klo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"toxicjuggalo","files":2,"time":1249347813,"description":"MOTO RACER:\n\nMOTO RACER brings the excitement of motorcycle racing to the PlayStation, and is essentially two racing games in one. showcases both dirt and street bikes, with tracks that fit each bike's acing style. Dirt bikes can race in a typical motocross stadium, which offers plenty of moguls and dirt ramps. In street racing, you'll go to more exotic locales, peeling out and burning rubber in a jungle setting and trying to figure out the best way to negotiate the curves of the Great Wall of China. Also included is a Multiplayer mode, which lets you go full throttle against a friend in head-to-head competition. So strap on your helmet and get ready for some intense dirt bike and street racing action with MOTO RACER\n\nTested and working on all CFW's 5.00 m33 and above using the 500 popsloader pack set on 3.72 POPS... Like my work?? Please read the NFO and support me ;) \n\n\nHave you been looking for that classic PSX game but just can't seem to find it anywhere? How about those &quot;rare&quot; titles that were only released in certain regions? Better yet, would you like to be able to have those games playable on your PSP so you can play them anywhere you want? Want to get those conversions directly from the source instead of through &quot;unsafe&quot; torrent browsers? Come and request them at\n\n                         www.reputation-resource.com","torrent":{"xt":"urn:btih:b70dde60f03c46950d3bb16719e92437722ed1f3","amp;dn":"%28PSX-PSP%29+Moto+Racer+converted+properly+%5BResourceRG+Games+by+Klo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b70dde60f03c46950d3bb16719e92437722ed1f3","infoHashBuffer":{"type":"Buffer","data":[183,13,222,96,240,60,70,149,13,59,177,103,25,233,36,55,114,46,209,243]},"announce":[],"urlList":[]}}