{"title":"The New Know-Nothings (1998) by Morton M. Hunt","uid":10120607,"size":904939,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b74d41117f10e4d297d139a24a9fb278dbb299ce&amp;dn=The+New+Know-Nothings+%281998%29+by+Morton+M.+Hunt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":-1,"time":1399667756,"description":"The New Know-Nothings - The Political Foes of the Scientific Study of Human Nature (1998) by Morton M. Hunt.epub\n\nIn recent years, political, religious, and other special-interest groups have waged war on behavioral and social research projects that threaten their interests and values. They have hounded researchers out of universities, cut off their funding through congressional and state legislative pressure, and harassed them with public demonstrations and picketing, all in the hope of forcing them to abandon their research. Formerly such unwanted involvement came from activists on the left. Now it comes from all across the political spectrum, as anti-science attitudes and techniques have diffused throughout society. In addition, conservative and religious forces lobby Congress and state legislatures against funding for major research projects of which they disapprove. This phenomenon represents a grave threat to both scientific freedom and the well-being of modern society.\n\nMorton Hunt gives us the first serious overview of this threat to behavioral and social science research. He illustrates precisely how scientific research has been subjected to political attack. The New Know-Nothings illustrates this phenomenon using in-depth case histories and background discussions of the conflicting social forces involved. It considers the prevalence of each form of opposition of research has been subjected to political attack. The New Know-Nothings illustrates this phenomenon using in-depth case histories and background discussions of the conflicting social forces involved. It considers the prevalence of each form of opposition to research, using interviews with expert observers in the sciences and government. Hunt reviews the nature-nurture debate, biological contributions to gender differences, conservative opposition to sex research in the schools, the debate over the controlled drinking approach to alcoholism, animal rights versus scientists' rights to use animals in research, the controversy over day care, anthropological research needs versus the Native American repatriation of remains, and other cases. He argues that beyond the specific projects targeted, the most important thing threatened is the social valation of scientific freedom. The belief that it is permissible and laudable to obstruct research is neo-Luddite, obscurantist, and anti-intellectual.\n\nThis comprehensive, nonpartisan study is possibly the only book-length treatment of this important subject. It treats attacks on science from both the left and the right and is timely, lively, and accessible in style. It will be of interest to behavioral scientists and scientists in general, readers interested in the sciences and in social issues, and government policymakers.\n\n404 pages\nPublisher: Transaction Publishers (September 30, 1998)\nLanguage: English\nISBN-10: 0765804972\nISBN-13: 978-0765804976","torrent":{"xt":"urn:btih:b74d41117f10e4d297d139a24a9fb278dbb299ce","amp;dn":"The+New+Know-Nothings+%281998%29+by+Morton+M.+Hunt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b74d41117f10e4d297d139a24a9fb278dbb299ce","infoHashBuffer":{"type":"Buffer","data":[183,77,65,17,127,16,228,210,151,209,57,162,74,159,178,120,219,178,153,206]},"announce":[],"urlList":[]}}