{"title":"Sugar - Abbot- [History] [Non-Fiction] Epub_(K-Slender)","uid":8956557,"size":5712642,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7ccfec23bf4a5cc1d37041947cc2eacebdd2f0d&amp;dn=Sugar+-+Abbot-+%5BHistory%5D+%5BNon-Fiction%5D+Epub_%28K-Slender%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"K-Slender","files":3,"time":1380008761,"description":"Publisher: Overlook TP; Reprint edition (September 27, 2011)\nISBN-10: 1590206479\nISBN-13: 978-1590206478\n\n'A highly readable and comprehensive study of a remarkable product... rare eloquence and passion... a must-read' - Independent. 'Fascinating' - Daily Mail. 'Reading this graphic tale of the global havoc sugar has caused and continues to cause, you might wonder why sugar is not a banned substance; it seems to have done as much harm as opium or heroin... [Abbott's] style is vivid and she's done her research, right back to her sugar plantation Antiguan ancestors. It's a good read - but it might stay your hand next time you reach for a chocolate biscuit to enjoy with your coffee' - Irish Times. 'Zestful... belongs to that recent genre of food histories which have had huge public appeal... Abbott's breezy and energetic style will doubtless find an enthusiastic readership among people keen to make sense of the world around them via the history of this remarkable commodity' - BBC History. 'The blood-drenched history of sugar is carefully mapped in Elizabeth Abbot's impressive overview, which is guaranteed to make you choke on your chocolate - Enlightening and as dismaying as a sugar crash' - Metro. 'Read it and you'll never stir sugar into your coffee or sprinkle it over your berries in quite the same mindless way. I promise' - Montreal Gazette. 'Brilliant and assiduously researched. Abbott writes about the history of sugar with a fluid, fierce narrative power and a vengeful intelligence. Her personal stake in the story - via her own recently discovered West Indian heritage - makes the book all the more compelling' - Quill &amp; Quire. 'A richly dramatic and fascinating history of how sugar Africanized the New World' - Sun Times ","torrent":{"xt":"urn:btih:b7ccfec23bf4a5cc1d37041947cc2eacebdd2f0d","amp;dn":"Sugar+-+Abbot-+%5BHistory%5D+%5BNon-Fiction%5D+Epub_%28K-Slender%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7ccfec23bf4a5cc1d37041947cc2eacebdd2f0d","infoHashBuffer":{"type":"Buffer","data":[183,204,254,194,59,244,165,204,29,55,4,25,71,204,46,172,235,221,47,13]},"announce":[],"urlList":[]}}