{"title":"Modern Electric, Hybrid Electric, and Fuel Cell Vehicles(BBS}","uid":6817860,"size":10378249,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7e42eb745bf9db21c05db0002e15a986ccfffdb&amp;dn=Modern+Electric%2C+Hybrid+Electric%2C+and+Fuel+Cell+Vehicles%28BBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1321289466,"description":"Air pollution, global warming, and the steady decrease in petroleum resources continue to stimulate interest in the development of safe, clean, and highly efficient transportation. Building on the foundation of the bestselling first edition, Modern Electric, Hybrid Electric, and Fuel Cell Vehicles: Fundamentals, Theory, and Design, Second Edition updates and expands its detailed coverage of the vehicle technologies that offer the most promising solutions to these issues affecting the automotive industry.\n\nProven as a useful in-depth resource and comprehensive reference for modern automotive systems engineers, students, and researchers, this book speaks from the perspective of the overall drive train system and not just its individual components\n\nNew to the second edition:\n\n    * A case study appendix that breaks down the Toyota Prius hybrid system\n\n    * Corrections and updates of the material in the first edition\n\n    * Three new chapters on drive train design methodology and control principles\n\n    * A completely rewritten chapter on Fundamentals of Regenerative Braking\n\nEmploying sufficient mathematical rigor, the authors comprehensively cover vehicle performance characteristics, EV and HEV configurations, control strategies, modeling, and simulations for modern vehicles.\n\nThey also cover topics including:\n\n    * Drive train architecture analysis and design methodologies\n\n    * Internal Combustion Engine (ICE)-based drive trains\n\n    * Electric propulsion systems\n\n    * Energy storage systems\n\n    * Regenerative braking\n\n    * Fuel cell applications in vehicles\n\n    * Hybrid-electric drive train design\n\n \n\nThe first edition of this book gave practicing engineers and students a systematic reference to fully understand the essentials of this new technology. This edition introduces newer topics and offers deeper treatments than those included in the first. Revised many times over many years, it will greatly aid engineers, students, researchers, and other professionals who are working in automotive-related industries, as well as those in government and academia.\n\n\n# Hardcover: 557 pages\n# Publisher: CRC Press; 2 edition (September 21, 2009)\n# Language: English\n# ISBN-10: 1420053981\n# ISBN-13: 978-1420053982","torrent":{"xt":"urn:btih:b7e42eb745bf9db21c05db0002e15a986ccfffdb","amp;dn":"Modern+Electric%2C+Hybrid+Electric%2C+and+Fuel+Cell+Vehicles%28BBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7e42eb745bf9db21c05db0002e15a986ccfffdb","infoHashBuffer":{"type":"Buffer","data":[183,228,46,183,69,191,157,178,28,5,219,0,2,225,90,152,108,207,255,219]},"announce":[],"urlList":[]}}