{"title":"The Bible Series - Paul The Apostle","uid":12319368,"size":2739677074,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b864d07fc5b964c3cb417351e4c83a59dfa5f264&amp;dn=The+Bible+Series+-+Paul+The+Apostle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"POtHS11","files":13,"time":1441041712,"description":"Paul The Apostle\n\nDescription:\n\nThis just arrived 3-8-2011. I was pleased with the High Quality of Film work and actors. The Story was very close to what the Bible says and I really enjoyed it. It was informative as it show, the persecution the Early Christians received from the Jews and The Romans.\n\nWhere the Passion ends...the story of Paul begins.\n\nPaul The Apostle -aka- (Saul Of Tarsus) and (St. Paul).\n\nFrom the Emmy award-winning director of Joseph and Jesus comes the story of Paul the Apostle. This miniseries chronicles the life of Christ's most prolific messenger. Paul, originally known as Saul of Tarsus, was a persecutor of Christians until Jesus came to him in a vision. Forever changed, Paul withstood persecution and imprisonment and with unflagging determination he spread the word of Christ. Beautifully shot in the Moroccan desert, Paul the Apostle is a sweeping saga of a man whose story continues after the Passion of Christ.\n\nTravel the road to Damascus and witness Saul's transformation from persecutor to preacher of Christ! Look behind the pages of Scripture to observe political and religious conflicts. As you follow Paul's gospel-spreading journeys, you'll see what life was like for first-century believers. Beautifully filmed on location in Morocco. (Contains some violence.) Approx. 3","torrent":{"xt":"urn:btih:b864d07fc5b964c3cb417351e4c83a59dfa5f264","amp;dn":"The+Bible+Series+-+Paul+The+Apostle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b864d07fc5b964c3cb417351e4c83a59dfa5f264","infoHashBuffer":{"type":"Buffer","data":[184,100,208,127,197,185,100,195,203,65,115,81,228,200,58,89,223,165,242,100]},"announce":[],"urlList":[]}}