{"title":"Los Sopranos Temporadas 1 -6 Ingles Subtitulos EspaÃ&amp;plus","uid":6875792,"size":19424674626,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b8c36d2fdac72a6e92da0fe0ff5d7467ec8e03b7&amp;dn=Los+Sopranos+Temporadas+1+-6+Ingles+Subtitulos+Espa%26Atilde%3B%26plus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"krylonky","files":86,"time":1323416332,"description":"Los Soprano (The Sopranos) es una serie de televisiÃƒÂ³n estadounidense creada y producida por David Chase.\n\nLa serie se estrenÃƒÂ³ en Estados Unidos el 10 de enero de 1999 por el canal de televisiÃƒÂ³n por cable HBO, que la emitiÃƒÂ³ ininterrumpidamente hasta su desenlace, el 10 de junio de 2007. La trama de la serie gira en torno al mafioso de Nueva Jersey Tony Soprano (James Gandolfini) y las dificultades que enfrenta tanto en su hogar como en la organizaciÃƒÂ³n criminal que dirige. A su vez, la serie tambiÃƒÂ©n se centra en la historia de los personajes cercanos a Tony, especialmente su esposa Carmela (Edie Falco) y su sobrino y protegido Christopher Moltisanti (Michael Imperioli).\n\nLa serie abarcÃƒÂ³ un total de seis temporadas y 86 episodios. Fue producida por HBO, Chase Films y Brad Grey Television. El rodaje de la serie se realizÃƒÂ³ entre los Silvercup Studios de Nueva York y diversos escenarios del estado de Nueva Jersey. Los productores ejecutivos a lo largo de su emisiÃƒÂ³n fueron Chase, Brad Grey, Robin Green, Mitchell Burgess, Ilene S. Landress, Terence Winter y Matthew Weiner.\nUn ÃƒÂ©xito crÃƒÂ­tico y comercial, Los Soprano es la serie por cable econÃƒÂ³micamente mÃƒÂ¡s exitosa en la historia de la televisiÃƒÂ³n, y frecuentemente ha sido descrita por la crÃƒÂ­tica como una de las mejores series de televisiÃƒÂ³n de todos los tiempos. La serie destaca por su alto nivel de calidad en todos los aspectos de producciÃƒÂ³n y ha sido especialmente reconocida por su guion y por las actuaciones de sus actores principales.\n\nLos Soprano ha sido acreditado por brindar un gran nivel artÃƒÂ­stico a la televisiÃƒÂ³n media y allanar el camino para el ÃƒÂ©xito de muchas series de ficciÃƒÂ³n que le siguieron. TambiÃƒÂ©n ha ganado numerosos premios y reconocimientos, entre ellos, veintiÃƒÂºn Premios Emmy y cinco Globos de Oro. En 2009 fue elegida la mejor serie de los aÃƒÂ±os 2000 por la publicaciÃƒÂ³n The Hollywood Reporter.","torrent":{"xt":"urn:btih:b8c36d2fdac72a6e92da0fe0ff5d7467ec8e03b7","amp;dn":"Los+Sopranos+Temporadas+1+-6+Ingles+Subtitulos+Espa%26Atilde%3B%26plus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8c36d2fdac72a6e92da0fe0ff5d7467ec8e03b7","infoHashBuffer":{"type":"Buffer","data":[184,195,109,47,218,199,42,110,146,218,15,224,255,93,116,103,236,142,3,183]},"announce":[],"urlList":[]}}