{"title":"HAWAII - Hawaiian Drum Dance Chants - Sounds of Power in Time","uid":4426364,"size":78175724,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b9358a356198a4afb00b0ebd81b99721af51d6d1&amp;dn=HAWAII+-+Hawaiian+Drum+Dance+Chants+-+Sounds+of+Power+in+Time&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starinar","files":42,"time":1223054403,"description":"CLICK ON starinar TO GET MORE TRIBAL AND INDIGENOUS MUSIC. \nBE A MEMBER OF A GLOBAL SeeDeRS TRIBE. MoRE CoMING SooN. ENJoY! \n\n\nHawaiian Drum Dance Chants - Sounds of Power in Time \n\nHawaiian Drum Dance Chants: Sounds of Power in Time is an excellent CD. \nThese vintage recordings are true Hawaiian Hula Pahu songs, performed by \nsome of the last few people familar with traditional Hawaiian culture. \nAs the introductory notes say, this is music with a cultural and religious \nsignificance and deserves to be treated as such. Now that that has been \nstated, the music itself is well worth listening to. It is sung in Hawaiian, \ncomplete with linear notes, in both Hawaiian and English. I found the \ntranslations to be quite enjoyable, especially as they are presented in \nmetric form. Unlike most other non-western forms of music, Hawaiian music \nisn't that unfamilar to western ears. Even if you don't speak Hawaiian, \nyou probably can appreciate this deeply moving collection of music. The \nfirst six tracks are actually more &quot;contemporary&quot; Hula Pahu songs. Of them, \nMele Pule, Mele Kahea and Hanohano ka uka o Pihanakalani are perhaps the most \nenjoyable. From then on, we are given traditional and historical recordings \nfrom the Bishop museum. These are some of the best parts of the CD. Astute ears \nwill notice some key differences between these and previous tracks. Nonetheless, \nit remains quite enjoyable. Even though the quality of some of these tracks \nis a little scratchy, it is still an excellent CD. \n\nQuality: 192Kbps + full booklet scans","torrent":{"xt":"urn:btih:b9358a356198a4afb00b0ebd81b99721af51d6d1","amp;dn":"HAWAII+-+Hawaiian+Drum+Dance+Chants+-+Sounds+of+Power+in+Time","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9358a356198a4afb00b0ebd81b99721af51d6d1","infoHashBuffer":{"type":"Buffer","data":[185,53,138,53,97,152,164,175,176,11,14,189,129,185,151,33,175,81,214,209]},"announce":[],"urlList":[]}}