{"title":"Homebrew Military &amp; Espionage Electronics (Site Mirror)","uid":4555408,"size":754399324,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b9b38494947d0060098947b70fe786b21bad5b64&amp;dn=Homebrew+Military+%26+Espionage+Electronics+%28Site+Mirror%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":1,"time":1228465261,"description":"This is a currently active website, but in case anything ever happens to them, I am putting this up for you guys to download.  It is such a large amount of useful information.....I would feel terrible to have it lost forever without a copy floating around.  Besides, that folder 404's a lot, and people in various countries cannot connect to it....(I wonder why)\n\nIt is a folder on this website:\nhttp://www.qsl.net/n9zia/\n\nAnd here is the folder I spidered:\nhttp://projects1.gbppr.org/mil/index.html\nRead my top description, it is down a lot, so here is a full copy of it to look at uninterrupted.\n\nSo you all have an idea of what this contains:\n-  GPS/Cell Phone/Wifi/Bluetooth/Video Camera/Night Vision Jammers\n-  Infrared Beacon\n-  Phone Line Harassment Devices\n-  MIRT's (Mobile Infrared Transmitters....the things that change traffic lights)\n-  Voice Scrambers/Descramblers\n-  Various EMP Devices\n-  MUCH more....\n\n98 Projects total, each one with detailed blueprints, and dozens of links.  This information is extremely rare to find in one place.  Even if you won't actually make any of this stuff, believe me when I say it makes damn good reading material. :)\n\nIMPORTANT, READ THIS:  This mirror ONLY has the data stored on this website.  Any external links (to other sites) are not on here.  If this wasn't the case, this torrent would have spidered at least a thousand other pages/sites, which would have increased this torrent's size exponentially.  If there are any projects you find useful, interesting, or want to save, it is up to YOU to save the external links for yourself.  If you ever want to see another site spidered, by all means let me know, either here or via PM at Roguesci.  Furthermore, the site HAD to be put in a rar because the torrent file was too large for TPB (due to so many tiny files).  It will extract into a ~810MB folder.\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:b9b38494947d0060098947b70fe786b21bad5b64","amp;dn":"Homebrew+Military+%26+Espionage+Electronics+%28Site+Mirror%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9b38494947d0060098947b70fe786b21bad5b64","infoHashBuffer":{"type":"Buffer","data":[185,179,132,148,148,125,0,96,9,137,71,183,15,231,134,178,27,173,91,100]},"announce":[],"urlList":[]}}