{"title":"Codice.Genesi.2010.iTALiAN.MD.TS.XViD-THEMA.[bt-evolution.net]","uid":5394785,"size":741390543,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ba19f4185e64823cfc13dc0ea3b23f1cb65cb877&amp;dn=Codice.Genesi.2010.iTALiAN.MD.TS.XViD-THEMA.%5Bbt-evolution.net%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"OverNight","files":2,"time":1267192151,"description":"Codice Genesi\n\nTitolo originale:  The Book of Eli \nNazione:  U.S.A. \nAnno:  2010 \nGenere:  Azione, Drammatico \nDurata:  117' \nRegia:  Albert Hughes, Allen Hughes \nSito ufficiale:  www.sonypictures.net/movies/bookofeli \nSito italiano:  www.multiplayer.it/codicegenesi \n\n \nCast:  Denzel Washington, Gary Oldman, Mila Kunis, Ray Stevenson, Jennifer Beals, Francesca De La Tour, Michael Gambon, Joe Pingue, Richard Cetrone \nProduzione:  Silver Pictures \nDistribuzione:  01 Distribution \nData di uscita:  26 Febbraio 2010 (cinema) \n\nTrama:\nIn un futuro non troppo lontano, circa 30 anni dopo l'ultima guerra, un uomo attraversa in solitudine la terra desolata che un tempo era l'America. Intorno a lui cittÃƒÂ  abbandonate, autostrade interrotte, campi inariditi - i segni di una catastrofica distruzione. Non c'ÃƒÂ¨ civiltÃƒÂ , nÃƒÂ© legge. Le strade sono in mano a bande che ucciderebbero un uomo pur di togliergli le scarpe, o per un po' d'acqua... ma anche senza motivo. Ma non possono far nulla contro questo viaggiatore. Guerriero non per scelta ma per necessitÃƒÂ , Eli (Denzel Washington) cerca solo la pace, ma se viene sfidato elimina gli avversari prima ancora che si accorgano dell'errore fatale che hanno commesso. Non ÃƒÂ¨ la propria vita che difende cosÃƒÂ¬ ferocemente, ma la speranza per il futuro; una speranza che porta con sÃƒÂ© e protegge da 30 anni ed ÃƒÂ¨ determinato a realizzare. Spinto da questo impegno e guidato dalla fede in qualcosa piÃƒÂ¹ grande di lui, Eli fa quello che deve per sopravvivere - e va avanti. Solo un altro uomo in quel mondo in rovina comprende il potere che Eli detiene, ed ÃƒÂ¨ deciso a impadronirsene: Carnegie (Gary Oldman), il despota di una precaria cittÃƒÂ  di ladri e killer. Ma la figlia adottiva di Carnegie, Solara (Mila Kunis) ÃƒÂ¨ affascinata da Eli per un altro motivo, la visione di qualcosa che puÃƒÂ² esistere oltre i confini del territorio dominato dal patrigno. Ma nessuno dei due riuscirÃƒÂ  a distoglierlo dal suo impegno. Niente - e nessuno - puÃƒÂ² mettersi sulla sua strada. Eli deve andare avanti per compiere il suo destino e portare aiuto a un'umanitÃƒÂ  devastata.\n\n","torrent":{"xt":"urn:btih:ba19f4185e64823cfc13dc0ea3b23f1cb65cb877","amp;dn":"Codice.Genesi.2010.iTALiAN.MD.TS.XViD-THEMA.%5Bbt-evolution.net%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba19f4185e64823cfc13dc0ea3b23f1cb65cb877","infoHashBuffer":{"type":"Buffer","data":[186,25,244,24,94,100,130,60,252,19,220,14,163,178,63,28,182,92,184,119]},"announce":[],"urlList":[]}}