{"title":"Ruth Mazo Karras - Common Women. Prostitution and Sexuality in M","uid":10292102,"size":16199471,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba4f28ac26df77718de8a464793609233cfd0ed3&amp;dn=Ruth+Mazo+Karras+-+Common+Women.+Prostitution+and+Sexuality+in+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Anette14","files":-1,"time":1401873359,"description":"Description\nProduct Details\nBook Title: Common Women: Prostitution and Sexuality in Medieval England (Studies in the History of Sexuality)\t\nBook Author: Ruth Mazo Karras\nSeries: Studies in the History of Sexuality\nHardcover: 232 pages\nPublisher: Oxford University Press (March 14, 1996)\nLanguage: English\nISBN-10: 0195062426\nISBN-13: 978-0195062427\n\n===================================================================================\nBook Description\nPublication Date: March 14, 1996 | ISBN-10: 0195062426 | ISBN-13: 978-0195062427\n&quot;Common women&quot; in medieval England were prostitutes, whose distinguishing feature was not that they took money for sex but that they belonged to all men in common. Common Women: Prostitution and Sexuality in Medieval England tells the stories of these women's lives: their entrance into the trade because of poor job and marriage prospects or because of seduction or rape; their experiences as streetwalkers, brothel workers or the medieval equivalent of call girls; their customers, from poor apprentices to priests to wealthy foreign merchants; and their relations with those among whom they lived.\nCommon Women crosses the boundary from social to cultural history by asking not only about the experiences of prostitutes but also about the meaning of prostitution in medieval culture. The teachings of the church attributed both lust and greed, in generous measure, to women as a group. Stories of repentant whores were popular among medieval preachers and writers because prostitutes were the epitome of feminine sin.\nThrough a sensitive use of a wide variety of imaginative and didactic texts, Ruth Karras shows that while prostitutes as individuals were marginalized within medieval culture, prostitution as an institution was central to the medieval understanding of what it meant to be a woman. This important work will be of interest to scholars and students of history, women's studies, and the history of sexuality.\n\n===================================================================================\nReviews\n&quot;Ruth Karras's new book will become a standard text on medieval prostitution, but it will also be required reading for anyone interested in gender, sexuality, and women in the middle ages. Drawing on literary texts, religious materials, legal documentation, and other sources, Karras places prostitutes--so often seen as marginal and atypical women--at the center of gender relations in medieval England. Her sophisticated and compelling argument is a major contribution to women's history, gender history, and medieval history.&quot;--Judith Bennett, University of North Carolina, Chapel Hill\n\n&quot;A study of prostitution should reveal the convergence of many social forces: fear of female sexuality and venality, the fine line between approved and condemned behavior, the regulation of commercial activity, the double standard, and the distinction between the moral economy of the neighborhood and that of the fathers of society. Ruth Karras touches all these points and also turns to the voice of creative and sermon literature, as well as case studies, to put flesh on the tale.&quot;--Joel Rosenthal, State University of New York, Stony Brook\n\n&quot;Ruth Karras here again displays her extraordinary ability to unpack the medieval meanings of twentieth-century terms that do not adequately describe medieval phenomena. Her study replaces the modern concept of prostitution with the more accurate and very wide-ranging term &quot;whoredom&quot;, bringing to bear and synthesizing a vast array of sources, from the legal and archival to the literary, artistic, and theological.&quot;--Edward Peters, University of Pennsylvania\n\n&quot;A worthy addition to Studies in the History of Sexuality. In Common Women Ruth Karras argues that while it is clear enough that commercial prostitutes inhabited [late medieval English] towns, what marked these women was not &quot;money for sex&quot; but their general availability to men. Their behavior, viewed as both socially necessary and individually depraved, is examined in terms of law, society, the life course of a prostitute and prevailing ideas about sin. This thorough-going study yields valuable perspectives on women's position in medieval society.&quot;--Susan Mosher Stuard, Haverford College\n\n===================================================================================\nAbout the Author\nRuth Mazo Karras is at Temple University.\n===================================================================================","torrent":{"xt":"urn:btih:ba4f28ac26df77718de8a464793609233cfd0ed3","amp;dn":"Ruth+Mazo+Karras+-+Common+Women.+Prostitution+and+Sexuality+in+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba4f28ac26df77718de8a464793609233cfd0ed3","infoHashBuffer":{"type":"Buffer","data":[186,79,40,172,38,223,119,113,141,232,164,100,121,54,9,35,60,253,14,211]},"announce":[],"urlList":[]}}