{"title":"American Desire XXX DVDRip","uid":11920703,"size":1540538162,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:bae0f75bd36e5f41824d3aaa7c9d052cb9d01105&amp;dn=American+Desire+XXX+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"HighCode","files":26,"time":1431625485,"description":"American Desire XXX DVDRip\n\n&quot;From legendary porn director Lasse Braun comes this explosive 1981 look at suburban lust and desire. Statuesque stunner Veronica Hart and Robert Bolla star as a couple who find that the spark has gone out of their marriage. They decide to try and perk things up by taking separate vacations -- and by taking new lovers while on those vacations! Veronica goes back to her father's house, where she's astounded to find him engaged in a feverish frolic with Asian strumpet Mai Lin. Her world gets turned upside down when she visits her grandfather's old house. Veronica is confronted by the swarthy owner of the home, and he forces himself on her in a scene of pure sexual frisson. This erotic experience changes Veronica's life forever, and she finds herself turning into the wanton sex goddess that she's always yearned to be. Meanwhile, Robert is back at home, romping with masochistic hooker Lysa Thatcher in a heated hayloft humdinger. In the end, Veronica and Robert are reunited and find that their separate experiences have brought them closer together than ever before. Shot on location in New England, this is an exceedingly well-made and well-acted feature. Veronica Hart turns in one of her all-time classic performances, perfectly capturing the hunger and allure of her character. 'American Desire' is without a doubt one of the true classics of 80s porn.&quot;\n\nScreenshots: &lt;a href=&quot;\nhttp://imgclover.com/image/OAT&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/OAT&lt;/a&gt; &lt;a href=&quot;\nhttp://imgclover.com/image/OA0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/OA0&lt;/a&gt;","torrent":{"xt":"urn:btih:bae0f75bd36e5f41824d3aaa7c9d052cb9d01105","amp;dn":"American+Desire+XXX+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bae0f75bd36e5f41824d3aaa7c9d052cb9d01105","infoHashBuffer":{"type":"Buffer","data":[186,224,247,91,211,110,95,65,130,77,58,170,124,157,5,44,185,208,17,5]},"announce":[],"urlList":[]}}