{"title":"Borderlands 2 ENG v1.7.0 by [R.G. Catalyst] uploaded~DoN","uid":8646506,"size":6222247545,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bbc69138104ade9c2088e382fb5fe0f910e0321b&amp;dn=Borderlands+2+ENG+v1.7.0+by+%5BR.G.+Catalyst%5D+uploaded%7EDoN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"DoN_Vinny","files":35,"time":1372997631,"description":"\n\nINFO:\n\nâ–ª Released: 2012\nâ–ª Genre: Action (Shooter) / 3D / 1st Person\nâ–ª Developer: Gearbox Software\nâ–ª Publisher: 2K Games\nâ–ª Publisher in Russia: 1C-SoftKlab\n\nâ–ª Game Version: 1.5.0u2 (1.7.0)\n\nâ–ª Language : English\nâ–ª Language voice: English\nâ–ª Publication Type: Repack\nâ–ª Tablet: N  A\n\n     SYSTEM REQUIREMENTS:\n\nâˆš Operating system: Windows Â® XP SP3 / Windows Â® Vista SP2 / Windows Â® 7 SP1\nâˆš Processor: Intel Core 2 Duo processor with a clock speed of 2.4 GHz\nâˆš RAM: 2 GB\nâˆš Video: 256 MB VRAM (NVIDIA GeForce 8500 / ATI Radeon HD 2600)\nâˆš Sound Card: DirectX 9.0c compatible\nâˆš Free hard drive space: 13 GB\n\n     DESCRIPTION:\n\n    In a team with three colleagues on the network, or together with a friend in the good old split screen mode go to the raid on the still unexplored areas of Pandora to seek adventure on the ... head.\n\nChoose a hero and how it should fit a - by tradition at your disposal a huge arsenal of weapons, ammunition and equipment - and more and more. Items on Pandora generated automatically, and you can never know in advance what kind of gun will be in the near inbox! Discover new secrets of Pandora, Suck character as the assignments, make friends and make enemies - become the hero of his own story full of surprises in the world of Borderlands!\n\n     GAME FEATURES:\n\n&quot; The new face.\n&quot; Experience in the fighter's new class called &quot;ShizostrelÂ» (Gunzerker). This big guy, little man is so strong that is easily controlled with any two guns at once. Do you want to water the enemy a lead of a pair of heavy-handed guns? No problem! Or maybe you like the twin rocket launchers? Easily! Two snipers? Does not matter! Your tactics plus firepower Shizostrela - the naive enemy no chance to survive!\n&quot; punitive detachment.\n&quot; Have fun with your friends, joining the team on the Internet or local network. Get involved in the campaign and get out of it at any time, it does not hurt your fellow adventures continue - no need to restart the game. Moreover, all purchased equipment you can use in every new game!\n&quot; That story yet.\n&quot; This time your stay in the world of Borderlands begin with, you'll find yourself thrown in the midst of destruction icy tundra. Will find out who and why he had behaved so with you to find the offender and, of course, to take revenge on him ... on the first number. You will have to examine the ownership of the corporation &quot;Hyperion&quot; and the encounter with the villain universal scale - its director, known as Handsome Jack.\n&quot; Armory workshop.\n&quot; new generation of weapons system allows the game to make a truly incredible amount of means of destruction. All what you can imagine! Electricity, fire, acid and other &quot;additions&quot; to the good old lead will be at your disposal to rebuff the forces of &quot;Hyperion&quot;.\n&quot; An endless array of ... everything!\n&quot; unique system for creating game objects - an inexhaustible source of not only the most fantastic weapons but also other equipment, including shields, grenades, alien artifacts ... There are all sorts of things! And do not forget the tons of all kinds of goodness from the original Borderlands!\n&quot; in distant lands.\n&quot; Take an expedition to the unexplored areas of Pandora that will surprise you with a variety of landscapes and scenery. You will frosty tundra, green meadows full of dangers and mysterious underground caves.\n&quot; Interesting dating.\n&quot; And as much as the inhabitants of Pandora unprecedented look forward to seeing you! Huge, something looking like gorillas, mordoplyui (Bullymongs), the ruthless predatory Crookshanks (Stalkers) and an army of mechminds &quot;Hyperion&quot;, led by Handsome Jack - only a few of unimaginable monsters, avoid a meeting with whom you would never come out. And not very much and wanted! The guns at the ready!\n\n     Features repack:\n\n\nDo not recoded / no cut\nDLC: Collector's Edition Pack, Creature Slaughterdome, Premiere Club, Ultimate Vault Hunter Upgrade Pack, Assassin Pack, Commando Pack, Gunzerker Pack, Mechromancer Pack, Siren Pack, Psycho Pack, Captain Scarlett and her Pirate's Booty, Mr.Torgue 's Campaign of Carnage, Sir Hammerlock's Big Game Hunt, Tiny Tina's Assault on Dragon Keep\n\nInstallation time ~ 10 min.\n","torrent":{"xt":"urn:btih:bbc69138104ade9c2088e382fb5fe0f910e0321b","amp;dn":"Borderlands+2+ENG+v1.7.0+by+%5BR.G.+Catalyst%5D+uploaded%7EDoN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbc69138104ade9c2088e382fb5fe0f910e0321b","infoHashBuffer":{"type":"Buffer","data":[187,198,145,56,16,74,222,156,32,136,227,130,251,95,224,249,16,224,50,27]},"announce":[],"urlList":[]}}