{"title":"James Deen's Big Boob Massage Movie (James Deen, Evil Angel / 20","uid":9392266,"size":1785278289,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:bc150f4ee3b3596b0a62db61904c525a7feab70d&amp;dn=James+Deen%27s+Big+Boob+Massage+Movie+%28James+Deen%2C+Evil+Angel+%2F+20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"SplashPt","files":1,"time":1387905210,"description":"James Deen's Big Boob Massage Movie (James Deen, Evil Angel / 2013)\n\nPorn stud, hard-core director and mainstream crossover star James Deen has created another hybrid niche for fans of creative smut making. 'James Deen's Big Boob Massage Movie' combines the sensuality of erotic massage with the tit-lover's fetish for stacked females. The movie features a cast of generously endowed ladies and prominently features their big, up-front assets in intimate sexual encounters. The only thing hotter than huge, well-oiled boobies in your hands or pressed against your back is having them wrapped around your slippery cock shaft! Sultry brunette Ava Addams rubs her greasy globes against the director's cock and balls; hungrily she slurps on his fat dick in a sensuous titty fuck. James relentlessly plows the mature slut and spurts love goo into Ava's ample cleavage!\n\nTop-heavy, tattooed sexpot Alison Tyler enjoys some intimate, powerful mammary manipulation and passionate pounding from Latin stud Ramon. Lusty, busty blonde Olivia Blu can't draw boyfriend Erik Everhard's attention until she coats her big, hanging knockers with oil and presses them against his bare back. Professional masseuse Carolyn Reese shows up at James' apartment for a session, but when she learns of his porn career, she can't resist a slippery walk on the nasty side. James gives gorgeous April O'Neil a slow, sensual rubdown, paying close attention to her perfect ass, shapely legs, adorable bare feet and those bodacious ta-tas. He porks her pussy before splattering April's generous chest with hot semen. 'James Deen's Big Boob Massage Movie' is part nut-buster, part bust-nutter!\n\nCarolyn Reese, Ava Addams, Alison Tyler, Olivia Blu, James Deen, April O'Neil\n\nAll Sex, Big Tits\n\nScreens:\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=7jmnnrbvtgnp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=7jmnnrbvtgnp.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=qt8jvemhimp0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=qt8jvemhimp0.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:bc150f4ee3b3596b0a62db61904c525a7feab70d","amp;dn":"James+Deen%27s+Big+Boob+Massage+Movie+%28James+Deen%2C+Evil+Angel+%2F+20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc150f4ee3b3596b0a62db61904c525a7feab70d","infoHashBuffer":{"type":"Buffer","data":[188,21,15,78,227,179,89,107,10,98,219,97,144,76,82,90,127,234,183,13]},"announce":[],"urlList":[]}}