{"title":"Case Studies in Modern Drug Discovery and Development [PDF] [Sto","uid":10292609,"size":17009254,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc1f3a91eb5c0da465a2f13df29d727cdbc5f4ef&amp;dn=Case+Studies+in+Modern+Drug+Discovery+and+Development+%5BPDF%5D+%5BSto&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"0xmovva","files":-1,"time":1401879726,"description":"Author: Xianhai Huang, Robert G. Aslanian\nHardcover: 472 pages\nPublisher: Wiley; 1 edition (June 5, 2012)\nLanguage: English\nISBN-10: 0470601817\nISBN-13: 978-0470601815\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n___________________________________________________________________________________\n\nLearn why some drug discovery and development efforts succeed . . . and others fail\n\nWritten by international experts in drug discovery and development, this book sets forth carefully researched and analyzed case studies of both successful and failed drug discovery and development efforts, enabling medicinal chemists and pharmaceutical scientists to learn from actual examples. Each case study focuses on a particular drug and therapeutic target, guiding readers through the drug discovery and development process, including drug design rationale, structure-activity relationships, pharmacology, drug metabolism, biology, and clinical studies.\n\nCase Studies in Modern Drug Discovery and Development begins with an introductory chapter that puts into perspective the underlying issues facing the pharmaceutical industry and provides insight into future research opportunities. Next, there are fourteen detailed case studies, examining:\n\nAll phases of drug discovery and development from initial idea to commercialization\n\nSome of today's most important and life-saving medications\n\nDrugs designed for different therapeutic areas such as cardiovascular disease, infection, inflammation, cancer, metabolic syndrome, and allergies\n\nExamples of prodrugs and inhaled drugs\n\nReasons why certain drugs failed to advance to market despite major research investments\n\nEach chapter ends with a list of references leading to the primary literature. There are also plenty of tables and illustrations to help readers fully understand key concepts, processes, and technologies.\n\nImproving the success rate of the drug discovery and development process is paramount to the pharmaceutical industry. With this book as their guide, readers can learn from both successful and unsuccessful efforts in order to apply tested and proven science and technologies that increase the probability of success for new drug discovery and development projects.","torrent":{"xt":"urn:btih:bc1f3a91eb5c0da465a2f13df29d727cdbc5f4ef","amp;dn":"Case+Studies+in+Modern+Drug+Discovery+and+Development+%5BPDF%5D+%5BSto","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc1f3a91eb5c0da465a2f13df29d727cdbc5f4ef","infoHashBuffer":{"type":"Buffer","data":[188,31,58,145,235,92,13,164,101,162,241,61,242,157,114,124,219,197,244,239]},"announce":[],"urlList":[]}}