{"title":"[SoM]Swing Kids - Giovani Ribelli[DvdRip-Xvid-Ita-Eng-Mp3]","uid":4848516,"size":1302325248,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bc477f57e9de62f2328371793dfcc4a40f0e4580&amp;dn=%5BSoM%5DSwing+Kids+-+Giovani+Ribelli%5BDvdRip-Xvid-Ita-Eng-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mitimex","files":2,"time":1239784150,"description":"Spoken language(s):Italiano - Inglese\n\nAd Amburgo nel 1939, mentre Hitler sta portando la Germania verso la guerra, i ragazzi iscritti alla Hitlerjugend, sottoposti ad una severa disciplina, vengono spinti da una propaganda al fanatismo verso il Fuhrer e all'odio verso gli ebrei. Ma un gruppo di giovani tedeschi ribelli detti &quot;Swing Kids&quot;, entusiasti della musica da ballo americana, ascoltano di nascosto dischi di Benny Goodman, Count Basic, vestono elegantemente all'inglese, portano i capelli piuttosto lunghi e si riuniscono di notte a ballare e a suonare al CafÃƒÂ¨ Bismark, dove si scatenano nelle nuove danze americane. Essi fanno della swing un simbolo di rivolta. Fra questi ci sono tre amici, studenti diciassettenni: Peter Muller, figlio di un grande violinista classico, morto in una prigione nazista; Thomas Berger, di ricca famiglia borghese e Arvid, un ebreo claudicante, chitarrista abilissimo e collezionista di dischi di swing. PoichÃƒÂ© si sente ancora sorvegliata, a causa del defunto marito, la bella signora Muller, che vuol proteggere i due figli, Peter e il piccolo Willi, accetta la protezione di un potente membro della Gestapo, il quale ha fatto liberare Peter, arrestato per una bravata, e cerca di insinuarsi nella famiglia Muller e di servirsi del ragazzo come spia, senza che egli se ne accorga. Ma Peter lo detesta, perchÃƒÂ© teme che gli prenda il posto del padre. Tuttavia il ragazzo ÃƒÂ¨ costretto ad iscriversi alla Hitlerjugend, subito seguito dall'inseparabile Thomas. I due credono di poter far parte di giorno della GioventÃƒÂ¹ hitleriana e di notte ritornare fra gli Swing Kids. Ma la realtÃƒÂ  ÃƒÂ¨ dura. Arvid perseguitato, picchiato e disperato, si suicida, e la sua morte divide Peter e Thomas. Intanto Muller scopre che il libraio Schumler lo manda a consegnare, dentro finti pacchi di libri, delle false carte di identitÃƒÂ  per ebrei perseguitati, ma non denuncia il fatto, mentre Thomas provoca l'arresto del proprio padre, denunciandolo perchÃƒÂ© ha parlato male di Hitler. In seguito Peter insospettito da alcuni pacchetti affidatigli dai nazisti e apertone uno, vi trova le ceneri e la fede nunziale di un uomo assassinato e inorridisce. Esaltato dal ricordo dell'eroico padre, il giovane scaccia di casa il dirigente della Gestapo, poi torna a ballare fra gli Swing Kids e viene arrestato in una retata dei nazisti, fra i quali si trova Thomas, che prima lotta con lui, poi lo spinge a fuggire per salvarlo. Stavolta l'ambiguo uomo della Gestapo lascia arrestare il ribelle.","torrent":{"xt":"urn:btih:bc477f57e9de62f2328371793dfcc4a40f0e4580","amp;dn":"%5BSoM%5DSwing+Kids+-+Giovani+Ribelli%5BDvdRip-Xvid-Ita-Eng-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc477f57e9de62f2328371793dfcc4a40f0e4580","infoHashBuffer":{"type":"Buffer","data":[188,71,127,87,233,222,98,242,50,131,113,121,61,252,196,164,15,14,69,128]},"announce":[],"urlList":[]}}