{"title":"Bioactive Compounds from Natural Sources - Isolation, Characteri","uid":15559285,"size":6933032,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc4b49905963dde841b0e8e94eeba11aa187a1ff&amp;dn=Bioactive+Compounds+from+Natural+Sources+-+Isolation%2C+Characteri&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1471107431,"description":"Bioactive Compounds from Natural Sources - Isolation, Characterization and Biological Properties - C. Tringali (Taylor &amp; Francis, 2001).pdf\r\n\r\nInterest in obtaining biologically active compounds from natural sources has recently spiked due to their low toxicity, complete biodegradability, availability from renewable sources, and in most cases, low cost. Taking an interdisciplinary approach, Bioactive Compounds from Natural Sources: Isolation, Characterization, and Biological Properties covers general methods and main topics in the research field of bioactive natural products. \r\n\r\nThe book describes general screening methods, modern HPLC hyphenated techniques, and NMR methods in the structural elucidation of compounds and devotes individual chapters to specific topics of research. Surveys on compounds displaying important pharmacological activities are presented in chapters devoted to Mexican medicinal plants, anti-tumor drugs of natural origin, cancer chemopreventive flavonoids, and metabolites displaying anti-HIV, antioxidative, antimalarial, and anti-inflammatory activity. The final chapters are devoted to representative examples of research into marine metabolites: immunomodulating marine glycolipids and surveys of bioactive compounds from marine opisthobranchs and Japanese soft corals.\r\n\r\nWith its focus on modern approaches to the isolation of biologically active natural products, this book encourages interdisciplinary work among chemists, pharmacologists, biologists, botanists, and agronomists with an interest in bioactive natural products","torrent":{"xt":"urn:btih:bc4b49905963dde841b0e8e94eeba11aa187a1ff","amp;dn":"Bioactive+Compounds+from+Natural+Sources+-+Isolation%2C+Characteri","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc4b49905963dde841b0e8e94eeba11aa187a1ff","infoHashBuffer":{"type":"Buffer","data":[188,75,73,144,89,99,221,232,65,176,232,233,78,235,161,26,161,135,161,255]},"announce":[],"urlList":[]}}