{"title":"Ministry -Mind is a Terrible Thing To Taste@320- Rovhal_Knullare","uid":4290909,"size":120811228,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bcaf828531d6b68d90cc127598f541bd89edf1b5&amp;dn=Ministry+-Mind+is+a+Terrible+Thing+To+Taste%40320-+Rovhal_Knullare&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"rovhal_knullare","files":-1,"time":1215895133,"description":"** Ministry **\n** The Mind is a Terrible Thing to Taste ** &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Ministry_(band)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Ministry_(band)&lt;/a&gt;\n\nBitrate : 320\nSample  : 44.1khz\nGenre   : Industrial, Metal, Speedmetal, Hardcore\n\n\nThe Mind is a Terrible Thing to Taste (1989?1991)\n\nThe follow-up, The Mind Is a Terrible Thing to Taste was just as acclaimed, if not more, than The Land of Rape and Honey. Both albums included similar tight, thick soundscapes, but The Mind Is a Terrible Thing to Taste was slightly harder with Jourgensen's heavy metal-influenced guitar more emphasized. The Mind Is a Terrible Thing to Taste was supported by the RollerBall tour through 1990. Due to the complex nature of the album's drumming, a second drummer, Martin Atkins, was used. This tour was documented on In Case You Didn't Feel Like Showing Up. Three singles were released from the album, Burning Inside (for which a video was made), Thieves and So What (a composition inspired by the movie The Violent Years).\n\nThroughout the late 1980s Jourgensen and Barker expanded their ideas beyond Ministry into a seemingly endless parade of side projects and collaborations. Many of these bore Ministry's signature sound and the duo's Hypo Luxa/Hermes Pan production imprint. (These side-projects were also responsible for the delayed release of Ministry's next album.) Foremost of these was Ministry's alter ego, the Revolting Cocks. RevCo, as it is often referred to, was essentially the same band plus Belgian vocalist Luc Van Acker &amp; Richard 23 of Front 242. Jourgensen and Barker also formed Lard with Dead Kennedys frontman Jello Biafra, Acid Horse with Cabaret Voltaire, 1000 Homo DJs with Nine Inch Nails Trent Reznor, PTP with Chris Connelly and Pailhead with Ian MacKaye of Minor Threat and Fugazi. Barker released his own material as Lead Into Gold and Jourgensen produced and played electric guitar on Skinny Puppy's Rabies LP. Atkins and Rieflin also formed the band Pigface, which featured Barker on several tracks, as well. The smaller of these projects were later collected on the CD Side Trax (Rykodisc Records, 2004), while the discographies of Lard and RevCo were remastered and reissued.\n\nFile List:\n\nfilelist.txt\n01 Ministry - Thieves.mp3            \n02 Ministry - Burning Inside.mp3     \n03 Ministry - Never Believe.mp3      \n04 Ministry - Cannibal Song.mp3      \n05 Ministry - Breathe.mp3 \n06 Ministry - So What.mp3\n07 Ministry - Test.mp3    \n08 Ministry - Faith Collapsing.mp3 \n09 Ministry - Dream Song.mp3      \n\n              10 File(s)    120,808,576 bytes\n\nIf you love George Bush, you won't seed. &lt;a href=&quot;\nhttp://www.thepiratebay.se/user/rovhal_knullare&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thepiratebay.se/user/rovhal_knullare&lt;/a&gt;","torrent":{"xt":"urn:btih:bcaf828531d6b68d90cc127598f541bd89edf1b5","amp;dn":"Ministry+-Mind+is+a+Terrible+Thing+To+Taste%40320-+Rovhal_Knullare","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcaf828531d6b68d90cc127598f541bd89edf1b5","infoHashBuffer":{"type":"Buffer","data":[188,175,130,133,49,214,182,141,144,204,18,117,152,245,65,189,137,237,241,181]},"announce":[],"urlList":[]}}