{"title":"(Blues) McHouston Mickey Baker - Mississippi Delta Dues","uid":6432133,"size":115542552,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bd4087419ce58d48626b66fb0f18584738954e8b&amp;dn=%28Blues%29+McHouston+Mickey+Baker+-+Mississippi+Delta+Dues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1306690465,"description":"mp3   320kbps\n\n\nAlbum: Mississippi Delta Dues\nGenre: Blues\nStyles: Acoustic Delta Blues, East Coast Blues\nRecorded: 1973\nReleased: LP in 1973/CD in 1993\nLabel: Blue Star(LP) Verve/Polygram(CD)\n\n\n1. Good Advice - 3:05\n2. High Sheriff Blues - 3:41\n3. Blues Before Sunrise - 3:44\n4. Terraplane Blues - 2:52\n5. Animal Farm - 3:33\n6. Alabama March - 3:30\n7. Spoonful - 3:02\n8. Sun Is Going Down - 3:45\n9. Sweet Home Chicago - 3:28\n10. My Black Woman - 2:47\n11. Can't Find My baby - 3:27\n12. Trouble Is A Woman - 3:30\n13. Lazy Daisy - 2:55\n14. Drucilla - 4:18\n\nPersonnel:\nMcHouston 'Mickey' Baker - Acoustic Guitar, Vocal\nStefan Grossman - Acoustic Guitar, Vocal\nwith\nThe London String Orchestra and Bass, Bongo, Drums &amp; Various Percussion\n\nMcHouston Baker was born in Louisville, Kentucky. By The Time he was 16 he was living in New York, where he became a leading session guitarist on blues and R'n'B recordings for labels such as Savoy and Atlantic. He formed duet, Mickey &amp; Sylvia, with singer Sylvia Vanderpool and they had hit in 1957 with 'Love Is Strange'. Moving in 1961 to France, he worked with Memphis Slim and as all-purpose arranger and wrote several guitar tutors. He still lives in France but has not been active in blues for some time.\nDuring the '70s Baker occasionally played unplugged gigs, surprising listeners who knew him only as an electric guitarist with his decorous reading of old blues. This is the aspect of his music presented by 'Mississippi Delta Dues' on which he plays old blues repertoire with acoustic guitar, assisted by Stefan Grossman and percussionist Ray cooper. For some tracks, too, he arranged string parts, generally providing cenventional orchestral colouring, painting a more impressionic backdrop, inspired, he revals, by the work of the composers Penderecki(POLAND!) and Xenakis(GREEK).\nOn its first issue the album was not greeted with much enthusiasm, no doubt because, in Baker's words, 'it went against the grain of the sentiments of blues purist...[and] we deliberately chose to ignore that mentality'. Thirty-odds years later, listeners will be more accustomed to textural experiment and Baker's strings are unlikely to frighten the horses. Their potency is uneven, but it's hard to discern any enhancement of the material in the setting of Son House's 'My Black Woman'. The original album was recorded in Paris, and on CD is expanded by two previously unreissued pieces. Released on USA in 2006 has jet one more pieces.\n","torrent":{"xt":"urn:btih:bd4087419ce58d48626b66fb0f18584738954e8b","amp;dn":"%28Blues%29+McHouston+Mickey+Baker+-+Mississippi+Delta+Dues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd4087419ce58d48626b66fb0f18584738954e8b","infoHashBuffer":{"type":"Buffer","data":[189,64,135,65,156,229,141,72,98,107,102,251,15,24,88,71,56,149,78,139]},"announce":[],"urlList":[]}}