{"title":"Inside.The.Factory.s02e05.Sweets.EN.SUB.x264.MPup","uid":15650191,"size":1064119348,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:be3df540f304783aa26835995f0ea261479289a9&amp;dn=Inside.The.Factory.s02e05.Sweets.EN.SUB.x264.MPup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"makinapufterpup","files":2,"time":1472086902,"description":"Inside.The.Factory.How.Our.Favourite.Foods.Are.Made.s02e05.Sweets.EN.SUB.MPEG4.x264.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\n\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nIn the fifth episode of Inside The Factory we see Gregg Wallace helping to unload a tanker full of sugar from Norfolk and follows it through one of the oldest sweet factories in Britain - Swizzels in Derbyshire - to see how over 500 workers, as well as some mind-boggling machines, transform it into over a hundred million individual sweets within just 24 hours.\r\n\r\nHe'll discover how this factory that produces Lovehearts could be the most romantic place to work in the world and how the words on Lovehearts have evolved over the decades. Gregg will also find out how they make 5,000 Fizzers a minute using a tablet pressing machine that uses three tonnes of pressure to create each sweet, and he meets the man in charge of making three quarters of a million Fruity Pop lollies every day.\r\n\r\nMeanwhile Cherry Healey is let inside the research and development department and experiences for herself how hard it is to come up with a new product - plus she researches how the country you’re from has an impact on the sweets you like. She also finds out how they put the letters in seaside rock and is given special access to the Fisherman’s Friend factory in Lancashire to discover how a local family turned a niche product into a worldwide success.\r\n\r\nAnd historian Ruth Goodman investigates how sweets were first invented and discovers that, in the Middle Ages, they were used as a medicine and thought to reduce flatulence. She’ll also find out about the human cost of Britain’s sweet tooth in the 18th century and how an abolition movement instigated a sugar boycott which helped to end the slave trade","torrent":{"xt":"urn:btih:be3df540f304783aa26835995f0ea261479289a9","amp;dn":"Inside.The.Factory.s02e05.Sweets.EN.SUB.x264.MPup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be3df540f304783aa26835995f0ea261479289a9","infoHashBuffer":{"type":"Buffer","data":[190,61,245,64,243,4,120,58,162,104,53,153,95,14,162,97,71,146,137,169]},"announce":[],"urlList":[]}}