{"title":"Jules Dassin - 1964 - Topkapi - (USA) Dvdrip Xvid.avi","uid":4328356,"size":735051776,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:be72fc96bd710a7fbbcb403a3376005210b17649&amp;dn=Jules+Dassin+-+1964+-+Topkapi+-+%28USA%29+Dvdrip+Xvid.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"xskip","files":1,"time":1217899907,"description":"Plot\n\nArthur Simon Simpson (Peter Ustinov) is a lazy, middle-aged, small-time crook biding his time in Kavala, Greece. He works as a tout, accosting tourists at the airport, selling them cheap souvenirs, offering his services as a driver and, given the chance, stealing their valuables. One of his potential victims, however, turns out to be a gentleman thief (Maximilian Schell) planning to steal the emerald-encrusted dagger of the Mehmed II from Istanbul's Topkapi Museum, where it is on display in a glass-enclosed case for tourists to admire. He introduces himself to Simpson as Walter Harper and his attractive companion (Melina Mercouri) as Elizabeth Lipp and hires him to drive his American limousine from Athens to Istanbul -- alone.\nAt the Turkish border, Simpson is arrested when firearms are found hidden in the car. The Turkish Secret Police suspect the &quot;tourists&quot; to be revolutionaries planning a coup d'etat (see also History of Turkey) and release Simpson only on condition that he become one of their agents. From then on, Simpson has to spy on Harper, Lipp and everyone else they meet in Istanbul. But ultimately Simpson is hired by Harper, too -- not as their driver but as a member of the gang.\nWhile all this is happening, Simpson, a coward longing for his less dangerous life back in Kavala, has no idea what exactly they are planning. When the big day finally comes, Simpson, who is afraid of heights, panics because his job involves climbing to the roof of the museum. But he summons up the nerve to carry on, and he and Harper's gang of thieves do go through with the robbery -- with a quite unexpected result.\n\n\nTopkapi (1964) is a heist film made by Filmways Pictures and distributed by United Artists. It was produced and directed by an American film director Jules Dassin. The film is based on Eric Ambler's novel The Light of Day (1962), adapted as a screenplay by Monja Danischewsky. The music score was by Manos Hadjidakis, the cinematography by Henri Alekan and the costume design by Theoni V. Aldredge.\nThe film stars Melina Mercouri (who later became Dassin's wife), Maximilian Schell, Peter Ustinov, Robert Morley, Akim Tamiroff and Gilles SÃƒÆ’Ã‚Â©gal.\nA remake to star Pierce Brosnan as Thomas Crown has been announced as a sequel to the successful 1999 heist film The Thomas Crown Affair. It has been alternately referred to as The Topkapi Affair or The Thomas Crown Affair 2 and is currently listed on Brosnan's site on the Independent Movie Data Base as being in pre-production for a possible 2009 release.\n","torrent":{"xt":"urn:btih:be72fc96bd710a7fbbcb403a3376005210b17649","amp;dn":"Jules+Dassin+-+1964+-+Topkapi+-+%28USA%29+Dvdrip+Xvid.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be72fc96bd710a7fbbcb403a3376005210b17649","infoHashBuffer":{"type":"Buffer","data":[190,114,252,150,189,113,10,127,187,203,64,58,51,118,0,82,16,177,118,73]},"announce":[],"urlList":[]}}