{"title":"Essentials_of_Veterinary_Ophthalmology - Gelatt..2nd Edn [Leah12","uid":10356559,"size":44283739,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf12f4368dd14a4e5b6450df8e10f96a7caeda7a&amp;dn=Essentials_of_Veterinary_Ophthalmology+-+Gelatt..2nd+Edn+%5BLeah12&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"leah1289","files":1,"time":1402744960,"description":"\nBook Description\n\nPublication Date: April 22, 2008 | ISBN-10: 0781785596 | ISBN-13: 978-0781785594 | Edition: 2  | 16 Chapters | 654 Pages | Fully Bookmarked and Indexed |\n\n\nNow in its second edition, Essentials of Veterinary Ophthalmology provides its readers with a practical introduction to the diagnosis and clinical management of the most frequently encountered eye diseases of domestic animals. Essentials of Veterinary Ophthalmology is distilled from the authoritative, two-volume, fourth edition of Veterinary Ophthalmology (Gelatt), drawing primarily on the clinically relevant sections to provide expert coverage in a more concise and quick-reference format - ideal for busy small animal or equine practitioners seeking rapid advice for a patient. The second edition includes more images, algorithms to speed the clinical problem-solving process, key points highlighted in bold, expanded appendices for convenient reference to therapeutic agents, recommended dosages, and possible side effects, and a brief glossary.\nPractical and accessible, the second edition of Essentials of Veterinary Ophthalmology is filled with reader-friendly features to provide veterinary students and practitioners with an indispensable resource for the fundamentals of clinical veterinary ophthalmology.\n* Focuses on the most common eye diseases of small animals and horses\n* Provides expert coverage in a concise, quick-reference format\n* New edition includes more images, algorithms, key points in bold, expanded appendices and glossary\n* Based on the two-volume definitive reference Veterinary Ophthalmology, 4th Edition (Gelatt)\n","torrent":{"xt":"urn:btih:bf12f4368dd14a4e5b6450df8e10f96a7caeda7a","amp;dn":"Essentials_of_Veterinary_Ophthalmology+-+Gelatt..2nd+Edn+%5BLeah12","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf12f4368dd14a4e5b6450df8e10f96a7caeda7a","infoHashBuffer":{"type":"Buffer","data":[191,18,244,54,141,209,74,78,91,100,80,223,142,16,249,106,124,174,218,122]},"announce":[],"urlList":[]}}