{"title":"Little Criminals-[1995]-DVDrip","uid":3545977,"size":733872128,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bff65e7f7730fae688ed8ff16d0f51725efdeb71&amp;dn=Little+Criminals-%5B1995%5D-DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"crypto__","files":1,"time":1161821229,"description":"Little Criminals (1995) (Visades med titeln \\&quot;Satans Barn\\&quot; i SVT (tror jag))\n-----------------------\nI saw this movie many years ago, and it has been etched into my mind. It\\&amp;#039;s a very good movie!! I\\&amp;#039;ve tried to find it everywere but it is impossible because there is no readily available DVD release. The only release known was given away by Stephen Surjik&amp;#039;s secretary to fans on IMDB. He gave away them for free because fan requests, the only version available was a VHSrip -he didn\\&amp;#039;t wan\\&amp;#039;t people to see that version of the movie (And I can understand that), it was bad as hell (as any VHSrip)... This DVDrip of the movie isn\\&amp;#039;t very good either, but it\\&amp;#039;s the only one avaiable I know of...\n\n(Can\\&amp;#039;t understand why people persist making crappy DivX\\&amp;#039;s instead of just uploading the \\&quot;DVD-R\\&quot;, it\\&amp;#039;s stupid, that\\&amp;#039;s my opinion.. some DVDRips are so bad they\\&amp;#039;d look better compressed with QT format (MOV) for cellphones!)\n\n\n-----------------------------------------\nDirected by      ....  Stephen Surjik\t \t\nWriting credits  ....  Dennis Foon\t \t\n\n\nCast (in credits order)\n-----------------------------------------\nBrendan Fletcher ....  Des\nMyles Ferguson\t ....  Cory\nAdam Harrison\t ....  House\n...\n-----------------------------------------\n\n\nPlot Summary for\nLittle Criminals (1995)\n\nDes is an eleven year old kid who has had a really bad deal in life. Crime and mischief are the main staples of his life and he and his friends cruise around the city and do things like vandalize, steal, light fires, and mug people. He thinks that he is untouchable because he cannot be charged until he is twelve. Cory becomes Des\\&amp;#039; best friend and they carry on like nothing can stop them; however, Des ends up at an assessment centre for troubled youths and may begin a new life without crime.\n\n\n\n\n\n\nRANDOM USER COMMENTS FROM IMDB:\n-----------------------------------------\nA film that proves that kids can act!, 13 February 2002\n10/10\n\nA film that proves that kids can act!\n\nWhen i first saw this film I was about 15-16 and loved it then cause of the kids who didnt care about what they were doing. They were free.\n\nNow that I am older I can see the film in a different light, seeing that the system that failed the main character (Des) and he was a product of his environment.\n\nThe music in this film is great, it sets the feel for the scenes they were chosen for.\n\nIf you have time see this film, its well worth it! (or if you dont have time, make time) \n\n-----------------------------------------\n\nA remarkable film that you will wish you had seen sooner, 4 September 2002\n10/10\n\nOne evening, late Autumn 96 I sat back and causally channel surfed, I ended up on channel 4 (UK) where I was about to witness one of the best films of all time.\n\nFrom our first introduction to Des, perfectly framed through the windshield shadowed by the angry tones for Violet I knew that this film was going to be something different from the usual TV movies.\n\nThe concept of someone hitting the downward spiral is oft covered by small and big budget alike, but to convey it from the eyes of a child, however dangerous on the outside, a sensitive messed up inner beauty is portrayed, a victim of his surroundings without the adult understanding to make sense of it all. Suddenly you realise that this kid who seems to be popular, connected and tough is far from it and is merely fitting the mould society has carved for him and when the pillars of his self, the shreds of normality that his world clings to are torn away he realises that the voices were right, he is alone, he is not special, and his time has run out.\n\nWe have see a roller coaster of emotions, with him reverting from adult to child but in the final scene, as the flames lick around him, distorting his treasured drawings, burning his forgotten sanctuary: we realise that there could be no other ending for him, or for the film - the trip hop pining of Portishead Roads that has haunted us throughout the film, reaches crescendo to add the final brevity.\n\nThe raw quality of this film and the depth of message is usually out of reach in a TV movie, but not his gem.\n\nWatch it, remember it.\n\n-----------------------------------------\n\nDepressing but thought-provoking, 30 December 2005\n9/10\n\n\\&amp;#039;Little Criminals\\&amp;#039; has to be one of the most depressing films I\\&amp;#039;ve ever seen; more so when I consider that, in reality, there must be thousands of children out there condemned to lives of crime and misery as a result of their home situations.\n\nThe film revolves primarily around two eleven-year-olds boys named Cory and Des whose extra-curricular activities involve robbery, violence, vandalism, smoking and drugs. On the whole, Cory is a decent child who is just acts out because he feels displaced his step-father and half-siblings. He is sucked into the world of juvenile crime in the hopes of feeling \\&amp;#039;cool\\&amp;#039; but realises the full ramifications of his actions when things go too far and, luckily, he has a family to protect him. Des is another story. It would be too easy to hate him from the onset because he behaves like a vile little monster but only through watching the film do we see a different side to him. He\\&amp;#039;s a neglected, miserable child who has never had one happy moment in his short life. And, deep down, there is a part of him that is still very childlike and desperate for someone to reach out and redeem him. He\\&amp;#039;s a boy who could have lead a well-adjusted, productive life had he been raised by loving parents who actually cared about, guided and disciplined their son.\n\nThe quality of the child actors was just excellent. Myles Ferguson, who tragically died just five years after appearing in this film, was able to portray Cory\\&amp;#039;s descent into crime in a way that makes the audience identify how easily a child can be led astray. But it is Brendan Fletcher who steals the show. He depicts Des\\&amp;#039; hard edge and dark emotions while retaining a sense of vulnerability and childish desperation in the character. He leaves you feeling a conflict between condemning Des as irredeemable and wanting to help this child climb to a better future.\n\nThere is no happy ending in this film but it does leave you pondering many thoughts long after the credits have gone by. Perhaps if Canada had a lower age of criminal responsibility, Des and his friends could have been arrested earlier and given the therapy they needed. While I do believe some child criminals deserve to be locked up for a good few decades because they have gone just too far for justice to take second place to rehabilitation (the two ten-year-old British boys who tortured, abused and murdered two-year-old James Bulger fall into this category), reflecting on Des\\&amp;#039; situation leaves me realising that juvenile detention is not the best solution for all children who commit crimes. Some can be saved if intervention is given early enough.\n\nIt\\&amp;#039;s just sad that even in the twenty-first century many of those children who can be save fall still through the cracks of and go on to meet the fate of becoming adult criminals or, worse, premature death.\n\n-----------------------------------------\n\npoignant, realistic, gruesome, tragic - a masterpiece, 4 March 2002\n10/10\n\nOne of the most memorable film experiences I have ever witnessed. Myles Ferguson makes a promising debut.\n\nThe real star though, is eleven year old Brendan Fletcher who gives an unbelievable performance for one so young. I have worked with children like Des, and I cannot believe how accurately Fletcher portrays Des.\n\nThis one surely deserves a far wider audience and a global DVD release. \n\n-----------------------------------------\t","torrent":{"xt":"urn:btih:bff65e7f7730fae688ed8ff16d0f51725efdeb71","amp;dn":"Little+Criminals-%5B1995%5D-DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bff65e7f7730fae688ed8ff16d0f51725efdeb71","infoHashBuffer":{"type":"Buffer","data":[191,246,94,127,119,48,250,230,136,237,143,241,109,15,81,114,94,253,235,113]},"announce":[],"urlList":[]}}