{"title":"Tyrone Davis - Turn Back the Hands of Time (1970) V0","uid":8641183,"size":61026295,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c05c87fc421b6bfe4e1622a19df403f5d998c51b&amp;dn=Tyrone+Davis+-+Turn+Back+the+Hands+of+Time+%281970%29+V0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":-1,"time":1372881497,"description":"Tyrone Davis - Turn Back The Hands Of Time \n\nmp3 V0\n\n   1. Tyrone Davis - Turn Back The Hands Of Time              [02:58]\n   2. Tyrone Davis - All The Waiting Is Not In Vain           [02:30]\n   3. Tyrone Davis - Let Me Back In                           [02:40]\n   4. Tyrone Davis - Love Bones                               [03:11]\n   5. Tyrone Davis - I'll Be Right Here                       [02:44]\n   6. Tyrone Davis - Is It Something You've Got?              [02:39]\n   7. Tyrone Davis - Undying Love                             [03:23]\n   8. Tyrone Davis - Just Because Of You                      [03:03]\n   9. Tyrone Davis - If It's Love That You're After           [02:50]\n  10. Tyrone Davis - I Keep Coming Back                       [02:41]\n\n\nIf the only great song on Tyrone Davis' second album, Turn Back the Hands of Time, was its impeccable title track, it still would have been a noteworthy record in the history of uptown Chicago soul and early-'70s soul -- it's simply that good of a song. Fortunately, it's the tip of the iceberg on this terrific album that ranks among the finest soul records of its era. In a way, the single is a little misleading, since it is such a silky smooth, seductive tune that it gives the impression that everything on the album will be the same, and it's not. Yes, the album has more than its fair share of strings, backing vocals, horns, and even harpsichords (showcased on &quot;If It's Love You're After&quot;), but that doesn't mean this is so smooth that it becomes glossy and slick. Instead, it's luxurious, and Davis is able to deepen it with his nuanced, soulful interpretations; he's even given a chance to try bluesy funk with &quot;Undying Love&quot; and does a great slow ballad with &quot;I Keep Coming Back.&quot; What's impressive about the record is not just that Davis is able to handle everything from those slow-burners to the soul-pop, sounding convincing in each setting, but that producer Willie Henderson has crafted utterly appropriate, intoxicating, and unique productions for each song. And those songs are all very, very strong. There's no filler here, just terrific songwriting from the pens of Jack Daniels/Johnny Moore, Eugene Record/Carl Davis, and Cash McCall, among others. There were other singles pulled from Turn Back the Hands of Time that scaled the charts -- &quot;Is It Something You've Got?&quot; and &quot;I'll Be Right Here,&quot; both R&amp;B Top Ten hits, plus &quot;Let Me Back In&quot; -- but album tracks like &quot;All the Waiting Is Not in Vain,&quot; the Impressions-styled &quot;Just Because of You,&quot; and the great, great, funky &quot;Love Bones&quot; are strong as well. There's not a weak moment here (and there shouldn't be, considering that the whole thing clocks in at under 30 minutes), just great early-'70s soul. It's a forgotten gem. ","torrent":{"xt":"urn:btih:c05c87fc421b6bfe4e1622a19df403f5d998c51b","amp;dn":"Tyrone+Davis+-+Turn+Back+the+Hands+of+Time+%281970%29+V0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c05c87fc421b6bfe4e1622a19df403f5d998c51b","infoHashBuffer":{"type":"Buffer","data":[192,92,135,252,66,27,107,254,78,22,34,161,157,244,3,245,217,152,197,27]},"announce":[],"urlList":[]}}