{"title":"Andreas Christensen - The Complete Exodus Trilogy","uid":13617312,"size":431972199,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c0812a861e69cb470d8e64d6d3d52e7870b1a109&amp;dn=Andreas+Christensen+-+The+Complete+Exodus+Trilogy&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Cybotage","files":63,"time":1455951760,"description":"Book 1: Exodus\r\n\r\nWhen mankind faces extinction, can anyone survive?\r\n\r\nIn 2072, Earth faces the ultimate extinction event. In an America turned authoritarian, a desperate race against time begins. To send a starship to a distant planet, where the remains of humanity can survive.\r\n\r\nHowever, while the government wants to recreate the society it has engineered, there are those who secretly conspire to let the starfarers choose their own destiny. As mankind on Earth faces its final blow, the selected few set course for Aurora, more than 40 light years away.\r\n\r\nFollow Maria Solis, the billionaire daughter, Kenneth Taylor, Harvard professor of psychology, and Tina Hammer, a scramjet pilot and officer, through the selection and preparations for the adventure of a lifetime - and a final chance for a doomed civilization.\r\n\r\nBook 2: Aurora\r\n\r\nOn Aurora, humanity's final outpost is heading for disaster.\r\n\r\nIn 2080, the starship Exodus left Earth, carrying some 1600 people, to give humanity a second chance. Now, in 2245, the colonists are trying to build a future on distant Aurora. But the doomed world that sent them on their long voyage had turned authoritarian and repressive, leading a small group to form a plan to let those sent on the Exodus choose a different path.\r\n\r\nWhile Kenneth Taylor struggles to accept his self-imposed silence even on the new world, Thomas Dunn is slowly subverting the colonial administration. Governor George Havelar, on the other hand, plans to make sure the mistakes of the past are not repeated as he proposes a radical plan for human expansion. In the north a simmering discontent is threatening to break up the unity of the human settlement on Aurora, and former scramjet pilot Tina Hammer realizes she cannot stay out of the conflict. Maria Solis, torn between loyalty to her father's faction and her own desires, is suddenly being forced into the conflict as she witnesses a terrible crime.\r\n\r\nWith an entire planet to discover, tensions rise as opposing forces work their plans. While the leadership of the colony tries to affirm its control, others are working to regain lost liberties.\r\n\r\nWill humanity's final outpost survive the confrontation, or succumb to destruction?\r\n\r\nBook 3: Genesis\r\n\r\nOn Aurora, a people divided braces for the final confrontation.\r\n\r\nAurora, the final destination of the starship Exodus, has become the scene of a deadly struggle between opposing forces, ready to fight with any means available. The rebels have found a leader in former Harvard Professor Kenneth Taylor, who with the help of former scramjet pilot Tina Hammer, has vowed to fight the injustices of the past and regain lost liberties.\r\n\r\nGovernor George Havelar once had a plan for Aurora, but the rebels are now threatening its unraveling. As he rallies his forces to move against the rebels, events take a surprising turn, and he is forced to reconsider his options.\r\n\r\nThe mysterious Thomas Dunn is fighting a guerrilla war in the hills and forests, and so far, the rebels have kept the enemy at bay. As winter draws to a close, an overwhelming force is coming north to end the war once and for all. But everything changes when the enemy’s attack turns to frantic retreat.\r\n\r\nBenjamin Waters, once a boy soldier caught up in the turmoil of rebellion, has found himself developing amazing abilities, but the ghosts of his past are slowly creeping up on him. Will he find redemption, or will he lose himself to the parasite infesting his very soul?\r\n\r\nWhen Maria Solis is searching for a way to expand further north, she makes a discovery that changes everything. But little does she know that the answer to an even greater mystery, which has eluded sages and scientists for thousands of years, will soon be revealed.\r\n\r\nIt is time for the explosive conclusion to the saga that began with the appearance of a rogue planet threatening humanity’s existence. Will this be the final chapter of humans on Aurora, or a new beginning? \r\n\r\n\r\n\r\nRead by Jeffrey Kafer\r\nFormat: MP3\r\nBitrate: 64 Kbps","torrent":{"xt":"urn:btih:c0812a861e69cb470d8e64d6d3d52e7870b1a109","amp;dn":"Andreas+Christensen+-+The+Complete+Exodus+Trilogy","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0812a861e69cb470d8e64d6d3d52e7870b1a109","infoHashBuffer":{"type":"Buffer","data":[192,129,42,134,30,105,203,71,13,142,100,214,211,213,46,120,112,177,161,9]},"announce":[],"urlList":[]}}