{"title":"Advanced Persistent Threat (Syngress)","uid":8888487,"size":9968581,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c115ca51413ef642fa08b5d84402db02962d9fe7&amp;dn=Advanced+Persistent+Threat+%28Syngress%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1378524529,"description":"Advanced Persistent Threat: Understanding the Danger and How to Protect Your Organization \n\nBook Description:\n\nPublication Date: November 27, 2012 Syngress Press | Pages: 320 | ISBN-10: 1597499498 | ISBN-13: 978-1597499491 | Edition: 1 | Format: PDF, EPUB\n\nThe newest threat to security has been categorized as the Advanced Persistent Threat or APT. The APT bypasses most of an organizations current security devices, and is typically carried out by an organized group, such as a foreign nation state or rogue group with both the capability and the intent to persistently and effectively target a specific entity and wreak havoc. Most organizations do not understand how to deal with it and what is needed to protect their network from compromise. In Advanced Persistent Threat: Understanding the Danger and How to Protect your Organization Eric Cole discusses the critical information that readers need to know about APT and how to avoid being a victim.\n\nAdvanced Persistent Threat is the first comprehensive manual that discusses how attackers are breaking into systems and what to do to protect and defend against these intrusions.\n\nAdvanced Persistent Threat covers what you need to know including:\n\n. How and why organizations are being attacked\n\n. How to develop a Risk based Approach to Security\n\n. Tools for protecting data and preventing attacks\n\n. Critical information on how to respond and recover from an intrusion\n\n. The emerging threat to Cloud based networks\n","torrent":{"xt":"urn:btih:c115ca51413ef642fa08b5d84402db02962d9fe7","amp;dn":"Advanced+Persistent+Threat+%28Syngress%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c115ca51413ef642fa08b5d84402db02962d9fe7","infoHashBuffer":{"type":"Buffer","data":[193,21,202,81,65,62,246,66,250,8,181,216,68,2,219,2,150,45,159,231]},"announce":[],"urlList":[]}}