{"title":"Edward Abbey A voice in the wilderness","uid":8837713,"size":734302208,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c29224d98066b52d791699c9c1a34a1c5ce1be06&amp;dn=Edward+Abbey+A+voice+in+the+wilderness&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1377166326,"description":"Edward Abbey a voice in the wilderness\n\nWhen Edward Abbey died in 1989 at the age of sixty-two, the American West lost one of its most eloquent and passionate advocates. Through his novels, essays, letters and speeches, Edward Abbey consistently voiced the belief that the West was in danger of being developed to death, and that the only solution lay in the preservation of wilderness. Abbey authored twenty-one books in his lifetime, including Desert Solitaire, The Monkey Wrench Gang, The Brave Cowboy, and The Fool's Progress. His comic novel The Monkey Wrench Gang helped inspire a whole generation of environmental activism. A writer in the mold of Twain and Thoreau, Abbey was a larger-than-life figure as big as the West itself.\n\nThis documentary, part biography, part tribute, is a look back at Abbey's life as remembered by sixteen of his closest friends and family members. Images of the places which Abbey loved and defended so fiercely are woven throughout the program. They include Arches National Park, Canyonlands National Park, Grand Canyon National Park, Great Basin National Park, and the Sonoran desert. Rare film clips and interviews with Abbey, combined with over one hundred twenty rare and largely unpublished photographs offer an insightful look into the personal life and philosophy of this iconoclastic writer. Edward Abbey: A Voice in the Wilderness was produced over a two year period with the full cooperation of Edward Abbey's family and estate. \n\nDVD rip in AVI format\n\nRuntime: 57 min.\n\nLanguage: English, no subtitles","torrent":{"xt":"urn:btih:c29224d98066b52d791699c9c1a34a1c5ce1be06","amp;dn":"Edward+Abbey+A+voice+in+the+wilderness","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c29224d98066b52d791699c9c1a34a1c5ce1be06","infoHashBuffer":{"type":"Buffer","data":[194,146,36,217,128,102,181,45,121,22,153,201,193,163,74,28,92,225,190,6]},"announce":[],"urlList":[]}}