{"title":"MClibel 2005 (great fuckoff to mcdonalds)","uid":3341204,"size":718933922,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c2eb13441c51ee5efc4544ac8ba02fb4ede85bb1&amp;dn=MClibel+2005+%28great+fuckoff+to+mcdonalds%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"a3dzone","files":0,"time":1118152032,"description":"McLibel is the story of two ordinary people who humiliated McDonald's in the biggest corporate PR disaster in history.\n\nMcDonald's loved using the UK libel laws to suppress criticism. Major media organisations like the BBC and The Guardian crumbled and apologised. But then they sued gardener Helen Steel and postman Dave Morris.\n\nIn the longest trial in English legal history, the &quot;McLibel Two&quot; represented themselves against McDonald's &amp;pound;10 million legal team. Every aspect of the corporation's business was cross-examined: from junk food and McJobs, to animal cruelty, environmental damage and advertising to children.\n\nOutside the courtroom, Dave brought up his young son alone and Helen supported herself working nights in a bar. McDonald's tried every trick in the book against them. Legal manoeuvres. A visit from Ronald McDonald. Top executives flying to London for secret settlement negotiations. Even spies.\n\nSeven years later, in February 2005, the marathon legal battle finally concluded at the European Court of Human Rights. And the result took everyone by surprise - especially the British Government.\n\nMcLibel is not just about hamburgers. It is about the importance of freedom of speech now that multinational corporations are more powerful than countries.\n\nFilmed over ten years by no-budget Director Franny Armstrong, McLibel is the David and Goliath story of two people who refused to say sorry. And in doing so, changed the world.","torrent":{"xt":"urn:btih:c2eb13441c51ee5efc4544ac8ba02fb4ede85bb1","amp;dn":"MClibel+2005+%28great+fuckoff+to+mcdonalds%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2eb13441c51ee5efc4544ac8ba02fb4ede85bb1","infoHashBuffer":{"type":"Buffer","data":[194,235,19,68,28,81,238,94,252,69,68,172,139,160,47,180,237,232,91,177]},"announce":[],"urlList":[]}}