{"title":"The Unthinkable: Who Survives When Disaster Strikes- and Why","uid":8680858,"size":2251166,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c33bba9f8cd0d99f16c6f537ee87709a4685428f&amp;dn=The+Unthinkable%3A+Who+Survives+When+Disaster+Strikes-+and+Why&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1373691913,"description":" Amanda Ripley, &quot;The Unthinkable: Who Survives When Disaster Strikes- and Why&quot;\n2009 | ISBN: 0307352900 | EPUB\n\nRipley, an award-winning writer on homeland security for Time, offers a compelling look at instinct and disaster response as she explores the psychology of fear and how it can save or destroy us. Surprisingly, she reports, mass panic is rare, and an understanding of the dynamics of crowds can help prevent a stampede, while a well-trained crew can get passengers quickly but calmly off a crashed plane. Using interviews with survivors of hotel fires, hostage situations, plane crashes and, 9/11, Ripley takes readers through the three stages of reaction to calamity: disbelief, deliberation and action. The average person slows down, spending valuable minutes to gather belongings and check in with others. The human tendency to stay in groups can make evacuation take much longer than experts estimate. Official policy based on inaccurate assumptions can also put people in danger; even after 9/11, Ripley says, the requirement for evacuation drills on office buildings is inadequate. Ripley's in-depth look at the psychology of disaster response, alongside survivors' accounts, makes for gripping reading, sure to raise debate as well as our awareness of a life-and-death issue","torrent":{"xt":"urn:btih:c33bba9f8cd0d99f16c6f537ee87709a4685428f","amp;dn":"The+Unthinkable%3A+Who+Survives+When+Disaster+Strikes-+and+Why","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c33bba9f8cd0d99f16c6f537ee87709a4685428f","infoHashBuffer":{"type":"Buffer","data":[195,59,186,159,140,208,217,159,22,198,245,55,238,135,112,154,70,133,66,143]},"announce":[],"urlList":[]}}