{"title":"Appunti per un film sull_India (Pasolini) [TV-Rip-Ita] TNT VILLA","uid":5713270,"size":489910272,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c363622c837cfc46e95871ef846f6b99f8d6d941&amp;dn=Appunti+per+un+film+sull_India+%28Pasolini%29+%5BTV-Rip-Ita%5D+TNT+VILLA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"l.diliberto","files":1,"time":1279987117,"description":".: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=130610&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=130610&lt;/a&gt;\n\n.: Scheda del film :.\n\nGenere: Short | Documentary\nDurata: Italy:25 min\nRiconoscimenti: 2 wins\nRegia: Pier Paolo Pasolini\nFotografia: Roberto Nappa Federico Zanni\nCast: Pier Paolo Pasolini\nProduzione: Gianni Barcelloni\nColonna Sonora: Ennio Morricone\n\nScritto, diretto, fotografato e commentato da Pier Paolo Pasolini\nMontaggio Jenner Menghi Produzione Rai Radiotelevisione Italiana:\nPoduttore delegato Gianni Barcelloni Corte, BBG cinematografica srl;\nPllicola Kodak formato 16 mm, b/n, macchine da ripresa Arriflex.\nRiprese dicembre-gennaio 1968; esterni Stato di Maharashtra (Bombay),\nStato di Uttar Pradesh, Stato di Rajahstan, New Delhi.\n\n.: Trama :.\n\nAlla Mostra del cinema di Venezia del 1968, insieme a Teorema, Pasolini presentÃƒÂ² anche il mediometraggio Appunti per un film sull'India, girato nel dicembre 1967. Naldini spiega nella sua biografia pasoliniana (Pasolini, una vita, Einaudi 1989) che tali &quot;appunti&quot; si riferivano sostanzialmente a un film da farsi &quot;sulla storia di un maragiÃƒÂ  il quale, secondo una leggenda mitica indiana, offre il proprio corpo alle tigri per sfamarle (questo, idealmente, prima della liberazione dell'India); e, dopo la liberazione dell'India, sempre idealmente, la famiglia di questo maragiÃƒÂ  scompare perchÃƒÂ© i suoi membri muoiono di fame ad uno ad uno durante una carestia&quot;. &quot;Questa era l'idea del film&quot;, spiegÃƒÂ² Pasolini nel corso di una intervista. &quot;CosÃƒÂ¬ sono andato in India a fare una specie di inchiesta per verificare se questa idea era attendibile o no.&quot;\nPasolini aveva in un primo tempo progettato di realizzare un film sullo svilupparsi di una coscienza politica in alcune nazioni del Terzo Mondo, alcune delle quali si erano affrancate dal colonialismo e stavano avviando forme di gestione democratica.\nPer rappresentare poeticamente tutto ciÃƒÂ², il regista prevedeva di utilizzare racconti che avessero le loro radici nella cultura locale e che risultassero omogenei grazie a ciÃƒÂ² che egli stesso definiva un &quot;sentimento violentemente e magari anche velleitariamente, rivoluzionario: cosÃƒÂ¬ da fare del film stesso un'azione rivoluzionaria (non partitica, naturalmente, e assolutamente libera fin quasi all'anarchia)&quot;.\nPasolini presentÃƒÂ² diversi progetti ad alcuni produttori: l'unica possibilitÃƒÂ  di realizzazione gli si prospettÃƒÂ² perÃƒÂ² grazie alla Rai, che gli propose di fare uno &quot;speciale&quot; per TV7.\nPasolini effettuÃƒÂ² le riprese cinematografiche per le strade, principalmente nella cittÃƒÂ  di Bombay e nelle sue estreme, poverissime periferie, con la cinepresa in spalla, riprendendo gente comune e dialogando con alcuni intellettuali indiani. L'intento del regista non era quello di realizzare un documentario, ma di verificare la propria concezione poetica del film. E di ricercare inoltre i personaggi che interpreteranno l'episodio. Pasolini presenta a persone di ogni estrazione sociale la propria idea di realizzazione della storia del marajÃƒÂ : di tali persone egli ascolta e registra le opinioni, i commenti, i suggerimenti; e coglie, sui volti vecchi e giovani di coloro che incontra, e nei gesti, nei sorrisi puri, nei quali traspare una grande quiete interiore, una incredibile ricchezza di espressioni.\nNel filmato sono numerose le immagini di povertÃƒÂ  e di morte: sulle riprese di un corteo funebre e di una cremazione il film si conclude con le parole di Pasolini: &quot;Un occidentale che va in India ha tutto, ma non dÃƒÂ  niente. L'India, invece, non ha nulla, in realtÃƒÂ  dÃƒÂ  tutto&quot;.\n\nSi ringrazia http://www.pasolini.net per le info.\n\n.: Scheda tecnica del DivX :.\n\nDimensione: 467 Mb\nDurata: 00:33:10\n\nVideo Codec: DivX 5.0\nVideo Bitrate: 1867\nRisoluzione: 640 x 480\nFPS (Frames/sec): 25.000\nQF (Frame quality): 0.243\n\nAudio Codec: MP3\nAudio Bitrate: 96 kb/s total (2 chnls)\nFreq Audio: 44100Hz","torrent":{"xt":"urn:btih:c363622c837cfc46e95871ef846f6b99f8d6d941","amp;dn":"Appunti+per+un+film+sull_India+%28Pasolini%29+%5BTV-Rip-Ita%5D+TNT+VILLA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c363622c837cfc46e95871ef846f6b99f8d6d941","infoHashBuffer":{"type":"Buffer","data":[195,99,98,44,131,124,252,70,233,88,113,239,132,111,107,153,248,214,217,65]},"announce":[],"urlList":[]}}