{"title":"MSTS - Addon - BNSF Scenic Sub 1 + Scenic Sub 2 Update","uid":9996132,"size":691555055,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c3b5aa574826b4b7906a756e1c6599e6fd467b3a&amp;dn=MSTS+-+Addon+-+BNSF+Scenic+Sub+1+%2B+Scenic+Sub+2+Update&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"FrankFoo2","files":6,"time":1397923678,"description":"BNSF Seligman Route 2.0 (Upgrade Version)\n\nThe former Santa Fe Seligman Subdivision has changed a lot in the past 15 years.  \nWith the merger between the Santa Fe and the Burlington Northern to form the BNSF Railway, new technologies and operating methods have put in place system wide.  \n\nBeginning in the late 1990's, BNSF began installing CTC on the western portion of the line, from Seligman to Needles.  \n\nThe majority of the former ATSF passing sidings are still in use today, either as storage tracks or as CTC controlled sidings.  \n\nThe old ATSF signals that once graced the western, as well as the eastern portion are now gone, replaced by modern, solid state, traffic light-type signals.  \n\nWhile we cannot stop the movement of time and technology, we can surely marvel at the highly efficient piece of railroad the Seligman Subdivision is today.\n\nAlso, in the past 5 years, the majority of the BNSF's older locomotives, including the ubiquitous SD40-2s, have moved to other parts of the system, leaving the equally ubiquitous GE C44-9W and newer GEVO (ES44DC) locomotives to handle traffic on the BNSF Transcon.  \n\nNot much is left of the former Santa Fe, save for a few bridges, some old station signs here and there, and former ATSF GP60s handling local wayfreight and yard switching duties.  \n\nToday's Seligman is a constant onslaught of high horsepower GE's pulling exceptionally long trains of ocean and domestic containers, piggyback trailers, grain, fossil fuels, chemicals, and manifest traffic of all shapes, sizes, and colors.\n\nIt is the modern day version of the 300 miles of the BNSF Transcon between Winslow AZ, and Needles CA.\n\n\n    12 High Detail Locomotive models, including GE ES44DC, GE C44-9W, and EMD GP60\n    Over 50 pieces of rolling stock, including new 53' articulated well cars\n    Accurate Cabviews and Physics\n    Daytime and Nightime Cabviews\n    High Quality 22khz Audio\n    Challenging Activities and Much More!\n\nNote:\n See readme1st.txt for install instructions\n\n","torrent":{"xt":"urn:btih:c3b5aa574826b4b7906a756e1c6599e6fd467b3a","amp;dn":"MSTS+-+Addon+-+BNSF+Scenic+Sub+1+%2B+Scenic+Sub+2+Update","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3b5aa574826b4b7906a756e1c6599e6fd467b3a","infoHashBuffer":{"type":"Buffer","data":[195,181,170,87,72,38,180,183,144,106,117,110,28,101,153,230,253,70,123,58]},"announce":[],"urlList":[]}}