{"title":"ELITE COMBAT FITNESS","uid":4747682,"size":2861587456,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c3d136da59414badab416b39fc5f17e54a246e3d&amp;dn=ELITE+COMBAT+FITNESS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"serpol","files":6,"time":1235977427,"description":"INTRODUCING THE ELITE COMBAT FITNESS TRAINING SYSTEM\n\nGet into the best shape of your life with the new and revolutionary ELITE COMBAT FITNESS (ECF) training system. Elite Combat Fitness is a fusion of Olympic and Mixed Martial Arts training drills combined with modern military routines used by elite commandos to provide YOU with the ultimate total body workout.\n\nDeveloped by MONI AIZIK, a former member of the Israeli Special Forces and founder of Commando Krav Maga, the fastest growing reality-based fighting system in the world, Elite Combat Fitness is designed to take you to your next level of conditioning. Moni has taken his lifetime of knowledge, training expertise and experience in the science of sports, and made them available to you in the QUICK FIT Library which includes 6 high quality DVDs.\n\nWith the Elite Combat Fitness system, you will not need any complex or expensive equipment. Instead, you will have the most modern and highly effective fitness training system at your fingertips. Whether you're on business, traveling, at home or in your backyard, you can have fun working out with the dynamic exercises anywhere at your convenience!","torrent":{"xt":"urn:btih:c3d136da59414badab416b39fc5f17e54a246e3d","amp;dn":"ELITE+COMBAT+FITNESS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3d136da59414badab416b39fc5f17e54a246e3d","infoHashBuffer":{"type":"Buffer","data":[195,209,54,218,89,65,75,173,171,65,107,57,252,95,23,229,74,36,110,61]},"announce":[],"urlList":[]}}