{"title":"Ella's Kitchen - The Cook Book","uid":11774594,"size":10136593,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c592901a10214a33fa26002b11c1da3734ec8c8c&amp;dn=Ella%27s+Kitchen+-+The+Cook+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1427222149,"description":"'It's never too early to get little'uns interested in healthy eating, so instead of cooking for the kids, why not cook with them?' - Reveal As featured in The Times, Ella's Kitchen is the fastest growing brand in the UK baby food sector and this new title, Ella's Kitchen: The Cookbook: The Red One, is the first in a series of books aimed at creating nutritious, convenient food that kids (and their parents) will love. 100 yummy recipes to inspire big and little cooks, ranging from the easiest of snacks and light meals that can be rustled up in minutes to delicious and satisfying dinners. Interesting twists and clever shortcuts, such as salmon fillets baked in parcels and sweet and sour prawns, make life as easy as possible for busy parents. For weekends and holidays, when there is a bit more time available, there are leisurely breakfast recipes such as Blueberry Pancakes and more involved cooking projects such as a Pasta Weekend. With an emphasis on involving kids as much as possible, the book includes easy prep tasks throughout, as well as fun activities, from growing your own window-box plants to getting creative with vegetable prints. Colour-in pages and stickers also mean that kids will love it as much as their parents do. Content's includes... First foods for tiny taste buds From must to mash &amp; beyond Learning about food Yummy lunches and speedy snacks Dee-licious dinners Perfect puds Scrummy treats Hooray for the weekend ...and much more!","torrent":{"xt":"urn:btih:c592901a10214a33fa26002b11c1da3734ec8c8c","amp;dn":"Ella%27s+Kitchen+-+The+Cook+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c592901a10214a33fa26002b11c1da3734ec8c8c","infoHashBuffer":{"type":"Buffer","data":[197,146,144,26,16,33,74,51,250,38,0,43,17,193,218,55,52,236,140,140]},"announce":[],"urlList":[]}}