{"title":"Break by Vanessa Waltz","uid":9625166,"size":592410,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5c48a88765836183b31913a6027843acc829002&amp;dn=Break+by+Vanessa+Waltz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"PirateBook","files":2,"time":1392579118,"description":"\nWhat if a handsome billionaire offered you thousands to pretend to be his girlfriend? And what if you started to believe the lie? Jessica has never had a boyfriend, and that's just how she likes it. She's still trying to rebuild herself from a sexually abusive past, and a guy - no matter how gorgeous - would only mess up the fragile balance of her life. \n\nAlmost-billionaire Luke Pardini is gorgeous, that's for sure. He's also desperate. His dying father thinks he's too irresponsible to inherit the family estate, and Luke needs to convince his dad that he's grown up and ready to settle down with a girl. Any girl. With five billion dollars at stake, Luke can't mess this up. But as he pretends to date Jessica, he finds himself drawn to her more than he'd like to admit. \n\nHe has been hurt too many times to count, but Jessica is the one person who makes him feel safe. It could have been a Cinderella story, but both of them made a promise that their relationship was just for show, and neither of them is going to step over the line. When Jessica's secret past emerges on the front page of the tabloids, his dad threatens to disown him if he doesn't sever ties with her. If their relationship was only a charade, the solution would be easy. But if it's not...\n\nThis new adult college romance contains mature themes. Recommended for 17+ audience.\n\nGenre: Romance","torrent":{"xt":"urn:btih:c5c48a88765836183b31913a6027843acc829002","amp;dn":"Break+by+Vanessa+Waltz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5c48a88765836183b31913a6027843acc829002","infoHashBuffer":{"type":"Buffer","data":[197,196,138,136,118,88,54,24,59,49,145,58,96,39,132,58,204,130,144,2]},"announce":[],"urlList":[]}}