{"title":"Hematopathology, 2E [PDF] [StormRG]","uid":9835919,"size":70679647,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c7099594c13b4abe9bd09d6d692e2135b32c3871&amp;dn=Hematopathology%2C+2E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"0xmovva","files":-1,"time":1395910754,"description":"Author: Eric D. Hsi\nSeries: Foundations in Diagnostic Pathology\nHardcover: 760 pages\nPublisher: Saunders; 2 edition (February 22, 2012)\nLanguage: English\nISBN-10: 1437726062\nISBN-13: 978-1437726060\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nHematopathology, a volume in the Foundations in Diagnostic Pathology Series, packs all of today's essential know-how into a concise, high-yield format! This medical reference book's well-organized approach, full-color illustrations, and at-a-glance tables make the information you need easy to find, so you can diagnose the most commonly encountered hematologic conditions as efficiently and accurately as possible.\n\nEfficiently diagnose the most commonly encountered neoplastic and non-neoplastic conditions of the hematologic system.\nReview normal histology before examining abnormal findings.\nReference information quickly with a user-friendly format that explores each entity's clinical features, pathologic features, ancillary studies, differential diagnosis, and prognostic and therapeutic considerations.\nView key features of a wide variety of pathologies with hundreds of full-color illustrations.\nCheck out the latest in the labs with new chapters on splenic pathology and flow cytometry.\n\nThe Foundations in Diagnostic Pathology Series answers the call for fresh, affordable, and easy-to-use guidance. Each region-specific volume provides all of the most essential information on the pathologic entities encountered in practice. Series Editor: John R. Goldblum, MD, FACP, FASCP, FACG\nA quick and easy reference, as a refresher or for those just starting out, on hematopathology.","torrent":{"xt":"urn:btih:c7099594c13b4abe9bd09d6d692e2135b32c3871","amp;dn":"Hematopathology%2C+2E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7099594c13b4abe9bd09d6d692e2135b32c3871","infoHashBuffer":{"type":"Buffer","data":[199,9,149,148,193,59,74,190,155,208,157,109,105,46,33,53,179,44,56,113]},"announce":[],"urlList":[]}}