{"title":"Duran Duran - Live at Coachella Music Festival 2011","uid":9708898,"size":2807109562,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c7705a6c5577346bc2c8ffe8f21b66b3311b91e2&amp;dn=Duran+Duran+-+Live+at+Coachella+Music+Festival+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"wesleysr","files":1,"time":1394084274,"description":"This is a recording of Duran Duran's performance at The Coachella Valley Music and Arts Festival, a three-day annual festival.\nThe event features many genres of music including alternative rock, indie, and electronic music as well as large sculptural art. The festival enjoys little cloud cover or shade and has a desert setting (the city of Indio is a part of the California Desert), with daytime temperatures frequently rising to over 100 Â°F (38 Â°C).\n\nDuran Duran took to the stage on the last night of the event in Indio and kicked off with &quot;Planet Earth&quot;. &quot;We have been looking forward to this moment for weeks and weeks, and now we're here it's going to go off!&quot; Simon Le Bon said. &quot;Hungry Like The Wolf&quot; was next and &quot;Safe&quot; soon followed, performed with Ana Matronic of the Scissor Sisters.\n\nAfter they finished the set, Duran Duran returned for an encore and dedicated the first track to late composer John Barry, who co-wrote their hit song &quot;A View To A Kill for the Roger Moore movie of the same name. Le Bon told the crowd, &quot;We lost a dear friend of ours this year - English composer John Barry. This for him.&quot; Frontman Le Bon dressed in a white tuxedo reminiscent of the suave superspy and they were backed by an orchestra as they played a pared down version of the song, before launching into the full, upbeat track.\n\nThe band ended the encore with &quot;Girls on Film&quot; with a snipet of Lady Gaga's &quot;Poker Face&quot;, as keyboardist Nick Rhodes took photographs of the crowd. Duran Duran continued the tour three days later, playing the Ogen Theatre show in Denver, CO, USA on 20 April 2011.\n\nTrack listingEdit\n&quot;Planet Earth&quot;\n&quot;Hungry Like The Wolf&quot;\n&quot;All You Need Is Now&quot;\n&quot;Notorious&quot;\n&quot;Safe (In the Heat of the Moment)&quot; (with Ana Matronic)\n&quot;The Chauffeur&quot;\n&quot;Ordinary World&quot;\n&quot;Girl Panic!&quot;\n&quot;Sunrise&quot;\n&quot;Rio&quot;\nBond Medley / &quot;A View To A Kill&quot;\n&quot;Girls on Film&quot; / &quot;Poker Face&quot;","torrent":{"xt":"urn:btih:c7705a6c5577346bc2c8ffe8f21b66b3311b91e2","amp;dn":"Duran+Duran+-+Live+at+Coachella+Music+Festival+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7705a6c5577346bc2c8ffe8f21b66b3311b91e2","infoHashBuffer":{"type":"Buffer","data":[199,112,90,108,85,119,52,107,194,200,255,232,242,27,102,179,49,27,145,226]},"announce":[],"urlList":[]}}