{"title":"Szymanowski - The Collector's Edition - Simon Rattle [4 cd box]","uid":6116012,"size":1290025736,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c774012f832a5e16a295637ccc7ec3a8df75038c&amp;dn=Szymanowski+-+The+Collector%5C%27s+Edition+-+Simon+Rattle+%5B4+cd+box%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Lucy1948","files":100,"time":1295553740,"description":"This set comprises the best work that Simon Rattle has given us. The performers largely match or exceed the finest of what has come out of Poland in recent decades in this marvelous music, and if the chorus in the Stabat Mater and Litany doesn't have quite the amplitude of the best Eastern European groups, it still sings very well. More to the point: Thomas Zehetmair easily rises to the challenge of such predecessors as Kaja Danczowska in the violin concertos; Leif Ove Andsnes remains unsurpassed in the Sinfonia Concertante (Symphony No. 4); and this is hands down the finest version of King Roger ever recorded. Here and in the two song cycles the first-rate cast of international and Polish singers (including Philip Langridge, Thomas Hampson, and Iwona Sobotka) does the music proud. Harnasie is also terrific, its folk-music inspiration vigorously projected by Rattle and his team.\n\nThe orchestra sounds completely comfortable with Szymanowski's richly colored and ripely harmonized idiom, and as for Rattle, in this complex and largely unfamiliar music he seems gratifyingly concerned with serving the composer rather than drawing attention to himself through the gratuitous imposition of &quot;ideas&quot; that may or may not suit the music at hand. Excellent engineering and a booklet with full texts and translations instantly establish this as the set to own, whether you know Szymanowski well or are looking to get acquainted.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:c774012f832a5e16a295637ccc7ec3a8df75038c","amp;dn":"Szymanowski+-+The+Collector%5C%27s+Edition+-+Simon+Rattle+%5B4+cd+box%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c774012f832a5e16a295637ccc7ec3a8df75038c","infoHashBuffer":{"type":"Buffer","data":[199,116,1,47,131,42,94,22,162,149,99,124,204,126,195,168,223,117,3,140]},"announce":[],"urlList":[]}}