{"title":"Bad Company UK - Book Of The Bad (2001)","uid":10755743,"size":255706970,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c7af3a4dedb3668a44286ea7a15fc6f4f918dd65&amp;dn=Bad+Company+UK+-+Book+Of+The+Bad+%282001%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"geloso","files":-1,"time":1407888986,"description":"Artist: Bad Company UK\n\nTitle: Book Of The Bad\n\nLabel: BC Recordings\n\nCatalog#:: BCRUKEPCD001\n\nSource: 2xCD, Album\n\nRelease date: 2001-11-12\n\nFormat: mp3 320 kbps\n\nSize: 243 MB\n\nGenre: Electronic\n\nStyle: Drum &amp; Bass\n\n\n\nTracklist:\n\nCD 1\n\n01. Blind (07:30)\n\n02. Dogs On The Moon (07:00)\n\n03. The Voice (06:00)\n\n04. Numbers (07:10)\n\n05. Spider (05:59)\n\n06. Miami Flashback (04:55)\n\n07. Riptide (06:42)\n\n08. Planet Dust (07:10)\n\n\nCD 2\n\n01. Storyteller (06:14)\n\n02. Believe (06:36)\n\n03. Running man (08:14)\n\n04. Grunge 2 (06:25)\n\n05. Ladies of Spain (06:47)\n\n06. Atlantis remix (06:29)\n\n07. Rodeo (05:37)\n\n08. Mindgames (07:17)\n\nWikipedia:\nBad Company, Bad Company UK or simply BC (stylized as &quot;)E|3(&quot;) is the stage name of British drum and bass producers and supergroup Jason Maldini (Maldini), Darren White (dBridge), Dan Stein (Fresh), and Michael Wojcicki (Vegas).\n\nThe abbreviation of the name, )E|3(, is the group's logo as used on singles and album covers: the letters BC are mirrored on a vertical line (written as the letter I or as the pipe symbol |), whereas the B looks like the number 3 or letter E and the C like brackets.\n\nHistory:\n\nThey formed in 1998 as &quot;Bad Company&quot; from the ashes of Renegade Hardware acts Future Forces Inc (dBridge and Maldini) and Absolute Zero (DJ Fresh), although they had also worked together in various configurations: Stein, White and Maldini released The Code as Absolute Zero &amp; Subphonics on Renegade Hardware; Stein and Wojcicki released Otto's Way as Fresh &amp; Vegas on Metro Recordings, having met in Japan.\n\nThe group is known in the drum and bass industry for their 12&quot; single, &quot;The Nine&quot; / &quot;The Bridge&quot; (BCR001). Bad Company went on to produce three albums and various singles which were acclaimed with similar success, most notably &quot;Book Of The Bad&quot; (2000), a compilation album of their three Book Of The Bad vinyl EPs, featuring &quot;Miami Flashback&quot;, &quot;Planet Dust&quot; (originally released on Prototype Recordings), and &quot;Mind Games&quot;. The name Bad Company has been in disuse since about 2005, but the artists still work in the scene. Fresh had left Bad Company to pursue several solo projects under different record labels, such as Breakbeat Kaos, Ram Records, V Recordings, and Valve. D-Bridge kept producing alone as well, and started his own record label.\n\nMaldini continued to cooperate with Vegas, recording under the name &quot;Bad Company UK&quot;, a change which was needed because of a legal battle with the band formed in the 1970s with the same name. Their main label is Bad Taste Recordings. In 2010 the two producers formed the trio Blokhe4d along with Swiss producer Uman. Maldini and Vegas also created the Unique Artists record label, with the participation of a variety of producers from the scene.\n\nThe group had a fan forum on their website, which later became Dogs On Acid.\n\nIn 2008, readers of Knowledge Magazine voted &quot;The Nine&quot; as the number 1 drum &amp; bass track of all time.","torrent":{"xt":"urn:btih:c7af3a4dedb3668a44286ea7a15fc6f4f918dd65","amp;dn":"Bad+Company+UK+-+Book+Of+The+Bad+%282001%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7af3a4dedb3668a44286ea7a15fc6f4f918dd65","infoHashBuffer":{"type":"Buffer","data":[199,175,58,77,237,179,102,138,68,40,110,167,161,95,198,244,249,24,221,101]},"announce":[],"urlList":[]}}