{"title":"Joe Louis Walker Preacher and President(blues)(flac)[rogercc]","uid":6319201,"size":340111846,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c7d82aed23c5a015c3be1b8bf32eadf8f1bf3286&amp;dn=Joe+Louis+Walker+Preacher+and+President%28blues%29%28flac%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rogercc1","files":11,"time":1302806998,"description":"JOE LOUIS WALKER  PREACHER AND PRESIDENT\nLabel Verve \nRelease Date Aug 25, 1998\nFormat:Flac\n\nSan Francisco blues pilgrim Joe Louis Walker documents an eclectic career with a landmark album, assembling elements from his productive stabs at Delta and Chicago blues, slide acoustic and funk-rock, motor jazz and gospel. He even throws a taste of social commentary into the mix with the title cut of The Preacher and the President, which is mostly a tribute to (and graduation from) his preferred (and stricter) urban-pulpit forms of late. Sure to be criticized by some as lacking in depth, Walker makes up for it in range, with viable demonstrations of influence by Buddy Guy, B.B. King, and old roommate Mike Bloomfield. Those in the need of a smidge of convincing should cut directly to the way-down &quot;Uhhh!&quot; and the reassuringly lustful &quot;Yveline,&quot; since &quot;Repay My Love&quot; wouldn't offend a fan of easy listening, and the oddly colorless &quot;I Ain't Messin' Around&quot; speaks accurately of itself: it ain't. Too bad -- Walker's restraint reminds many blues fans of the glossy filler of Robert Cray rather than the gritty business of Otis Rush or T-Bone Walker, all considered influences of Walker's. A sturdy example of the multiple flavors of the modern blues. ~ Becky Byrkit[/color]\n\nTracklist\n1.Preacher and the President\n2.Yveline\n3.Repay My Love\n4.I'm Not Messin' Around\n5.Y&amp;T \n6.Lyin' in the Name of Love\n7.Pride of a Fool\n8.Uhh!\n9.Tell the Truth\n10.My Real Fantasy\n\nRecording information: Muscle Shoals Sound Studios, Sheffield, AL (12/03/1997-02/21/1998).\n\n\nPersonnel:\n Joe Louis Walker (vocals, guitar, percussion, background vocals); Steve Cropper (guitar); Mike Eppley (strings, piano); Noel Catura (soprano saxophone, baritone saxophone); Harvey Thompson (tenor saxophone); Jim Horn (baritone saxophone); Eddie Ramirez (trumpet, trombone); Mike Haynes (trumpet); Charles Rose (trombone); Clayton Ivey (piano); Carl Marsh (keyboards); David Hood (bass guitar); Roger Hawkins (drums); Chris Sandoval (timbales).","torrent":{"xt":"urn:btih:c7d82aed23c5a015c3be1b8bf32eadf8f1bf3286","amp;dn":"Joe+Louis+Walker+Preacher+and+President%28blues%29%28flac%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7d82aed23c5a015c3be1b8bf32eadf8f1bf3286","infoHashBuffer":{"type":"Buffer","data":[199,216,42,237,35,197,160,21,195,190,27,139,243,46,173,248,241,191,50,134]},"announce":[],"urlList":[]}}