{"title":"(Ski Movie 2010) Level 1 - Refresh.mkv","uid":5157540,"size":495110069,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c828fb0665d39fe611cbd3b115c07cc6d845a725&amp;dn=%28Ski+Movie+2010%29+Level+1+-+Refresh.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"steffosilvestri","files":1,"time":1257946675,"description":"Never before has the sport of skiing changed and progressed so much, so quickly, as it has over the past decade. With changes in equipment, accessibility of terrain, and most importantly the mindset of some of the worldï¿½s best athletes, skiing today is not what it once wasï¿½ An integral part of these recent changes, Level 1 looks back and challenges perspectives of where the sport has come from, and where itï¿½s going in their tenth-anniversary offering, ï¿½Refresh.ï¿½ Keeping true to their humble roots while exploring every arena that skiing has to offer the Level 1 crew serves up the most diverse ski entertainment to date. New things will never get old- fresh images of big jumps, deep powder, technical urban exploits, steep lines, and memorable terrain park action with a collection of the sportï¿½s best and brightest talent. \n\nFeaturing:\nTom Wallisch, Wiley Miller, Tanner Rainville, Duncan Adams, Phil Casabon, Henrik Harlaut, Mike Riddle, Josh Bibby, Liam Downey, Corey Vanular, Mike Hornbeck, Stefan Thomas, Will Wesson, Adam Delorme, Ahmet Dadali, JF Houle, Arnaud Rougier, Niklas Eriksson, and others.\n\nShot on location at:\nSEABA/Haines AK, Mammoth Mountain CA, Denver CO, Michigan, Salt Lake City UT, Chamonix and Tignes France, Baldface Lodge BC, Helsinki Finland, Are Sweden, Trysil Norway, Copper Mtn CO, Alta UT, Eclipse Snow Park CO, Squaw Valley CA, Windells/Timberline OR, Montana, Eastern Canada, Keystone CO, Revelstoke Mountain Resort BC, and Crested Butte CO\n\nProudly supported by:\nDynastar/Lange, Spyder, Under Armour, Skullcandy, Jiberish, Spy Optic, SWEET, Freeskier Magazine, Level, SBC Skier, Moment Skis, Orage, Amplid, Volkl, 4Frnt, Full Tilt, Kombi, EC Headwear\n","torrent":{"xt":"urn:btih:c828fb0665d39fe611cbd3b115c07cc6d845a725","amp;dn":"%28Ski+Movie+2010%29+Level+1+-+Refresh.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c828fb0665d39fe611cbd3b115c07cc6d845a725","infoHashBuffer":{"type":"Buffer","data":[200,40,251,6,101,211,159,230,17,203,211,177,21,192,124,198,216,69,167,37]},"announce":[],"urlList":[]}}