{"title":"Earth 1947 - Deepa Mehta","uid":4206994,"size":732808260,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c890d1746f21a14768c25becbd8304e1a074f272&amp;dn=Earth+1947+-+Deepa+Mehta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"somfatmtylm","files":2,"time":1211851318,"description":"No sub-titles added as yet but will do so in next few days. Most of the story is in English with a mixture of other Indian languages so it is intelligible without sub-titles.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0150433/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0150433/&lt;/a&gt;\n\nA beautiful and haunting film, \\&quot;Earth\\&quot; is set in India during 1947, which saw independence granted and the Indian sub-continent divided between Muslim Pakistan and (largely) Hindu India. History is seen through the eyes of Lenny, an eight-year-old girl from the numerically tiny Parsee sect, the members of which are professedly \\&quot;neutral\\&quot; in the conflict between Hindu and Muslim. The action takes place in Lahore, in the Punjab, an ancient cosmopolitan city where Muslim, Hindu, Sikh and Parsee lived side by side in reasonable harmony until partition, when unspeakable violence broke out, as it did in many other parts of India. Over a million people died in the sub-continent and perhaps 12 million people fled their homes.\n\nThe film, based on the autobiographical novel \\&quot;Cracking India\\&quot; by Bapsi Sidhwa, concentrates on the effect the civil turmoil has on personal relationships. Somehow, politics brings out the worst in everyone; submerged resentments and trivial jealousies fuel shocking atrocities. Even innocent little Lenny manages to act badly, despite her \\&quot;neutral\\&quot; status.\n\nDespite the presence of at least one \\&quot;Bollywood\\&quot; star (Aamir Khan) the director, Deepa Mehta, has not made a crowd-pleaser here. There are survivors, but no surviving heroes. The story unfolds first at a leisurely pace, gaining speed as independence day approaches and ends in a montage of mobs, destruction and violence. Every scene is beautifully composed and almost every part sensitively played. Maia Sethna as Lenny, Nandita Das as her beautiful young nanny Shasta , Rahul Khanna as Hasan, Shastas\\&amp;#039; lover and Aamir Khan as Dil Navaz the \\&amp;#039;ice candy man\\&quot; are all stand-outs. While not actually filmed in Lahore (the authorities there were not keen, it seems) the film evokes superbly a hot, ancient and troubled land. The whole style of the film is quite different from anything to emerge out of Hollywood and that alone makes it worth seeing.\n\nIt is suggested in the film that perhaps the villain here was that old standby, human nature. It does seem, though, that the British India administration (represented here only by one drunken official at a dinner party) and particularly the British government, had a lot to answer for. The twenty-five years or so leading up to independence were marked by the failure of successive conservative British governments to allow a truly responsible democracy to emerge in India when it was quite clear by the end of World War One that independence was inevitable. (The white Dominions on the other hand were practically pushed into independence.) Then, when the post-war Labour government decided to grant independence it did so with unseemly and disastrous haste. No, the chief villain was perfidious Albion, or rather British \\&quot;muddling through\\&quot;. Here we get a beautiful, moving, elegiac account of the victims of bad colonial policy driven by racism and unenlightened self-interest.\n","torrent":{"xt":"urn:btih:c890d1746f21a14768c25becbd8304e1a074f272","amp;dn":"Earth+1947+-+Deepa+Mehta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c890d1746f21a14768c25becbd8304e1a074f272","infoHashBuffer":{"type":"Buffer","data":[200,144,209,116,111,33,161,71,104,194,91,236,189,131,4,225,160,116,242,114]},"announce":[],"urlList":[]}}