{"title":"Spark: The Revolutionary New Science of Exercise and the Brain","uid":5230689,"size":546157713,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c9096ca9a1c4ac73635b28f2a1f16acb7e967b75&amp;dn=Spark%3A+The+Revolutionary+New+Science+of+Exercise+and+the+Brain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"KKELTIKK","files":2,"time":1261320472,"description":"Description:\n\nA groundbreaking and fascinating investigation into the transformative effects of exercise on the brain, from the bestselling author and renowned psychiatrist John J. Ratey, MD.\n\n\n\nDid you know you can beat stress, lift your mood, fight memory loss, sharpen your intellect, and function better than ever simply by elevating your heart rate and breaking a sweat? The evidence is incontrovertible: Aerobic exercise physically remodels our brains for peak performance. \n\n\nIn SPARK, John J. Ratey, M.D., embarks upon a fascinating and entertaining journey through the mind-body connection, presenting startling research to prove that exercise is truly our best defense against everything from depression to ADD to addiction to aggression to menopause to Alzheimer's. Filled with amazing case studies (such as the revolutionary fitness program in Naperville, Illinois, which has put this school district of 19,000 kids first in the world of science test scores), SPARK is the first book to explore comprehensively the connection between exercise and the brain. It will change forever the way you think about your morning run---or, for that matter, simply the way you think\n\n\n***\n\nMore info: http://www.amazon.com/Spark-Revolutionary-Science-Exercise-Brain/dp/0316113506/\n\nBuy the book, it's always better to read after listening.","torrent":{"xt":"urn:btih:c9096ca9a1c4ac73635b28f2a1f16acb7e967b75","amp;dn":"Spark%3A+The+Revolutionary+New+Science+of+Exercise+and+the+Brain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9096ca9a1c4ac73635b28f2a1f16acb7e967b75","infoHashBuffer":{"type":"Buffer","data":[201,9,108,169,161,196,172,115,99,91,40,242,161,241,106,203,126,150,123,117]},"announce":[],"urlList":[]}}