{"title":"Russian Tanks of World War II: Stalin's Armoured Might","uid":9767062,"size":38338126,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c93b8bd7c69ceea5ea140181054482ca76496a90&amp;dn=Russian+Tanks+of+World+War+II%3A+Stalin%27s+Armoured+Might&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"JinRohEX","files":-1,"time":1394895768,"description":"Russian Tanks of World War II: Stalin's Armoured Might\nby Tim Bean &amp; Will Fowler\n\nDESCRIPTION:\n\nAt the start of the campaign on the Eastern Front, in the earliest days of Operation Barbarossa, it was the German armour that swept all in front of it as the Wehrmacht drove eastwards in an unrelenting advance on Leningrad, Moscow and Stalingrad. The ill-prepared and under-resourced Russian forces were forced to retreat. Gradually, the balance of the war swung in favor of the Russian forces, whose strength both in numbers and equipment proved decisive in the ultimate defeat of the German forces in the east. Critical in the Soviet victory was its armour; tanks such as the T-34 proving the equal, if not better than, some of the tanks available to the Germans. This authoritative history of the Soviet forces before and during World War 2, reveals the development of their tactics in the early post-revolutionary era right through to the ultimate victory in Berlin in May 1945. The dramatic struggle of the tank crews against the German advance is told through some 200 contemporary photographs, many of which have never been seen before. The photographs include images of tank training in the 1920s and 1930s, on active service, and many compelling pictures from some of the major tank battles of the day. Over the past five years, aided by the opening up of archives in Russia previously closed to western experts, there has been a massive growth in interest in the events that occurred on the Eastern Front. Russian Tanks is an important addition to the literature currently available, exploring as it does, the vitally important Soviet armour of the period.","torrent":{"xt":"urn:btih:c93b8bd7c69ceea5ea140181054482ca76496a90","amp;dn":"Russian+Tanks+of+World+War+II%3A+Stalin%27s+Armoured+Might","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c93b8bd7c69ceea5ea140181054482ca76496a90","infoHashBuffer":{"type":"Buffer","data":[201,59,139,215,198,156,238,165,234,20,1,129,5,68,130,202,118,73,106,144]},"announce":[],"urlList":[]}}