{"title":"Last Tango In Halifax (UK) COMPLETE Series 1 (2012) 720p","uid":8509853,"size":5579774312,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:c977751f241de26d7f3f9e849f4e07ac1332c063&amp;dn=Last+Tango+In+Halifax+%28UK%29+COMPLETE+Series+1+%282012%29+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Drizzle99","files":6,"time":1369540270,"description":"Last Tango in Halifax is a British romantic drama series that first aired on BBC One on 20 November 2012. The series was written by Sally Wainwright, who was inspired by witnessing the happiness her mother's second marriage brought her late in life. Last Tango in Halifax stars Derek Jacobi and Anne Reid as two widowed and retired septuagenarians, Alan and Celia. Alan and Celia were childhood sweethearts, though were estranged for sixty years. Upon re-uniting via the social networking sitethey meet up, fall in love and plan to get married. Reid and Jacobi enjoyed having the chance to play out a love story between older people that wasn't ageist or stereotyped.\n\nLast Tango in Halifax's strong ratings ensured that a second series was commissioned. The series has also been praised for its depiction of the older generation, the strong acting and the believable dialogue. A critic for The Daily Telegraph summarised the series as &quot;a triumph against TV's ageism&quot; whilst it has also been endorsed by an executive member of the charity Age UK. Last Tango in Halifax accrued four nominations for the upcoming 2013 British Academy Television Awards, eventually winning the British Academy Television Award for Best Drama Series.\n\nPlease seed after downloading!","torrent":{"xt":"urn:btih:c977751f241de26d7f3f9e849f4e07ac1332c063","amp;dn":"Last+Tango+In+Halifax+%28UK%29+COMPLETE+Series+1+%282012%29+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c977751f241de26d7f3f9e849f4e07ac1332c063","infoHashBuffer":{"type":"Buffer","data":[201,119,117,31,36,29,226,109,127,63,158,132,159,78,7,172,19,50,192,99]},"announce":[],"urlList":[]}}