{"title":"The Rentals - Lost in Alphaville (2014) [FLAC]","uid":10817875,"size":293473518,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c99fb860de8356006fec4868c98b85247a491264&amp;dn=The+Rentals+-+Lost+in+Alphaville+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1408483981,"description":"\n  The Rentals - Lost in Alphaville (2014) [FLAC]\n\n  Genre: Rock\n  Styles: Indie, Alternative\n  Source: CD \n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 It's Time to Come Home\n  02 Traces of Our Tears\n  03 Stardust\n  04 1000 Seasons\n  05 Damaris\n  06 Irrational Things\n  07 Thought of Sound\n  08 Song of Remembering \n  09 Seven Years\n  10 The Future\n\n  The Rentals were the new wave-influenced project of singer/songwriter Matt Sharp, former bassist for power pop favorites Weezer. Born in Arlington, VA, on September 22, 1969, Sharp co-founded Weezer in 1992, and in the months to follow, the band emerged as one of the most popular up-and-coming acts on the Los Angeles club scene; their self-titled debut LP appeared on Geffen two years later, becoming a major hit thanks their smash single and video &quot;Buddy Holly.&quot; During the spring of 1994, Sharp mounted the first Rentals studio session. Assembling a roster including Weezer drummer Pat Wilson, that dog. violinist Petra Haden, vocalist/keyboardist Cherielynn Westrich, and guitarist Rod Cervera, subsequent dates yielded the group's 1995 debut, Return of the Rentals, which notched a hit with the infectious &quot;Friends of P.&quot; Sharp returned to Weezer to record the band's acclaimed 1996 follow-up, Pinkerton, but announced his exit from the lineup in February 1998; the second Rentals album, Seven More Minutes, followed a year later. After a six-year hiatus, Sharp brought back The Rentals in 2005. After touring with Ozma in the summer of 2006, Sharp's group released the EP The Last Little Life in 2007. In December of the same year, The Rentals announced that they would begin recording a new album in 2008. The resulting Songs About Time, a 2009 multimedia project consisting of photographs, short films, and three mini-albums, was made available in a limited-edition deluxe box set in 2010. In April of 2011, the band released Present Resilience: A Benefit Album For the Japanese Relief.","torrent":{"xt":"urn:btih:c99fb860de8356006fec4868c98b85247a491264","amp;dn":"The+Rentals+-+Lost+in+Alphaville+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c99fb860de8356006fec4868c98b85247a491264","infoHashBuffer":{"type":"Buffer","data":[201,159,184,96,222,131,86,0,111,236,72,104,201,139,133,36,122,73,18,100]},"announce":[],"urlList":[]}}