{"title":"Star Wars Empire At War Forces Of Corruption","uid":4565662,"size":1459260557,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c9d87df1afa1a2480e2a195b7d052f1994fbda89&amp;dn=Star+Wars+Empire+At+War+Forces+Of+Corruption&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"fallos0","files":9,"time":1228860590,"description":"The  battle  for control of the galaxy expands with the release of\n     Star  Wars Empire at War: Forces of Corruption. This expansion for\n     the  best-selling  PC  game  of  Q1 2006 features the underworld&amp;#039;s\n     point  of  view  of  the  Galactic Civil War. The Rebels have just\n     destroyed  the  Death  Star,  and  the galaxy is in turmoil. As an\n     aspiring  Underworld  figure  named  Tyber Zann, spread corruption\n     throughout  the  galaxy  using  new strategic gameplay elements to\n     influence   other   factions,   steal   their  funds,  slow  their\n     production,  spy  on  them  and  more.  Exciting new land-tactical\n     options  like customizable, upgradeable bases and guerilla warfare\n     allow  for  innovative  battlefield  tactics.  Take command of and\n     confront  new  fighting  units  for  all  factions (Rebel B-wings,\n     Imperial  TIE  interceptors,  Darth  Vader&amp;#039;s  Executor  Super Star\n     Destroyer  and  more), and take down anyone who stands in your way\n     of ruling the Underworld, be they new battlefield heroes like Luke\n     Skywalker and Yoda, or the forces of your most bitter rival, Jabba\n     the  Hutt. Destroy capital ships with the awesome firepower of the\n     second  Death  Star,  and  satiate Tyber&amp;#039;s drive for the deadliest\n     capital  ship  in  the galaxy, a devastatingly powerful Super Star\n     Destroyer known as the Eclipse.\n\n     Major additions to the game include:\n\n     A  new  Zann  Consortium faction whose powers will include bribing\n     enemy  units,  stealing  credits from other factions, slowing down\n     enemy  unit  production and purchasing units and upgrades from the\n     black market.\n\n     The  ability  to select the placement of structures and units on a\n     planet&amp;#039;s surface.\n\n     The ability to pre-select which unit will be the player&amp;#039;s starting\n     unit during space or ground battles.\n\n     13  new  planets  including  Mandalore,  Hypori,  Honoghr, TheMaw,\n     Felucia,   Mustafar,   Kamino,   Utapau,   Saleucami,  and  Myrkr.\n\n     The  ability to transport units in vehicles during ground battles.\n     The  ability to call in an orbital bombardment when a capital ship\n     is in orbit.\n\n     The  Zann  Consortium and Galactic Empire will have the ability to\n     cloak certain ships and vehicles.\n\n     Mobile  defense  platforms (moving build pads) for ground battles.\n\n     New  types  of  terrain  on  some  planets. New terrain types will\n     include terrain that can only be crossed by infantry, terrain that\n     can  not  be crossed by heavy vehicles and terrain that can damage\n     your units.\n\n     Higher resolution textures for better graphics\n\n     Larger maps (30% - 40% bigger)","torrent":{"xt":"urn:btih:c9d87df1afa1a2480e2a195b7d052f1994fbda89","amp;dn":"Star+Wars+Empire+At+War+Forces+Of+Corruption","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9d87df1afa1a2480e2a195b7d052f1994fbda89","infoHashBuffer":{"type":"Buffer","data":[201,216,125,241,175,161,162,72,14,42,25,91,125,5,47,25,148,251,218,137]},"announce":[],"urlList":[]}}