{"title":"Marquis De Sade - 120 Days Of Sodom [PDF]","uid":5666945,"size":1693331,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9e6ef7c07e4f0a38a051a35b47a41a7e9b2cf3a&amp;dn=Marquis+De+Sade+-+120+Days+Of+Sodom+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"insinuendo","files":1,"time":1278177726,"description":"The Marquis de Sade, vilified by respectable society from his own time through ours, apotheosized by Apollinaire as &quot;the freest spirit that has yet existed,&quot; wrote The 120 Days of Sodom while imprisoned in the Bastille. An exhaustive catalogue of sexual aberrations and the first systematic exploration-a hundred years before Krafft-Ebing and Freud-of the psychology of sex, it is considered Sade's crowning achievement and the cornerstone of his thought. Lost after the storming of the Bastille in 1789, it was later retrieved but remained unpublished until 1935.\nIn addition to The 120 Days, this volume includes Sade's &quot;Reflections on the Novel,&quot; his play Oxtiem, and his novella Ernestine. The selections are introduced by Simone de Beauvoir's landmark essay &quot;Must We Burn Sade?&quot; and Pierre Klossowski's provocative &quot;Nature as Destructive Principle.&quot; &quot;Imperious, choleric, irascible, extreme in everything, with a dissolute imagination the like of which has never been seen, atheistic to the point of fanaticism, there you have me in a nutshell, and kill me again or take me as I am, for I shall not change.&quot;-From Sade's Last Will and Testament","torrent":{"xt":"urn:btih:c9e6ef7c07e4f0a38a051a35b47a41a7e9b2cf3a","amp;dn":"Marquis+De+Sade+-+120+Days+Of+Sodom+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9e6ef7c07e4f0a38a051a35b47a41a7e9b2cf3a","infoHashBuffer":{"type":"Buffer","data":[201,230,239,124,7,228,240,163,138,5,26,53,180,122,65,167,233,178,207,58]},"announce":[],"urlList":[]}}