{"title":"Birds of Steel NTSC XBOX360-COMPLEX","uid":7101790,"size":8739294216,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:ca2874b731a7ef561b8e335d19c1759700b6c69e&amp;dn=Birds+of+Steel+NTSC+XBOX360-COMPLEX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"boobsman","files":-1,"time":1331720686,"description":"THIS IS AN XGD3 ISO AND IS ONLY BE PLAYABLE WITH LT+2.0 or ABOVE!!!\n\nBirds of Steel NTSC XBOX360-COMPLEX\n\nBirds of Steel is a combat simulator featuring some of the most pivotal air battles of World \nWar II, including the battle of Midway, Guadalcanal, Coral Sea, the historic attack on Pearl \nHarbour, the Mediterranean Maltese island and more. Birds of Steel offers 20 historical and \na wealth of fictitious missions, spanning eight world famous campaigns, and users are given\naccess to over 100 famous planes from the entire axis and allied forces rosters. A number \nof planes ideal for each campaign can be selected, and have been faithfully recreated in \nterms of handling, capabilities and weaponry. The classic Spitfire, P-51D Mustangs, and \nMesserschmidt 109 are all lined up for combat, as players opt to player opt to fight for \nthe Allies, Japanese or Axis forces. Birds of Steel also enjoys a huge online element. \nPlayers can support co-op missions alongside friends, or enter massive multi-player \nonline dogfights to see who owns the skies.\n\nFeatures:\n\nOver 100 real life planes - Dog fight and dive bomb in actual WW2 planes and rain down terror \nfrom above. Determine for yourself which plane is the ultimate bird of prey.\n\nNavigate through hundreds missions - Embark on 20 historical missions, hundreds of procedural \nmissions scattered throughout 16 different locations. All are inspired by real life campaigns \nsuch as Pearl Harbor, Guadalcanal and the battle of Wake Island. Reality is reflected using \nreal life maps and actual satellite photos of these areas.\n\nPioneering online and multi-player modes for flight sims - Enjoy 4 player co-op or go into the \nnew and unique online war mode to compete against up to 16 aviators across world.\n\nKey innovations - In every single warplane you will experience the unique details of the physics \nand damage models. Master your dogfights during heavy wind and rain. Each plane has over 100 \nhitpoints where each part of the plane has its own health and damage detection.\n\nFun for all gamers - Multiple levels of realism offer a gameplay experience for gamers of all \nwalks: Simplified, Realistic up to Simulator for the serious flight-sim aficionados.\n\nPlatform: XBOX360 \nRegion: NTSC/U &amp; NTSC/J\nFormat: XGD3\nSize: 1 DVD \nGenre: Simulator \nLanguages: English \n\nXGD3 BURN GUIDE: http://nickthegr33k.eu/XGD3burn.pdf\n &lt;a href=&quot;\nhttp://www.freeimage.us/image-0769_4F60548D.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freeimage.us/image-0769_4F60548D.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://www.freeimage.us/image-9A53_4F60548D.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freeimage.us/image-9A53_4F60548D.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ca2874b731a7ef561b8e335d19c1759700b6c69e","amp;dn":"Birds+of+Steel+NTSC+XBOX360-COMPLEX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca2874b731a7ef561b8e335d19c1759700b6c69e","infoHashBuffer":{"type":"Buffer","data":[202,40,116,183,49,167,239,86,27,142,51,93,25,193,117,151,0,182,198,158]},"announce":[],"urlList":[]}}