{"title":"Head First PMP: A Brain-Friendly Guide to Passing the Project Ma","uid":4723291,"size":39595062,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb0b791f376cb62bfa555bc77d53fad7fe1f2921&amp;dn=Head+First+PMP%3A+A+Brain-Friendly+Guide+to+Passing+the+Project+Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":5,"uploader":"VasiaZozulia","files":1,"time":1234625129,"description":"A PMP certification is more than just passing a test. It means that you have the knowledge to solve most common project problems, and proves that you know your stuff. Once you're certified, your projects are more likely to succeed because you have the skills and knowledge to make them successful. Not only that, it can mean a better job, more money, and greater respect from your peers. \nBut studying for a difficult four-hour exam on project management isn't easy, even for experienced project managers. You want to remember everything that you're learning about project management, but your brain is working against you! Your brain craves novelty, and most PMP certification prep books are anything but novel. When you keep putting down a boring book instead of studying, it's because your brain doesn't think the information in it is worth learning. Your brain has more important stuff to think about, like how to keep you alive and out of danger-and it doesn't think that failing the PMP exam qualifies as life-threatening! \nSo how do you trick your brain into thinking that your life does depend on learning everything you need to know to pass the PMP Exam? Head First PMP is the answer! Using the latest research in neurobiology, cognitive science and learning theory, Head First PMP has a visually rich format designed for the way your brain works-a multi-sensory experience that helps the material stick, not a text-heavy approach that puts you to sleep. \nHead First PMP offers 100% coverage of The PMBOKÃ‚Â® Guide principles and certification objectives in a way that's engaging, not tedious. This book helps you prepare for the PMP certification exam with a unique method that goes beyond answers to specific questions and makes you think about the big picture of project management. By putting project management concepts into context, you will be able to understand, remember, and apply them-not just on the exam, but also on the job. \nWith Head First PMP, you get the best of both worlds: a thorough and effective preparation guide for the PMP certification exam with hundreds of practice questions and exam strategies, along with puzzles, games, problems, exercises and the unique Head First approach that makes learning easy and entertaining. When you're done with Head First PMP, you'll know your stuff, you'll pass the exam, and you'll be able to bring everything you've learned to your job. \n\n","torrent":{"xt":"urn:btih:cb0b791f376cb62bfa555bc77d53fad7fe1f2921","amp;dn":"Head+First+PMP%3A+A+Brain-Friendly+Guide+to+Passing+the+Project+Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb0b791f376cb62bfa555bc77d53fad7fe1f2921","infoHashBuffer":{"type":"Buffer","data":[203,11,121,31,55,108,182,43,250,85,91,199,125,83,250,215,254,31,41,33]},"announce":[],"urlList":[]}}