{"title":"Hank Locklin - Send Me The Pillow You Dream On - 1948-1955","uid":6435176,"size":397787142,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cb1583acac40e3c5ba622684dd7cd8f74c8ddced&amp;dn=Hank+Locklin+-+Send+Me+The+Pillow+You+Dream+On+-+1948-1955+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"bonnie335","files":79,"time":1306785995,"description":"This triple-CD set is fascinating as well as priceless -- 66 sides cut by Hank Locklin between 1948 and 1954 for Gold Star, Four Star, and Decca. The majority of the tracks here will be new to most listeners, never having been reissued in any ...    Full Descriptionform (or in redubbed form) from their original 78 rpm appearances. They present Locklin doing a rougher, harder honky-tonk brand of music, derived from Texas dance-band roots, but different from the Nashville countrypolitan sound with which he achieved lasting fame -- compared to his later, softer material, this stuff rocks. The early Gold Star and Royalty sides come from decent masters, with a certain amount of noise (the bass tends to boom) that is unavoidable, but otherwise they're pretty impressive. Of his early Four Star releases, the most unexpected treats are &quot;Knocking at Your Door,&quot; Locklin's theme song in his Texas period, and the heavily Hank Williams-influenced &quot;Born to Ramble.&quot; The latter is a revelation, showing Locklin to be a talented yodeler, among other surprises. &quot;Send Me the Pillow That You Dream On&quot; is also here in its original version, a lot less slick than the 1957 hit version off of RCA. Even at this point, Locklin's music was weighted toward ballads, although he interjected bright dance numbers. Disc Two is still honky-tonk-based but slicker, with better players all around. Disc Three opens with Locklin's move to Nashville in 1952, under the aegis of Owen Bradley -- the sound on those first sessions is smooth, almost elegant compared with the Texas-based stuff, and shows Locklin hitting his stride as a singer and bandleader, predating the full bloom of his Nashville period. The music on this disc flows seamlessly into the RCA period covered by the next Bear Family box, and Locklin's better-known RCA sides. ~ Bruce Eder","torrent":{"xt":"urn:btih:cb1583acac40e3c5ba622684dd7cd8f74c8ddced","amp;dn":"Hank+Locklin+-+Send+Me+The+Pillow+You+Dream+On+-+1948-1955+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb1583acac40e3c5ba622684dd7cd8f74c8ddced","infoHashBuffer":{"type":"Buffer","data":[203,21,131,172,172,64,227,197,186,98,38,132,221,124,216,247,76,141,220,237]},"announce":[],"urlList":[]}}