{"title":"Fujiya &amp; Miyagi - Transparent Things (2006)","uid":4858791,"size":55828131,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cb166d2725d73faac66d104ad0b0ca6ebb08da12&amp;dn=Fujiya+%26+Miyagi+-+Transparent+Things+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"NixSoul","files":10,"time":1240173343,"description":"Despite the name, Fujiya &amp; Miyagi are neither Japanese nor a duo. The electronic trio of singer and guitarist David Best, synth player Steve Lewis, and bassist Matt Hainsby are deeply indebted both to vintage '70s Krautrock and the '90s bands that were themselves influenced by the likes of Neu! and Kraftwerk, from Stereolab and Broadcast to Aphex Twin and the Orb. The group started in the coastal city of Brighton, England, in 1999, when Best and Lewis first met in a pickup football game. Taking their name at random from Mr. Miyagi in The Karate Kid and a brand of stereo equipment, Best and Lewis recorded their first album, Electro Karaoke in the Negative, as a duo, releasing it on the Tirk Records label in 2003. In preparation for touring behind the album, Best and Lewis formed a full-band iteration of Fujiya &amp; Miyagi, including bassist Grunder and drummer Matthew Avery. When recording sessions started for the band's second album, Best and Lewis felt the four-piece lineup didn't work in the studio and reverted briefly to a duo before adding Hainsby on bass and additional keyboards. Thus constituted, Fujiya &amp; Miyagi completed their second album, Transparent Things, which was released in the spring of 2006. Stewart Mason, All Music Guide","torrent":{"xt":"urn:btih:cb166d2725d73faac66d104ad0b0ca6ebb08da12","amp;dn":"Fujiya+%26+Miyagi+-+Transparent+Things+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb166d2725d73faac66d104ad0b0ca6ebb08da12","infoHashBuffer":{"type":"Buffer","data":[203,22,109,39,37,215,63,170,198,109,16,74,208,176,202,110,187,8,218,18]},"announce":[],"urlList":[]}}