{"title":"Key Terms in Logic","uid":6017407,"size":682005,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb349c0118b24a4a3d259a2e8a6e3ea67c8d27b5&amp;dn=Key+Terms+in+Logic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":1,"time":1291684165,"description":"This is an accessible guide for those facing the study of Logic for the first time, this book covers key thinkers, terms and texts. &quot;The Key Terms in Philosophy&quot; series offers clear, concise and accessible introductions to the central topics in philosophy. Each book offers a comprehensive overview of the key terms, concepts, thinkers and major works in the history of a key area of philosophy. Ideal for first-year students starting out in philosophy, the series will serve as the ideal companion to study of this fascinating subject. &quot;Key Terms in Logic&quot; offers the ideal introduction to this core area in the study of philosophy, providing detailed summaries of the important concepts in the study of logic and the application of logic to the rest of philosophy. A brief introduction provides context and background, while the following chapters offer detailed definitions of key terms and concepts, introductions to the work of key thinkers and lists of key texts. Designed specifically to meet the needs of students and assuming no prior knowledge of the subject, this is the ideal reference tool for those coming to Logic for the first time. &quot;The Key Terms&quot; series offers undergraduate students clear, concise and accessible introductions to core topics. Each book includes a comprehensive overview of the key terms, concepts, thinkers and texts in the area covered and ends with a guide to further resources.\n\nContinuum \nNumber Of Pages: 192 \nPublication Date: 2010-11-18 \n","torrent":{"xt":"urn:btih:cb349c0118b24a4a3d259a2e8a6e3ea67c8d27b5","amp;dn":"Key+Terms+in+Logic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb349c0118b24a4a3d259a2e8a6e3ea67c8d27b5","infoHashBuffer":{"type":"Buffer","data":[203,52,156,1,24,178,74,74,61,37,154,46,138,110,62,166,124,141,39,181]},"announce":[],"urlList":[]}}