{"title":"Phish-At The Roxy-Atlanta '93-Liv","uid":4521790,"size":537423042,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cbb2698aa3f1f182a84f795f9a1b3d2a1ef781f0&amp;dn=Phish-At+The+Roxy-Atlanta+%5C%2793-Liv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"SecondOpinion","files":-1,"time":1227194228,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nPhish is an American jam band noted for their musical improvisation, extended jam sessions, and cult following. Formed at the University of Vermont in 1983, the band's four members performed together for over 20 years until their breakup in August 2004. The band has recently announced they would reunite for a tour in 2009 starting with three shows at the Hampton Coliseum in Hampton, Virginia.\nTheir music blends elements of a wide variety of genres, including rock, jazz, bluegrass, and funk. Each of their concerts was original in terms of the songs performed, the order in which they appeared, and the way in which they were performed.\nAlthough the group received little radio play or MTV exposure, Phish developed a large and dedicated following by word of mouth, via Phish.net (originally a mailing list, then a Usenet newsgroup, now a website), and the exchange of live recordings. Rolling Stone hailed them as &quot;the most important band of the 90s&quot; and stated that the band helped to &quot;...spawn a new wave of bands oriented around group improvisation and superextended grooves\n\n\nPhish var ett amerikanskt rockband aktivt frÃƒÆ’Ã‚Â¥n 1983 till 2004. Bandet bildades i Vermont av gitarristen Trey Anastasio. Andra medlemmar var Jon Fishman, Page Mconnell och Mike Gordon. Phish ÃƒÆ’Ã‚Â¤r allmÃƒÆ’Ã‚Â¤nt sedda som det stÃƒÆ’Ã‚Â¶rsta av de amerikanska &quot;jambanden&quot; (det vill sÃƒÆ’Ã‚Â¤ga rockgrupper som improviserar mycket live) en term som ursprungligen skapades av Grateful Dead och The Allman Brothers Band i slutet av 1960-talet.\nBen &amp; Jerrys glass Phish food ÃƒÆ’Ã‚Â¤r uppkallad efter detta band.\n\n","torrent":{"xt":"urn:btih:cbb2698aa3f1f182a84f795f9a1b3d2a1ef781f0","amp;dn":"Phish-At+The+Roxy-Atlanta+%5C%2793-Liv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbb2698aa3f1f182a84f795f9a1b3d2a1ef781f0","infoHashBuffer":{"type":"Buffer","data":[203,178,105,138,163,241,241,130,168,79,121,95,154,27,61,42,30,247,129,240]},"announce":[],"urlList":[]}}