{"title":"Il Deserto Rosso aka Red Desert 1964 DVDRip Sonata Premiere","uid":8863305,"size":1087388357,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cbb2148339500cac752744201826a98ca0909443&amp;dn=Il+Deserto+Rosso+aka+Red+Desert+1964+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"klinho","files":4,"time":1377828714,"description":"Red Desert (Il Deserto Rosso) once more combines the considerable talents of director Michelangelo Antonioni and star Monica Vitti. Cast as Giuliana, an unhappy wife, Vitti suffers from an unnamed form of depression and malaise. Her quicksilver emotional shifts disturb everyone around her, but they, like she, pretend that nothing is truly wrong. British engineer Corrado Zeller (Richard Harris) seems to understand what Giuliana is really after in life, and he acts upon it by entering into an affair with the troubled woman. Giuliana eventually comes to terms with her physical and mental pain, but this hardly means that she's &quot;cured&quot; in the conventional sense. Monica Vitti's sense of isolation is heightened by Antonioni's (and cinematographer Carlo DiPalma's) choice of colors, and especially by Carlo Savina's bizarre electronic musical score. This is a landmark movie in Antonioni's effort to portray alienated individuals in contemporary life; he places people against towering forms of technology to emphasize their smallness and lostness in the modern world of technological change. \n\n\nSubs srt: Portuguese / English / French","torrent":{"xt":"urn:btih:cbb2148339500cac752744201826a98ca0909443","amp;dn":"Il+Deserto+Rosso+aka+Red+Desert+1964+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbb2148339500cac752744201826a98ca0909443","infoHashBuffer":{"type":"Buffer","data":[203,178,20,131,57,80,12,172,117,39,68,32,24,38,169,140,160,144,148,67]},"announce":[],"urlList":[]}}