{"title":"Worlds Without End: The Many Lives of the Multiverse (2014)","uid":9710470,"size":7381486,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cbbf2c49f1c85255622bed228944d888e598b209&amp;dn=Worlds+Without+End%3A+The+Many+Lives+of+the+Multiverse+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":1,"time":1394106175,"description":"&quot;Multiverse&quot; cosmologies imagine our universe as just one of a vast number of others. While this idea has captivated philosophy, religion, and literature for millennia, it is now being considered as a scientific hypothesis -- with different models emerging from cosmology, quantum mechanics, and string theory.\n\n Beginning with ancient Atomist and Stoic philosophies, Mary-Jane Rubenstein links contemporary models of the multiverse to their forerunners and explores the reasons for their recent appearance. One concerns the so-called fine-tuning of the universe: nature's constants are so delicately calibrated that it seems they have been set just right to allow life to emerge. For some thinkers, these &quot;fine-tunings&quot; are evidence of the existence of God; for others, however, and for most physicists, &quot;God&quot; is an insufficient scientific explanation.\n\n Hence the allure of the multiverse: if all possible worlds exist somewhere, then like monkeys hammering out Shakespeare, one universe is bound to be suitable for life. Of course, this hypothesis replaces God with an equally baffling article of faith: the existence of universes beyond, before, or after our own, eternally generated yet forever inaccessible to observation or experiment. In their very efforts to sidestep metaphysics, theoretical physicists propose multiverse scenarios that collide with it and even produce counter-theological narratives. Far from invalidating multiverse hypotheses, Rubenstein argues, this interdisciplinary collision actually secures their scientific viability. We may therefore be witnessing a radical reconfiguration of physics, philosophy, and religion in the modern turn to the multiverse.\n\n\nepub","torrent":{"xt":"urn:btih:cbbf2c49f1c85255622bed228944d888e598b209","amp;dn":"Worlds+Without+End%3A+The+Many+Lives+of+the+Multiverse+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbbf2c49f1c85255622bed228944d888e598b209","infoHashBuffer":{"type":"Buffer","data":[203,191,44,73,241,200,82,85,98,43,237,34,137,68,216,136,229,152,178,9]},"announce":[],"urlList":[]}}