{"title":"Ganser - NATO's Secret Armies - Operation Gladio and Terr","uid":4759155,"size":3019053,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc780a540fecbb2f325f7d9cb5d43feb8f1d084c&amp;dn=Ganser+-+NATO%5C%27s+Secret+Armies+-+Operation+Gladio+and+Terr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Djofullinn","files":1,"time":1236626634,"description":"Product Description\nThe CIA and the British secret service MI6, in collaboration with the military alliance NATO and European military secret services set up a network of clandestine anticommunist armies in Western Europe after World War II. The secret soldiers were trained on remote islands in the Mediterranean and in unorthodox warfare centers in England and in the United States by the Green Berets and SAS Special Forces. The network was armed with explosives, machine guns and high-tech communication equipment hidden in underground bunkers and secret arms caches in forests and mountain meadows. In some countries, the secret army linked up with right-wing terrorists who in a secret war engaged in political manipulation, harassment of left wing parties, massacres, coup d'etats and torture. \n\nCodenamed &quot;Gladio&quot; ('the sword'), the Italian secret army was exposed in 1990 by Italian Prime Minister Giulio Andreotti to the Italian Senate, whereupon the press spoke of the &quot;the best kept, and most damaging, political-military secret since World War II&quot; (Observer, 18. November 1990) and observed that &quot;The story seems straight from the pages of a political thriller.&quot; (The Times, November 19, 1990). Ever since, so-called 'stay-behind' armies of NATO have also been discovered in France, Spain, Portugal, Germany, Belgium, the Netherlands, Luxemburg, Denmark, Norway, Sweden, Finland, Switzerland, Austria, Greece and Turkey. They were internationally coordinated by the Pentagon and NATO and had their last known meeting in the NATO-linked Allied Clandestine Committee (ACC) in Brussels in October 1990. &lt;a href=&quot;\nhttp://www.amazon.com/NATOs-Secret-Army-Operation-Contemporary/dp/0714656070/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1236622866&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/NATOs-Secret-Army-Operation-Contemporary/dp/0714656070/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1236622866&amp;sr=8-1&lt;/a&gt;\n","torrent":{"xt":"urn:btih:cc780a540fecbb2f325f7d9cb5d43feb8f1d084c","amp;dn":"Ganser+-+NATO%5C%27s+Secret+Armies+-+Operation+Gladio+and+Terr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc780a540fecbb2f325f7d9cb5d43feb8f1d084c","infoHashBuffer":{"type":"Buffer","data":[204,120,10,84,15,236,187,47,50,95,125,156,181,212,63,235,143,29,8,76]},"announce":[],"urlList":[]}}