{"title":"Braid (GOG)","uid":14593131,"size":239909625,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cca240df3b315a7cc3433945a1b43540a299a1c6&amp;dn=Braid+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mercs215","files":4,"time":1463007697,"description":"Install instructions:\r\n- Run &quot;setup_braid_2.0.0.3.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: BRAID\r\nGenre: Action - Puzzle - Platformer\r\nWorks on: Windows (XP, Vista, 7), Mac OS X (10.9.0+) and Linux (Ubuntu 14.04)\r\nLanguages: Text only: 中文, Deutsch, English, español, français, italiano, 한국어\r\nFeatures: single-player - controller support\r\nReleased: April 11, 2009\r\nSize: 224.5 MB\r\nCompany: Number None / Number None\r\nRating:\tESRB Rating: Everyone 10+ (with Language, Mild Cartoon Violence)\r\nStore page: https://www.gog.com/game/braid\r\n\r\nAbout:\r\nBraid is a puzzle-platformer, drawn in a painterly style, where you can manipulate the flow of time in strange and unusual ways. From a house in the city, journey to a series of worlds and solve puzzles to rescue an abducted princess. In each world, you have a different power to affect the way time behaves, and it is time's strangeness that creates the puzzles. The time behaviors include: the ability to rewind, objects that are immune to being rewound, time that is tied to space, parallel realities, time dilation, and perhaps more.\r\nBraid treats your time and attention as precious; there is no filler in this game. Every puzzle shows you something new and interesting about the game world.\r\nForgiving yet challenging gameplay: Braid is a 2-D platform game where you can never die and never lose. Despite this, Braid is challenging — but the challenge is about solving puzzles, rather than forcing you to replay tricky jumps.\r\nRich puzzle environment: Travel through a series of worlds searching for puzzle pieces, then solving puzzles by manipulating time: rewinding, creating parallel universes, setting up pockets of dilated time. The gameplay feels fresh and new; the puzzles are meant to inspire new ways of thinking.\r\nAesthetic design: A painterly art style and lush, organic soundtrack complement the unique gameplay.\r\nNonlinear story: A nonlinear fiction links the various worlds and provides real-world metaphors for your time manipulations; in turn, your time manipulations are projections of the real-world themes into playful &quot;what-if&quot; universes where consequences can be explored.\r\nNonlinear gameplay: The game doesn't force you to solve puzzles in order to proceed. If you can't figure something out, just play onward and return to that puzzle later.\r\n\r\nMinimum system requirements - Windows: XP / Vista / 7\r\nProcessor: 1.4GHz or faster \r\nMemory: 768 MB or more \r\nHard Disk Space: 200 MB or more \r\nVideo Card: Pixel Shader 2.0 \r\nDirectX® Version: DirectX® 9.0c \r\nController Support: Microsoft Xbox 360 Controller for Windows","torrent":{"xt":"urn:btih:cca240df3b315a7cc3433945a1b43540a299a1c6","amp;dn":"Braid+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cca240df3b315a7cc3433945a1b43540a299a1c6","infoHashBuffer":{"type":"Buffer","data":[204,162,64,223,59,49,90,124,195,67,57,69,161,180,53,64,162,153,161,198]},"announce":[],"urlList":[]}}