{"title":"Architectural Excursions - Frank Lloyd Wright, Holland and Europ","uid":10461008,"size":20420111,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd00823aeb03a0ebf880feeb792820c866a0a395&amp;dn=Architectural+Excursions+-+Frank+Lloyd+Wright%2C+Holland+and+Europ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1404135551,"description":"Architectural Excursions: Frank Lloyd Wright, Holland and Europe (Contributions to the Study of Art and Architecture)\n2000 | 272 pages | PDF | 19 MB\n\nSoon after 1900 in both North America and Europe the evolution from the tradition of Mediterranean and Gallic architectural styles to modernism began. This phenomenon was due, in part, to American industrial architecture and the work of Frank Lloyd Wright. Wright's building and architectural treatises of 1898-1908, with the additional help of Dutch propaganda on his behalf, significantly influenced European practitioners and theorists. European architecture within and outside of Holland reflects an adaptation of Wright's theories along with the structural determinism of American industrial buildings. With new evidence and fresh analysis culled from Dutch and American archives, personal correspondence, and professional material, this study examines the weight of Wright's works and words and those of the Dutchmen H.P. Berlage, Theo van Doesburg, Jan Wils, J.J.P. Oud, William Dudok and Hendrik Theodor Wijdeveld. This work provides insight into the effects of Wright's architectural theories and designs, coupled with an extensive guide for further research. It aims to attract art and architecture scholars and historians from both sides of the Atlantic and should also be of interest to social historians, artists and architects. Events and theories, including the assertion that Hendrik Theodor Wijdeveld was the catalytic source behind Wright's Taliesin Fellowship established in 1932, are presented in clear accessible language. Tied to the text are numerous visual presentations of significant designs and buildings.","torrent":{"xt":"urn:btih:cd00823aeb03a0ebf880feeb792820c866a0a395","amp;dn":"Architectural+Excursions+-+Frank+Lloyd+Wright%2C+Holland+and+Europ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd00823aeb03a0ebf880feeb792820c866a0a395","infoHashBuffer":{"type":"Buffer","data":[205,0,130,58,235,3,160,235,248,128,254,235,121,40,32,200,102,160,163,149]},"announce":[],"urlList":[]}}