{"title":"Lynch-Frost - On the air 4-6.avi","uid":4535943,"size":733491200,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cd3a6e972e11f28ca5e4f59669eed393c577af05&amp;dn=Lynch-Frost+-+On+the+air+4-6.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"the_corpse_vanished","files":1,"time":1227734909,"description":"The year is 1957. A new program entitled &quot;The Lester Guy Show&quot; is debuting on the Zoblotnick Broadcasting Corporation (ZBC). Most of the cast is nuts, the crew is incompetent and everything that could go wrong always does. Of course, this makes the show a hit.\n\nWhile mixing the sound for an episode of the second season of Twin Peaks, Lynch was hit with a sudden inspiration. &quot;It just came into my head, the idea of people trying to do something successful and having it all go wrong.&quot; Following the initial success of Twin Peaks, David Lynch and Mark Frost were hot properties in Television. When they approached ABC with the idea for &quot;On the Air,&quot; the network was eager to take them up on the offer. The show itself was a half-hour absurdist comedy featuring many of the cast and crew from Twin Peaks. The pilot tested very well, and six more episodes were ordered. However, by the time it came to scheduling the On the Air, things with Twin Peaks had already fallen apart, and the network was no longer eager to work with Lynch. &quot;During that time everything was going belly up with Twin Peaks, and there wasn't any support from ABC for this show at all. They really hated it.&quot; The series' broadcast was delayed and finally run during the summer, a time when most networks know people are away from their television sets, thus they dump undesirable shows then. Lynch knew the timeslot meant certain death for the show at the hands of the network. &quot;I've heard that summertime is pretty much the worst time you can be on, but we're going on in summer. I've heard that Saturday night is the worst night of the week to be on, and we're going on Saturday night.&quot; As expected, the show received poor ratings, and only three of the seven episodes were aired by ABC before they gave it the axe (all seven episodes were aired overseas however).\n\n\nEPISODES 04-06\n\n\nEpisode 4\nOriginal air date: Never aired in the U.S.\nProduced by Deepak Nayar\nCo-Executive Producer: Robert Engels\nWritten by Scott Frost\nDirected by Jonathan Sanger\n\nGuest Starring: Freddie Jones (Stan Tailings)\nFeaturing: Bill Zuckert (crusty old stagehand), Irwin Keyes (shorty the stagehand), Everett Greenbaum (announcer), Buddy Douglas (Buddy Morris), Raleigh Friend (hurry up twin), Raymond Friend (hurry up twin).\n\nSummary:\nBetty has made a new friend in the form of a duck named Doodles who is to be used in a hunting skit. A former film and stage star, Stan Tailings is brought in by Lester as a guest start. He thinks with good actors by his side he can rise to greatness (and make people forget about Betty). Unfortunately, Stan ends up having a voice that constantly cuts out and he isn't used to performing live. Meanwhile, the stagehands accidentally fry Doodles while testing an electric chair for the final skit of the show. Betty continues looking for Doodles and the stagehands treat themselves to some fried duck. Finally it's showtime, and as usual everything goes wrong.\n\n\nEpisode 5\nOriginal air date: 7/04/92 on the ABC Network\nProduced by Deepak Nayar\nCo-Executive Producer: Robert Engels\nWritten by Mark Frost\nDirected by Lesli Linka Glatter\n\nGuest Starring: Anne Bloom (Sylvia Hudson), Chuck McCann (Wally Walters)\nFeaturing: Irwin Keyes (shorty the stagehand), Everett Greenbaum (announcer), Buddy Douglas (Buddy Morris), Raleigh Friend (hurry up twin), Raymond Friend (hurry up twin).\n\nSummary:\nPreparations are under way for the arrival of a new guest star, Sylvia Hudson, the most important female star in the pioneer days of television. The hope is that if things go well, more big name stars will want to appear on the Lester Guy Show. Sylvia also happens to be Betty's cruel sister, who always makes fun of her. There's another guest star as well: Mr. Peanuts, the star of the morning kids show. Betty is upset over the arrival of her sister, Lester is excited because he once had a relationship with Sylvia (or so he tells it). Sylvia arrives, orders everyone around and is just generally rude, including insulting Mr. Peanuts. Everything goes wrong on the show of course. Nicole's skirt gets caught in the gears that open the door during Sylvia's entrance, causing them to slam shut in her face. Sylvia spends the most of the rest of the show in a daze, passing out during the next sketch. Betty, Bert and even Mr. Peanuts try to save the skit by taking over Sylvia's part. Sylvia finally comes to in just enough time to ruin the scene and threatens Mr. Peanuts on live national television in the process. Everyone sings the Mr. Peanuts theme song to cheer him up, and Sylvia ends up getting the door slammed in her face again.\n\n\nEpisode 6\nOriginal air date: Never aired in the U.S.\nProduced by Deepak Nayar\nCo-Executive Producer: Robert Engels\nWritten by Robert Engels\nDirected by Betty Thomas\n\nGuest Starring: Robert Costanzo (Mr. Plumber), I.M. Hobson (Presidio)\nFeaturing: Irwin Keyes (shorty the stagehand), Everett Greenbaum (announcer), Buddy Douglas (Buddy Morris), Raleigh Friend (hurry up twin), Raymond Friend (hurry up twin).\n\nSummary:\nA plumber creates chaos in the studio by putting up a complex pipe system that seems to run everywhere. Meanwhile, everyone waits for that weeks guest star, The Great Presidio, a magician Mr. Zoblotnick once saw and now wants on the show. Unfortunately, Presidio is not quite what he once was (at first they mistake him for a bum wandering the studio). Presidio is paranoid of a dog that wears a hat and smokes a cigar because he brings transformation. Lester accidentally finds a sketch showing a title logo for &quot;The Betty Hudson Show.&quot; Nicole overhears Presidio telling Betty about the dog and develops a plan. Lester tries to learn magic to make up for Presidio's lack of awareness and steal the show. Nicole convinces Betty to put a hat and cigar on Snaps and release him during Presidio's act in order to ruin him and allow Lester to shine. But the plan backfires and seeing Snaps transforms Presidio into the great and powerful magician he once was. He turns Nicole into a lizard and makes Lester disappear.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0103505/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0103505/&lt;/a&gt;\n\nEp. 1-3 &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4535328/Lynch-Frost_-_On_the_air_1-3.avi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4535328/Lynch-Frost_-_On_the_air_1-3.avi&lt;/a&gt;\n\nEp. 7 &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4535959/Lynch-Frost_-_On_the_air_7.avi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4535959/Lynch-Frost_-_On_the_air_7.avi&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:cd3a6e972e11f28ca5e4f59669eed393c577af05","amp;dn":"Lynch-Frost+-+On+the+air+4-6.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd3a6e972e11f28ca5e4f59669eed393c577af05","infoHashBuffer":{"type":"Buffer","data":[205,58,110,151,46,17,242,140,165,228,245,150,105,238,211,147,197,119,175,5]},"announce":[],"urlList":[]}}