{"title":"Alexander The Great In His World","uid":11739045,"size":5575846,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cda94806a496cac496c1599a7d5008ddfce93f12&amp;dn=Alexander+The+Great+In+His+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425682119,"description":"Alexander the Great is one of the most celebrated figures of antiquity. In this book, Carol G. Thomas places this powerful figure within the context of his time, place, culture, and ancestry in order to discover what influences shaped his life and career. The book begins with an exploration of the Macedonia that conditioned the lives of its inhabitants. It also traces such influences on Alexander's life as his royal Argead ancestry, his father, Philip II, and his mother, Olympias. The author examines Alexander's engagement with Greek culture, especially his relationship with Aristotle, and contemplates how other societal factors - especially the highly militarized Macedonian kingdom and the nature of Macedonia's relationship with neighboring states - contributed to his achievement. What was the significance of these influences on the man who succeeded in conquering most of the known world from the Adriatic Sea to the Indus River? The author focuses on this question in exploring ancient landscapes and resurrecting key figures from antiquity in order to penetrate the motivation, goals, and inner being of Alexander the Great","torrent":{"xt":"urn:btih:cda94806a496cac496c1599a7d5008ddfce93f12","amp;dn":"Alexander+The+Great+In+His+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cda94806a496cac496c1599a7d5008ddfce93f12","infoHashBuffer":{"type":"Buffer","data":[205,169,72,6,164,150,202,196,150,193,89,154,125,80,8,221,252,233,63,18]},"announce":[],"urlList":[]}}