{"title":"Alan Turing - Britain's Greatesdebreaker (Channel 4 - 2011)","uid":6837576,"size":734683760,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cdcfec9276c9cf198018156a415190269610a1e2&amp;dn=Alan+Turing+-+Britain%5C%27s+Greatesdebreaker+%28Channel+4+-+2011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rosie1966","files":2,"time":1322059530,"description":"Alan Turing is the genius British mathematician who was instrumental in breaking the German naval Enigma Code during World War II, arguably saving millions of lives. He was also the visionary scientist who gave birth to the computer age, pioneered artificial intelligence and was the first to investigate the mathematical underpinnings of the living world.\n\nTuring is one of the great original thinkers of the 20th century, who foresaw the digital world in which we now live. In the eyes of many scientists today Turing sits alongside Isaac Newton, Albert Einstein and Charles Darwin at the table of scientific greats.\n\nTuring's achievements went unrecognised during his lifetime. Instead he ended up being treated as a common criminal, for being homosexual at a time when homosexual acts were a crime.\n\nIn 1952, he was convicted of 'gross indecency' with another man and was forced to undergo so-called 'organo-therapy' - chemical castration. Two years later, he killed himself with cyanide, aged just 41. Alan Turing was driven to a terrible despair and early death by the nation he'd done so much to save.\n\nIn the last 18 months of his short life, Turing visited a psychiatrist, Dr Franz Greenbaum, who tried to help him. This film brings Turing's ideas to life by dramatising this relationship and these sessions, based on historical records, Turing's writings, and accounts of those who knew him. The film includes the testimony of people who knew and remember Turing.\n\nPlus, contemporary experts from the world of technology and high science, including Apple co-founder Steve Wozniak, bring Turing's exciting impact up to the present day, explaining why, in many ways, modern technology has only just begun to explore the potential of Turing's ideas.\n\nC4 Britain's Greatest Codebreaker 2011.avi\nFilesize......: 700Mb\nRuntime.......: 01:01:16\nVideo Codec...: XviD\nVideo Bitrate.: 1599Kbps\nFrame Size....: 624x352\nFrame Rate....: 25fps\nAudio Codec...: mp3\nAudio Bitrate.: 400bps\nAudio Freq....: 48KHz\nAudio Channels: Stereo\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:cdcfec9276c9cf198018156a415190269610a1e2","amp;dn":"Alan+Turing+-+Britain%5C%27s+Greatesdebreaker+%28Channel+4+-+2011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdcfec9276c9cf198018156a415190269610a1e2","infoHashBuffer":{"type":"Buffer","data":[205,207,236,146,118,201,207,25,128,24,21,106,65,81,144,38,150,16,161,226]},"announce":[],"urlList":[]}}