{"title":"4hero - Two Pages [1998]","uid":9494620,"size":470426215,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ce2c0cc31d577e4a6350b256426cd4663cc45fb2&amp;dn=4hero+-+Two+Pages+%5B1998%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GenXRock","files":-1,"time":1390069103,"description":"Review by John Bush  [-]\nIt's nearly impossible to listen to 4 Hero's Two Pages without thinking about the incredible success enjoyed by the jungle movement (and Roni Size's New Forms LP in particular) during the four-year gap which separated Dego and Mark Mac's second album from their third. With LTJ Bukem, the duo were one of the first jungle acts to desert hardcore for the astral drift of jazz-fusion atmospheres, and Two Pages is about as fusion-soaked as it gets. The first of the two discs includes the more downtempo R&amp;B, almost orchestral side of 4 Hero, quite indebted to jazz luminaries like Pharoah Sanders, Lonnie Liston Smith and Roy Ayers. Many of the instruments are live contributions, while vocalists as wide-ranging as poet Ursula Rucker and Digable Planets rapper Butterfly make appearances. The second disc is the dancefloor (read: tighter) half of the album, skirting through dense soundscapes of paranoid breakbeats. As could be expected, more than two hours of music is way too much for listeners to work their way through, and a heavy editing job would have made this a stellar album instead of the flawed and somewhat bloated album it turned out to be. For drum'n'bass fans, the real highlights come with second-disc tracks like &quot;We Who Are Not as Others&quot; and &quot;In the Shadows&quot; -- as it is, they're so terrific as to nearly justify purchase by themselves. (The American version of Two Pages edited the album down to fit on a single disc, and also added several tracks not available on the British two-CD version.) (4/5)","torrent":{"xt":"urn:btih:ce2c0cc31d577e4a6350b256426cd4663cc45fb2","amp;dn":"4hero+-+Two+Pages+%5B1998%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce2c0cc31d577e4a6350b256426cd4663cc45fb2","infoHashBuffer":{"type":"Buffer","data":[206,44,12,195,29,87,126,74,99,80,178,86,66,108,212,102,60,196,95,178]},"announce":[],"urlList":[]}}