{"title":"fdhypno_Hypnodomme_Superpack","uid":4659014,"size":5504707343,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:ce5d3084338d8fddbc46f370f8f7fa929c31c199&amp;dn=fdhypno_Hypnodomme_Superpack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"sspiff9913","files":257,"time":1232310789,"description":"Hypnodomme hypnofetish erotic hypnosis hypnotic hypnotism FDHYPNO femdom\n\nThis torrent, the &quot;Hypnodomme Superpack&quot; is a TPB re-uploading of a\ntorrent I have been seeding (as sspiff9912) on another site for a\nlong while now.   Judging from the response to the previous hypnodomme\ncollections I brought over to TPB as\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4520487/fdhypno_Hypnodomme_Gigapack&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4520487/fdhypno_Hypnodomme_Gigapack&lt;/a&gt;\n\nand\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4573676/fdhypno_Hypnodomme_Minipack&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4573676/fdhypno_Hypnodomme_Minipack&lt;/a&gt;\n\nthere is a fair bit of interest here in this material, so I'll seed\nthis one here as well.  It would take a lot of work to catalogue all\nthe hypnodomme files already seeded here, and I would have to redo all\nthe README files, so I have not attempted to avoid duplicating files\nalready available here.\n\nHowever, remember that on The Pirate Bay, you can always see what\nfiles are in a torrent by clicking on the number after the &quot;Files:&quot;\nline in the header.\n\nThis was the first torrent I ever uploaded, so some things are a bit\nrough.  In particular, I gathered a lot of these files from EMule,\nwhich encourages super-long mongo descriptive file names, and\nI probably should have renamed a lot of these to something shorter.\n\nBelow are the posting notes I used on the original upload:\n\n------------------------------END TPB INTRO---------------------------------\nThis is a collection of erotic hypnosis files gathered from a large\nnumber of different places.  They are mainly Femdom (hypnodomme)\nsessions, but there are several vanilla erotic hypnosis files as\nwell.  I have listened to some of these files, but by no means\nto all.  Some of them I will eventually, and some I have already\ndecided I will not.\n\nAre these files safe?  Well, as always when dealing with the\nhuman mind, there is no guarantee.  Certainly if you have a\nhistory of mental illness, you should probably approach anything\nthat might alter your mental state with great caution.  Remember\nhowever that no hypnotist can make you do anything you do not\nwant to do.  You are always free to reject any suggestion a\nhypnotist may make.  I will say that there are some things\nthat you may want to do at some level which normally you\ndo NOT do because they are not in your best interest.  I\nthink it is possible a hypnotist could tip your judgement\nin the case of an ill-advised thing you may have some\nhidden desire to try.  In any case, since having to\nreject a suggestion kind of spoils a trance, I suggest\nyou audit any files you are suspicious of by skipping\nthe induction (the introductory part which takes you into\ntrance) and playing parts of the middle and the end (where\nany post-hypnotic suggestions will be) to make sure there\nis nothing you will have to reject.  (I would be especially\nsuspicous of any files from Mz Dominica!)\n\nAlso, recall that hypnosis is not magic.  A stage hypnotist\ngets &quot;instant&quot; results since he is trained to pick the\nhalf-dozen most gung-ho subjects from an audience of\nhundreds.  In most cases, since you are probably not\none of those half-dozen, you will have to play a session\nmany times to get the full effect.\n\nMy personal suggestion is that you start with sessions\nby Nikki Fatale, who seems a sanely grounded domme\nwith a lovely voice and great delivery.\n","torrent":{"xt":"urn:btih:ce5d3084338d8fddbc46f370f8f7fa929c31c199","amp;dn":"fdhypno_Hypnodomme_Superpack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce5d3084338d8fddbc46f370f8f7fa929c31c199","infoHashBuffer":{"type":"Buffer","data":[206,93,48,132,51,141,143,221,188,70,243,112,248,247,250,146,156,49,193,153]},"announce":[],"urlList":[]}}