{"title":"The Sister Agnes Mystery Collection","uid":11847017,"size":945327496,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ce616146c589070d8d67f398887addefa9a20787&amp;dn=The+Sister+Agnes+Mystery+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"davieboy1966","files":74,"time":1429923284,"description":"Audio Books : Mystery and Suspense : Other quality : English\n\nAll are unabridged. The first two titles were only available on Cassette tapes, but their sound quality is decent.\nRead by Julia Franklin except the first which is by Phyllida Nash.\n\n\n\nSister Agnes Bourdillon, is a young ex-cloistered nun, living in London, England who turns amateur private investigator to solve crimes.\n( As far as I am aware, books 1,2,3 and 6 in this series have never been released in audio format )\n\n#4. A Dark and Sinful Death [11 hours 30 mins] Cassettes (1997) , 32kbps (Thanks to Telpointer for supplying this rare copy.)\nSister Agnes is a very unusual nun and an even more unusual detective. She has been sent by her religious order to girls' boarding school in Yorkshire where she finds herself investigating a murder. A young gardener, Mark Snaith, is found dead on the moors with his face badly mutilated. He had apparently been defending a peregrine falcon's nest. Mark happened to be a friend of one of the pupils at the school, St. Catherine's Convent. Agnes is soon embroiled in the family history, feuds and troubles of the owners of the local mill. She is convinced the answer to the mystery is connected with the mill, but the police have other ideas....\n\n#5. The Dying Light [11 hours 39 mins] Cassettes (1999) , 32kbps\nSister Agnes is working at a women's prison when the father of one of the inmates is murdered. What at first seems a straightforward potentially drugs related crime, gradually takes on more and more dimensions as Agnes tries to find out whether Cally's boyfriend Mal is really the murderer as the police seem to think. Agnes has problems of her own to deal with as her mother is seriously ill in France. She finds the ramifications of other people's relationships start to reflect her own problems and she is forced to deal with some long buried issues. The plot is complicated and fast paced and keeps the reader guessing right up until the dramatic conclusion. Even the minor characters are interesting - Rosanna the jazz singer, Cally and Claire - twins who have chosen different roads in life, the ex Welsh miners who are digging new tunnels for the London Underground and Venn the owner of the Pomegranate Seed club. Very little on stage violence and Sister Agnes' battles with obedience to her Order make this a gripping novel. (Damaskcat)\n\n#7. The Darkening Sky [11 hours 2 mins] CD (2005) , 32kbps\nYoung, independent and sharply aware of her weaknesses, Sister Agnes Bourdillon is not the kind of nun who needs a habit and a wimple to express her religious commitment. Approaching her final vows in the order, after six years as a novice, Agnes is dreading leaving the solitude of her Bermondsey flat to join the rest of the community in Hackney. If she takes the vow of poverty, she will have to give up a house she owns in Provence, bequeathed to her by her mother. Her mentor, Father Julius, tries to allay her fears, yet Agnes is not comforted. A temporary respite from the decision is her work in an addiction center near her home. One of the residents, Walker Hogan, a dried-out alcoholic, is stabbed in a street brawl and dies in hospital. Before his death, he had confided in Agnes, and given her pages of his writing--a war diary--to read. At his funeral, she is surprised to see that the coffin is plush and obviously expensive, but thinks no more of it until a man turns up at the hostel looking for information on Walker. His story is intriguing, and Agnes decides to investigate. This decision will cost her dearly, and take her on a journey that will challenge her beliefs and her physical safety...\n\n#8. Shadow of Death [9 hours 32 mins] CD (2007) , 48kbps\nSister Agnes is up to her neck in books. Having been asked to help sort out the library of the nearly defunct Order in Bermondsey before the building is sold, she is trawling through piles of tatty Victoriana and mawkish lives of the saints. However, the 17th-century Hawker archive, a collection of beautifully preserved books on spells and magic as well as hand-written journals, does catch her eye. These tell the story of Alice, her husband Thomas and their daughter who died in infancy. Alice did not long survive her. Alice's story seems to haunt the present. The building, now an NHS day center for the mentally ill, is the backdrop for a modern mother's fears for the safety of herself and her child Agnes is increasingly drawn into the predicament of Jeanne-Marie and her daughter Leila as well as Alice s narrative. The line between past and present becomes hazy, as Jeanne-Marie, like Alice before her, is prey to the men in her life and depression. When unexplained and horrible things start happening and Agnes becomes convinced that buyers are after something more than the obvious in the Hawker archives, she hurries to protect Leila and lay some ghosts to rest...\n\n#9. A Violent Act [11 hours 12 mins] CD (2008), 48kbps (Thanks to Shauna for supplying this copy.)\nShe may wish it otherwise but now that Sister Agnes is, as Father Julius solemnly teases her, a 'fully paid up' member of the convent, any thoughts that life might go more smoothly with her final vows taken are soon proved mistaken. Outside the oppressive confines of life inside the convent, Agnes is back in her own flat, working at the order's hostel for the homeless. But before long things take a turn for the worse when a young and vulnerable resident, Abbie, is found dead, and the little fragile peace there was is shattered. Though it looks like suicide, questions over what, or who, pushed Abbie to end her life plague Agnes along with questions from her past....\n\n\nEnjoy and seed!!","torrent":{"xt":"urn:btih:ce616146c589070d8d67f398887addefa9a20787","amp;dn":"The+Sister+Agnes+Mystery+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce616146c589070d8d67f398887addefa9a20787","infoHashBuffer":{"type":"Buffer","data":[206,97,97,70,197,137,7,13,141,103,243,152,136,122,221,239,169,162,7,135]},"announce":[],"urlList":[]}}