{"title":"TTC - Art of Public Speaking","uid":6633856,"size":92229746,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cea9f58001149f36fa79717166e46686aaaf7065&amp;dn=TTC+-+Art+of+Public+Speaking&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"programa","files":13,"time":1314469342,"description":"TTC - The Art of Public Speaking: Lessons from the Greatest Speeches in History\nBy John R. Hale\n\n\nFormat: MP3\nBitrate: 32 Kbps\n\n\nEverybody is a public speaker. Maybe you're delivering a corporate presentation or interviewing for a new job. Maybe you're a teacher lecturing students or a citizen addressing a neighborhood association. Maybe you're arguing a case before a courtroom or persuading book club members about the merits of your latest read.\n\nWhatever the situation, being able to speak in public is essential to success. You can have the most logical argument possible, but in order to truly teach, inform, persuade, or defend, you need to present your ideas with conviction and confidence.\n\nYet this is often easier said than done. Many of us have a deep fear of public speaking. Or we think it's just an intuitive talent that can't be learned. But according to award-winning Professor John R. Hale of the University of Louisville, a masterful public speaker who has delivered more than 1,000 speeches to all manner of audiences, that couldn't be further from the truth.\n\nAll it takes is confidence, practice, and the knowledge of time-tested techniques and strategies used by history's greatest public speakers - all of which you'll find in The Art of Public Speaking: Lessons from the Greatest Speeches in History. This 12 lecture course is your guide to the secrets of this essential skill, an insider's look at what makes history's enduring speeches so unforgettable, and an invaluable reference tool you can use any time you have to speak your mind.\n\n\n12 Lectures\n30 minutes/lecture\n\n\n1  Overcome Obstacles - Demosthenes of Athens\n2  Practice Your Delivery - Patrick Henry\n3  Be Yourself - Elizabeth I to Her Army\n4  Find Your Humorous Voice - Will Rogers\n5  Make It a Story - Marie Curie on Discovery\n6  Use the Power of Three - Paul to His People\n7  Build a Logical Case - Susan B Anthony\n8  Paint Pictures in Words - Tecumseh on Unity\n9  Focus on Your Audience - Gandhi on Trial\n10 Share a Vision - Martin Luther King's Dream\n11 Change Minds and Hearts - Mark Antony\n12 Call for Positive Action - Lincoln at Gettysburg","torrent":{"xt":"urn:btih:cea9f58001149f36fa79717166e46686aaaf7065","amp;dn":"TTC+-+Art+of+Public+Speaking","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cea9f58001149f36fa79717166e46686aaaf7065","infoHashBuffer":{"type":"Buffer","data":[206,169,245,128,1,20,159,54,250,121,113,113,102,228,102,134,170,175,112,101]},"announce":[],"urlList":[]}}