{"title":"Remington- Essentials of Pharmaceutics [PDF] [StormRG]","uid":10424222,"size":11814513,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cef14b9c63a0d979465c4f491f3e059b8ff6d62b&amp;dn=Remington-+Essentials+of+Pharmaceutics+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"0xmovva","files":2,"time":1403680547,"description":"Author: Linda Felton (Editor)\nPaperback: 816 pages\nPublisher: Pharmaceutical Press; 1 edition (September 11, 2013)\nLanguage: English\nISBN-10: 0857111051\nISBN-13: 978-0857111050\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nProvides a concise yet detailed resource covering all aspects of pharmaceutics, from the scientific fundamentals to the dosage forms and drug delivery systems to drug product analyses. Assists with integrating the science of pharmacy into practice. Chapters from the original parent text Remington: The Science and Practice of Pharmacy 22nd edition were specifically selected to create this new edition. The text pulls heavily from the Pharmaceutics and Pharmaceutical Dosage Forms sections. Various delivery systems and dosage forms are covered as well as parenterals, sterilization processes, and sterile compounding. One chapter addresses pharmaceutical excipients and another discusses pharmaceutical packaging. Pharmaceutical analysis, product characterization, quality control, stability, bioavailability, and dissolution are also covered. Fundamental scientific concepts including thermodynamics, ionic solutions and electrolyte equilibria, tonicity, chemical kinetics, rheology, complex formation and interfacial phenomenon are presented. The text also provides an introduction to pharmacokinetics and pharmacodynamics and the principles of absorption, distribution, metabolism and excretion. In addition, some introductory concepts on drug discovery and drug product approval as well as information resources in pharmacy and the pharmaceutical sciences are presented.","torrent":{"xt":"urn:btih:cef14b9c63a0d979465c4f491f3e059b8ff6d62b","amp;dn":"Remington-+Essentials+of+Pharmaceutics+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cef14b9c63a0d979465c4f491f3e059b8ff6d62b","infoHashBuffer":{"type":"Buffer","data":[206,241,75,156,99,160,217,121,70,92,79,73,31,62,5,155,143,246,214,43]},"announce":[],"urlList":[]}}