{"title":"Swerve_ How the Renaissance Began -Greenblatt- Epub/Mobi [Slende","uid":10121337,"size":2664125,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf31711a6aba474cb5ca73ef4277466beb5c6436&amp;dn=Swerve_+How+the+Renaissance+Began+-Greenblatt-+Epub%2FMobi+%5BSlende&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"K-Slender","files":4,"time":1399677270,"description":"Publisher: Vintage Digital (September 1, 2011)\nLanguage: English\nASIN: B005L18C4E\n\nWINNER OF THE PULITZER PRIZE FOR NONFICTION\n\nAlmost six hundred years ago, a short, genial man took a very old manuscript off a library shelf. With excitement, he saw what he had discovered and ordered it copied. The book was a miraculously surviving copy of an ancient Roman philosophical epic, On the Nature of Things by Lucretius and it changed the course of history.\n\nIn the early 15th century Western Europe was just emerging from a couple of centuries of plague, famine, and conflict. Led by the city states of northern Italy, the Europeans were attempting to find their footing, and to do so they looked back 1500 years or more to the classical civilizations of Greece and Rome. Scholarly humanists began to search out and restudy old scrolls and ancient manuscripts in order to relearn much of what had been lost during the Dark Ages. Of these none was more important than Poggio Bracciolini, a papal secretary whose Pope had been overthrown and replaced, and who dealt with his loss of power and income by searching monasteries in Germany and Switzerland for forgotten scripts. His greatest discovery was Lucretius' long poem On The Nature Of Things, which he copied and had distributed, ensuring that it became a seminal document of the emerging Renaissance.\n\nLucretius had been a Epicurean philosopher during the Roman Empire, who taught that the soul did not survive death and that all living things were made up tiny particles or atomi. Epicureans called on people to enjoy a good life (not a hedonistic one as is often supposed) without worrying about the wrath of God or the gods, who did not concern themselves with anything so insignificant as human affairs. This has a modern ring to us, as it should since Lucretius' writings, as Stephen Greenblatt so ably shows, helped to shape the Renaissance and the Scientific Revolution. Lucretius' ideas were unwelcome to many in the Church hierarchy, and those who followed his ideas were often in danger of perseuction or even execution.\n\nStephen Greenblatt has produced a fascinating chronicle of Lucretius, Poggio, and the worlds they inhabited. Much of the book is concerned with Poggio's life and times, which were very long for the period and rich and full of incident. There is also much excellent material on the tumultuous political world the Church and secular powers struggled to dominate, as well as some fascinating discussion on how Lucretius probably came to create his poem and on how its rediscovery and publication influenced the world, whose development turned or &quot;swerved&quot; dramatically as a result of Lucretius and other classical writers renewed popularity.\n\nThe Swerve should become an essential part of the library of anyone interested in the late medieval and early Renaissance eras.","torrent":{"xt":"urn:btih:cf31711a6aba474cb5ca73ef4277466beb5c6436","amp;dn":"Swerve_+How+the+Renaissance+Began+-Greenblatt-+Epub%2FMobi+%5BSlende","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf31711a6aba474cb5ca73ef4277466beb5c6436","infoHashBuffer":{"type":"Buffer","data":[207,49,113,26,106,186,71,76,181,202,115,239,66,119,70,107,235,92,100,54]},"announce":[],"urlList":[]}}