{"title":"Trouble Andrew - Trouble Andrew","uid":3955867,"size":36686578,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cf56e41ea9f4b5b9c235a6a1e43188595d02af1e&amp;dn=Trouble+Andrew+-+Trouble+Andrew&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gurt","files":11,"time":1199131676,"description":"From CDBABY :\n\nSk8r/Snowboarder Electro-PUNK\ntracks\n\n    1 Chase Money\n    2 Bang Bang\n    3 Uh Oh\n    4 Youngboy\n    5 Pimp Millenium\n    6 Trouble\n    7 No Good\n    8 Be Free\n    9 Either Way\n\n\nnotes\n\nBorn and raised on the East Coast of Canada in Windsor, Nova Scotia, lil&amp;#039; Trey, age 9, dressed in his mother&amp;#039;s over sized hiking boots, wrapped in socks and taped into the bindings of an old snowboard three times his size. He was determined to conquer the slight and icy mountain at Martock, the local ski resort where his mom worked. As fate would have it, Trevor&amp;#039;s determination paid off. He is now one of the top-ranking professional snowboarders worldwide, sponsored by industry heavyweights Burton Snowboards, Analog Clothing, Gravis Footwear, and Oakley Optics. He holds numerous national titles and World Cup victories and has had feature parts in many of the industry&amp;#039;s biggest magazines and video productions. He competed in the 1998 and 2002 Olympics. After a fall in his final run, he landed in 8th place as the highest ranking Canadian in the half pipe. In 2004 Trevor suffered a knee injury forcing him to sit out much of the season. By the time the 2005 snowboarding season rolled around, Trevor was not only ready to ride, he had recorded half of what would become his debut, under the name, &quot;Trouble Andrew&quot; (a collaboration with renowned New York-based production team, Shitake Monkey). The sound is a blend of synth/programmed beats, and danceable skate and punk rock, drawing from musical influences through out his life. Trevor spent the summer of 2006 in Brooklyn, New York assembling and touring with his band of musicians Ian Longwell, Johny Rodeo, and Joao Salomao. They have been playing various parties and events and supporting groups such as De La Soul, GZA, Controller Controller, Rick Ross, Pit Bull, Silverstien, and McRad. The band is currently living together in Whistler, Canada snowboarding, producing new music, and jet setting across the globe to rock crowds and appear at snowboard/skate related functions. He has placed songs in six snowboard films out this year, aroused interest from several major record labels, and the band is selling out shows everywhere. The album is set to come out January 25th. Trevor and the band will be appearing at numerous events such as the X-Games, the SIA winter sports trade show in Las Vegas, and the Toyota Big Air in Japan.","torrent":{"xt":"urn:btih:cf56e41ea9f4b5b9c235a6a1e43188595d02af1e","amp;dn":"Trouble+Andrew+-+Trouble+Andrew","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf56e41ea9f4b5b9c235a6a1e43188595d02af1e","infoHashBuffer":{"type":"Buffer","data":[207,86,228,30,169,244,181,185,194,53,166,161,228,49,136,89,93,2,175,30]},"announce":[],"urlList":[]}}