{"title":"No Vacancy - The Best of The Motels","uid":4117404,"size":67864207,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cf887bc5a73258a3c96dba28ae279093269a87d1&amp;dn=No+Vacancy+-+The+Best+of+The+Motels&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"80zforever","files":20,"time":1207382812,"description":"Led by the charismatic Martha Davis, the Motels were one of the most successful and acclaimed bands to emerge from the fertile Los Angeles new wave scene, reaching the Top Ten in 1982 with their biggest hit, &quot;Only the Lonely.&quot; Davis formed the group in 1972 while living in Berkeley, CA, recruiting guitarist Dean Chamberlain and bassist Richard d&amp;#039;Andrea; originally dubbed the Warfield Foxes, they became the Motels upon relocating to L.A., but despite interest from a number of record labels, the group suffered through endless lineup changes, finally disbanding in 1976. Davis soon formed a new Motels roster with guitarist Jeff Jourard, his saxophonist/keyboardist brother Marty, bassist Michael Goodroe, and drummer Brian Glascock; signing to Capitol, in 1979 the group issued their self-titled debut LP, scoring a minor hit with the ballad &quot;Total Control.&quot; Guitarist Tim McGovern, formerly of the Pop, replaced Jeff Jourard prior to the release of the 1980 sophomore effort Careful. After Capitol rejected the Motels&amp;#039; third album, All Four One, McGovern exited, and the group re-recorded the album with guitarist Guy Perry and assorted session musicians. This time the label relented, releasing All Four One in 1982; the album eventually went gold on the strength of the atmospheric &quot;Only the Lonely,&quot; which ascended to the number nine spot. The evocative &quot;Suddenly Last Summer,&quot; the lead single from the Motels&amp;#039; 1983 follow-up, Little Robbers, reached number nine as well a year later, yielding the Top 40 entry &quot;Remember the Nights.&quot; 1985&amp;#039;s Shock generated the band&amp;#039;s final hit, &quot;Shame.&quot; A cancer scare prompted Davis to dissolve the Motels in 1987, the year she made her solo debut with Policy. In mid-1998 she reformed the group, touring under the name the Motels Featuring Martha Davis. A half-dozen compilations were released from 2000 to 2007, and in September 2007 a new album titled Clean Modern and Reasonable became available. \n\nTracklisting:\n\n01   Danger (3:25) \n02   Only The Lonely (3:16) \n03   Celia (3:06) \n04   Shame (4:11) \n05   Careful (3:30) \n06   Suddenly Last Summer (3:39) \n07   So L.A. (3:34) \n08   Cries And Whispers (4:09) \n09   Icy Red (4:28) \n10   Apocalypso (3:29) \n11   Total Control (5:53) \n12   Take The L (3:38) \n13   Trust Me (3:24) \n14   Remember The Nights (3:04) \n15   Bonjour Baby (3:25) \n16   Little Robbers (3:53) \n17   Annie Told Me (4:18) \n18   Kix (2:15) \n19   Whose Problem? (3:52) \n","torrent":{"xt":"urn:btih:cf887bc5a73258a3c96dba28ae279093269a87d1","amp;dn":"No+Vacancy+-+The+Best+of+The+Motels","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf887bc5a73258a3c96dba28ae279093269a87d1","infoHashBuffer":{"type":"Buffer","data":[207,136,123,197,167,50,88,163,201,109,186,40,174,39,144,147,38,154,135,209]},"announce":[],"urlList":[]}}