{"title":"Native Instruments - Symphony Series Woodwind Ensemble","uid":15453612,"size":33175705275,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:cf8ae5d3b4ac4bfd0fad2782c031a7e2ed1c9509&amp;dn=Native+Instruments+-+Symphony+Series+Woodwind+Ensemble&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":7,"uploader":"Horisarte","files":82,"time":1469964841,"description":"https://www.native-instruments.com/en/products/komplete/orchestral-cinematic/symphony-series-woodwind/\r\n\r\nThe SYMPHONY SERIES WOODWIND ENSEMBLE delivers high-class orchestral woodwind recordings arranged in an elegant, supremely usable interface. Created in partnership with Native Instruments and designed for flawless integration with both Kontakt and Komplete Kontrol, this state-of-the-art virtual woodwind orchestra delivers unparalleled sonic depth and realism. It offers you a massive 36-piece woodwind ensemble sound. Control six fully independent orchestral woodwind sections – flutes, oboes, clarinets, saxophones, bassoons and contrabassoons - each with six players per section.\r\n\r\nThis library features 314 playable articulations, multi-layered true legato and sustain types, a range of staccato tonguing techniques with up to 8-round-robins, half &amp; whole trills, sforzandos, swells, crescendos, decrescendos, time-adjustable arpeggios, and so much more. Add character and realism with an additional selection of orchestral woodwind effects – such as clusters, sweeps, falls, risers, stingers, tuning cacophonies, valve clicks and creative flourishes. Even straight out of the box, the sound is natural, full of personality, and truly huge. This library is available at a great bundle price in the SYMPHONY SERIES WOODWIND COLLECTION, along with WOODWIND SOLO. Together, these premium virtual instruments provide producers and composers maximum flexibility and the utmost quality at a fantastic price.\r\n\r\nThis library is part of the Native Instruments Symphony Series line. It is not included in Komplete or Komplete Ultimate. If you own Komplete, you're eligible for a great cross-grade offer from Native Instruments when you order Symphony Series Woodwind Ensemble.\r\n\r\n\r\nProduct Specifications\r\n\r\n38,964 Samples\r\n30.5 GB installed\r\n43 Kontakt instrument presets\r\n24 bit / 48kHz lossless NCW format samples\r\nWorks with the free Kontakt Player and the full retail version of Kontakt (v5.5.1 or later only)\r\nSupported by Komplete Kontrol S-Series Keyboards","torrent":{"xt":"urn:btih:cf8ae5d3b4ac4bfd0fad2782c031a7e2ed1c9509","amp;dn":"Native+Instruments+-+Symphony+Series+Woodwind+Ensemble","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf8ae5d3b4ac4bfd0fad2782c031a7e2ed1c9509","infoHashBuffer":{"type":"Buffer","data":[207,138,229,211,180,172,75,253,15,173,39,130,192,49,167,226,237,28,149,9]},"announce":[],"urlList":[]}}