{"title":"Neo Ned (2005).avi","uid":7527805,"size":1921176230,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d012ad38bf393e49407043f69834b2bde52b2147&amp;dn=Neo+Ned+%282005%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"HurricaneA","files":1,"time":1344846738,"description":"Synopsis of Neo Ned\n\nNed (Jeremy Renner of Dahmer) is a proud member of the Aryan Brotherhood who has been admitted to a mental institution for his involvement in a racially motivated murder. Dr. Magnuson (Cary Elwes) and Johnny (Ethan Suplee) have trouble keeping Ned in line. Boisterous and belligerent, he's prone to childish tantrums when things don't go his way. Still, the other inmates, like Joey (Eddie Kaye Thomas) seem to look up to him. Ned's life at the facility is upended with the arrival of Rachael (Gabrielle Union of Bring It On), a beautiful young black woman who's brought in shouting German, and seems to believe that she's possessed by the spirit of Adolf Hitler. At first, Ned mocks her, and attempts to provoke her, but soon, his feelings toward Rachael turn surprisingly tender. Eventually, Ned and Rachael open up to each other, revealing the past traumas that left them in such a screwed up state. Ned, still reluctant to give up the accoutrements of skinhead life, tells Rachael about his imprisoned father and his unhappy foster care experiences, and Rachael tells him about being sexually abused, and reveals that she has a young daughter. When Ned is released from the hospital, he convinces Rachael to leave with him, but the couple finds life together on the outside difficult. Neo Ned also stars Steve Railsback and Sally Kirkland. It was written by Tim Boughn and directed by Van Fischer (Blink of an Eye, aka Urban Jungle).","torrent":{"xt":"urn:btih:d012ad38bf393e49407043f69834b2bde52b2147","amp;dn":"Neo+Ned+%282005%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d012ad38bf393e49407043f69834b2bde52b2147","infoHashBuffer":{"type":"Buffer","data":[208,18,173,56,191,57,62,73,64,112,67,246,152,52,178,189,229,43,33,71]},"announce":[],"urlList":[]}}