{"title":"John Coltrane - Coltrane's sound","uid":9570372,"size":309328093,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d0cf4ae74bbf8dff39b4416e2976ef08cd41d33e&amp;dn=John+Coltrane+-+Coltrane%27s+sound&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"jamezua","files":-1,"time":1391620714,"description":"    This is one of the most highly underrated entries in Coltrane's voluminous catalog. Although the same overwhelming attention bestowed upon My Favorite Things was not given to Coltrane's Sound upon its initial release, both were actually recorded during the same three-day period in the fall of 1960. So prolific were those recording dates, they informed no less than five different Coltrane albums on Atlantic. The title could not have been more accurate, as each of the six pieces bear the unmistakable and indelible stamp of Coltrane's early-'60s style. &quot;The Night Has a Thousand Eyes&quot; and &quot;Body and Soul&quot; (the only tracks not penned by Coltrane) are given unique and distinctive voices. Animating the arrangements on these sessions were Coltrane (soprano/tenor sax), Steve Davis (bass), Elvin Jones (drums), and McCoy Tyner (piano). It's perhaps Tyner's recollection of the quartet as &quot;four pistons in an engine&quot; that most aptly explains the singular drive heard during Coltrane's extended runs on &quot;Liberia.&quot; Tyner flawlessly complements Coltrane with full resonating chords that cling to his volley of sound. The rhythmic gymnastics of percussionist Jones is also showcased as his double-jointed bop swing and military band precision are distinctly displayed on the blues &quot;Equinox.&quot; The opening six bars give Jones a chance to make a contrasting statement -- which he takes full advantage of. Regardless of the lack of attention, these recordings remain among Trane's finest. Some reissues add two bonus tracks, &quot;26-2&quot; as well as an alternate take of &quot;Body and Soul.&quot;\n\n\nTracks:\n\n1- The Night Has A Thousand Eyes \n2- Central Park West \n3- Liberia \n4- Body and Soul \n5- Equinox \n6- Satellite\n7- 26-2 \n8- Body and Soul (alternate take).\n\nPlayers:\n\nJohn Coltrane: tenor or soprano sax\nMcCoy Tyner: piano\nSteve Davis: bass\nElvin Jones: drums.  ","torrent":{"xt":"urn:btih:d0cf4ae74bbf8dff39b4416e2976ef08cd41d33e","amp;dn":"John+Coltrane+-+Coltrane%27s+sound","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0cf4ae74bbf8dff39b4416e2976ef08cd41d33e","infoHashBuffer":{"type":"Buffer","data":[208,207,74,231,75,191,141,255,57,180,65,110,41,118,239,8,205,65,211,62]},"announce":[],"urlList":[]}}