{"title":"Silver Surfer - Requiem 01-04 (2007|Digital|AnPymHero-Empire)","uid":9665688,"size":169653496,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d0e52614fecfd0257bb345dd0d846e9958a0f17e&amp;dn=Silver+Surfer+-+Requiem+01-04+%282007%7CDigital%7CAnPymHero-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1393371509,"description":"This beautiful and often moving limited series examines what happens when the Silver Surfer learns that he is literally falling apart. He first visits his longtime friends Reed and Sue Richards of the Fantastic Four, who confirm what he suspects - the very Power Cosmic that has given Norrin Radd enormous power has now irradiated his body to the point of decay; he can't hold out much longer. Thus begins a meditative and poetic odyssey in the last few days of the Surfer's life; his only goal being to reflect on what he accomplished and what he could not, and be internally satisfied with the results if possible. Along the way, we are treated to eye-opening encounters with Spider-Man, a world of divided inhabitants in a constant state of war with each other, and Radd's return to his home planet Zenn-La and his lover Shalla-Bal - but Galactus and his final message also await. J. Michael Straczynski delivers some of the finest work of his career, evoking much sympathy for the Surfer's plight and allowing us to identify with his nobility and humanity with his inner monologue and through his actions and the eyes of others (such as Peter Parker). However, the real star of the show is Esad Ribic's incredible art - the noted artist is at his exceptional best, creating deep painterly images and heightening the feeling of solemn tranquility that seems to emanate from the story. This beautiful Digital copy of the miniseries is presented by AnPymHero-Empire. Thanks to them for their awesome work, and please seed - enjoy! :-)","torrent":{"xt":"urn:btih:d0e52614fecfd0257bb345dd0d846e9958a0f17e","amp;dn":"Silver+Surfer+-+Requiem+01-04+%282007%7CDigital%7CAnPymHero-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0e52614fecfd0257bb345dd0d846e9958a0f17e","infoHashBuffer":{"type":"Buffer","data":[208,229,38,20,254,207,208,37,123,179,69,221,13,132,110,153,88,160,241,126]},"announce":[],"urlList":[]}}