{"title":"Heavy Gear 2 Repack [sk-k.net].rar","uid":4626342,"size":571554465,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d1172eba37338ec064a482287f4c8b9bafd4a47b&amp;dn=Heavy+Gear+2+Repack+%5Bsk-k.net%5D.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"towers84","files":1,"time":1231226324,"description":"Heavy Gear 2 Repack.\n\nCreated April 2006.\n\nDownload Contents:\n\nHeavy Gear 2 NRG image\nServers.dat zip file\nHG2 noCD crack zip file\nHG2 XP patch zip file\nReadme file\nPDF Manuals\n\nChanges from the old Heavy Gear 2 torrent file:\n\nUpdated servers.dat file\nUpdated readme information\nAdded English/German/Italian/French PDF Manuals\n\n-----\n\nDirections:\n\nUse NRG image compatible CD burning software (Nero, for instance) to burn the Heavy Gear 2 NRG image to a CD. Install from the CD and enjoy.\n\nThe Servers.dat file is required to play online. It must be copied into the main Heavy Gear 2 directory where it will replace the original Servers.dat file. This file is updated periodically. Any updates can be found at www.sk-k.net.\n\nThe WinXP Patch is required to sync with hosts using WinXP when playing online. Replace the winets2.dll and wudplan.dll files in Heavy Gear 2/Anet folder with the ones included in the Zip file.\n\nA noCD crack is included, but some people have experienced some issues using this in WinXP, so hopefully it will work for you.\n\n-----\n\nThis torrent download was bought to you by the Screaming Korpse Kollectiv, the net's only dedicated Heavy Gear 2 community which can be found at www.sk-k.net\n\nFeel free to visit us and register. If you have any problems, we can hopefully help you solve them on our forums and we also host fixes for known issues.\n\nWe also offer Heavy Gear downloads, including mods, maps and a level editor.\n\nTorrent compiled by Revol77. Thanks to Shyborg for helping me get a decent rip of the HG2 disc.\n\nDescription from allgame.com:\n[/i]&quot;Heavy Gear II introduces a brand new 3D hardware-only engine, which brings with it quick combat-action, indoor battles, a new and realistic physics model and &quot;photo-realistic terrain.&quot; Players can send complex commands to squad mates such as flanking maneuvers, ambushes, and diversions. Enemies will adapt to your plans and create tactics of their own.\n\nTo combat the threat on Terra Nova, player's forces will have to traverse a wide variety of settings such as swamps, grasslands, unstable volcanic areas, freezing arctic settings and cityscape. Through battle and scouting, you'll gather information to better understand just whom you are up against.&quot;[/i]\n\nScreenshot: [url]http://sjames.org/hg2shot.jpg[/url]","torrent":{"xt":"urn:btih:d1172eba37338ec064a482287f4c8b9bafd4a47b","amp;dn":"Heavy+Gear+2+Repack+%5Bsk-k.net%5D.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1172eba37338ec064a482287f4c8b9bafd4a47b","infoHashBuffer":{"type":"Buffer","data":[209,23,46,186,55,51,142,192,100,164,130,40,127,76,139,155,175,212,164,123]},"announce":[],"urlList":[]}}