{"title":"The Secret File of Joseph Stalin A Hidden Life.pdf","uid":4761714,"size":4315010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d298c8bbe70bbcd65f1a2397ef856415a8d43430&amp;dn=The+Secret+File+of+Joseph+Stalin+A+Hidden+Life.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"Djofullinn","files":1,"time":1236721409,"description":"'Brackman has done a vaulable service in piecing together the fragmentary information about Stalins record from the published sources ... interesting book.' - Times Literary Supplement\n\n'Poor Stalin: he murdered, poisoned and tortured tens of thousands of Bolsheviks in order to keep his secrets, and yet Roman Brackman is able to disclose and prove them all ... Brackmans extensive, systematic research into Stalin's crime presents us with a well-written history of events leading to the 1917 Communist Revolution and the subsequent developments.'\n- The Jerusalem Post\n\n'There is much in The Secret File of Joseph Stalin that challenges conventional interpretation of Stalins dictatorship ... his claim that Stalin had been an Okhrana agent also deserves to be taken seriously.' - Christopher Andrews, The Sunday Times\n\n'This book is an important contribution to the historical record.' - The Russian Review\n\n'This is an engaging and provocative psychological study of Stalin. The book has a good index and biliography and is recommended to the general public.' - Choice\n\nBrackman has done a vaulable service in piecing together the fragmentary information about Stalins record from the published sources ... interesting book. - Times Literary Supplement\n\nPoor Stalin: he murdered, poisoned and tortured tens of thousands of Bolsheviks in order to keep his secrets, and yet Roman Brackman is able to disclose and prove them all ... Brackmans extensive, systematic research into Stalins crime presents us with a well-written history of events leading to the 1917 Communist Revolution and the subsequent developments.\n- The Jerusalem Post\n\nThere is much in The Secret File of Joseph Stalin that challenges conventional interpretation of Stalins dictatorship ... his claim that Stalin had been an Okhrana agent also deserves to be taken seriously. - Christopher Andrews, The Sunday Times\n\nThis book is an important contribution to the historical record. - The Russian Review\n\nThis is an engaging and provocative psychological study of Stalin. The book has a good index and biliography and is recommended to the general public. - Choice \n\nProduct Description\nStarting with Stalin's early years, the author reveals the bitter family conflict caused by the suspicion that the boy was the result of an adulterous affair. The suspicion poisoned the lives of his parents and led to the family's breakup, and to severe abuse by Stalin's father that left the ten-year-old boy's arm crippled for the rest of his life. The traumatized boy grew up into a brutal and crafty criminal, becoming an agent-provocateur of the Tsarist secret police, the Okhrana. This account details Stalin's role as an Okhrana agent, and reconstructs his rivalry with Roman Malinovsky, the top Okhrana agent in Lenin's organization.\nThe book explores why Stalin was not exposed after the collapse of the Tsarist regime. It gives an account of the discoveries in the odl archives of Stalin's Okhrana files after his rise to power. It came to light in 1926 and there were several attempts to use the file to depose and execute Stalin as an Okhrana provocateur. Soviet officials of Polish and Jewish ethnic origin played a part in the story of this file, and Brackman argues that this inspired Stalin's hatred for these two groups, igniting the irrational urge to destroy them that led to his alliance with Hitler and the partitioning of Poland, which started World War II. ","torrent":{"xt":"urn:btih:d298c8bbe70bbcd65f1a2397ef856415a8d43430","amp;dn":"The+Secret+File+of+Joseph+Stalin+A+Hidden+Life.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d298c8bbe70bbcd65f1a2397ef856415a8d43430","infoHashBuffer":{"type":"Buffer","data":[210,152,200,187,231,11,188,214,95,26,35,151,239,133,100,21,168,212,52,48]},"announce":[],"urlList":[]}}