{"title":"GREAT COLLECTION OF CLASSICAL MUSIC 66 MDs TAGGED!","uid":11288473,"size":17317017753,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d2a11578ce6e9ebe016f0db57895ab434f0f4104&amp;dn=GREAT+COLLECTION+OF+CLASSICAL+MUSIC+66+MDs+TAGGED%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":4,"uploader":"DigiTizeU","files":820,"time":1414295891,"description":"This is truly a GREAt collection of classical music. It was released by Sony in 1994 as 66 Minidiscs in a boxed set with a book.The original poster did a great job of ripping it and the scans are quite good. However it was not tagged almost at all.\n\nI can not blame the original poster for not tagging it. It took a lot of time and was a nightmare to get it right. Fortunately notes were with each disc from the original poster. Whom I assume was japanese.\n\nRemoved are all the notes. All the information is now in the tags. It included scans of the back side of each disc. They have been removed since they provided no information that was useful. The covers were a bit dark and have been set to proper brightness. Removed the cue files because they were in Japanese. Also removed the narration tracks because they were also in Japanese. Unfortunately a PDF of the book was not included. It would have been nice to have with this collection\n\nDiscs 61-65 are sounds from nature. Disc 66 is an index in soundtracks of what is on the discs. The way it is tagged it should goto the back of your library as 66 albums in numbered order. They are in four folders in DVD=R size for easy burning.\n\nEven if you already have this collection you will want this!\n\nEnjoy!\n\n\nPlease seed for others. It is the right thing to do!","torrent":{"xt":"urn:btih:d2a11578ce6e9ebe016f0db57895ab434f0f4104","amp;dn":"GREAT+COLLECTION+OF+CLASSICAL+MUSIC+66+MDs+TAGGED%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2a11578ce6e9ebe016f0db57895ab434f0f4104","infoHashBuffer":{"type":"Buffer","data":[210,161,21,120,206,110,158,190,1,111,13,181,120,149,171,67,79,15,65,4]},"announce":[],"urlList":[]}}