{"title":"The Marlene Dietrich  Collection - Morocco (1930) Xvid 1cd - Gar","uid":9471311,"size":733880320,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d3254c09f83adbec1e3adc254b4fada13f4c3f8e&amp;dn=The+Marlene+Dietrich++Collection+-+Morocco+%281930%29+Xvid+1cd+-+Gar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"SaM","files":-1,"time":1389581990,"description":"The Marlene Dietrich  Collection - Morocco (1930) Xvid 1cd - Gary Cooper [DDR]\n\nMorocco is a 1930 American romance drama film directed by Josef von Sternberg and starring Gary Cooper, Marlene Dietrich, and Adolphe Menjou. Based on the novel Amy Jolly by Benno Vigny and adapted by Jules Furthman, the film is about a cabaret singer and a Legionnaire who fall in love, but their relationship is complicated by his womanizing and the appearance of a rich man who is also in love with her. The film is most famous for the scene in which Dietrich performs a song dressed in a man's tailcoat and kisses another woman (to the embarrassment of the latter), both of which were rather scandalous for the period.\n\nMorocco was nominated for four Academy Awards in the categories of Best Actress in a Leading Role (Marlene Dietrich), Best Art Direction, Best Cinematography and Best Director (Josef von Sternberg). In 1992, Morocco was selected for preservation in the United States National Film Registry by the Library of Congress as being &quot;culturally, historically, or aesthetically significant&quot;.\n\n    CAST:-\n    Gary Cooper as Legionnaire Tom Brown\n    Marlene Dietrich as Amy Jolly\n    Adolphe Menjou as La Bessiere\n    Ullrich Haupt as Adjutant Caesar\n    Eve Southern as Madame Caesar\n    Francis McDonald as Sergeant\n    Paul Porcasi as Lo Tinto, nightclub owner\n\nDirected by Josef von Sternberg\nProduced by Hector Turnbull\nScreenplay by Jules Furthman\nBased on Amy Jolly by Benno Vigny\nMusic by Karl Hagos\nRunning time 91 minutes\n\nMOVIE REVIEW:- Morocco (1930)\nWealthy La Bessiere (Adolphe Menjou) tries to strike up an acquaintance with disillusioned nightclub singer Amy Jolly (Marlene Dietrich) on a ship bound for Morocco. Though polite, she later tears up and tosses away his calling card. They meet again at the nightclub where she is the headliner.\n\nAlso in the audience is appreciative ladies man, Legionnaire Private Tom Brown (Gary Cooper). During her first performance, after kissing a woman in the audience, Amy slips Tom her key. He takes her up on her offer that night, and they become acquainted. He discovers that she has become embittered with life and men, but, as they talk, she finds herself coming to like him. Unwilling to risk heartbreak once again, she asks him to leave before anything serious happens.\n\nOn the street, Tom encounters Legionnaire Adjutant Caesar's wife (Eve Southern). It is clear that she has a past clandestine relationship with him, which she desires intensely to maintain. Her husband, Tom's commanding officer, watches undetected from the shadows, as Tom rejects her. Meanwhile, Amy changes her mind and seeks Tom out. Madame Caesar then hires two street ruffians to attack the couple. Tom manages to seriously wound both, while he and Amy escape unscathed.\n\nThe next day, Tom is brought before Adjutant Caesar on the charge of injuring two allegedly harmless natives. Amy clears him, but Caesar makes him aware that he knows about Tom's involvement with his wife. Tom is ordered to leave for Amalfi Pass with a detachment commanded by Caesar. He suspects that Caesar intends to rid himself of his romantic rival.\n\nThat night, Tom overhears La Bessiere, who has been courting Amy all along, offer to marry her. Though he has fallen in love with her himself, Tom decides that she would be better off with a rich man than with a poor Legionnaire. When Tom hides the depth of his feelings for her before his departure, Amy eventually accepts La Bessiere's proposal.\n\nOn the march to Amalfi Pass, the detachment runs into a machine gun nest. Caesar orders Tom to deal with it, then decides to accompany him. Caesar is killed by the enemy.\n\nLater, at their engagement party, La Bessiere and Amy learn that what's left of Tom's detachment has returned. Frantic, Amy rushes outside, but learns that Tom was wounded and left behind to recuperate in a hospital. She informs La Bessiere that she must go to Tom that very night; wanting only her happiness, he drives her there.\n\nShe finds that he has not been injured at all. Because he feigned being wounded to avoid returning, he has been assigned to a new unit, which is about to march away into the desert. \n\nAmy is torn, but when she sees a handful of native women stubbornly following the Legionnaires they love, she joins them.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 91 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]\nDuration: 91 mins","torrent":{"xt":"urn:btih:d3254c09f83adbec1e3adc254b4fada13f4c3f8e","amp;dn":"The+Marlene+Dietrich++Collection+-+Morocco+%281930%29+Xvid+1cd+-+Gar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3254c09f83adbec1e3adc254b4fada13f4c3f8e","infoHashBuffer":{"type":"Buffer","data":[211,37,76,9,248,58,219,236,30,58,220,37,75,79,173,161,63,76,63,142]},"announce":[],"urlList":[]}}