{"title":"AK Interactive - Weathering a Sdkfz 222 in One Hour","uid":7638933,"size":1129659330,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d36ccd9fe014583fe731a495dca731956c99c0f3&amp;dn=AK+Interactive+-+Weathering+a+Sdkfz+222+in+One+Hour&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"maninga69","files":-1,"time":1347726965,"description":"Finally a DVD that is different from the rest. Most modellers, especially when starting out in the world of paint effects, have wondered what the complete process of painting a model consists of. From start to finish. Until now our DVD?s have only shown parts of the action, seconds or minutes of a small fraction of the process. But on our new DVD we show you the complete process of weathering a Sdkfz 222, from Hobby Boss, recorded in just one take with one camera and without any cuts or editing. In this way, you the spectator, can see the complete process, and appreciate in real time what you need to do to paint a model in a little more than 1 hour.\n\n\nAn experiment, which due to its difficulty has never been done before. Mig Jimenez is back to demonstrate that the job of weathering a model doesn?t have to be slow and complicated. In just a small time you can achieve a great and attractive finish. Included with the DVD are numerous colour profilesfor other variants on the Sdkfz 222. Narration in English. Text?s in Spanish and English. 70 minutes. PAL format.\n","torrent":{"xt":"urn:btih:d36ccd9fe014583fe731a495dca731956c99c0f3","amp;dn":"AK+Interactive+-+Weathering+a+Sdkfz+222+in+One+Hour","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d36ccd9fe014583fe731a495dca731956c99c0f3","infoHashBuffer":{"type":"Buffer","data":[211,108,205,159,224,20,88,63,231,49,164,149,220,167,49,149,108,153,192,243]},"announce":[],"urlList":[]}}