{"title":"CRASH AND BURN (A Back Down Dev - London Casey.epub","uid":10860630,"size":203526,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d386ed63dcdab26a1a4cc0eec4521003ca74b48c&amp;dn=CRASH+AND+BURN+%28A+Back+Down+Dev+-+London+Casey.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"DethHolly","files":1,"time":1408839005,"description":"Stealing a motorcycle, crashing it, witnessing a bomb explosion, and being held at gunpoint while begging for her life is a far cry from the life that Avery Smith is trying to escape in the first place, but as she winds up in the strong, sexy arms of another biker, she can't help but wonder why she would want to leave that life ever again.\n\nLandon Cryen knows it's a mistake to bring Avery into the clubhouse. There's too much going on right now. In the midst of a raging war with a rival crew, they have to satisfy a business deal and find the ones responsible for almost killing a fellow member in a bombing. But sensing Avery's pain - and feeling her body - has Landon questioning everything he believes in. The pressure puts him over the edge and soon he and the Back Down Devil MC are blackmailed into handling the murder of a man who can potentially take down the MC.\n\nAvery knows she should run away, but she can't escape Landon - or Back Down Devil MC. She knows more than she should, so she decides to step up and prove her feelings for Landon and her respect for the club.\n\nOnce Avery steps into a dangerous world without the protection of the MC, she has to find the strength that had once been taken from her... the question is, will her strength be enough to make it back to Landon's arms safely?","torrent":{"xt":"urn:btih:d386ed63dcdab26a1a4cc0eec4521003ca74b48c","amp;dn":"CRASH+AND+BURN+%28A+Back+Down+Dev+-+London+Casey.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d386ed63dcdab26a1a4cc0eec4521003ca74b48c","infoHashBuffer":{"type":"Buffer","data":[211,134,237,99,220,218,178,106,26,76,192,238,196,82,16,3,202,116,180,140]},"announce":[],"urlList":[]}}