{"title":"The Blues Brothers OST 320 MP3","uid":7410258,"size":98374244,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d4425eac1da0fdc888fdb54b8ca78f1561575182&amp;dn=The+Blues+Brothers+OST+320+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":-1,"time":1341360329,"description":"The Blues Brothers: Music from the Soundtrack was released on June 20, 1980 as the second album by the Blues Brothers Band, which also toured that year to promote the film. &quot;Gimme Some Lovin'&quot; was a Top 20 Billboard hit, peaking at number 18.[38] The album was a followup to their debut, the live album, Briefcase Full of Blues. Later that year they released a second live album, Made in America, which featured the Top 40 track, &quot;Who's Making Love&quot;.[38]\nThe songs on the soundtrack album are a noticeably different audio mix than in the film, with a prominent baritone saxophone in the horn line (also heard in the film during &quot;Shake a Tail Feather&quot;, though no bari sax is present), and female backing vocals on &quot;Everybody Needs Somebody to Love&quot;, though the band had no backup singers in the film. A number of regular Blues Brothers' members, including saxophonist Tom Scott and drummer Steve Jordan, perform on the soundtrack album but are not in the film.\nAccording to director Landis in the 1998 documentary The Stories Behind the Making of 'The Blues Brothers', filmed musical performances by Franklin and Brown took more effort, as neither artist was accustomed to lip-synching their performances on film. Franklin required several takes, and Brown simply rerecorded his performance live. Cab Calloway initially wanted to do a disco variation on his signature tune, &quot;Minnie The Moocher&quot;, having done the song in several styles in the past, but Landis insisted that the song be done faithful to the original big band version.\n\n\n\n\n\t1.\tShe Caught The Katy - Jake\n\t2.\tPeter Gunn Theme - strumentale (di Henry Mancini)\n\t3.\tGimme Some Lovin' - Jake\n\t4.\tShake a Tail Feather - Ray Charles/Jake &amp; Elwood\n\t5.\tEverybody Needs Somebody to Love - Jake &amp; Elwood\n\t6.\tThe Old Landmark - James Brown\n\t7.\tThink - Aretha Franklin\n\t8.\tTheme From Rawhide - Jake &amp; Elwood\n\t9.\tMinnie the Moocher - Cab Calloway\n\t10.\tSweet Home Chicago - Jake &amp; Elwood\n\t11.\tJailhouse Rock - Jake\n\n\n320 Kbps Enjoy!","torrent":{"xt":"urn:btih:d4425eac1da0fdc888fdb54b8ca78f1561575182","amp;dn":"The+Blues+Brothers+OST+320+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4425eac1da0fdc888fdb54b8ca78f1561575182","infoHashBuffer":{"type":"Buffer","data":[212,66,94,172,29,160,253,200,136,253,181,75,140,167,143,21,97,87,81,130]},"announce":[],"urlList":[]}}