{"title":"ALONG THE INFINITE SEA - Beatriz Williams {FerraBit}","uid":15799877,"size":842421587,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d489214058c8d1f201f683a7754c741ea28346d2&amp;dn=ALONG+THE+INFINITE+SEA+-+Beatriz+Williams+%7BFerraBit%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"FerraBit","files":36,"time":1473487413,"description":"Along the Infinite Sea by Beatriz Williams (2015) {FerraBit}\r\n\r\nRead by . . : Kathleen Mcinerney\r\nPublisher . : Recorded Books (2015) #DD21343\r\nISBN-10 . . : 1611764556   BX00054971\r\nISBN-13 . . : 9781611764550\r\nFormat . . .: MP3. 32 tracks.\r\nSize: . . . : 803 MB\r\nBitrate . . : 120 kbps (iTunes 12, Stereo, VBR, 44.1 kHz)\r\nSource . . .: 13 CDs (15.5 hrs)\r\nGenre . . . : Fiction Historical\r\nUnabridged .: Unabridged\r\n\r\n1 track per chapter (merged), nicely tagged and labeled, cover scan included.\r\n\r\nThanks for sharing &amp; caring.\r\nCheers, FerraBit\r\nSeptember 2016\r\n\r\n Links: \nhttp://www.recordedbooks.com/title-details/9781611764550\r\n\r\n Originally posted: \nhttps://thepiratebay.org/search/FerraBit/ \nhttps://www.demonoid.ooo/files/?uid=4819534\r\n\r\nTaken the time to read this? Take some more, and leave a nice \r\nnote of encouragement for everyone to share and care.\r\nGot your FPL card?\r\n_____________________________________________________\r\n\r\nDescription\r\n\r\nEach of the three Schuyler sisters has her own world-class problems, but in the autumn of 1966, Pepper Schuyler's problems are in a class of their own. When Pepper fixes up a beautiful and rare vintage Mercedes and sells it at auction, she thinks she's finally found a way to take care of herself and the baby she carries, the result of an affair with a married, legendary politician. But the car's new owner turns out to have secrets of her own, and as the glamorous and mysterious Annabelle Dommerich takes pregnant Pepper under her wing, the startling provenance of this car comes to light: a Nazi husband, a Jewish lover, a flight from Europe, and a love so profound it transcends decades. As the many threads of Annabelle's life from World War II stretch out to entangle Pepper in 1960s America, and the father of her unborn baby tracks her down to a remote town in coastal Georgia, the two women must come together to face down the shadows of their complicated pasts. Indomitable heroines, a dazzling world of secrets, champagne at the Paris Ritz, and a sweeping love story for the ages, in New York Times bestselling author Beatriz William's final book about the Schuyler sisters.\r\n\r\nProfessional reviews\r\n\r\n&quot;Kathleen McInerney portrays two determined women in this historical novel. Although they're strangers of different generations, elegant widow Annabelle feels drawn to young Pepper when they meet in 1966. McInerney portrays Annabelle with sophisticated mystery as she connects with Pepper for the purpose of buying Pepper's 1936 Mercedes roadster, for which Annabelle pays more than market value. McInerney provides glimpses of the self-doubt behind Pepper's bravado as the unmarried young woman on the run plans for the birth of her baby. When the novel flashes back to 1930s Germany and Annabelle's intense relationships with her Nazi husband and her Jewish lover, McInerney's portrayal of young Annabelle displays her intelligence and heartbreaking confusion. McInerney is gentle with the German accents, allowing the listener to discern the differences between the two men. N.M.C. © AudioFile 2015","torrent":{"xt":"urn:btih:d489214058c8d1f201f683a7754c741ea28346d2","amp;dn":"ALONG+THE+INFINITE+SEA+-+Beatriz+Williams+%7BFerraBit%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d489214058c8d1f201f683a7754c741ea28346d2","infoHashBuffer":{"type":"Buffer","data":[212,137,33,64,88,200,209,242,1,246,131,167,117,76,116,30,162,131,70,210]},"announce":[],"urlList":[]}}