{"title":"The Dead Sea Scrolls (Wise, Abegg, Cook) (pdf)","uid":8881565,"size":5800767,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4a1b000e07a7597ddac35bcbc829eca15693c70&amp;dn=The+Dead+Sea+Scrolls+%28Wise%2C+Abegg%2C+Cook%29+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"pharmakate","files":-1,"time":1378337832,"description":"Dead Sea Scrolls: A New Translation (Michael O. Wise, Martin G. Abegg, Edward M. Cook, trans.) (HarperCollins, 1996). 513 pages.\n\nOld scan, completely reprocessed and improved. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nThe Dead Sea Scrolls: A New Translation is a landmark work that brings to life the long-inaccessible ancient scrolls of Qumran. Three distinguished translators at the forefront of modern scrolls scholarship reveal the rich tapestry of writings known as the Dead Sea Scrolls. This is the most comprehensive translation ever compiled for the general reader in any language. Translated into modern-day English by Michael Wise, Martin Abegg Jr. and Edward Cook, this book contains virtually every legible portion of the fragmented scrolls, including revelatory information on early Christianity and its roots far deeper than previously realized in ancient Judaism. Included as well are scroll fragments that promise to alter dramatically our view of biblical history, including never-before released texts and newly discovered writings by and about key biblical prophets and ancestors. The translators provide illuminating commentary throughout that place the scrolls in their true historical context. They also present a compelling, insightful introduction that gives the reader an overview of the often surprising contents of the scrolls and discusses what are perhaps the greatest mysteries of the scrolls -- who authored them and why.\n\nFrom a new generation of Dead Sea Scrolls scholars, here is a fresh look at the scrolls, including the most recently released texts. Michael Wise, Martin Abegg Jr. and Edward Cook unlock the secrets and rich mysteries of the Dead Sea Scrolls in the most comprehensive translation ever published for the general reader in any language. Their brilliant scholarship and illuminating commentary add dramatic new knowledge to our understanding of the scrolls. This historic translation includes:\n\nIntriguing revelations about biblical history and the roots of Christianity.\nNever-before-seen stories about the biblical figures Abraham, Jacob and Enoch -- including a text explaining why God demanded the sacrifice of Isaac.\nTwelve texts not included in the Bible that claim Moses as their author.\nNew psalms attributed to King David and to Joshua.\nTexts illuminating ancient doctrines about angels and writings claiming to be revelations of angels themselves including the Archangel Michael.\nThe Dead Sea Scrolls: A New Translation will set the standard for scrolls scholarship for years to come. This is an important, rigorously researched work that renders the scrolls vibrant and accessible.\n\nIn their great variety and stunning richness, the Dead Sea Scrolls as captured in this groundbreaking translation offer modern readers an unprecedented glimpse of the complex roots of modern Christianity. Its dozens of never-before-published texts encompass poetry and prose, teaching parables and magical tales, astrology, apocalyptic visions, lists of buried treasure, stories of messiahs and antichrists, demons and angels and together comprise a new classic of religious history.\n\nLong withheld from public view, the ancient scrolls found in the caves of Qumran near the Dead Sea are revered by many but known in full by very few. Now three translators at the forefront of modern scrolls scholarship have revealed the entire rich complex of writings, stories, poems and texts known as the Dead Sea Scrolls.","torrent":{"xt":"urn:btih:d4a1b000e07a7597ddac35bcbc829eca15693c70","amp;dn":"The+Dead+Sea+Scrolls+%28Wise%2C+Abegg%2C+Cook%29+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4a1b000e07a7597ddac35bcbc829eca15693c70","infoHashBuffer":{"type":"Buffer","data":[212,161,176,0,224,122,117,151,221,172,53,188,188,130,158,202,21,105,60,112]},"announce":[],"urlList":[]}}