{"title":"F. Donald Logan - The Vikings in History [1991][A]","uid":10017364,"size":3362579,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d51de50d1c887a75d3aebddbb8ebaa0e79722907&amp;dn=F.+Donald+Logan+-+The+Vikings+in+History+%5B1991%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Anette14","files":-1,"time":1398163693,"description":"Description\nProduct details\nBook Title: The Vikings in History\t\nBook Author: F.Donald Logan (Author)\nPaperback: 232 pages\nPublisher: Routledge; New ed of 2 Revised ed edition (28 Feb 1991)\nLanguage: English\nISBN-10: 0415083966\nISBN-13: 978-0415083966\n================================\nBook Description\nPublication Date: 28 Feb 1991\nThe second edition of this lively and comprehensive book provides a forceful reassessment of the role of the Vikings in history. Drawing on archaeological, literary, as well as historical evidence, the author describes the Viking expeditions overseas, and their transformation from terrifying raiders to assimilated settlers whose rich culture played an influential role in European civilization.\n================================\nReview\n&quot;The originality of this book lies in shifts of emphasis...in a common-sense approach, and in the breadth of the picture which it offers..&quot;\n-Times Literary Supplement\n================================\nMost Helpful Customer Reviews on(beta)\nGood book on Scandinavian expansion/influence 29 Aug 2003\nBy Lois Huneycutt - Published on\nFormat:Paperback\nI have used this book in medieval history courses and courses on the Vikings with a great deal of success. It's well-written, engaging, told in a logical sequence, and it covers areas that other, similar books do not. It tends, however, to be a little over-corrective in its approach and minimizes the devastation of Viking violence on some more settled societies. He calls the raiding parties &quot;exuberant, at times destructive,&quot; making them sound more like Labrador Retriever puppies than sometimes murderous bands. Overall, though, it's a very good survey.\n\nIntriguing 9 April 2000\nBy &quot;astyanax&quot; - Published on\nFormat:Paperback\nF. Donald Logan's The Vikings in History seeks to establish that the overall picture we have of the vikings is distorted to the point that we do not consider their contributions to the development of Europe in the Middle Ages and early Renaissance periods. Logan wishes to move away from the traditional &quot;Franco-centric&quot; viewpoint which holds that it was the Carolingians who brought about the great changes to western civilization. For Logan, the Vikings instituted a great many of these changes, which resulted in the establishment of political, social and economic institutions which prevailed in western civilization for a fairly long time.\nLogan divides his book into several sections which deal with the vikings from a geographical perspective, treating groups separately, e.g. the Vikings in Ireland or the Vikings in England. This isolationist approach gives better perspectives on the individual movements of various Viking tribes and their accomplishments in the respective area.\nThe book is not boring and is not bogged down with historical jargon or long explanations of historical methods and it reads extremely well. Some of Logan's discussions such as those on the value of the Vinland map work well for students of history as they would for people gathered at the dinner table. At the end of every chapter there is a short list of other works which the curious reader may wish to pursue.\nSome of Logan's conclusions may be questioned, especially when his ideas tear down traditional assumptions dealing with persons who have been revered for their accomplishments, such as King Alfred the Great.\nThis book is a good read for any beginner student of the vikings. It is an easy read and it is informative. Students will appreciate Logan's employment of both archaeological and literary evidence for his supports.\n","torrent":{"xt":"urn:btih:d51de50d1c887a75d3aebddbb8ebaa0e79722907","amp;dn":"F.+Donald+Logan+-+The+Vikings+in+History+%5B1991%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d51de50d1c887a75d3aebddbb8ebaa0e79722907","infoHashBuffer":{"type":"Buffer","data":[213,29,229,13,28,136,122,117,211,174,189,219,184,235,170,14,121,114,41,7]},"announce":[],"urlList":[]}}