{"title":"Earthworm Jim - Full Seasons 1&amp;2 AVI - CanadaBud","uid":4727173,"size":2554640697,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d52b26e97e9787809b13f6241ce81e4137372fdd&amp;dn=Earthworm+Jim+-+Full+Seasons+1%262+AVI+-+CanadaBud&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"G0ldy","files":31,"time":1234813357,"description":"The full series of Earthworm Jim, both seasons 1 and 2. A comedic cartoon from the mid 90's that I watched when I was younger which I thought was very funny.  It seems that legit copies are near impossible or are impossible to find and I wanted to get the highest quality episodes I could find and make an &quot;all in one&quot; torrent so everyone has a chance to get the best ones available. I found a few torrents offering a few good quality episodes but the rest were usually pretty crappy and other torrents didn't offer all the episodes and were still crappy.\nI only wish credit on putting the torrent together but meh.\n\nThe show was based on video games that was released on the Super Nintendo and the Sega genesis, also later to be released on the N64 and PC.\n\nEarthworm Jim is about how a regular earthworm came in contact with a highly advanced super suit created by one of the villain's in the series, Professor Monkey-for-a-head. After EWJ (Earthworm Jim) has become mutated into a large worm thingy he begins fighting evil in the universe with his faithful sidekick Peter Puppy and trying to win the hand of princess what's her name (trying to doesn't happen too often).\n\n-Goldy\n\n-----------------------------------------------------------------------------------\n\n&quot;The video quality of the episodes are not great but they are very enjoyable anyway. They were recorded on VHS tape from TV and later captured to avi with an ATI Radeon videocapture card. Finally they were recompressed using the available tools at the time like virtualdub/nandub and using codecs like divx 3.11, divx 4 and 5.\n\nTo read more about Earthworm Jim go here:\nhttp://en.wikipedia.org/wiki/Earthworm_Jim_%28TV_series%29\n\n\nEpisode guide here: http://www.bcdb.com/cartoons/Universal_Studios/Television/Earthworm_Jim/index.html&quot; By jimtick I believe.","torrent":{"xt":"urn:btih:d52b26e97e9787809b13f6241ce81e4137372fdd","amp;dn":"Earthworm+Jim+-+Full+Seasons+1%262+AVI+-+CanadaBud","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d52b26e97e9787809b13f6241ce81e4137372fdd","infoHashBuffer":{"type":"Buffer","data":[213,43,38,233,126,151,135,128,155,19,246,36,28,232,30,65,55,55,47,221]},"announce":[],"urlList":[]}}