{"title":"Langford's Basic Photography: The Guide for Serious Photographer","uid":8415067,"size":23213723,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5425001de0e564b5bc6cea19d79ed7ebd322887&amp;dn=Langford%27s+Basic+Photography%3A+The+Guide+for+Serious+Photographer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"2010kaiser","files":-1,"time":1367012948,"description":"  Langford's Basic Photography: The Guide for Serious Photographers-2010kaiser\n  ============================================================================\n\n\n\nLangford's Basic Photography is a seminal photography text. First published in 1965, it has informed the work and career of many of the world's leading photographers.\nThe new, 9th edition, continues the tradition of its predecessors, reflecting the same comprehensive mix of scholarly and practical information. It covers every aspect of photography, from capture through to output, both digital and analogue. There is an emphasis on explaining the 'how to' of photography, but Langford's Basic also includes in-depth coverage of the fundamental principles that govern the art, such as how light behaves, optics, and the shutter. This ensures that the reader comes away with not only a good grasp of photographic technique, but also an in-depth understanding of the fundamentals that will help them to better understand how great photography is made. As such, it functions both as an excellent coursebook for students of photography, and a great primer and reference for amateur enthusiasts.\nThe new edition has been fully updated to reflect dynamic changes in the industry. These changes include: an expansion and overhaul of the information on digital cameras and digital printing; an emphasis on updating photographs to incude a wider range of international work; replacement of many diagrams with photos; overhaul of the analogue sections to give a more modern tone (ie exposure measurement and film and filters with some more dynamic photo illustrations); a fully edited and updated photography timeline.\n\nAuthor: Michael Langford, Anna Fox, Richard Sawdon Smith\nTitle: Langford's Basic Photography: The Guide for Serious Photographers\nPublisher: Focal Press\nYear: 2010\nFormat: PDF\n\n\n\n2010kaiser home page at The Pirate Bay link below:\n\n  &lt;a href=&quot;\nhttp://thepiratebay.se/user/2010kaiser/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2010kaiser/&lt;/a&gt;\n\n\nCheck out the new PirateWiki! Where knowledge is shared ;-)\n\n           &lt;a href=&quot;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&lt;/a&gt;\n\n\nFor re-seed requests, help, support or anything else relating to The Pirate Bay. You'll find it all, and more, at suprbay. The official support forum of The Pirate Bay. Visit it at the link below:\n\n  &lt;a href=&quot;\nhttps://forum.suprbay.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/&lt;/a&gt; \n\n\nENJOY AND SEED!!!","torrent":{"xt":"urn:btih:d5425001de0e564b5bc6cea19d79ed7ebd322887","amp;dn":"Langford%27s+Basic+Photography%3A+The+Guide+for+Serious+Photographer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5425001de0e564b5bc6cea19d79ed7ebd322887","infoHashBuffer":{"type":"Buffer","data":[213,66,80,1,222,14,86,75,91,198,206,161,157,121,237,126,189,50,40,135]},"announce":[],"urlList":[]}}