{"title":"Marathon Monks of Mount Hiei","uid":5149335,"size":735150348,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d626ca56339b68c7a43b46a73da3b31d7b8064b8&amp;dn=Marathon+Monks+of+Mount+Hiei&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dangeroux1","files":1,"time":1257460107,"description":"The greatest athletes in the world today are neither the Olympic champions nor the stars of professional sports, but the &quot;Marathon Monks&quot; of Japan's sacred Mount Hiei. Over a seven year training period, these &quot;running Buddha&quot; figuratively circle the globe on foot. During one incredible 100-day stretch, they cover 52.5 miles daily - twice the length of an Olympic marathon. The prize they seek is not a pot of gold, but enlightenment in the here and now.This documentary program is about these amazing men - Tanno Kakudo and the magic mountain where he trains. It is the philosophy of Tendai Buddhism, which inspires him in his quest for the supreme. The viewer will learn about the monk's death-defying fast, his vegetarian training diet, his handmade straw running shoes, and other feats of endurance such as the mummifying fire ceremony. Illustrated with superb cinematography and music, this film contains the first full insight into Mount Hiei and Tendai Buddhism based on the book &quot;Marathon Monks of Mount Hiei&quot; by John Steven, published by Shambala Press.","torrent":{"xt":"urn:btih:d626ca56339b68c7a43b46a73da3b31d7b8064b8","amp;dn":"Marathon+Monks+of+Mount+Hiei","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d626ca56339b68c7a43b46a73da3b31d7b8064b8","infoHashBuffer":{"type":"Buffer","data":[214,38,202,86,51,155,104,199,164,59,70,167,61,163,179,29,123,128,100,184]},"announce":[],"urlList":[]}}