{"title":"Red Hot Chili Peppers - Blood Sugar Sex Magik (1991) WMA320","uid":6052710,"size":211685215,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d64cd768c55b7009fdc3019bf7f8089987b2a665&amp;dn=Red+Hot+Chili+Peppers+-+Blood+Sugar+Sex+Magik+%281991%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1292794366,"description":"Blood... a fluid that carries nourishment and oxygen to all parts of the body.\nSugar... a sweet, white crystal.\n\nSex... a sexually motivated phenomena or behaviour.\n\nMagik... supernatural power over natural forces.\n\nHmm, a self-reviewing album title. Like the four elements (earth, wind, fire, and water), the title of this album perfectly encompasses all that lies within it.\n\nThe blood speaks to the power of the funk; a force that (as George Clinton says) not only moves, but removes. The tight syncopated grooves put forth by these musicians are definitely life enhancing. There was a period last year when this album stayed in my CD player for months and months. I'd never get tired of listening to it, or dancing to it, or mellowing out to it. Check out &quot;Power of Equality&quot;, &quot;If You Have to Ask&quot;, &quot;Funky Monks&quot;, &quot;Mellowship Slinky&quot; and &quot;Apache Rose Peacock&quot; for real hardcore funk that moves from vivacious party jams, to laid back slow burning grooves.\n\nThe sugar speaks to the incredibly simple yet beautiful pop songs that ease into the mix every once in a while. &quot;I Could Have Lied&quot;, &quot;Breaking the Girl&quot;, and even the more uptempo &quot;My Lovely Man&quot; (about the late Chili guitarist Hillel Slovak) are great examples of this. And then of course there's &quot;Under the Bridge&quot;, a song whose power is so awe-inspiring that I played it in my room over and over even at the height of its popularity (those who know of my iconoclastic tastes can testify that this is a remarkable feat). It ranks as one of my all-time favourite 'songs'.\n\nThe sex refers to the primal energies that flow through the entire album. The Chilis have said that their songs are formed through intense jam sessions, the four packed together in a darkened room and playing together until they reach a Zen-like state. They have this innate power to tap into that collective sexual energy (conception) and produce something new and beautiful (birth). I can't think of anything more sexual than that.\n\nThe magik refers to the interplay between John Frusciante (guitar) and Flea (bass). I've always thought that when I reach the Pearly Gates, I'd like to look off to one side and see John and Flea, shirtless, standing face-to-face, holding guitars and looking into each other's eyes. They'd be playing the most beautiful and soulful and satisfying and magical tune that my ears have ever heard. They have a great musical partnership. It saddened me deeply when I first heard that John had left the group (especially since I was just about to seem them live for the first time; I'm ecstatic he's back). He and Flea, two musicians who are fantastic on their own, form a tandem that I can listen to for hours.\n\nThis album has been a constant for me over the last nine years. It is safe to say that it will always be on my top-5 desert island list. There is not a down moment over its seventy-plus minutes (except maybe the Robert Johnson cover of &quot;They're Red Hot&quot;, which is a little too hardcore-punkish for my liking; but I can easily overlook that because it's barely a minute long). Enjoy... \n\nby Mike Stone\n\nTRACKLIST:\n\n01 - The Power Of Equality.wma                              \n02 - If You Have To Ask.wma                                 \n03 - Breaking The Girl.wma                                  \n04 - Funky Monks.wma                                        \n05 - Suck My Kiss.wma                                       \n06 - I Could Have Lied.wma                                  \n07 - Mellowship Slinky In B Major.wma                       \n08 - The Righteous &amp; The Wicked.wma                         \n09 - Give It Away.wma                                       \n10 - Blood Sugar Sex Magik.wma                              \n11 - Under The Bridge.wma                                   \n12 - Naked In The Rain.wma                                  \n13 - Apache Rose Peacock.wma                                \n14 - The Greeting Song.wma                                  \n15 - My Lovely Man.wma                                      \n16 - Sir Psycho Sexy.wma                                    \n17 - They're Red Hot.wma    \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:d64cd768c55b7009fdc3019bf7f8089987b2a665","amp;dn":"Red+Hot+Chili+Peppers+-+Blood+Sugar+Sex+Magik+%281991%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d64cd768c55b7009fdc3019bf7f8089987b2a665","infoHashBuffer":{"type":"Buffer","data":[214,76,215,104,197,91,112,9,253,195,1,155,247,248,8,153,135,178,166,101]},"announce":[],"urlList":[]}}