{"title":"The Bare-Knuckle Boxer's Companion","uid":9686687,"size":7842509,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d65b57ada306d12d85288cae67d67b283ea83204&amp;dn=The+Bare-Knuckle+Boxer%27s+Companion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1393780016,"description":"Bare-Knuckle Boxer's Companion\nby David Lindholm, Ulf Karlsson\n\nDESCRIPTION:\n\nThe fighters of the great bare-knuckle boxing era were tough men and skilled combatants. They had to be to endure brutal brawls that could last for hours, testing the skills and guts of both participants. In this fascinating tutorial on this poorly understood combative art, martial artists David Lindholm and Ulf Karlsson Tada extract the practical material from historical bare-knuckle boxing and show how it can be applied in modern self-defense.\n\nLindholm and Tada have analyzed the surviving texts and illustrations of the masters of bare-knuckle boxing and organized what they've discovered into a complete program for training, conditioning and applying these skills in a real confrontation. In doing so, they show how bare knuckle is an ideal system for real-world self-defense. It contains strikes, throws, parries and a few basic kicks, so it is simple to learn. The techniques are remarkably powerful, which means you get a good payoff for each shot you land. It works regardless of the clothes you wear, the surface you stand on, the space you will fight in or how many attackers you meet. Bare knuckle is also easy to practice alone or with partners, because you need minimal space and equipment to train and enjoy its benefits.\n\nThe bare-knuckle boxing era ended in the early 20th century, when gloves were introduced, stricter rules implemented and oversight organizations formed. This book is devoted to reviving this practical combative art.","torrent":{"xt":"urn:btih:d65b57ada306d12d85288cae67d67b283ea83204","amp;dn":"The+Bare-Knuckle+Boxer%27s+Companion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d65b57ada306d12d85288cae67d67b283ea83204","infoHashBuffer":{"type":"Buffer","data":[214,91,87,173,163,6,209,45,133,40,140,174,103,214,123,40,62,168,50,4]},"announce":[],"urlList":[]}}