{"title":"Burnout Paradise The Ultimate Box pc 2014","uid":9713574,"size":3054603264,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d7a919d209b0d377989dfd781b2414d01ddbfd18&amp;dn=Burnout+Paradise+The+Ultimate+Box+pc+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"akselminos","files":3,"time":1394132749,"description":"\nRelease Date :- 2009-02-05\nPlatform :- PC\nPublisher :- Electronic Arts\nDeveloper :- Criterion Games\nGenre :- Racing\n\nThe last game of the famous console Burnout series and the first on a PC. Sparkling race without any rules and restrictions, but with a very decent system damage, which can destroy any car to the last screw. Traveling to the big city, you can choose not only the standard circular races. In Stunt Run mode, participants compete in the performance of mind blowing tricks, and in Road Rage destroying cars opponents.\n\nFeatures:\nTotal freedom of action! now before you are a city of skyscrapers, bridges, beautiful coastline and mountainous terrain nearby.\nFreedom of movement is not limited! You are looking for a venue for regular races or skate aimlessly through the streets for fun.\nMiracles on bends! In Paradise City you will find a wide range of exciting mini games. The longest ride on the counter without a frontal collision, the longest skid, dashing parking between two cars was close here bored!\nHundreds of cars! Each member of the movement can become a part of the grand accident! Arrange the most extensive and spectacular crash in the history of the series, use your imagination, and victory will be on your side!\nMad rivals! Besides you on roads Paradise City romp yet thirty four autos. Each of them has unique methods and techniques of driving.\n\n\nSystem requirements:\nOperating system: Windows XP / Vista / 7\nProcessor: Quad Core running at 2.8 GHz or equivalent\nMemory: 1 GB\nHard diske: 4 GB\nSound Card: Sound Card compatible with DirectX 9.0\nGraphics Card: GeForce 8600 or Radeon X1950, (256 MB) / GeForce GTS 250 or Radeon 4850 (512MB)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:d7a919d209b0d377989dfd781b2414d01ddbfd18","amp;dn":"Burnout+Paradise+The+Ultimate+Box+pc+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7a919d209b0d377989dfd781b2414d01ddbfd18","infoHashBuffer":{"type":"Buffer","data":[215,169,25,210,9,176,211,119,152,157,253,120,27,36,20,208,29,219,253,24]},"announce":[],"urlList":[]}}