{"title":"Gary Glitter - Full-Length Discography (1972-2001) mp3","uid":11241794,"size":852579846,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d7f5c2b287f505ee803321d42755c1f71acadb2f&amp;dn=Gary+Glitter+-+Full-Length+Discography+%281972-2001%29+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"analogkid6103","files":99,"time":1413683535,"description":"Description First Uploader Speaks- This guy was somebody back in the day but you have to be over 50 to know it.........\nGary Glitter (born Paul Francis Gadd, 8 May 1944) is an English former glam rock singer-songwriter and musician. His long and highly successful career was ended in the late 1990s by repeated revelations of and criminal convictions for possession of child pornography and (in the 2000s) for child sexual abuse.image\nimage\nGlitter first came to prominence in the glam rock era of the early 1970s, with a sustained solo UK chart run and several hits including &quot;Rock and Roll, Parts One and Two&quot;, &quot;Do You Wanna Touch Me&quot;, &quot;I Love You Love Me Love&quot;, &quot;I'm the Leader of the Gang (I Am)&quot; and &quot;Hello, Hello, I'm Back Again&quot;.\nimage\nA slight decline in the late 1970s was followed by a successful comeback as a solo artist again from the 1980s. Between 1972 and 1995, Glitter had 26 hit singles which spent a total of 180 weeks in the UK Top 100; twelve of those reached the Top 10, with three charting at number 1. He continued to record in the 1980s and 1990s, with his 1984 song &quot;Another Rock n' Roll Christmas&quot; becoming one of the most played Christmas hits of all time.\n\nHe released seven studio albums, and at least 15 greatest hits collections or live albums. In 1998, his recording of &quot;Rock and Roll&quot; was listed as one of the top 1,001 songs in music history. The mostly instrumental &quot;Rock and Roll, Part 2&quot; has been played as a popular cheering song at American sporting events for several decades.\nThe BBC described Glitter's fall from grace as &quot;spectacular&quot;.\n\nHe was convicted three times for driving under the influence, which in 1987 saw him receive a ten-year driving ban and narrowly escape imprisonment. The late 1990s saw Glitter's image become irreparably tarnished, following his 1997 arrest and 1999 conviction in the United Kingdom for possession of thousands of items of child pornography.\n\nLater, Glitter faced criminal charges and deportation across several countries including Vietnam and Cambodia and the UK connected with actual and suspected child sexual abuse, after a Vietnamese court found him guilty of obscene acts with minors in 2006; he had been living in Vietnam since deportation from Cambodia on suspected child sexual abuse charges in 2002.\n\nGlitter was deported from Vietnam back to Britain at the end of his sentence, where he was placed on the Sex Offenders' Register for life.\n\nThese convictions effectively ended his long career and turned the once-popular entertainer into a prominent hate figure. In October 2012, Glitter was arrested again, and bailed, as part of Operation Yewtree, an extensive police investigation into alleged sexual abuse that dates back to the 1950s, connected to the activities of alleged child abuser Jimmy Savile.\nimage\n\nGary Glitter At MySpace\n\n\n1972 Glitter (Reissue 2000)\n\n1973 Touch Me (Reissue 2000)\n\n1975 G. G. (Reissue 2009)\n\n1977 Silver Star (Reissue)\n\n1984 Boys Will Be Boys\n\n1991 Leader II\n\n\nGenre: Rock\nSubgenre: Glam Rock / Pop Rock\nBitrate: 320 k\nSize: 813.08 MB\n99 files","torrent":{"xt":"urn:btih:d7f5c2b287f505ee803321d42755c1f71acadb2f","amp;dn":"Gary+Glitter+-+Full-Length+Discography+%281972-2001%29+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7f5c2b287f505ee803321d42755c1f71acadb2f","infoHashBuffer":{"type":"Buffer","data":[215,245,194,178,135,245,5,238,128,51,33,212,39,85,193,247,26,202,219,47]},"announce":[],"urlList":[]}}