{"title":"[FSX] ImagineSim - VIDP New Delhi Indira Gandhi Airport  (RIP)","uid":7383674,"size":52504417,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d823dea3ca9a74b6d1c6dd8ba9477dc4a56f738d&amp;dn=%5BFSX%5D+ImagineSim+-+VIDP+New+Delhi+Indira+Gandhi+Airport++%28RIP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"_SnakEye","files":1,"time":1340571897,"description":"Indira Gandhi International Airport (IATA: DEL, ICAO: VIDP) is the primary international airport of the National Capital Region of Delhi, India, situated in West Delhi, 16 km (10 m) southwest of New Delhi city centre. Named after Indira Gandhi, the former Prime Minister of India, it is the busiest airport in India. With the commencement of operations at the new Terminal 3, Delhi's Indira Gandhi International Airport has become India's and South Asia's largest and one of the most important aviation hub, with a current capacity of handling more than 46 million passengers and aimed at handling more than 100 million passengers by 2030.\n\nThe airport features custom made runways, terminal buildings rendered to 5cm per pixel scale, an interactive docking system to park you right on your mark, taxiways with highly realistic concrete textures, full airport taxiway and runway signage, 3D approach lighting and full ILS navigation. There are hundreds of airport vehicles and ground personnel, aircraft can be found parked at custom textured parking positions, all hangers, cargo and airport auxiliary buildings are modelled.\n\nIn addition to all of this, the airport looks stunning after dark with beautifully lit buildings and parking areas. Complete airport taxiway and runway lighting is also included.\n\nPlease check the demo version before purchasing to ensure that the product is to your satisfaction and operates effectively on your PC system. FS2004 and FSX versions are offered as stand-alone products and are sold separately.\n\nCredit to *xxlovexx* from boerse.bz for this Release","torrent":{"xt":"urn:btih:d823dea3ca9a74b6d1c6dd8ba9477dc4a56f738d","amp;dn":"%5BFSX%5D+ImagineSim+-+VIDP+New+Delhi+Indira+Gandhi+Airport++%28RIP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d823dea3ca9a74b6d1c6dd8ba9477dc4a56f738d","infoHashBuffer":{"type":"Buffer","data":[216,35,222,163,202,154,116,182,209,198,221,139,169,71,125,196,165,111,115,141]},"announce":[],"urlList":[]}}