{"title":"Candy Girl - A Year in the Life of an Unlikely Stripper","uid":6120278,"size":400542,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d90c5a86788f9175869539b618251f0f3e89a238&amp;dn=Candy+Girl+-+A+Year+in+the+Life+of+an+Unlikely+Stripper&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":3,"time":1295715697,"description":"by Diablo Cody - from stripper/blogger to author, to Oscar-winning screenwriter of &quot;Juno&quot;, to creater/writer/executive producer of &quot;United States of Tara&quot;\n\n\nA copy typist by day in Minnesota, Cody was hardly a likely candidate for entering an amateur stripping contest. But her curiosity got the best of her and, encouraged by her boyfriend, enter she did. The contest left her with an increased curiosity about the profession, and Cody decided to take an evening job stripping at Schieks, a local club. There Cody learns the ins and outs of stripping--how to catch a client's attention, how much the house takes, how some nights are highly profitable and others leave a stripper in debt to the club. Eventually Cody outgrows Schieks and moves on to Deja Vu, a bigger club that's much faster paced. A promotion at her day job forces her to give up stripping temporarily, but before long she's back in the adult entertainment business, this time stripping behind glass in an emporium. Cody's lively romp through the adult entertainment business is bound to appeal to those wanting a peek inside the inner workings of the sex industry. Kristine Huntley","torrent":{"xt":"urn:btih:d90c5a86788f9175869539b618251f0f3e89a238","amp;dn":"Candy+Girl+-+A+Year+in+the+Life+of+an+Unlikely+Stripper","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d90c5a86788f9175869539b618251f0f3e89a238","infoHashBuffer":{"type":"Buffer","data":[217,12,90,134,120,143,145,117,134,149,57,182,24,37,31,15,62,137,162,56]},"announce":[],"urlList":[]}}