{"title":"Neil Young...Freedom(1989)[FLAC]","uid":6878892,"size":370996097,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d986560c33e8e4010f5684db0fb8cfdbb68cb23c&amp;dn=Neil+Young...Freedom%281989%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":19,"time":1323565128,"description":"[img]http://files.web-anonymous.com/z6hn89k55272s6hdq5p3hq186700lu8i/NeilYoung-Freedom.jpg[/img]\n\n[color=Red]Freedom [1989]Reprise2-2589[/color]\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n01 - Rockin' In The Free World \n02 - Crime In The City (Sixty To Zero Part I) \n03 - Don't Cry \n04 - Hangin' On A Limb \n05 - Eldorado \n06 - The Ways Of Love \n07 - Someday \n08 - On Broadway \n09 - Wrecking Ball \n10 - No More \n11 - Too Far Gone \n12 - Rockin' In The Free World \n\nNeil Young is famous for scrapping completed albums and substituting hastily recorded ones in radically different styles. Freedom, which was a major critical and commercial comeback after a decade that had confused reviewers and fans, seemed to be a selection of the best tracks from several different unissued Young projects. First and foremost was a hard rock album like the material heard on Young's recent EP, Eldorado (released only in the Far East), several of whose tracks were repeated on Freedom. On these songs -- especially &quot;Don't Cry,&quot; which sounded like a song about divorce, and a cover of the old Drifters hit &quot;On Broadway&quot; that he concluded by raving about crack -- Young played distorted electric guitar over a rhythm section in an even more raucous fashion than that heard on his Crazy Horse records. Second was a follow-up to Young's previous album, This Note's for You, which had featured a six-piece horn section. They were back on &quot;Crime in the City&quot; and &quot;Someday,&quot; though these lengthy songs, each of which contained a series of seemingly unrelated, mood-setting verses, were more reminiscent of songs like Bob Dylan's &quot;All Along the Watchtower&quot; than of the soul standards that inspired the earlier album. Third, there were tracks that harked back to acoustic-based, country-tinged albums like Harvest and Comes a Time, including &quot;Hangin' on a Limb&quot; and &quot;The Ways of Love,&quot; two songs on which Young dueted with Linda Ronstadt. There was even a trunk (or, more precisely, a drunk) song, &quot;Too Far Gone,&quot; which dated from Young's inebriated Stars 'n Bars period in the '70s. While one might argue that this variety meant few Young fans would be completely pleased with the album, what made it all work was that Young had once again written a great bunch of songs. The romantic numbers were carefully and sincerely written. The long imagistic songs were evocative without being obvious. And bookending the album were acoustic and electric versions of one of Young's great anthems, &quot;Rockin' in the Free World,&quot; a song that went a long way toward restoring his political reputation (which had been badly damaged when he praised President Reagan's foreign policy) by taking on hopelessness with a sense of moral outrage and explicitly condemning President Bush's domestic policy. Freedom was the album Neil Young fans knew he was capable of making, but feared he would never make again.\n\ncd ripped by EAC\n\nplease seed\n\n[img]http://dickthespic.org/[/img]","torrent":{"xt":"urn:btih:d986560c33e8e4010f5684db0fb8cfdbb68cb23c","amp;dn":"Neil+Young...Freedom%281989%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d986560c33e8e4010f5684db0fb8cfdbb68cb23c","infoHashBuffer":{"type":"Buffer","data":[217,134,86,12,51,232,228,1,15,86,132,219,15,184,207,219,182,140,178,60]},"announce":[],"urlList":[]}}