{"title":"The Fortifications of Gibraltar 1068-1945","uid":11829874,"size":29769920,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9e6a890568fc0f949ec91638ecb3f7127a64c46&amp;dn=The+Fortifications+of+Gibraltar+1068-1945&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429593450,"description":"Gibraltar is not only an archetypal fortress, preserving in its dominating topography and walls, bastions and emplacements a rich testament to extended periods of human conflict, but it is also a unique record of the evolution of the sciences of fortification and associated defensive structures over a period of more than six centuries. Gibraltar has a complex and varied military history, lying as it does at the gateway to the Mediterranean and the meeting points of the continents of Europe and Africa. Its history, always shaped by its unique combination of strategic position and topography, begins in ancient times with successive occupations by Phoenicians, Carthaginians and Romans. It then passed through Arab, Castilian and Spanish hands, and has been a British possession since 1704. The Rock served as a base for Nelson's fleet in the Napoleonic Wars and, in World War II, for the Royal Navy's Task Force 'H' and as as a vital stopping place for supply convoys plying to and from the East through the Suez Canal and supporting the Allied effort in the Mediterranean Theater. An unprecedented amount of tunnelling took place on Gibraltar, making it a veritable warren that housed aircraft hangars, ammunition stores, hospitals and even a secret chamber (the Stay-Behind Cave) that was to be manned as an observation post in the event of a hostile takeover","torrent":{"xt":"urn:btih:d9e6a890568fc0f949ec91638ecb3f7127a64c46","amp;dn":"The+Fortifications+of+Gibraltar+1068-1945","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9e6a890568fc0f949ec91638ecb3f7127a64c46","infoHashBuffer":{"type":"Buffer","data":[217,230,168,144,86,143,192,249,73,236,145,99,142,203,63,113,39,166,76,70]},"announce":[],"urlList":[]}}