{"title":"The Animals-The Complete Animals (2CD) + Inside Looking Out","uid":3923087,"size":529884254,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:da1b0030616a0e8bafee6a5c726c63f42d789501&amp;dn=The+Animals-The+Complete+Animals+%282CD%29+%2B+Inside+Looking+Out&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"alekow1","files":80,"time":1196923048,"description":"THE ANIMALS\n\nFormed in Newcastle-upon-Tyne during 1962 and 1963 when Burdon joined the existing Alan Price Rhythm and Blues Combo, the original line-up comprised Eric Burdon (vocals), Alan Price (organ and keyboards), Hilton Valentine (guitar), John Steel (drums), and Bryan &quot;Chas&quot; Chandler (bass). They were dubbed &quot;animals&quot; because of their wild stage act and the name stuck.[1] The Animals&amp;#039; moderate success in their hometown and a connection with Yardbirds manager Giorgio Gomelsky motivated them to move to London in 1964, in time to be grouped with the British Invasion. They performed fiery versions of the staple rhythm and blues repertoire (Jimmy Reed, John Lee Hooker, Nina Simone, etc). Signed to the Columbia Graphophone subsidiary of EMI, a rocking version of the standard &quot;Baby Let Me Follow You Down&quot; (retitled &quot;Baby Let Me Take You Home&quot;) was their first single.\n\nIt was followed in June 1964 by the huge transatlantic hit &quot;House of the Rising Sun&quot;. Burdon&amp;#039;s howling vocals and the dramatic arrangement created arguably the first folk rock hit. Whether the arrangement was inspired by Bob Dylan&amp;#039;s version of the song (which in turn was inspired by folk singer Dave Van Ronk) or by blues singer Josh White&amp;#039;s (who recorded it twice in 1944 and 1949) or by singer/pianist Nina Simone (who recorded it in 1962 on Nina at the Village Gate, predating Dylan&amp;#039;s interpretation) remains a subject of dispute, as does whether all five Animals deserved credit for the arrangement and not just Price.\n\nThe Animals&amp;#039; two-year chart career, masterminded by producer Mickie Most, featured singles that were intense, gritty pop covers such as Sam Cooke&amp;#039;s &quot;Bring It On Home To Me&quot; and the Nina Simone number &quot;Don&amp;#039;t Let Me Be Misunderstood&quot;. In contrast their album tracks stayed with rhythm and blues, with Hooker&amp;#039;s &quot;Boom Boom&quot; and Ray Charles&amp;#039; &quot;I Believe to My Soul&quot; being notable examples. Burdon&amp;#039;s powerful, deep voice and the use of keyboards as much or more than guitars were two elements that made the Animals&amp;#039; sound stand out.\n\nBy May 1965 the group was starting to feel internal pressures. Price left due to personal and musical differences as well as a fear of flying on tour;[2] he went on to a successful career as a solo artist and with the Alan Price Set. Mickey Gallagher filled in for him on keyboards for a spell, until Dave Rowberry replaced him and was on hand for the hit working-class anthems &quot;We Gotta Get Out of This Place&quot;[3] and &quot;It&amp;#039;s My Life&quot;. Around that time, an Animals Big Band even made a one-time appearance.[4]\n\nMany of The Animals&amp;#039; hits had come from Brill Building songwriters recruited by Most; the group, and Burdon in particular, felt this was too restrictive. As 1965 ended the group switched to Decca Records and producer Tom Wilson, who gave them more artistic freedom. In early 1966 MGM Records, their American label, collected their hits onto The Best of The Animals; it became their best-selling album in the U.S. In February 1966 Steel left and was replaced by Barry Jenkins; a leftover cover of Goffin-King&amp;#039;s &quot;Don&amp;#039;t Bring Me Down&quot; was the last hit as The Animals.\n\nBy this time their business affairs &quot;were in a total shambles,&quot; according to Chandler (who would go on to manage Jimi Hendrix), and the group disbanded. Even by the standards of the day, when artists tended to be financially na?, the Animals made very little money from their successes, eventually claiming mismanagement and theft on the part of their manager Michael Jeffery.\n\n\n\n\n1.  The Complete Animals\n\nThe title is a bit of a misnomer; this double CD does include the complete sessions that the Animals recorded with producer Mickie Most in 1964 and 1965. The 40 songs capture the band at their peak, including most of their best and biggest hits: &quot;House of the Rising Sun,&quot; &quot;Don&amp;#039;t Let Me Be Misunderstood,&quot; &quot;Bring It on Home to Me,&quot; &quot;We Gotta Get Out of This Place,&quot; &quot;I&amp;#039;m Crying,&quot; &quot;It&amp;#039;s My Life,&quot; and &quot;Boom Boom.&quot; Most of the rest of the tunes don&amp;#039;t match the excellence of these smashes, though they&amp;#039;re solid. The great majority of them are covers of vintage R&amp;B/rock tunes by Chuck Berry, Fats Domino, and the like, which aren&amp;#039;t quite as durable as reinterpretations from the same era by the Stones and Yardbirds. When they hit the mark, though, the Animals produced some great album tracks that have been mostly forgotten by time, such as &quot;I&amp;#039;m Mad Again&quot; (originally by John Lee Hooker), &quot;Worried Life Blues,&quot; and &quot;Bury My Body.&quot; After leaving Most, the group would maintain their peak for another year or so (this period is represented on the fine import collection Inside Looking Out) despite the departure of one of rock&amp;#039;s all-time finest organists, Alan Price. This compilation has everything that Price recorded with the group, including four previously unreleased cuts and the non-LP Eric Burdon original on the B-side of &quot;It&amp;#039;s My Life,&quot; &quot;I&amp;#039;m Gonna Change the World.&quot;\n\n\nCD 1\n\n01. Boom Boom                                                                                                          \n02. Talkin&amp;#039; Bout You                                                                                                    \n03. Blue Feeling                                                                                                        \n04. Dimples                                                                                                            \n05. Baby Let Me Take You Home                                                                                          \n06. Gonna Send You Back To Walker                                                                                      \n07. Baby What&amp;#039;s Wrong                                                                                                  \n08. The House Of The Rising Sun                                                                                        \n09. F-E-E-L                                                                                                            \n10. I&amp;#039;m Mad Again                                                                                                      \n11. The Right Time                                                                                                      \n12. Around And Around                                                                                                  \n13. I&amp;#039;m In Love Again                                                                                                  \n14. Bury My Body                                                                                                        \n15. She Said Yeah                                                                                                      \n16. I&amp;#039;m Crying                                                                                                          \n17. Take It Easy                                                                                                        \n18. The Story Of Bo Diddley                                                                                            \n19. The Girl Can&amp;#039;t Help It                                                                                              \n20. I&amp;#039;ve Been Around  \n\n\nCD 2\n\n01. Memphis Tennessee                                                                                                  \n02. Don&amp;#039;t Let Me Be Misunderstood                                                                                      \n03. Club-A-Gogo                                                                                                        \n04. Roadrunner                                                                                                          \n05. Hallelujah I Love Her So                                                                                            \n06. Don&amp;#039;t Want Much                                                                                                    \n07. I Believe To My Soul                                                                                                \n08. Let The Good Times Roll                                                                                            \n09. Mess Around                                                                                                        \n10. How You&amp;#039;ve Changed                                                                                                  \n11. I Ain&amp;#039;t Got You                                                                                                    \n12. Roberta                                                                                                            \n13. Bright Lights Big City                                                                                              \n14. Worried Life Blues                                                                                                  \n15. Bring It On Home To Me                                                                                              \n16. For Miss Caulker                                                                                                    \n17. I Can&amp;#039;t Believe It                                                                                                  \n18. We&amp;#039;ve Gotta Get Out Of This Place                                                                                  \n19. It&amp;#039;s My Life                                                                                                        \n20. I&amp;#039;m Gonna Change The World\n\nLabel: EMI\nDate: 1990\n\n\n\n2. Inside Looking Out (The 1965-1966 Sessions)\n\nTogether with the double-CD The Complete Animals, Inside Looking Out forms a complete retrospective of the great British Invasion band. This 22-song compilation features all of the essential recordings cut by the group in 1965 and 1966 after they broke with their original producer Mickie Most, and before Eric Burdon dissolved the core of the original lineup to pursue solo stardom with an Animals group featuring entirely different musicians. These tracks were perhaps more soul-oriented than their previous recordings, but the group still burns on the hits &quot;Inside Looking Out&quot; and &quot;Don&amp;#039;t Bring Me Down.&quot; Despite the absence of original keyboardist Alan Price, the group continued to showcase Burdon&amp;#039;s passionate vocals and burning, vibrant organ (by Price&amp;#039;s replacement Dave Rowberry) on both renowned and obscure R&amp;B tunes, with an occasional original thrown in. Besides the entirety of their final British LP Animalisms (from 1966) and the above-mentioned singles, the CD includes the hits &quot;Help Me Girl&quot; and &quot;See See Rider&quot; (credited to &quot;Eric Burdon and the Animals,&quot; these were possibly Burdon solo records). The four tracks from their first release, an independently released 1963 EP featuring primitive R&amp;B standards, are small but noteworthy bonus cuts that close this collection.\n\n\n01. Inside-Looking Out                                                                                                  \n02. Outcast (European Version)                                                                                          \n03. Don&amp;#039;t Bring Me Down                                                                                                \n04. Cheating                                                                                                            \n05. Help Me Girl                                                                                                        \n06. See See Rider                                                                                                      \n07. One Monkey Don&amp;#039;t Stop No Show                                                                                      \n08. Maudie                                                                                                              \n09. Sweet Little Sixteen                                                                                                \n10. You&amp;#039;re On My Mind                                                                                                  \n11. Clapping                                                                                                            \n12. Gin House Blues                                                                                                    \n13. Squeeze Her Tease Her                                                                                              \n14. What Am I Living For                                                                                                \n15. I Put A Spell On You                                                                                                \n16. That&amp;#039;s All I Am To You                                                                                              \n17. She&amp;#039;ll Return It                                                                                                    \n18. Mama Told Me Not To Come                                                                                            \n19. I Just Want To Make Love To You                                                                                    \n20. Boom Boom                                                                                                          \n21. Big Boss Man                                                                                                        \n22. Pretty Thing  \n\nLabel: Sequel\nDate: 1990\n\n\n\n\nBITRATE: 320\n\nMy cd-rips (EAC and Lame)\nCovers Included\n\n\n\n\n\n\nEnjoy,Seed and Share","torrent":{"xt":"urn:btih:da1b0030616a0e8bafee6a5c726c63f42d789501","amp;dn":"The+Animals-The+Complete+Animals+%282CD%29+%2B+Inside+Looking+Out","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da1b0030616a0e8bafee6a5c726c63f42d789501","infoHashBuffer":{"type":"Buffer","data":[218,27,0,48,97,106,14,139,175,238,106,92,114,108,99,244,45,120,149,1]},"announce":[],"urlList":[]}}