{"title":"World According to Monsanto - DVDRip English.mp4","uid":4098947,"size":735585121,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:da2ed446a103ffd18d63b2a0c9ce802c79a457c5&amp;dn=World+According+to+Monsanto+-+DVDRip+English.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"atrepp","files":1,"time":1206474777,"description":"nternational ? A new movie has dealt yet another severe blow to the credibility of US based Monsanto, one of the biggest chemical companies in the world and the provider of the seed technology for 90 percent of the world?s genetically engineered (GE) crops.\n\nThe French documentary, called ?The world according to Monsanto? and directed by independent filmmaker Marie-Monique Robin, paints a grim picture of a company with a long track record of environmental crimes and health scandals. \n\n\n\nThe story starts in the White House, where Monsanto often got its way by exerting disproportionate influence over policymakers via the ?revolving door?.   One example is Michael Taylor, who worked for Monsanto as an attorney before being appointed as deputy commissioner of the US Food and Drug Administration (FDA) in 1991. While at the FDA, the authority that deals with all US food approvals, Taylor made crucial decisions that led to the approval of GE foods and crops. Then he returned to Monsanto, becoming the company?s vice president for public policy.\n \nThanks to these intimate links between Monsanto and government agencies, the US adopted GE foods and crops without proper testing, without consumer labeling and in spite of serious questions hanging over their safety. Not coincidentally, Monsanto supplies 90 percent of the GE seeds used by the US market. \n\nMonsanto?s long arm stretched so far that, in the early nineties, the US Food and Drugs Agency even ignored warnings of their own scientists, who were cautioning that GE crops could cause negative health effects. Other tactics the company uses to stifle concerns about their products include misleading advertising, bribery and concealing scientific evidence. \n \n\nMonsanto&amp;#039;s background\n\nMonsanto was founded in 1901 as a chemical company. Its history is intimately linked to the production and promotion of highly toxic chemicals such as Agent Orange (used as a chemical weapon in the Vietnam war) and PCBs (widespread toxic pollutants). Robin?s movie reveals that Monsanto already knew about the ?systematic toxic effects? of PCBs for decades, but instructed its salespeople to stay silent because, ?we can?t afford to lose one dollar.?\n\nMore recently Monsanto received a bad reputation for the promotion of growth hormones from GE organisms known as rBGH, which the company sells in the US under the brand name Posilac. Monsanto claims that Posilac holds, ?benefits to consumers?. The reality is that, rBGH growth hormones were banned in Europe and Canada after the authorities found out about the health risks resulting from drinking milk from cows treated with rBGH hormones. Monsanto&amp;#039;s way of &quot;addressing&quot; this problem was to sue the Oakhurst dairy company in the state of Maine (US) - attempting to force them, and other dairies, to stop labelling diary products ?rBGH-free? and ?rBST-free?.\n\n\nGlobal reach, control\n\nOver the last decade, Monsanto aggressively bought up over 50 seed companies around the globe. Seeds are the source of all food. Whoever owns the seeds, owns the food. The process of genetic engineering allows companies, such as Monsanto, to claim patent rights over seeds.  Ninety percent of all GE seeds planted in the world are patented by Monsanto and hence controlled by them.   \n\nPatents on seeds give companies like Monsanto unprecedented power. Monsanto prohibits farmers saving patented GE seeds from one crop to replant the next season, an age-old practice. To ensure that farmers do not reuse seeds, Monsanto created its own &amp;#039;gene police&amp;#039;, and encourages farmers to turn in their neighbors. \n\nEven farmers that do not use GE seeds are not safe. According to an investigative  report by the Centre for Food Safety (CFS) farmers have even been sued for patent infringement after their field was contaminated by pollen or seed from someone else?s GE crop.  \n\nBut Monsanto?s influence doesn&amp;#039;t stop at the US border. ?The world according to Monsanto?, documents the devastating impact of Monsanto&amp;#039;s malpractices around the world. Among others, it includes the real-life stories of cotton farmers in India that ended up in hopeless debts after using Monsanto genetically engineered (so called Bt) cotton, and of a family in Paraguay, South America whose dreams have turned to nightmares after their farm became surrounded by fields planted with Monsanto?s GE soya. \n\n\nA much needed expose\n\nMonsanto wouldn?t address these issues on camera for Robin, instead referring to the &quot;Monsanto Pledge&quot; posted on their website (which we debunk here). \n\nAfter seeing ?The world according to Monsanto?, Greenpeace International campaigner Geert Ritsema said: \n\n?Mrs. Robin should be congratulated for revealing the sinister practices of the world?s leading producer of genetically engineered seeds. Her film is alarming and should be a call to action for everybody who cares about the quality of our food and a healthy future for our planet.?\n\nThe movie will be shown for the first time on ARTE TV (in German and French) on Tuesday 11 March at 21.00. You can order a DVD of it (in English, French and Spanish) here.","torrent":{"xt":"urn:btih:da2ed446a103ffd18d63b2a0c9ce802c79a457c5","amp;dn":"World+According+to+Monsanto+-+DVDRip+English.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da2ed446a103ffd18d63b2a0c9ce802c79a457c5","infoHashBuffer":{"type":"Buffer","data":[218,46,212,70,161,3,255,209,141,99,178,160,201,206,128,44,121,164,87,197]},"announce":[],"urlList":[]}}