{"title":"mIRC 7.38 + Patch [SWEG]","uid":11583552,"size":2614903,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dab101983e5055e11bf8beecc13287178c93fd18&amp;dn=mIRC+7.38+%2B+Patch+%5BSWEG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Swegin8r","files":1,"time":1417148841,"description":"Includes the mIRC v7.38 installation package, a patch and a text file containing instructions.\n\nInstall as usual. Use the provided patch then enter any name and serial combination to register the program. Done! Enjoy!\n\n\n---------------------------------------------------------------------------------\n\n\nmIRC is a full featured Internet Relay Chat client for Windows that can be used to communicate, share, play or work with others on IRC networks around the world, either in multi-user group conferences or in one-to-one private discussions.\n\nIt has a clean, practical interface that is highly configurable and supports features such as buddy lists, file transfers, multi-server connections, IPv6, SSL encryption, proxy support, UTF-8 display, UPnP, customizable sounds, spoken messages, tray notifications, message logging, and more.\n\nmIRC also has a powerful scripting language that can be used both to automate mIRC and to create applications that perform a wide range of functions from network communications to playing games.\n\nmIRC has been in development for over a decade and is constantly being improved and updated with new technologies.\n\n---------------------------------------------------------------------------------\n\nWHY UPGRADE?\n\n-Added STARTTLS support using the CAP tls protocol.\n-Fixed switchbar/treebar display bug that caused windows to be displayed in the wrong order.\n-Added Shift-F3 key support in Scripts Editor to search backwards through text.\n-Fixed timezone/daylight savings bug that was affecting timestamping and time/date identifiers.\n-Changed $sound() to use the TagLib library for improved reading of MP3 and other media file formats.\n-Updated the default DCC accept and ignore file types lists.\n-Changed $input() to allow entering of longer text and limiting text entry to maximum length.\n-Fixed DCC Get window not being updated when a resume begins.\n-Fixed DCC Chat speech bug that caused text in a DCC Chat window not to be spoken.\n-Added $envvar(N/name) identifier with .name and .value properties to return environment variables.\n-Changed /server to search servers list using combination of server address, group, and description.\n-Updated libraries to PCRE v8.36 and OpenSSL 1.0.1j.\n-Other changes and bug fixes","torrent":{"xt":"urn:btih:dab101983e5055e11bf8beecc13287178c93fd18","amp;dn":"mIRC+7.38+%2B+Patch+%5BSWEG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dab101983e5055e11bf8beecc13287178c93fd18","infoHashBuffer":{"type":"Buffer","data":[218,177,1,152,62,80,85,225,27,248,190,236,193,50,135,23,140,147,253,24]},"announce":[],"urlList":[]}}