{"title":"Turing's Cathedral - George Dyson - Audiobook MP3","uid":11321722,"size":452060109,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:db39300b5d7944f2b2fafa0d4dfee88e4b3b593a&amp;dn=Turing%27s+Cathedral+-+George+Dyson+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1414606147,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nTuring's Cathedral: The Origins of the Digital Universe\n\nWritten by: George Dyson\nNarrated by: Arthur Morey\nLength: 15 hrs and 40 mins\nUnabridged Audiobook\nRelease Date:03-06-12\n\nLegendary historian and philosopher of science George Dyson vividly re-creates the scenes of focused experimentation, incredible mathematical insight, and pure creative genius that gave us computers, digital television, modern genetics, models of stellar evolution - in other words, computer code.\n\nIn the 1940s and '50s, a group of eccentric geniuses - led by John von Neumann - gathered at the newly created Institute for Advanced Study in Princeton, New Jersey. Their joint project was the realization of the theoretical universal machine, an idea that had been put forth by mathematician Alan Turing. This group of brilliant engineers worked in isolation, almost entirely independent from industry and the traditional academic community. But because they relied exclusively on government funding, the government wanted its share of the results: the computer that they built also led directly to the hydrogen bomb. George Dyson has uncovered a wealth of new material about this project, and in bringing the story of these men and women and their ideas to life, he shows how the crucial advancements that dominated twentieth-century technology emerged from one computer in one laboratory, where the digital universe as we know it was born","torrent":{"xt":"urn:btih:db39300b5d7944f2b2fafa0d4dfee88e4b3b593a","amp;dn":"Turing%27s+Cathedral+-+George+Dyson+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db39300b5d7944f2b2fafa0d4dfee88e4b3b593a","infoHashBuffer":{"type":"Buffer","data":[219,57,48,11,93,121,68,242,178,250,250,13,77,254,232,142,75,59,89,58]},"announce":[],"urlList":[]}}