{"title":"Victoria 2 [MULTI][MACOSX][LZ0]","uid":7994029,"size":300630996,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:db3a8cfd81ca1898b554875309af885359017b5a&amp;dn=Victoria+2+%5BMULTI%5D%5BMACOSX%5D%5BLZ0%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"EdwardRech","files":-1,"time":1357566011,"description":"Victoria 2 (Game Version 1.3, if you want to use POP DEMAND MOD you have to either get the old 1.3 supported version or update somehow. If you know how to update it for mac to 1.4 please comment!)\n\nAfter some googling, I found this. Works well, pretty awesome! It's vanilla, WITHOUT the expansion packs and such stuff. But mod-supportable (I actually made one and also added one! Works well). It doesn't contain any viruses and I did not notice any decreased performance in my Mac, so it's safe. If you need help, why not comment? \n\nYes, the torrent is 21-part, so get &quot;The Unarchiver&quot;. The urls and readme aren't required, really. Just download the Unarchiver, select the archive (.part1 and so on) files and right click and open them with unarchiver and unarchive it somewhere you want. It's THAT easy. Then just open the .dmg file, place the Victoria 2 game in your Applications folder and play! :D\n\nNeed to mod the game? Game files can be accessed like this:\n1.) Right click Victoria 2\n2.) Press Show Package Contents\n3.) Go to contents -&gt; resources -&gt; Data\n4.) Voila.\n\nScreenshots? They're here:\n/*USER NAME HERE*/Library/Application Support/Victoria 2\n\nNeed other help? Please comment, i'm a friendly pirate.\n\nTESTED ON MAC OS X 10.6.8 (aka Snow Leopard. It works on newer too)\n\nGame Description: \nCarefully guide your nation from the era of absolute monarchies in the early 19th century, through expansion and colonization, to finally become a truly great power by the dawn of the 20th century.\n\nVictoria II is a grand strategy game played during the colonial era of the 19th century, where the player takes control of a country, guiding it through industrialisation, political reforms, military conquest, and colonization.\n\nExperience an in-depth political simulation where every action you take will have various consequences all over the world. The population will react to your decisions based on their political awareness, social class, as well as their willingness to accept or revolt against their government.\n\nKey features:\n\nDeep engrossing political simulation with dozens of different governments.\nDetailed economy with over fifty different types of goods and various production factories.\nOver 200 different countries can be played, during the era stretching from 1835 to the onset of WWII.\nAdvanced Technological system with thousands of inventions to discover.\nImproved graphics and interface, as well as multiplayer support.\nA streamlined interface makes the game easily accessible.\nAutomation of various tasks including, trade and population promotion.\nAdvanced spheres of influences system, where the great powers battle over the control of the world.\nCottage production simulating pre-industrial economies.\nGunboat Diplomacy, no need for negotiating as a fleet outside a port may be a more persuasive argument.\nHistorical and Dynamic missions guiding your country through the history.\n\nSystem Requirements:\nMac OS X 10.6.6 or later (It's said so in App Store, but i'm sure it will work on Leopard (10.5))\n\nThanks for downloading. Leech and seed! ;)\n\nP.S. Yes, it's that game where you can change governments. If you want to play as USA and experience Civil War, yes you will. But please, don't forget to make Communist USA. It's going to be fun :D. You can also create YOUR OWN country by modding, but that's another thing. HAVE FUN PLAYING! SEED IF YOU LEECH. LEECH IF YOU SEED :D","torrent":{"xt":"urn:btih:db3a8cfd81ca1898b554875309af885359017b5a","amp;dn":"Victoria+2+%5BMULTI%5D%5BMACOSX%5D%5BLZ0%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db3a8cfd81ca1898b554875309af885359017b5a","infoHashBuffer":{"type":"Buffer","data":[219,58,140,253,129,202,24,152,181,84,135,83,9,175,136,83,89,1,123,90]},"announce":[],"urlList":[]}}