{"title":"Science of Fullerenes and Carbon Nanotubes","uid":15479398,"size":56032321,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db570cc763a494986ac181a08c6230b648e48f26&amp;dn=Science+of+Fullerenes+and+Carbon+Nanotubes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1470228175,"description":"Science of Fullerenes and Carbon Nanotubes - M. S. Dresselhaus et al. (AP, 1996).pdf\r\n\r\nThe discovery of fullerenes (also known as buckyballs) has generated tremendous excitement and opened up a new field of carbon chemistry. As the first book available on this topic, this volume will be a landmark reference in the field. Because buckyballs are essentially closed hollow cages made up of carbon atoms, they can be manipulated in a variety of ways to yield never-before-seen materials. The balls can, for instance, be doped with atoms or pulled out into tubules and filled with lead to provide properties of high-temperature superconductivity. Researchers can now create their own buckyballs in a process that is almost as simple as making soot, making this research as inexpensive as it is exotic (which has doubtless contributed to its popularity). Researchers anticipate that fullerenes will offer boundless opportunities in the development of new products, drugs and materials.\r\nScience of Fullerenes and Carbon Nanotubes introduces materials scientists, chemists, and solid state physicists to the field of fullerenes, and discusses the unique properties and applications. both current and future, of all classes of fullerenes.\r\n\r\nKey Features\r\n* First comprehensive resource on fullerenes and their applications\r\n* Provides an introduction to the topic\r\n* Presents an extensive discussion of current and future applications of Fullerenes\r\n* Covers all classes of fullerenes","torrent":{"xt":"urn:btih:db570cc763a494986ac181a08c6230b648e48f26","amp;dn":"Science+of+Fullerenes+and+Carbon+Nanotubes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db570cc763a494986ac181a08c6230b648e48f26","infoHashBuffer":{"type":"Buffer","data":[219,87,12,199,99,164,148,152,106,193,129,160,140,98,48,182,72,228,143,38]},"announce":[],"urlList":[]}}