{"title":"The Classics of British Literature - An Exploration","uid":4603996,"size":772121798,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:dc190b8e980488094b7cb1d09494922d946c6f5d&amp;dn=The+Classics+of+British+Literature+-+An+Exploration&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"eddie1969","files":50,"time":1230394336,"description":"Classics of British Literature\n\nTaught by John Sutherland\nCalifornia Institute of Technology (Caltech)\nUniversity College London Ph.D., Edinburgh University\n\n\n--------------------------------------------------------------------------------\n\nHow does literature connect a nation to its past? And why does hearing a poem, attending a play, or reading a novel so often become more than the act itself? How do such works open windows into the historical, cultural, or intellectual worlds of the writers who created them?\n\nFew nations offer a literary legacy that addresses these questions as well as that of Great Britain. For more than 1,500 years, the literature of this tiny island and its founding peoples has taught, nurtured, entertained, thrilled, outraged, and humbled us.\n\nBut how, exactly, do masterpieces of great literature do this?\n\nWhy do we place the mantle of &quot;greatness&quot; upon works as different from one another as the surviving fragments of Beowulf, snatched from the flames by an unknown hero centuries ago, and Salman Rushdie's contemporary novel The Satanic Verses, whose publication sent its author into years of hiding?\n\nAnd why does understanding the world its creators inhabited increase the insights and pleasures a literary work can give us?\n\nBritish-born Professor John Sutherland has spent a lifetime exploring these questions, and in Classics of British Literature, he shares the answers that can forever alter the way you experience a novel, poem, or play. Its 48 lectures reveal why these great works are important - not only as literature, but also as fascinating documents of social, cultural, and political history:\n\n- You'll learn, for example, how the King James Bible of 1611, because it was read aloud in church each week, could teach a newly evolved English language to an entire population - even a largely illiterate one. Teaching the new rhythms and structure of the language in this manner paved the way for much of the literature that followed, including the work of an entire generation of dramatists whose success depended on an understanding of the spoken word by that same largely illiterate audience.\n\n- You'll understand why the Victorian society of Dickens's Oliver Twist chose to change its social welfare legislation to make the experience of poverty even more painful and degrading. This seemingly paradoxical approach was based on philosopher Jeremy Bentham's influential theory that people organized their lives around the pursuit of pleasure and the avoidance of pain. It was a theory that allowed for the belief that the responsible poor would always choose the &quot;option&quot; of gainful employment over the painful alternatives of unemployment, destitution, the workhouse, or the public dole.\n\n\nLearn How the Unlikeliest of Collaborations Changed Poetry Forever\n\n- You'll see how a shared sense of urgency over Britain's direction resulted in the unlikely pairing of Wordsworth and Coleridge. Though as different in their approaches to life as any two writers might be, the two nonetheless shared a common perception of the corrupting influences of industrialization. It was a bond that pushed them to pen an anonymous collaborative volume, Lyrical Ballads, which offered a way for poetry to cleanse itself of those hated influences and return to more primal sources of inspiration. Their book's tremendous success would change the face of English poetry forever.\n\n- And you'll experience the ultimately fatal blow that John Osborne's Look Back in Anger dealt to the centuries of censorship that had long shackled British drama. Written by a leading member of the &quot;angry young men&quot; of British art, the play did more than simply fire still another outraged round at England's long-standing class system. It also signaled the coming end of the censorial power long wielded by the Lord Chamberlain, the officer of the Crown charged with insulating theater-goers from anything offensive.\n\n\nSee the Interaction of Literature and the Social Landscape\n\nMore than just a survey course about great writers, this is a course about ideas and the social landscape, and how these factors and literature have acted upon and influenced one another.\n\nThe great writers you expect to find are here, including Chaucer, Shakespeare, Austen, Dickens, Swift, and so many others.\n\nBut you'll also enjoy the company of less familiar voices whose importance we now recognize.\n\nThese include Aphra Behn, cited by Professor Sutherland as the &quot;first loud and clear, wholly independent woman's voice&quot; in literature. Behn achieved both fame and commercial success as a Restoration dramatist, poet, and author and was the first female writer honored with a tomb in Westminster Abbey. It is a tomb upon which, according to Virginia Woolf, &quot;all women together ought to let flowers fall.&quot; But Behn was, as you'll learn, even more. She lived a life that saw her a widow, a spy, and an imprisoned debtor who by necessity wrote her way our of hardship. Her masterful Oroonoko, or the Royal Slave, subtitled A True History, was in fact a novel, though the term had not yet been invented.\n\nAnd you'll also learn the extraordinary story of Olaudah Equiano, a young Nigerian who was kidnapped and enslaved in his own country at the age of 11 and subsequently sold to white slavers - yet became &quot;the first major author whose skin is black.&quot; His remarkable life - which included the unusual opportunity of being sent to school by the Royal Navy officer who had purchased him as a personal slave - provided the stuff of The Interesting Narrative of the Life of Olaudah Equiano, or Gustavus Vassa, the African. Purchased again - this time by a Quaker merchant who eventually allowed Equiano to repay that purchase price and receive his freedom - Equiano became an accomplished merchant in his own right, a leading figure in the abolitionist movement, and the author of what is arguably the first important slave narrative - a volume as rich in its detailing of the Middle Passage and its horrors as of the unlikely fortunes of Equiano himself.\n\n\nA Teacher with a Relish for the Sounds of the Language\n\nIt's hard to imagine a professor better suited to teach this course than Professor Sutherland, who brings to these lectures not only his decades of academic and teaching honors but also extraordinary charm and wit.\n\nWhen he reads aloud, as he does throughout the course, you can't help but revel with him in the many different sounds of his native language.\n\nAs he moves from the Anglo-Saxon of Beowulf to the Middle English of Chaucer to the various class accents still representative of today's English speech, his delivery alone conveys a sense of just how much is encompassed by the term &quot;British literature.&quot;\n\nAnd be sure to watch and listen for his surprise unveiling of the real accents of his own upbringing at the end of his lecture on George Bernard Shaw. It's a teaching touch that adds a special resonance to that lecture's discussion of Shaw's Pygmalion.\n\nProfessor Sutherland's examination of Britain's literary treasures and their creators will also show you how each artist is connected to those who have come before.\n\nIt's a connection expressed not only in building on their predecessors' works and viewpoints, but also in choosing to cast them aside when need be, the better to challenge readers and audiences with new ways of understanding both a changing world and the literature that reflects it.\n\n128 kbps 44100 Hz mono\n","torrent":{"xt":"urn:btih:dc190b8e980488094b7cb1d09494922d946c6f5d","amp;dn":"The+Classics+of+British+Literature+-+An+Exploration","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc190b8e980488094b7cb1d09494922d946c6f5d","infoHashBuffer":{"type":"Buffer","data":[220,25,11,142,152,4,136,9,75,124,177,208,148,148,146,45,148,108,111,93]},"announce":[],"urlList":[]}}