{"title":"Priscilla Ahn...A Good Day(2008)[FLAC]","uid":6219175,"size":221749138,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dd0c457e7f8b3bce741c8d547387c72dede2beef&amp;dn=Priscilla+Ahn...A+Good+Day%282008%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":15,"time":1299272866,"description":"[img]http://image.allmusic.com/00/amg/cov200/drk600/k645/k64559cxuox.jpg[/img]\n[color=Pink]Jun 10, 2008 A Good Day Blue Note50999 697003 2 3[/color]\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n01. Dream - (3:33)\n02. Wallflower - (3:00)\n03. I Don't Think So - (2:18)\n04. Masters in China - (3:20)\n05. Leave the Light On - (3:16)\n06. Red Cape - (2:56)\n07. Astronaut - (3:33)\n08. Lullaby - (4:44)\n09. Find My Way Back Home - (2:27)\n10. Opportunity to Cry - (3:26)\n11. A Good Day (Morning Song) - (3:24)\n\nPriscilla Ahn comes from the same singer/songwriter circle that spun off Sara Bareilles and Cary Brothers, having cut her teeth in a dizzying array of L.A. venues before wooing Blue Note Records with her gently confident vocals and fretwork. Like the material of many L.A.-based musicians, Ahn's songs often brim with sunshine and poppy sparkle, but her East Coast heritage lends some rootsy depth to this debut. A Good Day draws as much from SoCal's sunny environs as Ahn's home state of Pennsylvania, where the burgeoning musician spent days wandering the vast, rural acreage of her family's home. &quot;I was a little girl...I played pretend between the trees and fed my houseguests bark and leaves,&quot; she recalls during &quot;Dream,&quot; a whimsical ballad that mixes fingerplucked arpeggios with a tasteful string arrangement. Harmonies swirl throughout the song's conclusion, recalling the earthy atmospherics of Emmylou Harris' Wrecking Ball while keeping Ahn's whimsy and innocence at the forefront. By the third track, however, she transforms herself into a champion of female autonomy, chastising a man for attempting to toy with her heart in &quot;I Don't Think So.&quot; The album proceeds in that same fashion, with Ahn jumping between character roles and instrumental duties with equal dexterity. Highlights include &quot;Astronaut,&quot; whose carnival rhythms and eerily gorgeous harmonies sound like the orchestration for a Tim Burton film (or perhaps a psychedelic Beatles song -- just listen to the way she slurs the &quot;Ohhh boy&quot; lyric during each verse), as well as a cover of &quot;Opportunity to Cry,&quot; which adds a bright shuffle to Willie Nelson's heartbroken original. Given its range and self-assured delivery, A Good Day doesn't quite sound like a debut effort -- a telltale sign that Priscilla Ahn (only 24 years old at the time of its release) is on her way to bigger and better things. \n\ncd ripped by dBpoweramp\n\nplease seed\n\n[url]http://dickthespic.org/2011/02/15/priscilla-ahn/[/url]","torrent":{"xt":"urn:btih:dd0c457e7f8b3bce741c8d547387c72dede2beef","amp;dn":"Priscilla+Ahn...A+Good+Day%282008%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd0c457e7f8b3bce741c8d547387c72dede2beef","infoHashBuffer":{"type":"Buffer","data":[221,12,69,126,127,139,59,206,116,28,141,84,115,135,199,45,237,226,190,239]},"announce":[],"urlList":[]}}