{"title":"Iced Earth - Horror Show  mp3  320k  a2k","uid":10835817,"size":146374668,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dee2040694504bd0ebd721cdda2f47348b232580&amp;dn=Iced+Earth+-+Horror+Show++mp3++320k++a2k&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"analogkid6103","files":12,"time":1408682191,"description":"Iced Earth - Horror Show  mp3  320k  a2k  What we got....Horror Show is the sixth studio album from the American heavy metal band Iced Earth, released June 26, 2001. It is a theme album based on classic monsters and horror-movie icons, including Dracula, Frankenstein, and the ghost from Phantom of the Opera. It was the first Iced Earth album to feature drummer Richard Christy, and the only album to feature Steve DiGiorgio on bass, though he did not tour with the band. Horror Show is usually considered Iced Earth's only straightforward power metal release, as little of the thrash metal influence from the band's earlier works is present. This album also featured more prominent usage of Matt Barlow's multi-layered vocals as a center point for the songs.\n\nThere was a special limited-edition 2-CD set. The second CD featured the instrumental track &quot; Transylvania&quot; (an Iron Maiden cover) along with an interview with bandleader/rhythm guitarist Jon Schaffer. There is also a single-disc version with &quot;Transylvania&quot;, but without the interview. The song &quot;Dracula&quot; includes the line &quot;the blood is the life&quot;, a quote from Deuteronomy 12:23. However, it is likely lifted from the 1992 version of Bram Stoker's Dracula which also features the line. As in &quot;Dracula&quot;, many of the lyrics are lifted straight from the movies they were inspired by. Unlike other releases, it features much writing from Matt Barlow.\n\nBy the end of the song &quot;Damien&quot; there is a section where Jon's reversed voice repeats the message that is also in the middle, silent section of the song. So, if the song is played backwards, the true message can be heard. This kind of reversed voice was also done by Iron Maiden by the beginning of their song &quot;Still Life&quot; of their fourth studio album &quot;Piece of Mind&quot;.Track listing\nNo. \tTitle \tLyrics \tMusic \tLength \t\n1. \t&quot;Wolf&quot; (inspired by The Wolf Man films) \tJon Schaffer \tSchaffer \t5:20\n2. \t&quot;Damien&quot; (inspired by The Omen films) \tSchaffer \tSchaffer \t9:12\n3. \t&quot;Jack&quot; (inspired by Jack the Ripper) \tMatt Barlow \tSchaffer \t4:14\n4. \t&quot;Ghost of Freedom&quot; (inspired by Matt Barlow's own concept [cited by the interview on disc 2]) \tBarlow, Schaffer \tBarlow, Schaffer \t5:12\n5. \t&quot;Im-Ho-Tep (Pharaoh's Curse)&quot; (inspired by The Mummy) \tBarlow \tLarry Tarnowski, Schaffer \t4:45\n6. \t&quot;Jekyll &amp; Hyde&quot; (inspired by The Strange Case of Dr. Jekyll and Mr. Hyde) \tBarlow \tSchaffer \t4:39\n7. \t&quot;Dragon's Child&quot; (inspired by Creature from the Black Lagoon) \tBarlow \tSchaffer \t4:21\n8. \t&quot;Transylvania&quot; (Iron Maiden cover) \t(instrumental) \tSteve Harris \t4:30\n9. \t&quot;Frankenstein&quot; (inspired by Frankenstein) \tSchaffer \tSchaffer \t3:50\n10. \t&quot;Dracula&quot; (inspired by Dracula) \tSchaffer \tSchaffer \t5:54\n11. \t&quot;The Phantom Opera Ghost&quot; (inspired by The Phantom of the Opera) \tSchaffer \tSchaffer \t8:41\nTotal length:\n\t61:36  This is to cool I had to post it... Now will anyone seed?.......","torrent":{"xt":"urn:btih:dee2040694504bd0ebd721cdda2f47348b232580","amp;dn":"Iced+Earth+-+Horror+Show++mp3++320k++a2k","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dee2040694504bd0ebd721cdda2f47348b232580","infoHashBuffer":{"type":"Buffer","data":[222,226,4,6,148,80,75,208,235,215,33,205,218,47,71,52,139,35,37,128]},"announce":[],"urlList":[]}}