{"title":"Terror in the Balkans: German Armies and Partisan Warfare","uid":9750618,"size":1586319,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfeeab09c215baa027ecdfec77d8d83335460b01&amp;dn=Terror+in+the+Balkans%3A+German+Armies+and+Partisan+Warfare&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"PirateBook","files":1,"time":1394658339,"description":"\nby Ben H. Shepherd\n\nGermanys 1941 seizure of Yugoslavia led to an insurgency as bloody as any in World War II. The Wehrmacht waged a brutal counter-insurgency campaign in response, and by 1943 German troops in Yugoslavia were engaged in operations that ranked among the largest of the entire European war. Their actions encompassed massive reprisal shootings, the destruction of entire villages, and huge mobile operations unleashed not just against insurgents but also against the civilian population believed to be aiding them. Terror in the Balkans explores the reasons behind the Wehrmachts extreme security measures in southern and eastern Europe.\n\nBen Shepherd focuses his study not on the high-ranking generals who oversaw the campaign but on lower-level units and their officers, a disproportionate number of whom were of Austrian origin. He uses Austro-Hungarian army records to consider how the personal experiences of many Austrian officers during the Great War played a role in brutalizing their behavior in Yugoslavia. A comparison of Wehrmacht counter-insurgency divisions allows Shepherd to analyze how a range of midlevel commanders and their units conducted themselves in different parts of Yugoslavia, and why. \n\nShepherd concludes that the Wehrmacht campaigns violence was driven not just by National Socialist ideology but also by experience of the fratricidal infighting of Yugoslavias ethnic groups, by conditions on the ground, and by doctrines that had shaped the military mindsets of both Germany and Austria since the late nineteenth century. He also considers why different Wehrmacht units exhibited different degrees of ruthlessness and restraint during the campaign.\n\nGenre: Non Fiction , History / Military","torrent":{"xt":"urn:btih:dfeeab09c215baa027ecdfec77d8d83335460b01","amp;dn":"Terror+in+the+Balkans%3A+German+Armies+and+Partisan+Warfare","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfeeab09c215baa027ecdfec77d8d83335460b01","infoHashBuffer":{"type":"Buffer","data":[223,238,171,9,194,21,186,160,39,236,223,236,119,216,216,51,53,70,11,1]},"announce":[],"urlList":[]}}