{"title":"Iggy Pop featuring Kate Pierson - Candy","uid":4863844,"size":155684868,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e05d7ffe508dac844f0df519088e400a9e75c6d6&amp;dn=Iggy+Pop+featuring+Kate+Pierson+-+Candy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"2nafish","files":-1,"time":1240381664,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nIggy Pop (born James Newell Osterberg, Jr. on April 21, 1947 in United States) is an American rock singer, songwriter, and occasional actor. Although he has had only limited mainstream success, Iggy Pop is considered an innovator of punk rock, garage rock, and other related styles. He is sometimes referred to by the nicknames &quot;the Godfather of Punk&quot; and &quot;the Rock Iguana&quot;, and is widely acknowledged as one of the most dynamic stage performers of all time. Pop began calling himself Iggy after his first band in high school, The Iguanas.\n\nPop's popularity has ebbed and flowed throughout the course of his subsequent solo career. His best-known solo songs include &quot;Lust for Life,&quot; &quot;I'm Bored,&quot; &quot;Real Wild Child,&quot; the Top 40 hit &quot;Candy&quot; (with vocalist Kate Pierson of The B-52's) and &quot;The Passenger&quot;. A film about Iggy Pop's life and career titled The Passenger is currently in development. He currently fronts the advertising campaign for the UK-based online insurance company Swiftcover, in his trademark state of shirtlessness.\n\nCatherine Elizabeth Pierson (born 27 April 1948 in Weehawken, New Jersey) is an American vocalist and one of the lead singers and founding members of The B-52's. She also played keyboard, guitar and bass for the band. In The B-52's she performs alongside Cindy Wilson, Fred Schneider, and Keith Strickland. She is in an openly lesbian relationship. She owns Kate's Lazy Meadow, a mid-century modern retreat in the Catskills. [kate's lazy meadow]\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:e05d7ffe508dac844f0df519088e400a9e75c6d6","amp;dn":"Iggy+Pop+featuring+Kate+Pierson+-+Candy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e05d7ffe508dac844f0df519088e400a9e75c6d6","infoHashBuffer":{"type":"Buffer","data":[224,93,127,254,80,141,172,132,79,13,245,25,8,142,64,10,158,117,198,214]},"announce":[],"urlList":[]}}