{"title":"Eugene Peterson - A Long Obedience in the Same Direction (pdf)","uid":8698018,"size":2843739,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e0bcda92e2fe607465bf98eecdfb95342fc475a5&amp;dn=Eugene+Peterson+-+A+Long+Obedience+in+the+Same+Direction+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pharmakate","files":-1,"time":1374000852,"description":"Eugene Peterson - A Long Obedience in the Same Direction (IVP, 1980, 2000). 212 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nAs a society, we are no less obsessed with the immediate than when Eugene Peterson first wrote this Christian classic. If anything, email and the Internet may have intensified our quest for the quick fix. But Peterson's time-tested prescription for discipleship remains the same--a long obedience in the same direction.\n\nTucked away in the Hebrew Psalter, Peterson discovered &quot;an old dog-eared songbook,&quot; the Songs of Ascents that were sung by pilgrims on their way up to worship in Jerusalem. In these songs (Psalms 120-134) Peterson finds encouragement for modern pilgrims as we learn to grow in worship, service, joy, work, happiness, humility, community and blessing.\n\nThis 20th anniversary edition of features these Psalms in Peterson's widely acclaimed paraphrase, He also includes an epilogue in which he reflects on the themes of this book and his ministry during the twenty years since its original publication.\n\n\n\nAbout the Author\n\nPeterson, now retired, was for many years James M. Houston Professor of Spiritual Theology at Regent College in Vancouver, British Columbia. He also served as founding pastor of Christ Our King Presbyterian Church in Bel Air, Maryland. In addition to his widely acclaimed paraphrase of the Bible, The Message (NavPress), he has written many other books.","torrent":{"xt":"urn:btih:e0bcda92e2fe607465bf98eecdfb95342fc475a5","amp;dn":"Eugene+Peterson+-+A+Long+Obedience+in+the+Same+Direction+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0bcda92e2fe607465bf98eecdfb95342fc475a5","infoHashBuffer":{"type":"Buffer","data":[224,188,218,146,226,254,96,116,101,191,152,238,205,251,149,52,47,196,117,165]},"announce":[],"urlList":[]}}