{"title":"Thursday - Discography (2000-2011) [FLAC]","uid":7986768,"size":2608498849,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e1026e0127491f117f52ce852ed5b89bc4979767&amp;dn=Thursday+-+Discography+%282000-2011%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1357304753,"description":"\n  Thursday - Discography (2000-2011) [FLAC]\n\n  Albums:\n\n  2000 - Waiting \n  2001 - Full Collapse\n  2003 - War All the Time\n  2006 - A City by the Light Divided\n  2007 - Kill the House Lights\n  2009 - Common Existence\n  2011 - No Devolution\n\n  EP:\n  \n  2002 - Five Stories Falling\n\n\n  A significant player in the early 21st century's post-hardcore scene, Thursday formed in 1997 in New Brunswick, NJ. Led by vocalist Geoff Rickly, the band's initial lineup also included bassist Tim Payne, drummer Tucker Rule, and guitarists Steve Pedulla and Tom Keeley. After issuing their debut, 1999's Waiting, through the New York-based indie label Eyeball Records, the band signed to Chicago's influential Victory label for 2001's Full Collapse. Tours alongside Boy Sets Fire and Sparta helped support the album, which cracked the Billboard 200 at number 178. \n \nThursday signed to Island Records in the wake of their breakthrough success. The ambitious song arc of War All the Time arrived in September 2003 and was met with considerable critical acclaim for its ruminations on 9/11, its personal lyrics, and a wildly shifting, kitchen-sink approach to pensive post-hardcore. Having played keyboards on the album, Andrew Everding was later added as a full-time member. Extensive touring behind the record took its toll on the band, however, as tensions between members and personal problems mounted. \n \nThe musicians headed back into the studio with producer Dave Fridmann (the Flaming Lips, Mogwai). A City by the Light Divided, &quot;the album that almost never was,&quot; appeared in May 2006.Thursday parted ways with Island Records in early 2007.\n2008 saw the band inking a new deal with Epitaph Records. Reprising their relationship with Dave Fridmann, the group retreated to the studio to record Common Existence, which melded their post-hardcore swagger with new elements of indie rock and New Wave. In 2010, Thursday went into the studio to start work on a new album with producer Dave Fridmann at his Tarbox Road Studio. Their sixth studio album, No Devolucion, was released the following year.","torrent":{"xt":"urn:btih:e1026e0127491f117f52ce852ed5b89bc4979767","amp;dn":"Thursday+-+Discography+%282000-2011%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1026e0127491f117f52ce852ed5b89bc4979767","infoHashBuffer":{"type":"Buffer","data":[225,2,110,1,39,73,31,17,127,82,206,133,46,213,184,155,196,151,151,103]},"announce":[],"urlList":[]}}