{"title":"Simple Heraldry Cheerfully Illustrated (1979) (starhome)","uid":8345150,"size":39098530,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e12e9ecf395a6689ead622f139d28b7a8ba82d3f&amp;dn=Simple+Heraldry+Cheerfully+Illustrated+%281979%29+%28starhome%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"blackcanary","files":-1,"time":1365181414,"description":"English | CBR | 69 Pages\n\nSimple Heraldry Cheerfully Illustrated\nPublisher:  Mayflower Books\nPublication Date:  May 1979\n\nAuthor:  Sir Iain Moncreiffe\nIllustrator:  Don Pottinger\n\nHeraldry is the profession, study, or art of devising, granting, and blazoning arms and ruling on questions of rank or protocol, as exercised by an officer of arms. Heraldry comes from Anglo-Norman herald, from the Germanic compound harja-waldaz, &quot;army commander&quot;. The word, in its most general sense, encompasses all matters relating to the duties and responsibilities of officers of arms.To most, though, heraldry is the practice of designing, displaying, describing, and recording coats of arms and heraldic badges. Historically, it has been variously described as &quot;the shorthand of history&quot; and &quot;the floral border in the garden of history&quot;. The origins of heraldry lie in the need to distinguish participants in combat when their faces were hidden by iron and steel helmets. Eventually a formal system of rules developed into ever more complex forms of heraldry. There are various conjectures as to the origins of heraldic arms. As early as predynastic Egypt, an emblem known as a serekh was used to indicate the extent of influence of a particular regime, sometimes carved on ivory labels attached to trade goods, but also used to identify military allegiances and in a variety of other ways. It led to the development of the earliest hieroglyphs. This practice seems to have grown out of the use of animal mascots, whose pelts or bodies were literally affixed to staves or standards, as depicted on the earliest cosmetic palettes of the period. Some of the oldest serekhs consist of a striped or cross-hatched box, representing a palace or city, with a crane, scorpion, or other animal drawn standing on top. Before long, a falcon representing Horus became the norm as the animal on top, with the individual Pharaoh's symbol usually appearing in the box beneath the falcon, and above the stripes representing the palace.\n\nThanks goes to starhome for this release.\n","torrent":{"xt":"urn:btih:e12e9ecf395a6689ead622f139d28b7a8ba82d3f","amp;dn":"Simple+Heraldry+Cheerfully+Illustrated+%281979%29+%28starhome%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e12e9ecf395a6689ead622f139d28b7a8ba82d3f","infoHashBuffer":{"type":"Buffer","data":[225,46,158,207,57,90,102,137,234,214,34,241,57,210,139,122,139,168,45,63]},"announce":[],"urlList":[]}}