{"title":"Night and the city (film noir)","uid":4265051,"size":838313512,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e19c068d858dc7b0b2ba2526c09eab9f4c8d16e4&amp;dn=Night+and+the+city+%28film+noir%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bitspreader","files":-1,"time":1214654247,"description":"A classic Film Noir\n\nThis is a recode of a DVD copy found on this site, so I recoded it to 800MB avi XVID. It's about the same quality, but a faster download.\n\nVideo: XviD AVI, 720 x 576, 25.00 fps\nAudio: 128kbs MPEG-1 Layer 3 (stereo, 44100 Hz)\n\n\n-- From IMDB --\n\nThe more films I see by Jules Dassin, the more I wonder why he isn't better known or regarded as a director. It's been 56 years since he was blacklisted by the McCarthy-ites, but his reputation never seems to have recovered, at least not in the United States. Hopefully, more DVD releases like the Criterion version of Night and the City will bring deserved attention to his excellent body of work.\n\nI want to call Night and the City a classic film noir, which it is, but that seems too limiting. It might be better to say that Dassin uses film noir to dig a little deeper into our human strivings and sufferings. There's a lot of sweat and desperation in the midst of this entertaining and well-paced film, and not just on the part of Harry Fabian, the small-time hustler who dreams of being great. We encounter a typically smooth and dangerous mobster who also happens to have a difficult relationship with his disappointed father. A wealthy but thugish club owner, who might be a caricature in another film noir, can't seem to express his powerful and animalistic feelings for his beautiful wife. She seems like a scheming femme fatale but turns out to have an almost quaint dream of her own. In the end, we're in the muck and mire of human foibles, a kind of low-level Shakespearean tragedy that we all live out to one degree or another. This story just happens to take place in the shadowy underworld of 1950 London.\n\nThere's a poignancy to this film that separates it from others in the noir genre. Part of this lies in the strong writing, part in the excellent acting ensemble. This is one of those rare and remarkable films where the secondary and minor actors seem like they were all giving the performance of their career. Richard Widmark probably could have done with a bit more subtlety as Harry Fabian; he feels a bit histrionic at times, but his manic energy is important to the pace of the film and the feeling of increasing desperation. Gene Tierney and Hugh Marlowe don't get to do much and seem a bit lost among all the other great roles. In an interview with Dassin included with the DVD, the director says he put Tierney in the film as a favor to producer Daryl Zanuck, adding her role at the last minute, and it feels like that at times. But, hey, it's Gene Tierney.\n\nHerbert Lom delivers a chilling performance as Kristo the mobster, and Stanislaus Zbyszko is a miracle as his father, the once-famous wrestler Gregorious who can't stand that his son has helped kill the great tradition of Greco-Roman wrestling with his shoddy wrestling matches. The great Mike Mazurki does well as The Strangler, and the wrestling match he gets into with Gregorious may be the highlight of the film. Zbyszko and Mazurki were both former wrestlers, and the realism of their fight heightens the emotional intensity of the scene. It's the brutal scruff and claw of existence brought to life on screen for a few powerful moments.\n\nI had never seen Francis Sullivan before, so I was pleasantly surprised by his masterful work as the club owner Nosseross. Googie Withers also does a great job as his wife Helen, managing to bring some good shading to an underwritten role. And some of the best moments of the film are delivered by minor characters such as Anna, the woman who works down on the docks; Figler, the &quot;King of the Beggars;&quot; and Googin the forger.\n\nAfter a brief voice-over intro, Dassin starts the action with a bang, as one man chases another through the darkness of late-night London, across what looks like the plaza in front of the British Museum (???). The camera angle on this opening is fantastic, the kind of shot you want to turn into a poster and hang on your wall. And the camera work remains excellent throughout the film. The final long sequence of Harry running all over London in the foggy darkness, with the whole world seemingly after him, is an exciting and powerful climax. Quite a memorable ending to this excellent film.\n\n************************* FREAKYFLICKS **************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art to the\nwidest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:e19c068d858dc7b0b2ba2526c09eab9f4c8d16e4","amp;dn":"Night+and+the+city+%28film+noir%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e19c068d858dc7b0b2ba2526c09eab9f4c8d16e4","infoHashBuffer":{"type":"Buffer","data":[225,156,6,141,133,141,199,176,178,186,37,38,192,158,171,159,76,141,22,228]},"announce":[],"urlList":[]}}