{"title":"David Sloan Wilson - Unto Others. The Evolution and Psychology o","uid":10317183,"size":5360431,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1c30297b01897185d2f187de608cfe2270deeb0&amp;dn=David+Sloan+Wilson+-+Unto+Others.+The+Evolution+and+Psychology+o&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Anette14","files":-1,"time":1402264355,"description":"Description\nProduct Details\nBook Title: Unto Others: The Evolution and Psychology of Unselfish Behavior\t\nBook Author: Elliott Sober, David Sloan Wilson\nHardcover: 416 pages\nPublisher: Harvard University Press (May 15, 1998)\nLanguage: English\nISBN-10: 0674930460\nISBN-13: 978-0674930469\n\n===================================================================================\nBook Description\nPublication Date: May 15, 1998 | ISBN-10: 0674930460 | ISBN-13: 978-0674930469\nNo matter what we do, however kind or generous our deeds may seem, a hidden motive of selfishness lurks--or so science has claimed for years. This book, whose publication promises to be a major scientific event, tells us differently. In Unto Others philosopher Elliott Sober and biologist David Sloan Wilson demonstrate once and for all that unselfish behavior is in fact an important feature of both biological and human nature. Their book provides a panoramic view of altruism throughout the animal kingdom--from self-sacrificing parasites to insects that subsume themselves in the superorganism of a colony to the human capacity for selflessness--even as it explains the evolutionary sense of such behavior.\nExplaining how altruistic behavior can evolve by natural selection, this book finally gives credence to the idea of group selection that was originally proposed by Darwin but denounced as heretical in the 1960s. With their account of this controversy, Sober and Wilson offer a detailed case study of scientific change as well as an indisputable argument for group selection as a legitimate theory in evolutionary biology.\nUnto Others also takes a novel evolutionary approach in explaining the ultimate psychological motives behind unselfish human behavior. Developing a theory of the proximate mechanisms that most likely evolved to motivate adaptive helping behavior, Sober and Wilson show how people and perhaps other species evolved the capacity to care for others as a goal in itself.\nA truly interdisciplinary work that blends biology, philosophy, psychology, and anthropology, this book will permanently change not just our view of selfless behavior but also our understanding of many issues in evolutionary biology and the social sciences.\n\n===================================================================================\nEditorial Review\nReview\nIn Unto Others, philosopher Elliott Sober and biologist David Sloan Wilson bravely attempt to reconcile altruism, both evolutionary and psychological, with the scientific discoveries that seem to portray nature as red in tooth and claw. The first half of the book deals with the evolutionary objection to altruism. For altruistic behavior to be produced by natural selection, it must be possible for natural selection to act on groups--but conventional wisdom holds that group selection was conclusively debunked by George Williams in Adaptation and Natural Selection. Sober and Wilson nevertheless defend group selection, instructively reviewing the arguments against it and citing important work that relies on it. They then discuss group selection in human evolution, testing their conclusions against the anthropological literature.\nIn the second half of the book, the question is whether any desires are truly altruistic. Sober and Wilson painstakingly examine psychological evidence and philosophical arguments for the existence of altruism, ultimately concluding that neither psychology nor philosophy is likely to decide the question. Fortunately, evolutionary biology comes to the rescue. Sober and Wilson speculate that creatures with truly altruistic desires are reproductively fitter than creatures without--altruists, in short, make better parents than do egoists.\nRich in information and insight, Unto Others is a book that will be seriously considered by biologists, philosophers, anthropologists, and psychologists alike. The interested amateur may find it difficult in places but worth the effort overall. --Glenn Branch\n\n===================================================================================\nReviews\nDo people help others because they think they will get pleasure from doing so (hedonism), or because they have an ultimate desire to help another (true altruism)? Sober and Wilson argue that evolutionary biology can shed light on this problem. They do not say that human traits that evolved by individual selection are hedonistic and those that evolved by group selection are truly altruistic. Their argument is more subtle than that...[This book] will stimulate thought about important questions.--John Maynard Smith (Nature)\n\nUnto Others, a collaboration between Elliott Sober, one of the founders of the modern philosophy of biology, and David Sloan Wilson, one of the most creative theoreticians in evolutionary studies, wades into this turbulent stream [of evolutionary biology ideology] at precisely the point where so many other adventurers have been swept away: the problem of the origin of altruistic behavior...At first sight Unto Others appears to be a reformulation of the now orthodox view of the evolution of altruism. It is, however, a great deal more subversive than that, for, if its alternative scheme is taken seriously, evolutionary biologists should stop characterizing the process as one in which genes drive organisms to develop particular characteristics that maximize their fitness...Unto Others is precisely that combination of radical reexamination of a system of explanation, an examination from the roots, with a rigorous technical analysis of both biological and epistemological questions that we all are supposed to engage in. What marks off their intellectual production is not its ideology but the seriousness with which they have taken the intellectual project. The hinge of Sober and Wilson's argument is a rejection of the prejudice that natural selection must operate directly solely on individuals. They point out that groups of organisms may also be the units of differential reproduction...A large part of Unto Others is taken up with a classic problem in philosophy and psychology that is analogous to the evolutionary question of whether the appearance of altruism at the individual level is really selfishness at the genic level. Is human altruism really egoism, or even pure hedonism, in disguise?...In the end, Sober and Wilson are entirely forthright in saying that they have consciously adopted a pluralistic perspective.--R. C. Lewontin (New York Review of Books)\n\nElliott Sober and David Sloan Wilson are clear that there are two notions of altruism, as well as two challenges to its possibility, stemming from quite different sources, but their wide-ranging book is intended to tackle both. They begin with biological altruism, offering their own perspective on how this puzzle should be resolved, and discussing the ways in which natural selection of social structures may have figured in the history of our species. In the second half of Unto Others, they turn to psychological altruism, arguing that debates between those who believe that human beings are sometimes other-directed and their sceptical opponents cannot be settled either by philosophical arguments or by psychological experiments... Sober and Wilson offer a distinctive approach to the problem of biological altruism, one that attempts to incorporate the accepted solutions within a unified theory. For two decades, Sober, an internationally prominent philosopher of biology, has provided welcome clarification of the concept of natural selection, while, for an even longer period, Wilson, a well-known theoretical biologist, has campaigned to rehabilitate one of the most vilified views about the nature of selection...[In this book] they have considerably clarified what is at stake in the debate about psychological altruism, and have demonstrated how an evolutionary perspective might bear on it.--Philip Kitcher (London Review of Books)\n\nUnselfish action is a hallmark of humanity. We may sacrifice our lives for the good of our children, for the good of our nation, and sometimes even for the good of a stranger. What motivates such altruistic acts? To a biologist, this question has two very different answers. There is the proximate answer that explains our psychological reasons for acting altruistically, and there is the ultimate answer that explains how an unselfish act increases our Darwinian fitness relative to some selfish alternative. Through the two more-or-less independent sections of Unto Others, Sober and Wilson discuss both proximate and ultimate explanations. They use both sections to also emphasize their belief in the value of pluralistic hypotheses, with natural selection driven by multiple levels of causation and behavior driven by multiple desires... Sober and Wilson...have the laudable goal of stimulating research into levels of selection and motivation as applied to humans and their culture.\n--Leonard Nunney (Science)\n\n[A] tour de force about the multitrack selection processes that have shaped life's creatures, including human behaviour, that dispels once and for all that peculiarly mystifying belief among gene selectionists that 'group selection' is risible and unworthy of intellectual consideration... Sober and D. S. Wilson are two of the leading thinkers in evolutionary biology who have made group selection respectable again and rescued altruism and many other supposedly counter-intuitive behavioural traits, from that contortionist potpourri of selfish-genery, inclusive fitness theory and game theory...[Unto Others] is a step in the right direction towards a truly new Darwinism.--Gabby Dover (Times Higher Education Supplement)\n\nUnto Others is an important, original, and well-written book. It contains the definitive contemporary statement on higher-level selection and the evolutionary origin of cooperation.--E. O. Wilson\n\nThis provocative, important book outlines an evolutionary theory of altruism, examining past theoretical problems--in particular, how to distinguish altruism and selfish (or hedonistic) motives. Drawing deeply and judiciously on research in theoretical biology, social psychology, philosophy, and anthropology, Sober and Wilson--both long-standing and eminent participants in controversies about the evolution of altruism--make two major claims: first, that 'natural selection is unlikely to have given us purely egoistic motives,' second, that the much-maligned concept of group selection--the idea that natural selection sometimes operates at the level of the group--may be a mechanism for the evolution of ultruism...Readers will be impressed by the breadth of the analysis and, especially, the extraordinary clarity of the presentation. This will most likely be regarded as a landmark, if controversial, work. It is a testament to the authors' understanding and skill as writers that it is also fun to read.\n--R. R. Cornelius (Choice)\n\nUnto Others, written by two eminent scholars, a philosopher (Elliott Sober) and a biologist (David Wilson) who have thought long and hard about unselfish cooperative behavior and group selection, is bound to have a long-lasting and strong influence on the field of evolutionary biology...In this book, philosophical and biological discourse are tightly woven together into an easy-to-read package. The major appeal of this book to those interested in he comparative and evolutionary study of behavior centers on the broad range of material that Sober and Wilson consider in arguing for group selection...All in all, Unto Others is a good read...I'm sure all readers will come away from this stimulating book having learned a lot and having had their own views challenged by this thoughtful and very timely essay.--Marc Bekoff (Ethology)\n\n===================================================================================\nAbout the Author\nElliott Sober is Vilas Research Professor and Hans Reichenbach Professor of Philosophy at the University of Wisconsin, Madison.\nDavid Sloan Wilson is Professor of Biology at State University of New York at Binghamton.\n======================================================================================================================================================================","torrent":{"xt":"urn:btih:e1c30297b01897185d2f187de608cfe2270deeb0","amp;dn":"David+Sloan+Wilson+-+Unto+Others.+The+Evolution+and+Psychology+o","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1c30297b01897185d2f187de608cfe2270deeb0","infoHashBuffer":{"type":"Buffer","data":[225,195,2,151,176,24,151,24,93,47,24,125,230,8,207,226,39,13,238,176]},"announce":[],"urlList":[]}}