{"title":"Runaway.Bride.DVDRip.By.Neo@Matrix","uid":5585831,"size":734365696,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e26c86b00efa0219a90db779669281ae7a170503&amp;dn=Runaway.Bride.DVDRip.By.Neo%40Matrix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"NeoATMatrix","files":1,"time":1274698850,"description":"Ike (Richard Gere) writes a column for a major New York City newspaper. But, he's a &quot;last-minute&quot; man, that is, he works better under pressure to complete each piece, barely making the paper's deadlines. One day, the inspiration pipeline is running dry and he grabs at a last minute tip to conjure up a column about a very cold-footed bride, Maggie (Julia Roberts) who has run away from the altar three times. Getting the facts seriously wrong means bye-bye Ike, as his boss and ex-wife (Rita Wilson) lets him go to avoid a lawsuit. Naturally, Ike is dismayed but, then, he is courted by another paper to do an in-depth study of Maggie, for she is about to walk down the aisle again in a matter of days. Traveling to the small city of Hale, Maryland, Ike sets up residence in the town's lovely inn and starts snooping. However, very shortly, the whole village, including Maggie, knows he's there and friends and neighbors try mightily to impede his investigation. They do this because they all have hope that Maggie's fourth nuptials will result in a marriage to the town's high school football coach, Bob (Chistopher Meloni). But, even with best friend Peggy (Joan Cusack) hovering around Maggie, could our Mags somehow be attracted to the handsome Ike, even when he's out to expose her foibles? This is a warm, funny, and touching romcom about the uncertainties in attraction, love, and marriage. How does one know for sure that their beloved is THE one? The answer here is that one must first know oneself well. The cast is a delight, with Roberts and Gere shining brightly in roles that are not necessarily predictable. The supporting troupe is also wonderful, as Cusack, Meloni, Wilson, Hector Elizondo, and others are as entertaining as they come. As for the setting, the lovely little Maryland town in the film is most beautiful and the costumes, photography, script and direction are all worthy, too. So, do not runaway from the chance to see this darling little romcom. It has some very fine lessons, love, and laughter to offer audiences of any age.\n \nIMDB rating 5.2/10\nWith/height: 512x224\nDuration :   1:51:33\nBitrate  :    112 kbps\nAudio format: Lame mp3\nFramerate :   25 frame/s\nData rate :   107 kbps\nV.sample size: 24bit\nKompression : DivX","torrent":{"xt":"urn:btih:e26c86b00efa0219a90db779669281ae7a170503","amp;dn":"Runaway.Bride.DVDRip.By.Neo%40Matrix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e26c86b00efa0219a90db779669281ae7a170503","infoHashBuffer":{"type":"Buffer","data":[226,108,134,176,14,250,2,25,169,13,183,121,102,146,129,174,122,23,5,3]},"announce":[],"urlList":[]}}