{"title":"Caterpillar SIS 2010 incl KEYGEN","uid":6355886,"size":74195743497,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e2a5e10a4cd47cbbc7b86bc2046e081ad6a5e977&amp;dn=Caterpillar+SIS+2010+incl+KEYGEN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"bevermahn","files":25,"time":1304150510,"description":"I found this Torrent, and i have no idea if it's work's or not. Long time i looking\nfor this program and finaly i found it. I'm in the process to download that Torrent\nand i have only 1000k bandwith. I belive that this is the complete story (9 DVD)\n\nMy english is very bad, so i write in spanish...\n\n\nDescripciÃƒÂ³n : El catÃƒÂ¡logo de Caterpillar SIS 2010, puede encontrar catÃƒÂ¡logo de piezas de repuesto y manuales de reparaciÃƒÂ³n lÃƒÂ­der mundial en tecnologÃƒÂ­a - CorporaciÃƒÂ³n Caterpillar. CatÃƒÂ¡logo contiene una gran cantidad de informaciÃƒÂ³n indispensable que se requiere en el ekspuatatsii proceso y reparaciÃƒÂ³n: hidrÃƒÂ¡ulicos y circuitos elÃƒÂ©ctricos, detalladas instrucciones de uso para todos los modelos de equipos Caterpillar, directrices para la gestiÃƒÂ³n y el mantenimiento, las especificaciones del motor, los resultados de todas las tÃƒÂ©cnicas, los momentos de indecisiÃƒÂ³n, los volÃƒÂºmenes de gas y Directorio de la CAT herramientas especiales. \n  \nDisc #1: Truck Engines, Track Material Handlers, Electric Power Generation, Est, Load Haul Dump, Industrial Engines, Marine Engines, Emac\n\n\nDisc #2: Machine Engines, Industrial Engines, Marine Engines, Electric Power Generation\n\nDisc #3: Electrical Power Generation, Industrial Engines, Marine Engines, Machine Engines, Compactors, OEM Products , Wheel Type Tractors\n\nDisc #4: Wheel Type Loaders, Wheel Tractor Scrapers, Wheel Type Tractors\n\nDisc #5: Excavators\n\nDisc #6: Articulated Dump Trucks, Asphalt Pavers, Backhoe Loaders, Cold Planers, Motor Graders, Underground Articulated Trucks, Work Tools,industrial Engines, Electric Power Generation, Machine Engines\n\nDisc #7: Challengers, Combines, Excavators, Integrated Toolcarriers, On Highway Truck, Pipelayers, Tillage, Track Type Tractors\n\nDisc #8: Road Reclaimer, Track Type Tractors, Track Type Loaders, Track Type Skidders, Skid Steer Loaders, Industrial Engine, Machine Engine, Truck Engine, Excavators\n\nDisc #9: Excavators, Combines, Mini Excavators, Forestry Products, Wheel Skidders, Mini Excavators, Load Haul Dump, Telehandler, Challengers\n\n\n\nEnjoy it","torrent":{"xt":"urn:btih:e2a5e10a4cd47cbbc7b86bc2046e081ad6a5e977","amp;dn":"Caterpillar+SIS+2010+incl+KEYGEN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2a5e10a4cd47cbbc7b86bc2046e081ad6a5e977","infoHashBuffer":{"type":"Buffer","data":[226,165,225,10,76,212,124,187,199,184,107,194,4,110,8,26,214,165,233,119]},"announce":[],"urlList":[]}}