{"title":"the universe in a nutshell- STEPHEN HAWKING","uid":8079228,"size":99943494,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e35e59eeefc592494387a7151793a135f8cfbaf3&amp;dn=the+universe+in+a+nutshell-+STEPHEN+HAWKING&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"sidlyf","files":6,"time":1359460447,"description":"THE AWESOME AUDio BOOK BY STEPHEN HAWKING\n\nThe Universe in a Nutshell \n\nBy: Stephen Hawking\n\nNarrator: Simon Prebble\n\nGenre: Science, Cosmology\n\nType: Unabridged Audiobook\n\nLength: 3 hours and 29 min.\n\nMP3, 64Kbps, 22KHz, Stereo, CBR\n\n\nSummery:\n\nOne of the most influential thinkers of our time, Stephen Hawking is an intellectual icon, known not only for the adventurousness of his ideas, but for the clarity and wit with which he expresses them. In this new work, Hawking brings us to the cutting edge of theoretical physics, where truth is often stranger than fiction, to explain in layman's terms the principles that control our universe.\n\nLike many in the community of theoretical physics, Professor Hawking is seeking to uncover the grail of science - the elusive Theory of Everything that lies at the heart of the cosmos. In his accessable and often playful style, he guides us on his search to uncover the secrets of the universe - from supergravity to supersymmetry, from quantum theory to M-theory, from holography to duality. And he lets us behind the scenes of one of his most exciting intellectual adventures as he seeks &quot;to combine Einstein's General Theory of Relativity and Richard Feynman's idea of multiple histories into one complete unified theory that will describe everything that happens in the universe.&quot;\n\nWith characteristic exuberance, Professor Hawking invites us to be fellow travelers on this extraordinary voyage through spacetime. The Universe in a Nutshell is essential listening for all of us who want to understand the universe in which we live.\n\n\nReview:\n\nStephen Hawking, science's first real rock star, may be the least-read bestselling author in history--it's no secret that many people who own A Brief History of Time have never finished it. Hawking's The Universe in a Nutshell aims to remedy the situation, with a plethora of friendly illustrations to help readers grok some of the most brain-bending ideas ever conceived.\n\nDoes it succeed? Yes and no. While Hawking offers genuinely accessible context for such complexities as string theory and the nature of time, it's when he must translate equations to sentences that the limits of language get in the way. But Hawking has simplified the origin of the universe, the nature of space and time, and what holds it all together to an unprecedented degree, inviting nonscientists to share his obvious awe and love of the unseen forces that shape it all.\n\nYes, it's difficult reading, but it's worth it. Hawking is one of the great geniuses of our time, a man whose life has been devoted to thinking in the abstract about the universe. With his help, and pictures--lots of pictures--we can seek to understand a bit more of the cosmos.","torrent":{"xt":"urn:btih:e35e59eeefc592494387a7151793a135f8cfbaf3","amp;dn":"the+universe+in+a+nutshell-+STEPHEN+HAWKING","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e35e59eeefc592494387a7151793a135f8cfbaf3","infoHashBuffer":{"type":"Buffer","data":[227,94,89,238,239,197,146,73,67,135,167,21,23,147,161,53,248,207,186,243]},"announce":[],"urlList":[]}}