{"title":"The Tyranny Of Gun Control - Jacob Hornberger","uid":11717257,"size":4960744,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4129af17648e1ed83bb8374cdeae6d225c8e68a&amp;dn=The+Tyranny+Of+Gun+Control+-+Jacob+Hornberger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starxteel","files":1,"time":1424640951,"description":"\nThe right to own firearms is one of the most fundamental, inherent rights of man. Not only do individuals have the natural,God-given right to own property, they also have the basic right to defend themselves from murderers, rapists, thieves, burglars,and other violent, antisocial people in society. Most important, individuals have the right to defend themselves from the oppressive, tyrannical acts of their own government. This book shows why gun control poses an enormous threat to the liberty of the American people. It is a must read for anyone concerned about the future direction of freedom in the United States.\n\nThis book shows why gun control poses an enormous threat to the liberty of the American people.\n\n\nAbout the author:\n Jacob G. Hornberger is founder and president of The Future of Freedom Foundation (FFF). FFF's mission is to advance freedom by providing an uncompromising moral and economic case for individual liberty, free markets, private property, and limited government.\n\nMr. Hornberger was born and raised in Laredo, Texas, and received his B.A. in economics from Virginia Military Institute and his law degree from the University of Texas. He was a trial attorney for twelve years in Texas. He also was an adjunct professor at the University of Dallas, where he taught law and economics. In 1987, Mr. Hornberger left the practice of law to become director of programs at The Foundation for Economic Education, publisher of The Freeman.\n\nIn 1989, Mr. Hornberger established The Future of Freedom Foundation. He is a regular writer for FFF's monthly journal Future of Freedom, writes a daily blog, and other commentaries. His editorials have appeared in the Washington Post, Charlotte Observer, La Presna San Diego, El Nuevo Miami Herald, and many others, both in the United States and in Latin America.\n\nMr. Hornberger has delivered speeches and engaged in debates about free-market principles with groups all over the United States, as well as Canada, England, Europe, and Latin America, including Brazil, Cuba, Bolivia, Mexico, Costa Rica, and Argentina.\n\nHe has also advanced freedom and free markets on talk-radio stations all across the country as well as on Fox News' Neil Cavuto and Greta van Susteren shows. He appeared regularly as a commentator on Fox News' legal commentator Judge Andrew Napolitano's Internet-based show Freedom Watch.\n\nMr. Hornberger is co-editor of five books that have been published by The Future of Freedom Foundation fff.org","torrent":{"xt":"urn:btih:e4129af17648e1ed83bb8374cdeae6d225c8e68a","amp;dn":"The+Tyranny+Of+Gun+Control+-+Jacob+Hornberger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4129af17648e1ed83bb8374cdeae6d225c8e68a","infoHashBuffer":{"type":"Buffer","data":[228,18,154,241,118,72,225,237,131,187,131,116,205,234,230,210,37,200,230,138]},"announce":[],"urlList":[]}}