{"title":"Bones Season 3 HDTV.XviD DutchReleaseTeam (dutch subs nl)","uid":6470744,"size":5505139294,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e479300a5cd1c6f9445217c0717cb0fc6256a3f0&amp;dn=Bones+Season+3+HDTV.XviD+DutchReleaseTeam+%28dutch+subs+nl%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Koedje","files":-1,"time":1308132687,"description":"Plot:\n\nemperance Brennan is als forensisch antropologe werkzaam op het Jeffersonian Institute. Samen met haar team van uitermate getalenteerde wetenschappers helpt ze de FBI om moordzaken op te lossen. Niet alleen oude, onopgeloste moordzaken worden opgelost, maar ook recente moordzaken. Tijdens haar werk voor de FBI werkt ze samen met Seeley Booth (David Boreanaz). Tussen de FBI en het Jeffersonian Institute bestaan soms onenigheden, zoals die ook tussen Brennan (en haar team) en Booth bestaan. Maar uiteindelijk lossen de twee partijen de zaken altijd weer op.\n\n\n\n\nSeizoen 1:\n\n\nSeason 3, Episode 1: The Widow's Son in the Windshield\nBones reluctantly searches for a replacement for Zack. A skull is tossed off a highway overpass and hits a vehicle. \nThere is evidence the victim was eaten by a cannibal.\n\n\n\t\nSeason 3, Episode 2: Soccer Mom in the Mini-Van\nA soccer mom dies as her car explodes, leading the team to discover that she was a murder suspect wanted for 30 years.\n\n\n\t\nSeason 3, Episode 3: Death in the Saddle\nA body with equine markings sends Booth and Bones into a world of fetishism, \nand Angela agrees to undergo hypnosis to get the name of her husband.\n\n\n\t\nSeason 3, Episode 4: The Secret in the Soil\nA charred body leads to a philandering organic farming magnate.\n\n\n\t\nSeason 3, Episode 5: Mummy in the Maze\nThe discovery of two mummified girls has Booth and Bones checking a fun house, a Halloween maze and a church charity\n for clues that may lead them to a missing girl whose parents believe she's dead.\n\n\n\t\nSeason 3, Episode 6: Intern in the Incinerator\nOne of the Jeffersonian's interns is found in the incinerator, \nand most of the institute believes it's the work of the Gormogon serial killer.\n\n\n\t\nSeason 3, Episode 7: Boy in the Time Capsule\nA 20-year-old body is found when a time capsule is opened, \nand focus turns towards the victim's fellow high school students.\n\n\n\t\nSeason 3, Episode 8: The Knight on the Grid\nThe Gormogon killer strikes again, and his next play is a little close to home. \nRuss returns to face a parole violation when his girlfriend's daughter takes a turn for the worse.\n\n\n\t\nSeason 3, Episode 9: The Santa in the Slush\nBrennan and Booth investigate the death of a Santa as Bones tries to give her father the Christmas he's always dreamed of, \nand Booth comes to terms with not spending the holiday with Parker.\n\n\n\t\nSeason 3, Episode 10: The Man in the Mud\nBooth and Brennan investigate the death of a motorcycle racer, and when another seeming accident occurs on the track attention turns to the team owners and a reporter, \nmeanwhile Dr. Sweets manipulates them into a &quot;social outing&quot; with him and his girlfriend.\n\n\n\t\nSeason 3, Episode 11: Player Under Pressure\nThe body of a star athlete is found behind the bleachers at Atlantic State University gymnasium.\n\n\n\t\nSeason 3, Episode 12: The Baby in the Bough\nMiraculously surviving a suspicious car accident that kills its mother, a baby is left with Booth and Bones who care for the infant while investigating the crime.\n\n\n\t\nSeason 3, Episode 13: The Verdict in the Story\nBrennan's father Max goes on trial for the alleged murder of FBI Deputy Director Robert Kirby, requiring everyone on the Jeffersonian team but Brennan to testify for the prosecution. \nBrennan, the forensics advisor for the defense, desperately tries to prove her father's innocence. \nMeanwhile, Booth requires the assistance of therapist Dr. Lance Sweets to help with his partnership with Brennan.\n\n\n\t\nSeason 3, Episode 14: The Wannabe in the Weeds\nBrennan and Booth investigate the murder of an aspiring singer, and Booth attracts a groupie.\n\n\n\t\nSeason 3, Episode 15: The Pain in the Heart\nHeartbreak hits the Squint Squad as they deal with the aftermath of the shooting and finally Gormogon and his Apprentice are revealed.\n\n\n\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nga dan eens naar http://www.hetmultimediacafe.be\n\nDutchReleaseteam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:e479300a5cd1c6f9445217c0717cb0fc6256a3f0","amp;dn":"Bones+Season+3+HDTV.XviD+DutchReleaseTeam+%28dutch+subs+nl%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e479300a5cd1c6f9445217c0717cb0fc6256a3f0","infoHashBuffer":{"type":"Buffer","data":[228,121,48,10,92,209,198,249,68,82,23,192,113,124,176,252,98,86,163,240]},"announce":[],"urlList":[]}}