{"title":"Teenage Twins (1976) XXX DVDRip","uid":12199850,"size":727744739,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e5604bd9b63496b7a44c37963a34da8b11b27bc6&amp;dn=Teenage+Twins+%281976%29+XXX+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"Ctrlme","files":14,"time":1438809749,"description":"Teenage Twins (1976) XXX DVDRip\n-----------------------------------------\nScreenshot(s):   &lt;a href=&quot;\nhttp://imgctrl.com/image/Cvc&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/Cvc&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/Cvd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/Cvd&lt;/a&gt;\n\nReal life twins, Brooke &amp; Taylor Young, star in this typical Golden Age porno with a perverted twist.  No doubt, you've heard that unlike most on-screen siblings, the two Youngs actually do get it on with each other. Sexual action includes: straight sex, anal sex, lesbian incest, pussy licking, 69, missionary, doggy, cowgirl, threesomes, cumshots on pussy and asses, and believe it or not, female masturbation using a bible. This is good stuff!\n\ndetails\nScene Breakdowns\nScene 1. Taylor Young\nScene 2. Brooke Young, Taylor Young\nScene 3. Brooke Young, Tia von Davis, Eric Edwards\nScene 4. Brooke Young, Todd Davis\nScene 5. Taylor Young, Leo Lovemore\nScene 6. Brooke Young, Eric Edwards, Leo Lovemore\nScene 7. Brooke Young, Taylor Young, Tia von Davis, Eric Edwards, Leo Lovemore, Todd Davis\n\nLength: 1 hour 7 minutes 33 seconds\nVideo: DivX 5 616x452 23.976fps 1371kbps\nAudio: MP3 16000Hz stereo 48kbps \n\nTeenage Twins revolves around the identical twins, playing the characters of Prudence and Hope.  As you might guess, Prudence is something of a prude, disapproving of her sister's loose ways.  But it turns out that Pru isn't as innocent as she claims to be:  from masturbating with a Bible to getting fucked in the ass by her stepfather, she's what the story terms as a &quot;virgin harlot.&quot;  On the other hand, Hope is an unashamed nympho, getting eaten out by her sister's boyfriend and engaging in a threesome with her mom.  And yes, the twins do have sex with each other--although it's probably explicit enough to be illegal in many states, if you take away the fact that they are related, the scene is pretty lipstick lesbian.\n\nThe story (yes, there is a story) is that Prudence &amp; Hope's stepfather, a local professor, has located a copy of the &quot;Necronomicon,&quot; an ancient spell book.  While he's away securing it's purchase, his research partner, Professor Petrie (Eric Edwards) is having an affair with his fellow academic's wife (and, his daughter Hope).  It turns out that this spellbook makes them do strange things (wow, I'm shocked), including a six-way orgy with all of the members of the cast","torrent":{"xt":"urn:btih:e5604bd9b63496b7a44c37963a34da8b11b27bc6","amp;dn":"Teenage+Twins+%281976%29+XXX+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5604bd9b63496b7a44c37963a34da8b11b27bc6","infoHashBuffer":{"type":"Buffer","data":[229,96,75,217,182,52,150,183,164,76,55,150,58,52,218,139,17,178,123,198]},"announce":[],"urlList":[]}}