{"title":"The Origin Of Satan by Elaine Pagels (1995) [EPUB] [PDF]","uid":9996938,"size":1813299,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e647ede91c5d35b86833ea8e58028b29b62748e6&amp;dn=The+Origin+Of+Satan+by+Elaine+Pagels+%281995%29+%5BEPUB%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1397934834,"description":"Title: The Origin of Satan - How Christians Demonized Jews, Pagans, and Heretics\nAuthor: Elaine Pagels\nCategory: Non-Fiction\nPaperback: 240 pages\nPublisher: Vintage; Reprint edition (April 30, 1996)\nLanguage: English\nISBN-10: 0679731180\nISBN-13: 978-0679731184\n\nIn The Origin of Satan, noted scholar and Princeton Professor Elaine Pagels discusses the history of the concept we now know as &quot;Satan&quot;, tracing the roots of the personification of evil and the name itself all the way from its early Arabic roots up to modern Christianity. The book is insightful, easy to read, very intriguing for those interested in Christian history and mythology and shows the lineage of the dichotomy between good and evil that is central to the very nature of many religious moral structures.\n\nPublisher's summary/Promotional info - &quot;From the religious historian whose The Gnostic Gospels won both the National Book Award and the National Book Critics Circle Award comes a dramatic interpretation of Satan and his role on the Christian tradition. With magisterial learning and the elan of a born storyteller, Pagels turns Satan's story into an audacious exploration of Christianity's shadow side, in which the gospel of love gives way to irrational hatreds that continue to haunt Christians and non-Christians alike.&quot;\n\nExcerpt from theReview:\n&quot;. . . ground-breaking . . . Many times in the course of reading her explications I found myself saying, &quot;Of course, why hasn't someone said this before?&quot; By showing how the sectarian demonization of the &quot;intimate enemies&quot;--Jews and heretics--shaped early Christianity, the book helps us to understand the power of irrational forces that still need to be confronted in contemporary society.&quot; - S. David Sperling, professor of Bible, Hebrew Union College\n\nExcerpt from Kirkus Reviews:\n&quot;Fundamental to Pagels's argument is the thesis of many scholars that the Gospel accounts of Jesus' trial and execution, by seeming to place blame on the Jews rather than the Romans, actually reflect the situation of later decades when Christians were completely separated from Judaism and anxious not to provoke the Romans. Pagels sees the whole demonizing tendency as continuing down the centuries in anti-Semitism and in sectarian hatred generally.&quot;\n\nThis torrent contains the original PDF of the reprint edition (1996) as well as an EPUB conversion done with Calbre that came out quite good in my opinion. There is also the metadata.opf file for reference and the front cover included. Please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:e647ede91c5d35b86833ea8e58028b29b62748e6","amp;dn":"The+Origin+Of+Satan+by+Elaine+Pagels+%281995%29+%5BEPUB%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e647ede91c5d35b86833ea8e58028b29b62748e6","infoHashBuffer":{"type":"Buffer","data":[230,71,237,233,28,93,53,184,104,51,234,142,88,2,139,41,182,39,72,230]},"announce":[],"urlList":[]}}