{"title":"Devendra Banhart - Cripple Crow [2005][EAC/FLAC]","uid":10348664,"size":422600005,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e6804e958cf573af871d9eb8627c5af7617ec6c3&amp;dn=Devendra+Banhart+-+Cripple+Crow+%5B2005%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":25,"time":1402643525,"description":"LAC / Lossless / Log (100%) / Cue\nLabel/Cat#: XL Recordings/Beggars Group / XL #XLCD 192\nCountry: USA\nYear: September 13, 2005\nGenre: folk/rock\nFormat: CD,Album\n\n[b]\n01 Now That I Know\n02 Santa Maria da Feira\n03 Heard Somebody Say\n04 Long Haired Child\n05 Lazy Butterfly\n06 Quedate Luna\n07 Queen Bee\n08 I Feel Just Like a Child \n09 Some People Ride the Wave\n10 The Beatles\n11 Dragonflys\n12 Cripple Crow\n13 Inaniel\n14 Hey Mama Wolf\n15 Hows About Tellin a Story\n16 Chinese Children\n17 Sawkill River\n18 I Love That Man\n19 Luna de Margarita\n20 Korean Dogwood\n21 Little Boys\n22 Canela\n\n\n\nCripple Crow marks a departure for Devendra Banhart. It's obvious from the faux Sgt. Pepper-meets-Incredible String Band freak scene cover photo that something is afoot. The disc is Banhart's first foray from Michael Gira's Young God label, and it's more adventurous than anything he's done before. This is not to imply that the set is a slick, over-produced affair, but it is a significant change. The instrumental, stylistic, and textural range on this 23-song set is considerably wider than it's been in the past. Working with Noah Georgeson and Thom Monahan, a backing band of friends known as &quot;the Hairy Fairies&quot;, Banhart's crafted something expansive, colorful, and perhaps even accessible to a wider array of listeners. There are layered vocals and choruses of backing singers, as well as piano and flutes on the gorgeous &quot;I Heard Somebody Say,&quot; while the electric guitar and drums fuelling &quot;Long Haired Child,&quot; with its reverb-drenched backing vocals, is primitive, percussive, and dark. There is also the 21st century psychedelic jug band stomp of the second single, &quot;I Feel Just Like a Child,&quot; that crosses the nursery rhyme melodics of Mississippi John Hurt with the naughty boy swagger of Marc Bolan. There are also five songs in Spanish, Banhart's native tongue, in a style that's a cross between flamenco and son. The title cut, &quot;Cripple Crow,&quot; is one of the most haunting anti-war songs around. In it, Banhart places a new generation in the firing line, and urges them to resist not with violence, but with pacifistic refusal. A lone acoustic guitar, hand drums, a backing chorus, and a lilting, muted flute all sift in with one another to weave a song that feels more like a prayer. The lone cover here, of Simon Diaz's &quot;Luna de Margaerita,&quot; drips with the rawest kind of emotion. Ultimately, Cripple Crow is a roughly stitched tapestry; it is rich, varied, wild, irreverent, simple, and utterly joyous to listen to.","torrent":{"xt":"urn:btih:e6804e958cf573af871d9eb8627c5af7617ec6c3","amp;dn":"Devendra+Banhart+-+Cripple+Crow+%5B2005%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6804e958cf573af871d9eb8627c5af7617ec6c3","infoHashBuffer":{"type":"Buffer","data":[230,128,78,149,140,245,115,175,135,29,158,184,98,124,90,247,97,126,198,195]},"announce":[],"urlList":[]}}