{"title":"Bukka White - Parchman Farm Blues","uid":5188508,"size":82990822,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e694b29be09ea4ee1fd9e8e6721f46000e8fe6dc&amp;dn=Bukka+White+-+Parchman+Farm+Blues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"muzik62","files":-1,"time":1259577732,"description":"Bukka White - Parchman Farm Blues\n\nmp3 VBR\n\n1.Aberdeen Mississippi Blues\n2.Bukka's Jitterbug Swing\n3.Special Streamline\n4.High Fever Blues\n5.District Attorney Blues\n6.Fixin' to Die Blues\n7.Black Train Blues\n8.Strange Place Blues\n9.When Can I Change My Clothes?\n10.Sleepy Man Blues\n11.Parchman Farm Blues\n12.Good Gin Blues\n13.Pinebluff Arkansas\n14.Shake 'Em Down\n15.The New Frisco Train\n16.The Panama Limited\n17.I Am in the Heavenly Way\n18.Promise True and Grand\n\nBukka White (true name: Booker T. Washington White) was born in Houston, Mississippi (not Houston, Texas) in 1906 (not any date between 1902-1905 or 1907-1909, as is variously reported). He got his initial start in music learning fiddle tunes from his father. Guitar instruction soon followed, but White's grandmother objected to anyone playing &quot;that Devil music&quot; in the household; nonetheless, his father eventually bought him a guitar. When Bukka White was 14 he spent some time with an uncle in Clarksdale, Mississippi and passed himself off as a 21-year-old, using his guitar playing as a way to attract women. Somewhere along the line, White came in contact with Delta blues legend Charley Patton, who no doubt was able to give Bukka White instruction on how to improve his skills in both areas of endeavor. In addition to music, White pursued careers in sport, playing in Negro Leagues baseball and, for a time, taking up boxing.\n\nIn 1930 Bukka White met furniture salesman Ralph Limbo, who was also a talent scout for Victor. White traveled to Memphis where he made his first recordings, singing a mixture of blues and gospel material under the name of Washington White. Victor only saw fit to release four of the 14 songs Bukka White recorded that day. As the Depression set in, opportunity to record didn't knock again for Bukka White until 1937, when Big Bill Broonzy asked him to come to Chicago and record for Lester Melrose. By this time, Bukka White had gotten into some trouble -- he later claimed he and a friend had been &quot;ambushed&quot; by a man along a highway, and White shot the man in the thigh in self defense. While awaiting trial, White jumped bail and headed for Chicago, making two sides before being apprehended and sent back to Mississippi to do a three-year stretch at Parchman Farm. While he was serving time, White's record &quot;Shake 'Em on Down&quot; became a hit.\n\nBukka White proved a model prisoner, popular with inmates and prison guards alike and earning the nickname &quot;Barrelhouse.&quot; It was as &quot;Washington Barrelhouse White&quot; that White recorded two numbers for John and Alan Lomax at Parchman Farm in 1939. After earning his release in 1940, he returned to Chicago with 12 newly minted songs to record for Lester Melrose. These became the backbone of his lifelong repertoire, and the Melrose session today is regarded as the pinnacle of Bukka White's achievements on record. Among the songs he recorded on that occasion were &quot;Parchman Farm Blues&quot; (not to be confused with &quot;Parchman Farm&quot; written by Mose Allison and covered by John Mayall's Bluesbreakers and Blue Cheer, among others), &quot;Good Gin Blues,&quot; &quot;Bukka's Jitterbug Swing,&quot; &quot;Aberdeen, Mississippi Blues,&quot; and &quot;Fixin' to Die Blues,&quot; all timeless classics of the Delta blues. Then, Bukka disappeared -- not into the depths of some Mississippi Delta mystery, but into factory work in Memphis during World War II.\n\nBob Dylan recorded &quot;Fixin' to Die Blues&quot; on his 1961 debut Columbia album, and at the time no one in the music business knew who Bukka White was -- most figured a fellow who'd written a song like &quot;Fixin' to Die&quot; had to be dead already. Two California-based blues enthusiasts, John Fahey and Ed Denson, were more skeptical about this assumption, and in 1963 addressed a letter to &quot;Bukka White (Old Blues Singer), c/o General Delivery, Aberdeen, Mississippi.&quot; By chance, one of White's relatives was working in the Post Office in Aberdeen, and forwarded the letter to White in Memphis.\n\nThings moved quickly from the time Bukka White met up with Fahey and Denson; by the end of 1963 Bukka White was already recording on contract with Chris Strachwitz and Arhoolie. White wrote a new song celebrating his good fortune entitled &quot;1963 Isn't 1962 Blues&quot; and swiftly recorded three albums of material for Strachwitz which the latter entitled Sky Songs, referring to White's habit of &quot;reaching up and pulling songs out of the sky.&quot; Nonetheless, even White knew he couldn't get away with making up all his material regularly in performance, so he also studied his 78s and relearned all the songs he'd written for Lester Melrose. Although Bukka White was practically the same age as other survivors of the Delta and Memphis blues scenes of the 1920s and '30s, he didn't look like someone who belonged in a nursing home. White was a sharp dresser, in the prime of health, was a compelling entertainer and raconteur, and clearly enjoyed being the center of attention. He thrived on the folk festival and coffeehouse circuit of the 1960s.\n\nBy the '70s, however, Bukka White couldn't help getting a little bored with his celebrity status as an acoustic bluesman. White's tastes had grown with the times, and he would have loved to have played an electric guitar and fronted a band, as his old acquaintance Chester Burnett (aka Howlin' Wolf) and Bukka's own cousin, B. B. King, had been already doing successfully for years. But he only needed to look at what happened to his friend Bob Dylan's career for a lesson on what happens to folk blues artists who try and &quot;go electric.&quot; So, Bukka White stayed on the festival circuit to the end of his days, beating the hell out of his National steel guitar, and sometimes his monologues would go on a little long, and sometimes his playing was a little more willfully eccentric than at others. Patrons would wait patiently to hear Bukka play &quot;Parchman Farm Blues,&quot; although some of them were under the mistaken impression that they had paid their money to hear an artist who had originated a number that Eric Clapton made famous.\n\nBlues purists will tell you that nothing Bukka White recorded after 1940 is ultimately worth listening to. This isn't accurate, nor fair. White was an incredibly compelling performer who gave up of more of himself in his work than many artists in any musical discipline. The Sky Songs albums for Arhoolie are an eminently rewarding document of Bukka's charm and candor, particularly in the long monologue &quot;Mixed Water.&quot; &quot;Big Daddy,&quot; recorded in 1974 for Arnold S. Caplin's Biograph label, likewise is a classic of its kind and should not be neglected. ~ Uncle Dave Lewis, All Music Guide\n\nmuzik62","torrent":{"xt":"urn:btih:e694b29be09ea4ee1fd9e8e6721f46000e8fe6dc","amp;dn":"Bukka+White+-+Parchman+Farm+Blues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e694b29be09ea4ee1fd9e8e6721f46000e8fe6dc","infoHashBuffer":{"type":"Buffer","data":[230,148,178,155,224,158,164,238,31,217,232,230,114,31,70,0,14,143,230,220]},"announce":[],"urlList":[]}}