{"title":"Quick Start to Modeling in MODO: Volume 1","uid":10282853,"size":473090356,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e6f853c65585859f405dde4632dba2da38edc4fe&amp;dn=Quick+Start+to+Modeling+in+MODO%3A+Volume+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ihatethisrecaptcha","files":14,"time":1401730109,"description":"Quick Start to Modeling in MODO: Volume 1\n\nReleased Jun 2, 2014\nMODO 801\n1h 7m\nProject Files Included\n\nIn this initial volume we'll cover the basics of getting started building models in MODO. We'll discuss the basics of working with mesh items in MODO and how to copy polygons from one item to another.\n\nWe'll cover methods of creating and working with primitive geometry and creating smooth surfaces by subdividing. We'll cover some of the most commonly used polygon modeling tools like Bevel and Loop Slice. We'll also learn to duplicate geometry in grids and in a radial pattern. In the end we'll create a complete solar array that we can populate across the ground.\n\nWhile following along with these lessons and building a project together will provide you with valuable knowledge, the real power comes from being able to take the techniques you've learned and apply them in a different way to your own work.\n\nWith this in mind, you'll be presented with an assignment immediately following each volume. These assignments will challenge you to take the skills that you've learned in a particular volume and apply them to a different asset.\n\nThese tutorials are designed to be taken in sequence so we really encourage you to start with this volume and proceed all the way through to Volume 5, and taking advantage of the periodic assignments along the way to get the full learning experience.","torrent":{"xt":"urn:btih:e6f853c65585859f405dde4632dba2da38edc4fe","amp;dn":"Quick+Start+to+Modeling+in+MODO%3A+Volume+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6f853c65585859f405dde4632dba2da38edc4fe","infoHashBuffer":{"type":"Buffer","data":[230,248,83,198,85,133,133,159,64,93,222,70,50,219,162,218,56,237,196,254]},"announce":[],"urlList":[]}}