{"title":"Veterinary Parasitology, 3rd Edition","uid":9924775,"size":50457733,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e739682efb0fbb9b3a3ce0854ad2f76fa005ec86&amp;dn=Veterinary+Parasitology%2C+3rd+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":1,"time":1397052270,"description":"Pages: 904\nPublisher: -\nEdition: 3rd., Oct. 2, 2007\nLanguage: English\nISBN-10: 1405119640\nISBN-13: 9781405119641\n\nDescription\n\nLong established as a bestselling parasitology book for veterinary practitioners and veterinary students, the previous edition lead by Urquhart was praised as '...probably the best available veterinary parasitology text for the practitioner' (Clinical Insight).This third edition of Veterinary Parasitology is a major update which builds on the spirit of earlier editions. New authors with a wealth of experience of teaching and researching the subject have thoroughly revised and restructured the book to reflect modern teaching practice and the most up-to-date coverage of advances in this area.\n*Arranged by host species and organ systems within the host, with extensive cross-referencing to enable ease of access to information on particular parasites.\n*The core focus is on parasites of livestock and companion animals, but new sections also cover parasites of poultry and gamebirds, laboratory animals, exotic pets and 'farmed' species.\n*Expanded sections on protozoa and ectoparasites, as well as coverage of a larger selection of parasites of veterinary significance around the world.\n*The majority of parasitic diseases are now covered in detail using a standardised format for each parasite to allow easy referencing and identification and for comparison between species within a genus.\nSuitable for veterinary students, as well as researchers of veterinary parasitology, veterinarians in practice and in government service and others who are involved in aspects of parasitic disease.","torrent":{"xt":"urn:btih:e739682efb0fbb9b3a3ce0854ad2f76fa005ec86","amp;dn":"Veterinary+Parasitology%2C+3rd+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e739682efb0fbb9b3a3ce0854ad2f76fa005ec86","infoHashBuffer":{"type":"Buffer","data":[231,57,104,46,251,15,187,155,58,60,224,133,74,210,247,111,160,5,236,134]},"announce":[],"urlList":[]}}