{"title":"[FTVGirls] Mary (Amazing First Timer AND A Gymnast In Adult / 01","uid":9465983,"size":2568729836,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e85002c1ad90dbd79b5203467fb2e009a780177c&amp;dn=%5BFTVGirls%5D+Mary+%28Amazing+First+Timer+AND+A+Gymnast+In+Adult+%2F+01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"chkm8te","files":14,"time":1389459010,"description":"[FTVGirls] Mary (Amazing First Timer AND A Gymnast In Adult / 01.10.2014)\n\nShe's a beautiful gymnast, with a very cute, firm and petite figure... visiting us from Colorado. Its her first time experiencing adult, with FTV being her starting run into the adult industry. We greet her at a sassy mall, watching her walk through in a cute, form fitting dress. Soon enough she's flashing her breasts, raising her skirt up and showing off her cute butt! We follow her up the escalator, her panties come off, and we get views of her private parts right in this public place! People watch through windows, but fortunately she doesn't get into trouble! Then we see how talented she is when she walks on her hands butt naked through the mall! Incredible... then she gets completely naked at a nearby museum and does it all in the nude! Back home, she experiments with a vibrator for the first time in her life. Never really masturbated before, she warms up with the eroscillator vibrator, then with the vintage vibrator, ending up with a very strong orgasm with visible vaginal contractions! The incredible pleasure is written all over her face, and the way her body quivers... She then gives us extreme closeups of her private parts, with her unique ability to suck in her stomach, and naturally gape her petite vagina in the most unique way... quite erotic to watch. After a little lunch interview, we see her in a hot yellow dress &amp; heels, her parading around at a golf resort, flashing and showing off her flexibility, then doing cartwheels and backflips in the grass (without panties of course!). Then she pulls out the long pink toy, has sex with it, though its rather big for her... On the next morning we see her wake up in the pink room, check her supercute figure out in the mirror, spread for us, then do some stretching from some sexy views. She starts showing off her cute petite feet &amp; pedicure, and with the help of her flexibility does some toe sucking. So fires up the Vibraking toy, which is the strongest thing she's ever used -- and after some intense masturbation she ends up having a squirting orgasm! For her that experience is somewhat shocking and confusing, as its never happened in her life. Wearing cute little shorts &amp; looking like a teen, she visits a mall, where she flashes some more and draws attention with her acrobatics, then spreading &amp; teasing. Off to a department store where she fingers herself and tries on some sportswear. Out at a park, she goes running, flashing, then completely naked in front of a tennis court while people play -- and does some incredible acrobatics &amp; back flips in the nude! She's got some incredible talent. Back home, she tries some kinky play, starting with a small glass plug, which she inserts into her vagina, and allows us to see 'inside', then a string of beads which she stuffs herself with, slowly pulling them out with her toes. To end the day, she puts on an elegant blue dress, dances for us, then gets naked and dances some more. She's so spunky and fun! An amazingly talented girl, gorgeous, fun, with everything we'd want in an FTV girl, and her total first time experience in adult here... One of the most energetic girls to ever appear on FTV \n\nJoined Screens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=ww90c306la6kje87v5iw.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=ww90c306la6kje87v5iw.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=qclb5ubvabwdrwod6mhx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=qclb5ubvabwdrwod6mhx.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:e85002c1ad90dbd79b5203467fb2e009a780177c","amp;dn":"%5BFTVGirls%5D+Mary+%28Amazing+First+Timer+AND+A+Gymnast+In+Adult+%2F+01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e85002c1ad90dbd79b5203467fb2e009a780177c","infoHashBuffer":{"type":"Buffer","data":[232,80,2,193,173,144,219,215,155,82,3,70,127,178,224,9,167,128,23,124]},"announce":[],"urlList":[]}}