{"title":"The Brain and the Meaning of Life (2010) epub","uid":10303655,"size":1199219,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e85d2d3fb1f73fd7c4760a658c77d9beb531f97a&amp;dn=The+Brain+and+the+Meaning+of+Life+%282010%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":1,"time":1402006729,"description":"Why is life worth living? What makes actions right or wrong? What is reality and how do we know it? The Brain and the Meaning of Life draws on research in philosophy, psychology, and neuroscience to answer some of the most pressing questions about life's nature and value. Paul Thagard argues that evidence requires the abandonment of many traditional ideas about the soul, free will, and immortality, and shows how brain science matters for fundamental issues about reality, morality, and the meaning of life. The ongoing Brain Revolution reveals how love, work, and play provide good reasons for living.\n Defending the superiority of evidence-based reasoning over religious faith and philosophical thought experiments, Thagard argues that minds are brains and that reality is what science can discover. Brains come to know reality through a combination of perception and reasoning. Just as important, our brains evaluate aspects of reality through emotions that can produce both good and bad decisions. Our cognitive and emotional abilities allow us to understand reality, decide effectively, act morally, and pursue the vital needs of love, work, and play. Wisdom consists of knowing what matters, why it matters, and how to achieve it.\n\n The Brain and the Meaning of Life shows how brain science helps to answer questions about the nature of mind and reality, while alleviating anxiety about the difficulty of life in a vast universe. The book integrates decades of multidisciplinary research, but its clear explanations and humor make it accessible to the general reader.","torrent":{"xt":"urn:btih:e85d2d3fb1f73fd7c4760a658c77d9beb531f97a","amp;dn":"The+Brain+and+the+Meaning+of+Life+%282010%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e85d2d3fb1f73fd7c4760a658c77d9beb531f97a","infoHashBuffer":{"type":"Buffer","data":[232,93,45,63,177,247,63,215,196,118,10,101,140,119,217,190,181,49,249,122]},"announce":[],"urlList":[]}}