{"title":"Hitman.HD.Trilogy.PS3-DUPLEX","uid":8061869,"size":10923802706,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:e984ace3cb135b424dd10c11ba270266f4f7bc6e&amp;dn=Hitman.HD.Trilogy.PS3-DUPLEX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":7,"uploader":"thenoobish","files":1032,"time":1359106279,"description":"- D U P L E X -\n\nP R O U D L Y   P R E S E N T S\n\nHitman HD Collection\n\nDate      : 01-2013                   Languages: English (Multi5)\nPlatform  : PS3                       Genre    : Action\n\nRelease Info:\n\nEnjoy three classic Hitman games in HD. Hitman2: Silent Assassin(2002),\nHitman: Contracts(2004) and Hitman: Blood Money(2006)\nHitman 2: Silent Assassin - Agent 47 has left his life as an assassin\nand retreated to a church in Sicily to find peace. 47 Works as a gardener\nfor Father Vittorio, who is his best friend and mentor.\nFather Vittorio has now been kidnapped, his kidnappers leave a ransom note\nfor agent 47. Going back to his old life as an assassin to track down Father\nVittorio, he gets back in contact with his agency who thought that 47 was\ndead. Making a deal with his handler Diana, He agrees to work for the\nagency if they agree to help him locate Father Vittorio.\nHitman: Contracts - The start of the game shows Agent 47 wandering through\na dark hotel corridor entering his room. Collapsing he begins to have\nflashbacks off past assassinations he has committed. Starting with the\naftermath of killing Dr. Ort-Meyer, at the end off th first Hitman game.\nThe Mission mainly focuses on replays of previous missions in the original\ngame, except played in reverse.\n\nHitman: Blood Money - This begins with a flash at an abandoned Baltimore,\nMaryland amusement park. Where many people were killed in an incident\ncaused by negligent maintenance of a ferris wheel. The father of one of\nthe victims calls the agency and orders a hit on the park owner, who was\ncleared of all charges. Agent 47 carries out the hit, following that\nassignment, he get's a string of contracts from American clients eager\nto hire the famous hitman.\n\nNotes:\n\nAll games are new HD Remakes for the PS3 - Enjoy!\n\nEnjoy This Fine DUPLEX Release\n\nbmx!","torrent":{"xt":"urn:btih:e984ace3cb135b424dd10c11ba270266f4f7bc6e","amp;dn":"Hitman.HD.Trilogy.PS3-DUPLEX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e984ace3cb135b424dd10c11ba270266f4f7bc6e","infoHashBuffer":{"type":"Buffer","data":[233,132,172,227,203,19,91,66,77,209,12,17,186,39,2,102,244,247,188,110]},"announce":[],"urlList":[]}}