{"title":"[NubileFilms] Jillian Janson (Teaser Pleaser / 08.03.2015)","uid":11744386,"size":184429578,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:e98beaef0cd956a6cea0171c9be93fe96f4241f7&amp;dn=%5BNubileFilms%5D+Jillian+Janson+%28Teaser+Pleaser+%2F+08.03.2015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"chkm8te","files":1,"time":1425932113,"description":"[NubileFilms] Jillian Janson (Teaser Pleaser / 08.03.2015)\n\nSeductress Jillian Janson teases Tommy Gunn with glimpses of her bra- and thong-clad body through sheer curtains, exciting his pleasure until his cock is rock hard. Jillian isn't about to stop teasing quite yet, though. She slips her bra off and then unties her bottom, revealing her lush bottom and landing strip pussy that are ready to party.\n\nNow that she's ready to get this show on the road, Jillian doesn't hesitate to get on her knees and pull Tommy's cock out for her obvious admiration. The blonde can't keep her mouth off of the head of Tommy's dick, and soon she is alternating between sucking him off and lapping happily at the tip of her stiff treat.\n\nEager to turn the tables on Jillian, Tommy arranges his lover so that she is standing with one leg propped up so that her juicy snatch is wide open for his magic tongue to go to work. Jillian can't get enough of Tommy's teasing licks, and the smile on her face only grows bigger when she is finally allowed to sink down onto her lover's cock to fill her cum hungry pussy all the way.\n\nWhen she is fully impaled, she takes a few experimental thrusts before letting Tommy piston in and out of her tight sheath with enough force to start her full tits bouncing. Finding that he can't get quite the leverage he needs to deliver the pussy pounding he craves, Tommy puts Jillian on her back and goes to town driving in and out of her fuck hole with the power of pure lust.\n\nWhen Tommy encourages Jillian to get up on her hands and knees, she does so gleefully. The new angle of penetration is everything that Jillian wanted, leaving her pushing her hips backwards for fuller penetration while she breaths in panting moans that express her ecstasy to the whole room.\n\nNow Jillian goes back to work with her magic mouth and hands, stroking and sucking him towards his climax. She insists on one more climax, which Tommy gladly gives her with a spooning fuck that brings him right to the edge even as Jillian clenches around him. Tommy barely has time to pull out and thrust his cock towards Jillian's mouth before he releases his load on her eager tongue and all over her soft chest to leave his lover covered in his adoration.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=yxy478fszx0pa51skup2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=yxy478fszx0pa51skup2.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=7cvvdebcmzqzzxo5m2tl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=7cvvdebcmzqzzxo5m2tl.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:e98beaef0cd956a6cea0171c9be93fe96f4241f7","amp;dn":"%5BNubileFilms%5D+Jillian+Janson+%28Teaser+Pleaser+%2F+08.03.2015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e98beaef0cd956a6cea0171c9be93fe96f4241f7","infoHashBuffer":{"type":"Buffer","data":[233,139,234,239,12,217,86,166,206,160,23,28,155,233,63,233,111,66,65,247]},"announce":[],"urlList":[]}}