{"title":"Nanotechnology for Dummies - Richard Booker, Earl Boysen","uid":15506088,"size":5865683,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea838f88e2d55be488818576833888f7bb638b97&amp;dn=Nanotechnology+for+Dummies+-+Richard+Booker%2C+Earl+Boysen&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1470585724,"description":"Nanotechnology for Dummies - Richard Booker, Earl Boysen (Wiley, 2005).pdf\r\n\r\nThis title demystifies the topic for investors, business executives, and anyone interested in how molecule-sized machines and processes can transform our lives. Along with dispelling common myths, it covers nanotechnology's origins, how it will affect various industries, and the limitations it can overcome. This handy book also presents numerous applications such as scratch-proof glass, corrosion resistant paints, stain-free clothing, glare-reducing eyeglass coatings, drug delivery systems, medical diagnostic tools, burn and wound dressings, sugar-cube-sized computers, mini-portable power generators, even longer-lasting tennis balls, and more.Nanotechnology is the science of matter at the scale of one-billionth of a meter or 1/75,000th the size of a human hairWritten in the accessible, humorous For Dummies style, this book demystifies nanotechnology for investors, business people, and anyone else interested in how molecule-sized machines and processes will soon transform our livesInvestment in nanotechnology is exploding, with $3.7 billion in nanotechnology R&amp;D spending authorized by the U.S. government in 2003 and international investment reported at over $2 billion","torrent":{"xt":"urn:btih:ea838f88e2d55be488818576833888f7bb638b97","amp;dn":"Nanotechnology+for+Dummies+-+Richard+Booker%2C+Earl+Boysen","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea838f88e2d55be488818576833888f7bb638b97","infoHashBuffer":{"type":"Buffer","data":[234,131,143,136,226,213,91,228,136,129,133,118,131,56,136,247,187,99,139,151]},"announce":[],"urlList":[]}}