{"title":"The Mannerheim Line 1920-39: Finnish Fortifications of the Winte","uid":11918418,"size":26527154,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb47a89da18012fa2c094d94d80be8a0d8bcf655&amp;dn=The+Mannerheim+Line+1920-39%3A+Finnish+Fortifications+of+the+Winte&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1431585498,"description":"In the wake of the bloody civil war that followed Finland's independence from Russia in 1917, the border between the two countries was established across the Karelian Isthmus, an area long fought over by Russia, Finland and Sweden in their attempts to dominate the northern tip of Europe. Neither the Soviets nor the Finnish were comfortable with such a divide, which provided an open route for a potential invader to Helsinki on the Finnish side, and was only 32km from the important military and industrial city of Petrograd in Russia. As such, both sides began an intensive period of fortification and defensive planning. As the Winter War broke out in November 1939, the complex and heavily defended Mannerheim Line suffered intense bombardment and armored assaults. The armistice of May 1940 saw Finland cede control of the entire Karelian Isthmus to the USSR however, and a propaganda war ensued; the Russians emphasizing the strength of the line, and the Finnish downplaying its importance, accentuating instead the heroism and bravery of the common Finnish soldier.\n\nThrough a detailed analysis of the background, design and operational history of the Mannerheim Line, Bair Irincheev attempts to dispel such myths and provide an accurate assessment of its immense historical importance","torrent":{"xt":"urn:btih:eb47a89da18012fa2c094d94d80be8a0d8bcf655","amp;dn":"The+Mannerheim+Line+1920-39%3A+Finnish+Fortifications+of+the+Winte","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb47a89da18012fa2c094d94d80be8a0d8bcf655","infoHashBuffer":{"type":"Buffer","data":[235,71,168,157,161,128,18,250,44,9,77,148,216,11,232,160,216,188,246,85]},"announce":[],"urlList":[]}}