{"title":"Characterization of Nanostructures","uid":15265871,"size":46401649,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb6c1f9b802c79c9465091bdf76a353280c4729f&amp;dn=Characterization+of+Nanostructures&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1468215146,"description":"Characterization of Nanostructures - Sverre Myhra, John Rivière (CRC, 2013).pdf\r\n\r\nISBN 978-1-4398-5417-4\r\n\r\nThe techniques and methods that can be applied to materials characterization on the microscale are numerous and well-established. Divided into two parts, Characterization of Nanostructures provides thumbnail sketches of the most widely used techniques and methods that apply to nanostructures, and discusses typical applications to single nanoscale objects, as well as to ensembles of such objects.\r\n\r\nSection I: Techniques and Methods overviews the physical principles of the main techniques and describes those operational modes that are most relevant to nanoscale characterization. It provides sufficient technical detail so that readers and prospective users can gain an appreciation of the strengths and limitations of particular techniques. The section covers both mainstream and less commonly used techniques.\r\n\r\nSection II: Applications of Techniques to Structures of Different Dimensionalities and Functionalities deals with the methods for materials characterization of generic types of systems, using carefully chosen illustrations from the literature. Each chapter begins with a brief description of the materials and supplies a context for the methods for characterization. The volume concludes with a series of flow charts and brief descriptions of tactical issues.\r\n\r\nThe authors focus on the needs of the research laboratory but also address those of quality control, industrial troubleshooting, and online analysis. Characterization of Nanostructures describes those techniques and their operational modes that are most relevant to nanoscale characterization. It is especially relevant to systems of different dimensionalities and functionalities. The book builds a bridge between generalists, who play vital roles in the post-disciplinary area of nanotechnology, and specialists, who view themselves as more in the context of the discipline","torrent":{"xt":"urn:btih:eb6c1f9b802c79c9465091bdf76a353280c4729f","amp;dn":"Characterization+of+Nanostructures","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb6c1f9b802c79c9465091bdf76a353280c4729f","infoHashBuffer":{"type":"Buffer","data":[235,108,31,155,128,44,121,201,70,80,145,189,247,106,53,50,128,196,114,159]},"announce":[],"urlList":[]}}