{"title":"Modeling of Metal Forming and Machining Processes","uid":15409018,"size":6943470,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb8aebf47cbb45dfdb868b0001f32b4cf898cb62&amp;dn=Modeling+of+Metal+Forming+and+Machining+Processes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1469539405,"description":"Modeling of Metal Forming and Machining Processes - Prakash M. Dixit, Uday S. Dixit (Springer, 2008).pdf\r\n\r\nThe use of computational techniques is increasing day by day in the manufacturing sector. Process modeling and optimization with the help of computers can reduce expensive and time consuming experiments for manufacturing good quality products. Metal forming and machining are two prominent manufacturing processes. Both of these processes involve large deformation of elasto-plastic materials due to applied loads. In metal forming, the material is plastically deformed without causing fracture. On the other hand, in machining, the material is deformed till fracture, in order to remove material in the form of chips. To understand the physics of metal forming and machining processes, one needs to understand the kinematics of large deformation (dependence of deformation and its rate on displacement) as well as the constitutive behavior of elasto-plastic materials (dependence of internal forces on deformation and its rate). Once the physics is understood, these phenomena have to be converted to mathematical relations in the form of differential equations. The interaction of the work-piece with the tools/dies and other surroundings also needs to be expressed in a mathematical form (known as the boundary and initial conditions). In this book, the first four chapters essentially discuss the physics of metal forming and machining processes. The physical behavior of the work-piece during the processes is modeled in the form of differential equations and boundary and initial conditions","torrent":{"xt":"urn:btih:eb8aebf47cbb45dfdb868b0001f32b4cf898cb62","amp;dn":"Modeling+of+Metal+Forming+and+Machining+Processes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb8aebf47cbb45dfdb868b0001f32b4cf898cb62","infoHashBuffer":{"type":"Buffer","data":[235,138,235,244,124,187,69,223,219,134,139,0,1,243,43,76,248,152,203,98]},"announce":[],"urlList":[]}}