{"title":"Vanished Kingdoms - The Rise and Fall of States and Nations","uid":9808044,"size":58500931,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb8d59e31774a0e525fd19d1e6280e01b13b388d&amp;dn=Vanished+Kingdoms+-+The+Rise+and+Fall+of+States+and+Nations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"STBGD","files":2,"time":1395480567,"description":"Norman Davies, &quot;Vanished Kingdoms: The Rise and Fall of States and Nations&quot; \nEnglish | 2012 | ISBN: 067002273X | EPUB, MOBI | 803 pages | 56 MB\n\nAn evocative account of fourteen European kingdoms-their rise, maturity, and eventual disappearance. \nThere is something profoundly romantic about lost civilizations. Europe's past is littered with states and kingdoms, large and small, that are scarcely remembered today, and while their names may be unfamiliar-Aragon, Etruria, the Kingdom of the Two Burgundies-their stories should change our mental map of the past. We come across forgotten characters and famous ones-King Arthur and Macbeth, Napoleon and Queen Victoria, right up to Stalin and Gorbachev-and discover how faulty memory can be, and how much we can glean from these lost empires. Davies peers through the cracks in the mainstream accounts of modern-day states to dazzle us with extraordinary stories of barely remembered pasts, and of the traces they left behind.\nThis is Norman Davies at his best: sweeping narrative history packed with unexpected insights. Vanished Kingdoms will appeal to all fans of unconventional and thought-provoking history, from readers of Niall Ferguson to Jared Diamond.","torrent":{"xt":"urn:btih:eb8d59e31774a0e525fd19d1e6280e01b13b388d","amp;dn":"Vanished+Kingdoms+-+The+Rise+and+Fall+of+States+and+Nations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb8d59e31774a0e525fd19d1e6280e01b13b388d","infoHashBuffer":{"type":"Buffer","data":[235,141,89,227,23,116,160,229,37,253,25,209,230,40,14,1,177,59,56,141]},"announce":[],"urlList":[]}}