{"title":"(Blues) Elizabeth Cotten - When I'm Gone","uid":6521933,"size":104668998,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eb9d1d3e212de9622618747dc72951b55f9cf46d&amp;dn=%28Blues%29+Elizabeth+Cotten+-+When+I%5C%27m+Gone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1310026835,"description":"mp3   320kbps\n\n\nLabel: Smithsonian Folkways\nStyles: Traditional folk, Appalachian, Blues Revival\nYear: 2006\nArt: Front\n\n\n\nThe third volume in the original Folkways series of albums by this master fingerpicker and acoustic music legend was actually pieced together from recordings made hither, thither, and yonder over nearly a decade. From the first notes of the opening instrumental, &quot;New Year's Eve,&quot; the listener will know they are in presence of greatness. The best way to describe her playing would perhaps be some kind of symbolic contrast to other well-known artists. For example, she is a Rembrandt painting while John Fahey is a picture postcard, no slight to Fahey intended. Some might assume that it took ten years to put together a new Cotten album, but this decision most likely had more to do with the label's scaredy-cat approach to marketing or producer Mike Seeger's reputation for perfectionism, or both. The latter trait was certainly one Cotten didn't share, and the fact that so many different recordings were done in situations such as people's living rooms is no surprise as the grand dame simply had to have a guitar in her hand whenever she sat down, and would often go home from a two or even three hour gig and play guitar all night in her motel room. This album features several songs with lyrics by her granddaughter Johnine Rankin. It also came originally with an insert that despite a horribly Xeroxed cover picture has much to offer in the way of anecdotes and historical information as well as printed lyrics. She revives &quot;Freight Train&quot; here, but of more interest are numbers such as &quot;Willie,&quot; &quot;Jenny,&quot; and &quot;Gaslight Blues,&quot; all played with a delicate, precise touch, as if the guitar was speaking to her of its own power. \n","torrent":{"xt":"urn:btih:eb9d1d3e212de9622618747dc72951b55f9cf46d","amp;dn":"%28Blues%29+Elizabeth+Cotten+-+When+I%5C%27m+Gone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb9d1d3e212de9622618747dc72951b55f9cf46d","infoHashBuffer":{"type":"Buffer","data":[235,157,29,62,33,45,233,98,38,24,116,125,199,41,81,181,95,156,244,109]},"announce":[],"urlList":[]}}