{"title":"Smart Mom, Rich Mom: How To Build Wealth While Raising A Family","uid":15384456,"size":189159288,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ebb321a1e9119e372684d61529df71cf0f1ae526&amp;dn=Smart+Mom%2C+Rich+Mom%3A+How+To+Build+Wealth+While+Raising+A+Family+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Kane_krit","files":1,"time":1469275268,"description":"Smart Mom, Rich Mom: How To Build Wealth While Raising A Family - Kimberly Palmer\r\n \nhttp://www.barnesandnoble.com/w/smart-mom-rich-mom-kimberly-palmer/1123051043?ean=9781504792318\r\n\r\nOf all of life's financial shocks, few compare to bringing home an infant. Just one tiny person costs $250,000 to raise - not including college!\r\nHow will you pay for it? That agonizing question fuels mothers' choices about their careers, budgets, and families. Some lean in, some scale back or seek new opportunities - there are no easy answers, but lots of rewarding possibilities.\r\nSmart Mom, Rich Mom explores how women today are navigating the financially challenging career/parenting years. Written by a national money columnist and mom of two, the book chronicles people who have stayed in the game - full-time, freelance, self-employed, and more - and emerged more prosperous and empowered.\r\nSmart Mom, Rich Mom mines their experiences to uncover both career advice and spending and savings strategies that everyone can use. Stories, checklists, action steps, planning tools, and more explain how to:\r\nPrepare financially for parenthood - whether you're expecting your first child or your third\r\nBalance thrift with generating income and investing wisely\r\nFind flexibility at work while safeguarding your earning potential\r\nSave for both college and retirement, despite increased expenses\r\nPlan for unexpected events, like a layoff or illness\r\nAnd much more\r\nKids change our lives, adding joy but draining bank accounts. Smart Mom, Rich Mom helps you adopt healthy habits - and make hard decisions - that pay off in abundance","torrent":{"xt":"urn:btih:ebb321a1e9119e372684d61529df71cf0f1ae526","amp;dn":"Smart+Mom%2C+Rich+Mom%3A+How+To+Build+Wealth+While+Raising+A+Family+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebb321a1e9119e372684d61529df71cf0f1ae526","infoHashBuffer":{"type":"Buffer","data":[235,179,33,161,233,17,158,55,38,132,214,21,41,223,113,207,15,26,229,38]},"announce":[],"urlList":[]}}