{"title":"Aliens VS. Predator Extinction [Ntsc], Ps2","uid":5148266,"size":485663956,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:ebd1fcf2480aa2ffd09bec65f037bc5f2434c19c&amp;dn=Aliens+VS.+Predator+Extinction+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Big_dude","files":-1,"time":1257403090,"description":"Aliens VS. Predator Extinction for the Ps2                          Rel. 07/29/2003\n\n\nFormat:        CD-R NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/MDF\nGenre.:        Action\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works. \n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\nImportant - This is a CD Type or Compact Disc Ps2 Game. So you must use CD-R Media\n            only to burn with.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n         &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n         &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n        &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n        &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\n\nGame Description:\n\nThe battle that has split more blood over centuries continues, with the human marines caught in-between the powerful Aliens and the deadly Predators.\n\nMoving away from the FPS series on PC, Extinction has you controlling one of the three races in a real time strategy mix, building each unit and setting them out into the battlefield to complete a range of tasks.\n\nEach race has an advantage and disadvantage. The humans have a collection of different units, from heavy weapons experts to medics, and are better known for their long range attacks. Predators are hardcore fighters, taking the battle right up to the enemy, although there are fewer of them available to counter act their superior power. Finally, the Aliens are fast and deadly, and always hunt in large packs.\n\nUpgrade weapons and use terrain to an advantage in each level to make certain your team (whoever or whatever they may be) survive until the next battle.\n\n\nFeatures:\n\n* Harness the unique advantages you possess as an Alien, Predator, or Colonial\n  Marine to wage war in 21 single-player missions. \n\n* Control one of three different races - each with it's own characteristics and \n  abilities to suit any style of play. \n\n* Upgrade up to 10 different unit types of various races including new, never \n  before seen units such  as the Predator Hydra or the Alien Ravager. \n\n* Engage the enemy in 21 unique maps, from jungles to deserts to high-tech \n  laboratories. \n\n* Utilize powerful resources and strategies including pulse rifles, exosuits, and \n  air strikes to unleash devastating attacks on your enemies.\n\n\nGame Pics Included.\n\n\nBurn with Alcohol 120%, (Included in download).  \n\n(Oops it appears that Alcohol 120% Installer is corrupt for this release, You can find Alcohol 120% + crack anywhere on the net or download my latest psx or downloads that have working version.)\n\nSet DataType to Playstation 2 (Write Method Raw/Dao) and Burn at 8x Speed.\n\nUse Verbatim or Taiyo Yuden CD-R Media for best quality, or if other media\nisn't working.\n\n\n(No CD-RW Will not Work).\n\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\nEnjoy!","torrent":{"xt":"urn:btih:ebd1fcf2480aa2ffd09bec65f037bc5f2434c19c","amp;dn":"Aliens+VS.+Predator+Extinction+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebd1fcf2480aa2ffd09bec65f037bc5f2434c19c","infoHashBuffer":{"type":"Buffer","data":[235,209,252,242,72,10,162,255,208,155,236,101,240,55,188,95,36,52,193,156]},"announce":[],"urlList":[]}}