{"title":"Fast Times At Ridgemont High (Soundtrack) [FLAC] - Kitlope","uid":6968685,"size":430189537,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ec38d4006b0af0b64a529a9244f4374e1892ab1d&amp;dn=Fast+Times+At+Ridgemont+High+%28Soundtrack%29+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Kitlope","files":23,"time":1327008019,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: EC38D4006B0AF0B64A529A9244F4374E1892AB1D\nFile Size: 410.26 MB\nYear: 1982\nLabel: Elektra\nCatalog #: 60158-2\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nFast Times at Ridgemont High is a 1982 American coming-of-age teen comedy film written by Cameron Crowe and adapted from his 1981 book of the same name. As a freelance writer for Rolling Stone magazine, Crowe went undercover at Clairemont High School in San Diego, California, and wrote about his experiences.\n\nThe film was directed by Amy Heckerling and chronicles a school year in the lives of freshmen Stacy Hamilton (Jennifer Jason Leigh) and Mark Ratner (Brian Backer), and their respective older friends Linda Barrett (Phoebe Cates) and Mike Damone (Robert Romanus), both of whom believe themselves wiser in the ways of romance than their younger counterparts. The ensemble cast of characters form two subplots with Jeff Spicoli (Sean Penn), an irresponsible stoned surfer, facing off against uptight history teacher Mr. Hand (Ray Walston), and Stacy's brother, Brad (Judge Reinhold), a senior who works at a series of entry-level jobs in order to pay off his car, and who is pondering easing out of his relationship with his girlfriend.\n\nIn addition to Penn, Reinhold, Cates and Leigh, this movie marks early appearances by several actors who later became stars, including Nicolas Cage, then billing himself as Nicolas Coppola, Forest Whitaker, Eric Stoltz, and Anthony Edwards.\n\n\n\n\n\n\n\n\nFast Times At Ridgemont High 1982\n\n\nThe soundtrack album, Fast Times at Ridgemont High: Music from the Motion Picture, peaked at #54 on the Billboard album chart. The soundtrack contains many quintessential 1980s rock artists.\n\nSeveral of the movie's songs were released as singles, including Jackson Browne's &quot;Somebody's Baby&quot;, which reached #7 on the Billboard Hot 100 singles chart.[1] Other singles were the title track by Sammy Hagar, &quot;So Much in Love&quot; by Timothy B. Schmit and &quot;Waffle Stomp&quot; by Joe Walsh. In addition to Schmit and Walsh, the album features solo tracks by two other members of the Eagles, Don Henley and Don Felder. The soundtrack also included &quot;I Don't Know (Spicoli's Theme)&quot; by Jimmy Buffett.\n\nFive tracks in the film, but not included on the soundtrack are: &quot;Moving in Stereo&quot; by The Cars, &quot;American Girl&quot; by Tom Petty and the Heartbreakers, &quot;We Got The Beat&quot; by The Go Go's, Led Zeppelin's &quot;Kashmir,&quot; and &quot;Jingle Bell Rock&quot; by Bobby Helms. In addition, the live band at the prom dance during the end of the film played two songs also not on the soundtrack: &quot;Life in the Fast Lane&quot; by the Eagles and &quot;Wooly Bully&quot; by Sam the Sham &amp; the Pharaohs.\n\nTodd Rundgren also recorded the song &quot;Attitude&quot; for the film at Crowe's request. It was not included in the film, but was later released on Rundgren's Demos and Lost Albums in 2001.\n\nAmy Heckerling, in the DVD audio commentary, states that the 1970s &quot;classic rock&quot; artists like the Eagles were the idea of one of the film's producers. In fact, Irving Azoff, one of the movie's producers, was the personal manager for the Eagles.\n\nTracks: \n\n\n1.\t&quot;Somebody's Baby&quot; (Jackson Browne) - 4:05\n2.\t&quot;Waffle Stomp&quot; (Joe Walsh) - 3:40\n3.\t&quot;Love Rules&quot; (Don Henley) - 4:05\n4.\t&quot;Uptown Boys&quot; (Louise Goffin) - 2:45\n5.\t&quot;So Much in Love&quot; (Timothy B. Schmit) - 2:25\n6.\t&quot;Raised on the Radio&quot; (The Ravyns) - 3:43\n7.\t&quot;The Look in Your Eyes&quot; (Gerard McMahon) - 4:00\n8.\t&quot;Speeding&quot; (The Go-Go's) - 2:11\n9.\t&quot;Don't Be Lonely&quot; (Quarterflash) - 3:18\n10.\t&quot;Never Surrender&quot; (Don Felder) - 4:15\n11.\t&quot;Fast Times (The Best Years of Our Lives)&quot; (Billy Squier) - 3:41\n12.\t&quot;Fast Times at Ridgemont High&quot; (Sammy Hagar) - 3:36\n13.\t&quot;I Don't Know (Spicoli's Theme)&quot; (Jimmy Buffett) - 3:00\n14.\t&quot;Love Is the Reason&quot; (Graham Nash) - 3:31\n15.\t&quot;I'll Leave It up to You&quot; (Poco) - 2:55\n16.\t&quot;Highway Runner&quot; (Donna Summer) - 3:18\n17.\t&quot;Sleeping Angel&quot; (Stevie Nicks) - 3:55\n18.\t&quot;She's My Baby (And She's Outta Control)&quot; (Palmer/Jost) - 2:53\n19.\t&quot;Goodbye, Goodbye&quot; (Oingo Boingo) - 4:34\n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:ec38d4006b0af0b64a529a9244f4374e1892ab1d","amp;dn":"Fast+Times+At+Ridgemont+High+%28Soundtrack%29+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec38d4006b0af0b64a529a9244f4374e1892ab1d","infoHashBuffer":{"type":"Buffer","data":[236,56,212,0,107,10,240,182,74,82,154,146,68,244,55,78,24,146,171,29]},"announce":[],"urlList":[]}}