{"title":"Planeta.Bur.1962.Planet-of-Storms.H264.English-Hardsubs.Chromeca","uid":9796693,"size":367122291,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ec596f8792d3477db7bbaefc115b3882a63804ba&amp;dn=Planeta.Bur.1962.Planet-of-Storms.H264.English-Hardsubs.Chromeca&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"usbmboot","files":1,"time":1395327479,"description":"This is a special &quot;embedded subtitles&quot; version of the Russian sci-fi classic, Planeta Bur a.k.a. Planet of Storms (1962) compatible with Google Chromecast. Optimized file size is very small but it is the same quality as much bigger (and older) RIPs. \n\nAudio track is in the Russian language. English subtitles are [b]hard-embedded[/b] on screen.\n\n\nGoogle Chromecast supports just a limited number of video and audio codecs and container file types. Chromecast still does not handle subtitles, so the English subtitles have been overlayed directly on the video image with this download.\n\nVideo: H264 ( 512 x 384 ) --- Audio: AAC (m4a) stereo 48000\n\nThis movie file with embedded subtitles was created using VLC and Avanti.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0056352/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0056352/&lt;/a&gt;\n\n\nfrom Wikipedia:\n\nThree Soviet spaceships, Sirius, Vega, and Cappella, are on their way to the planet Venus. The Cappella is struck by a meteorite and destroyed. The remaining two ships, the Sirius and Vega continue on, but the planned mission required three ships. Another spaceship, the Arktur, is being sent from Earth, but won't arrive for 2 months.\n\nThe cosmonauts aboard Sirius and Vega decide that some sort of landing and exploration is better than waiting. Ivan and Kern go down from Vega in the glider, leaving Masha in orbit. They must land in a swamp, then all contact is lost. The Sirius lands somewhat nearby and the three-man crew set out in a hovercar to find them.\n\nDuring their travels they hear an eerie woman's song in the distance, and encounter prehistoric beasts both benign and threatening. Ivan and Kern, meanwhile, have fought off some man-sized t-rex beasts and are headed to meet the men of Sirius. Ivan and Kern become weak with fever. Their robot, John, stands watch.\n\nThe Sirius crew had to submerge the hovercar to escape a pterodactyl. In doing so, they discover what might have been an ancient city. Alexy finds a strange triangular rock and they also find a statue of a pterodactyl with rubies for eyes.\n\nOnce on dry land, the Sirius crew contact John and tell him to administer an anti-fever drug. Ivan and Kern recover just as a volcano sends down rivers of lava. They order John to carry them across, but he malfunctions half way there. The hovercar shows up just in time to rescue them. John is lost to the lava.\n\nAll five return to Sirius, but worry that Masha had landed the Vega somewhere, stranding them all. An earthquake and flood from rain undermine the Sirius, so they must take off immediately. Alexey discovers that his odd triangular rock is really a sculpture of a woman's face, proving that there might still be intelligent life on Venus. They blast off and find that Masha remained in orbit and together they head home.\n","torrent":{"xt":"urn:btih:ec596f8792d3477db7bbaefc115b3882a63804ba","amp;dn":"Planeta.Bur.1962.Planet-of-Storms.H264.English-Hardsubs.Chromeca","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec596f8792d3477db7bbaefc115b3882a63804ba","infoHashBuffer":{"type":"Buffer","data":[236,89,111,135,146,211,71,125,183,187,174,252,17,91,56,130,166,56,4,186]},"announce":[],"urlList":[]}}