{"title":"Chris Bunch &amp; Allan Cole - The Sten Series [1-4]","uid":12108698,"size":595573183,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ec69e81685c252dd518b183ac95a1c832f2e3c1a&amp;dn=Chris+Bunch+%26amp%3B+Allan+Cole+-+The+Sten+Series+%5B1-4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Cybotage","files":4,"time":1436500196,"description":"The books follow Karl Sten, a young man born and raised on a dangerous factory world and saved from life as an outlaw by the head of Imperial Intelligence, Ian Mahoney. Mahoney takes Sten from the terrible world of his birth and enlists him in the military. Sten is thrust into a world of espionage, covert military actions, and galactic politics. His original training is in the super-secret covert ops group known as Mantis. The missions and actions taken are usually known only to a select few. However, a series of crucial missions ensures that Sten rises swiftly in rank until he becomes a troubleshooter and friend to the Emperor himself.\n\nThe series of eight books are set three thousand years in the future. A vast empire, limited only by the universe itself, is ruled by the Eternal Emperor, a man who appears to be in his thirties but is in fact thousands of years old. He has mastered death in a way no one has guessed since the beginning of his rule. The source of his power is a powerful fuel called Anti-Matter Two (AM2). It is what fuels everything from the star ships that link the Empire, to industrial factories, to camping heaters. Only he controls its supply and price. And only he knows where to find it. It is only for this reason that he is able to rule.\n\nWhen an &quot;accident&quot; kills his family, Sten rebels and harasses the company that runs Vulcan from the metal world's maze of warrens. The factory planet is ugly, harsh, and company-run for centuries. Sten meets a stranger who is his ticket off - and back.\n\n01 - Sten\n02 - The Wolf Worlds\n03 - The Court of a Thousand Suns\n04 - The Fleet of the Damned\n\n\n\nFormat: M4A\nBitrate: 32 Kbps\nUnabridged","torrent":{"xt":"urn:btih:ec69e81685c252dd518b183ac95a1c832f2e3c1a","amp;dn":"Chris+Bunch+%26amp%3B+Allan+Cole+-+The+Sten+Series+%5B1-4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec69e81685c252dd518b183ac95a1c832f2e3c1a","infoHashBuffer":{"type":"Buffer","data":[236,105,232,22,133,194,82,221,81,139,24,58,201,90,28,131,47,46,60,26]},"announce":[],"urlList":[]}}