{"title":"Adam &amp; Eve - Sena Jeter Naslund (epub &amp; mobi) {dwg}","uid":15641436,"size":2832234,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ec87600081f61e5f289470f4ae6deb36e4d3a54e&amp;dn=Adam+%26amp%3B+Eve+-+Sena+Jeter+Naslund+%28epub+%26amp%3B+mobi%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gratefuldawg77","files":4,"time":1472016941,"description":"335 pages\r\nPublished September 28th 2010 by William Morrow (first published 2010)\r\nISBN 0061579270 (ISBN13: 9780061579271)\r\n\r\nWhat Happened To Eden?\r\n\r\nThe New York Times bestselling author of Ahab's Wife, Four Spirits, and Abundance returns with a daring and provocative novel that envisions a world where science and faith contend for the allegiance of a new Adam &amp; Eve.\r\n\r\nHours before his untimely—and highly suspicious—death, world-renowned astrophysicist Thom Bergmann shares his discovery of extraterrestrial life with his wife, Lucy. Feeling that the warring world is not ready to learn of—or accept—proof of life elsewhere in the universe, Thom entrusts Lucy with his computer flash drive, which holds the keys to his secret work.\r\n\r\nDevastated by Thom's death, Lucy keeps the secret, but Thom's friend, anthropologist Pierre Saad, contacts Lucy with an unusual and dangerous request about another sensitive matter. Pierre needs Lucy to help him smuggle a newly discovered artifact out of Egypt: an ancient codex concerning the human authorship of the Book of Genesis. Offering a reinterpretation of the creation story, the document is sure to threaten the foundation of the Jewish, Christian, and Muslim religions . . . and there are those who will stop at nothing to suppress it.\r\n\r\nMidway through the daring journey, Lucy's small plane goes down on a slip of verdant land between the Tigris and Euphrates rivers in the Middle East. Burned in the crash landing, she is rescued by Adam, a delusional American soldier whose search for both spiritual and carnal knowledge has led to madness. Blessed with youth, beauty, and an unsettling innocence, Adam gently tends to Lucy's wounds, and in this quiet, solitary paradise, a bond between the unlikely pair grows. Ultimately, Lucy and Adam forsake their half-mythical Eden and make their way back toward civilization, where members of an ultraconservative religious cult are determined to deprive the world of the knowledge Lucy carries","torrent":{"xt":"urn:btih:ec87600081f61e5f289470f4ae6deb36e4d3a54e","amp;dn":"Adam+%26amp%3B+Eve+-+Sena+Jeter+Naslund+%28epub+%26amp%3B+mobi%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec87600081f61e5f289470f4ae6deb36e4d3a54e","infoHashBuffer":{"type":"Buffer","data":[236,135,96,0,129,246,30,95,40,148,112,244,174,109,235,54,228,211,165,78]},"announce":[],"urlList":[]}}