{"title":"Arms Dealer v11","uid":11356579,"size":103216221,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ecde2f87859568a2ec385008e68f290baf052403&amp;dn=Arms+Dealer+v11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Lamasu","files":-1,"time":1414950116,"description":"&quot;As a new arms dealer in the year 2025 you will bribe generals, build relationships, and trade over 300 real weapons. Hunted by 4 law enforcement agencies and compete with the top 10 arms dealers. You must find the best deals, rarest weapons and most useful vehicles to carry your goods.&quot;\n\nv11 changelog (29.10.2014):\n- Agency 1 is now active at the start which also allows The Bounty Hunters and The APA to become active later in game.\n- Sell price will now update after each weapon sell.\n- Updated pathfinding so traveling will take a shorter trip to and through countries and prevent impossible travel challenges.\n- Updated travel challenge distances and now have a leaderboard for the hardest challenges beaten.\n- Added button to hide story on story messages.\n- Can now press double escape to close all menus instead of escape only closing one at a time.\n- The world is no longer flat. Includes trans Pacific pathfinding, display, and travel challenges\n- Included Buy, Sell, and Ship maximum buttons.\n- Added several new sounds and ambient noises when zoomed in to locations on the map.\n- Added option box on sell screen to only display items you have on you.\n- Can now press the enter key while travel planning a private transport to move the menu back to the center of screen and begin the loading process.\n- Can now right click to remove a node and every node after it in a travel planned path.\n- Messages will now display for bribing a transport, canceling a bribed transport, and being unable to afford the bribe of a loaded departing transport.\n- Added a dropdown box for selecting resolution in addition to the input box for common resolutions as well as being able to use custom resolutions.\n- Added an option to help the player view the travel challenge in the travel planner.\n- You will now automatically travel with your yacht to the last location when it is selected as your private transport to travel.\n- Fixed a problem with agency ships never departing on a load game.\n- Adjusted difficulties of all travel challenges.\n- Fixed crash when game difficulty was harder than easy. \n\nIf you like the game, support the developer, buy it!     &lt;a href=&quot;\nhttp://store.steampowered.com/app/325630/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/325630/&lt;/a&gt;","torrent":{"xt":"urn:btih:ecde2f87859568a2ec385008e68f290baf052403","amp;dn":"Arms+Dealer+v11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecde2f87859568a2ec385008e68f290baf052403","infoHashBuffer":{"type":"Buffer","data":[236,222,47,135,133,149,104,162,236,56,80,8,230,143,41,11,175,5,36,3]},"announce":[],"urlList":[]}}