{"title":"Tony Hawks - Round Ireland with a Fridge - BBC Radio Audiobook -","uid":3825296,"size":64974362,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ed1bdf0c4de4bb3563462b774ddf400ce4a5c52a&amp;dn=Tony+Hawks+-+Round+Ireland+with+a+Fridge+-+BBC+Radio+Audiobook+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"khufu","files":10,"time":1191190743,"description":"Tony Hawks - Round Ireland With A Fridge - BBC Radio Audiobooks - cheops\n------------------------------------------------------------------------\n\nIn 1997, as a result of a drunken bet, Tony Hawks hitchhiked his way around Ireland with a fridge. Some of the highlights of this memorable voyage are recalled by the author.\n\nOn his only prior visit to Ireland, songwriter/comic Tony Hawks had seen a man hitchhiking with a refrigerator. For years, he was wont to tell the tale during late-night drinking matches, and after one particularly heavy-duty night of partying, he awoke to find a bet scrawled pillow-side: a friend wagered 100 pounds that Hawks wouldn&amp;#039;t travel Ireland for a month with a refrigerator at his side.\n\nOut of this stupid premise, a ridiculously amusing book was born. Quickly discovered by the Irish media, the thumbing Englishman finds that he and his box fridge are elevated to celebrity status, and there&amp;#039;s no dearth of rides, places to stay or goofy people to meet, from kings to spoons players to locals who take his fridge surfing. As insightful about the strange inner workings of Hawk&amp;#039;s mind as it is about charming peculiarities of Irishmen--it&amp;#039;s doubtful that Hawks would have been similarly embraced by Germans, Italians, or the French--Round Ireland with a Fridge is an entirely silly, heart-warming tale told in a rollicking funny and refreshing style.\n\nFive episodes of approximately 15 minutes each in high quality MP3.\n\n---------------------\nType : mpeg 1 layer III\nBitrate : 128\nMode : joint stereo\nFrequency : 48000 Hz\nEncoder : Lame 3.96\n---------------------\n\n/c Ubuntu+MythTV+LAME+DVB-T=MP3 http://cheops.fm","torrent":{"xt":"urn:btih:ed1bdf0c4de4bb3563462b774ddf400ce4a5c52a","amp;dn":"Tony+Hawks+-+Round+Ireland+with+a+Fridge+-+BBC+Radio+Audiobook+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed1bdf0c4de4bb3563462b774ddf400ce4a5c52a","infoHashBuffer":{"type":"Buffer","data":[237,27,223,12,77,228,187,53,99,70,43,119,77,223,64,12,228,165,197,42]},"announce":[],"urlList":[]}}