{"title":"Glengarry Glen Ross","uid":3538796,"size":734404608,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ed28ec3444d1a67b7288cd0469f596df520f1738&amp;dn=Glengarry+Glen+Ross&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"thermalrearrangement","files":1,"time":1160759916,"description":"Glengarry Glen Ross, based on the 1984 Pulitzer Prize and Tony-winning play of the same name by David Mamet, who adapted it into a screenplay for the film. The film shows parts of two days in the lives of four desperate real estate agents (Pacino, Lemmon, Harris and Arkin) who are prepared to engage in any number of unethical and/or illegal acts (from lies and flattery to bribery, threats and intimidation to burglary) in order to sell undesirable real estate to unwilling prospective buyers (&quot;leads&quot;) while the put upon office manager (Spacey) awaits for them to make their sale after the hardnosed corporate boss (Baldwin) gives marching orders to do their jobs.\n\nThe title refers to Glengarry Highlands and Glen Ross Farms, two properties mentioned in the movie.\n\nThe film, like the play, is notorious for its use of profanity. The word &quot;fuck&quot; is used in the script a total of 138 times during the 100 minute long movie and the word &quot;shit&quot; is used 50 times, leading the cast to jokingly refer to the film as &quot;Death of a Fucking Salesman.&quot;\n-- Wikipedia","torrent":{"xt":"urn:btih:ed28ec3444d1a67b7288cd0469f596df520f1738","amp;dn":"Glengarry+Glen+Ross","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed28ec3444d1a67b7288cd0469f596df520f1738","infoHashBuffer":{"type":"Buffer","data":[237,40,236,52,68,209,166,123,114,136,205,4,105,245,150,223,82,15,23,56]},"announce":[],"urlList":[]}}