{"title":"Journey - Original Album Classics [3 CD's][2011][320 KBPS]","uid":10325858,"size":290914126,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ed614ea0ff94d1add682a2a2c41cf29e34decbb4&amp;dn=Journey+-+Original+Album+Classics+%5B3+CD%27s%5D%5B2011%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"LameDuck69","files":34,"time":1402357818,"description":"Journey - Original Album Classics [3 CD's][2011]\n\n\n\n\n\nDisc 1  \n\n\n01. Of A Lifetime  \n02. In The Morning Day  \n03. Kohoutek  \n04. To Play Some Music  \n05. Topaz  \n06. In My Lonely Feeling/Conversations  \n07. Mystery Mountain \n\n\n \nDisc 2 \n \n01. On A Saturday Nite  \n02. It's All Too Much  \n03. Anyway  \n04. She Makes Me (Feel Alright)  \n05. You're On Your Own  \n06. Look Into The Future  \n07. Midnight Dreamer  \n08. I'm Gonna Leave You \n\n\n \nDisc 3 \n\n \n01. Spaceman  \n02. People  \n03. I Would Find You  \n04. Here We Are  \n05. Hustler  \n06. Next  \n07. Nickel &amp; Dime  \n08. Karma  \n\n\n\n\n\n320 KBPS [CBR]\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nJourney is an American rock band formed in San Francisco in 1973 by former members of Santana and Frumious Bandersnatch. The band has gone through several phases; its strongest commercial success occurred between 1978 and 1987, after which it temporarily disbanded. During that period, the band released a series of hit songs, including 1981's &quot;Don't Stop Believin'&quot;, which in 2009 became the top-selling catalog track in iTunes history. Its parent studio album, Escape, the band's eighth and most successful, reached No. 1 on the Billboard 200 and yielded another of their most popular singles, &quot;Open Arms&quot;. Its 1983 follow-up, Frontiers, was almost as successful in the United States, reaching No. 2 and spawning several successful singles; it broadened the band's appeal in the United Kingdom, where it reached No. 6 on the UK Albums Chart. Journey enjoyed a successful reunion in the mid-1990s, and later regrouped with a series of lead singers.\n\nSales have resulted in two gold albums, eight multi-platinum albums, and one diamond album (including seven consecutive multi-platinum albums between 1978 and 1987). They have had eighteen Top 40 singles in the US (the second most without a Billboard Hot 100 number one single behind Electric Light Orchestra with 20) six of which reached the Top 10 of the US chart and two of which reached No. 1 on other Billboard charts, and a No. 6 hit on the UK Singles Chart in &quot;Don't Stop Believin'&quot;. Originally a progressive rock band, Journey was described by Allmusic as having cemented a reputation as &quot;one of America's most beloved (and sometimes hated) commercial rock/pop bands&quot; by 1978, when they redefined their sound by embracing traditional pop arrangements on their fourth album, Infinity. According to the Recording Industry Association of America, Journey has sold 47 million albums in the US, making them the 28th best selling band. Their worldwide sales have reached over 75 million records, making them one of the world's best-selling bands of all time. A 2005 USA Today opinion poll named Journey the fifth best American rock band in history. Their songs have become arena rock staples and are still played on rock radio stations across the world.\n\n-----------------------------------------------------------------------------------\n\nJourney's self-titled debut album, Journey, was released in 1975 on Columbia Records. Unlike their later recordings, this is a progressive rock album which focuses mainly on the band's instrumental talents. It is the only album to include rhythm guitarist George Tickner among their personnel.\n\nJourney features progressive rock tracks like &quot;Of a Lifetime&quot;, &quot;Kohoutek&quot;, &quot;Topaz&quot; and fan favorite, &quot;Mystery Mountain&quot;.\n\nJourney recorded a demo album prior to the release of the self-titled Journey album, with the same songs, in different order and with Prairie Prince as the drummer. There were additional tracks, including additional instrumental pieces, that did not make it to the final product. One of which was the original title track of the demo album &quot;Charge of the Light Brigade&quot;.\n\n-----------------------------------------------------------------------------------\n\nJourney's second album, Look into the Future, was released in January 1976 on Columbia Records.\n\nFor their second album, the members of Journey toned down the overt progressiveness of their first, self-titled release, in favor of a more focused approach. Despite that, Look into the Future still retains some of the experimental approach and sound of the debut,[1] especially in the title track and &quot;I'm Gonna Leave You&quot;, the latter of which some claim inspired the main riff in the famous Kansas song &quot;Carry on Wayward Son&quot;. The album features a cover version of The Beatles' &quot;It's All Too Much&quot; from the 1968 Yellow Submarine film and 1969 soundtrack. The title track was the longest recorded Journey song until 1980, when &quot;Destiny&quot; from Dream, After Dream would claim that honor.\n\nGuitarist George Tickner had left the band, leaving members Gregg Rolie (lead vocals/keyboards), Neal Schon (guitar), Ross Valory (bass), and Aynsley Dunbar (drums), yet after having co-written two songs for this album.\n\n-----------------------------------------------------------------------------------\n\nNext is the third studio album by Journey, released in 1977. The band continued the formula from 1976's Look into the Future but this album also retains some of their progressive rock style from the first album.\n\nThe instrumental titled &quot;Cookie Duster&quot; was listed in very early pressings of the album, though not actually included on the pressings, and then not listed on the cover art at all. It was later released on their TimeÂ³ compilation album.\n\nNext reached #85 on the Billboard 200 Albums charts.\n\nAlthough he did not contribute to Next, lead-vocalist Robert Fleischman joined Journey shortly after the album's release as a songwriter and the group's first dedicated frontman, sharing lead-vocal duties with founding bandmember Gregg Rolie during subsequent live shows.\n\n-----------------------------------------------------------------------------------\n\nBand Members:\n\n\nGregg Rolie: keyboards, lead vocals, producer\n\nNeal Schon: acoustic and electric guitar, lead vocals, producer\n\nRoss Valory: bass guitar, backing vocals, producer\n\nAynsley Dunbar: drums, percussion, producer\n\n\n\n\n","torrent":{"xt":"urn:btih:ed614ea0ff94d1add682a2a2c41cf29e34decbb4","amp;dn":"Journey+-+Original+Album+Classics+%5B3+CD%27s%5D%5B2011%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed614ea0ff94d1add682a2a2c41cf29e34decbb4","infoHashBuffer":{"type":"Buffer","data":[237,97,78,160,255,148,209,173,214,130,162,162,196,28,242,158,52,222,203,180]},"announce":[],"urlList":[]}}