{"title":"Too Good to Leave Too Bad to Stay - M Kirshenbaum - epub azw3 -","uid":11462040,"size":1112285,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed772ccfbe61effed68f95fdbd2aad6b78c88ea4&amp;dn=Too+Good+to+Leave+Too+Bad+to+Stay+-+M+Kirshenbaum+-+epub+azw3+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":-1,"time":1415998832,"description":"\nToo Good to Leave, Too Bad to Stay\n\nDid you know that at least twenty percent of people in relationships are stuck because they can't decide whether to commit to their relationship once and for all or finally leave it?\n\nYou deserve the happiness you've been searching for. Too Good to Leave, Too Bad to Stay is the best-selling, most honored book for helping you discover the truth of your relationship. It's reputation comes from simple but comprehensive questions and guidelines that will help you see quickly and clearly, once and for all, what's best for you.\n\nWith a friendly, no-nonsense style, thoroughly tested advice, compelling stories, and engaging personal revelations, this book contains only good news.\n\nNothing's worse than the ambivalence you've been stuck in. If it turns out to be best for you to stay, you'll have the satisfying experience of facing all the important issues and knowing your relationship is truly too good to leave. And if it turns out, based on the evidence, that you'll be happiest leaving, you'll get the reassurance that comes from finally understanding why your relationship has been too bad to stay in. And you'll be freed up to move on to a new and better life.\n\nFor many people this classic book also offers a priceless opportunity to discover the strengths and weaknesses of their relationship.\n\nIt's also useful in deciding whether to make a commitment to an existing relationship","torrent":{"xt":"urn:btih:ed772ccfbe61effed68f95fdbd2aad6b78c88ea4","amp;dn":"Too+Good+to+Leave+Too+Bad+to+Stay+-+M+Kirshenbaum+-+epub+azw3+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed772ccfbe61effed68f95fdbd2aad6b78c88ea4","infoHashBuffer":{"type":"Buffer","data":[237,119,44,207,190,97,239,254,214,143,149,253,189,42,173,107,120,200,142,164]},"announce":[],"urlList":[]}}