{"title":"Daniel Boyarin - Jewish History &amp; Rabbinic Culture (7 books)","uid":10128027,"size":66686469,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:edbcd996c20cbd5833cd279cba1bf41659d0163b&amp;dn=Daniel+Boyarin+-+Jewish+History+%26amp%3B+Rabbinic+Culture+%287+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"workerbee","files":-1,"time":1399802579,"description":"\nDANIEL BOYARIN (b. 1946) is a historian of religion and the recipient of numerous awards and fellowships.  He works at the intersection of tradition and novelty, offering bold and controversial readings of traditional religious and philosophical texts.  His works explore the relationship between Judaism and modern streams of thought such as psychoanalysis and queer studies.  A discussion of the merits of Boyarin's scholarship is featured in the opening scene of Joseph Cedar's Oscar-nominated film &quot;Footnote&quot; (2011).\n\nIn DYING FOR GOD (1999) and BORDER LINES (2004), Boyarin develops a revised understanding of the interactions between nascent Christianity and Judaism in late antiquity, interpreting the two &quot;new&quot; religions as intensely and complexly intertwined throughout this period.\n\nTHE JEWISH GOSPELS (2012) makes a powerful case that our conventional understandings of Jesus and of the origins of Christianity are wrong.  In Boyarin's scrupulously illustrated account, the coming of the Messiah was fully imagined in the ancient Jewish texts; Jesus, moreover, was embraced by many Jews as this person, and his core teachings were not at all a break from Jewish beliefs and teachings.  What came to be known as Christianity came much later, as religious and political leaders sought to impose a new religious orthodoxy that was not present at the time of Jesus's life.\n\nSPARKS OF THE LOGOS (2003), a collection of previously published essays, explores various aspects of rabbinic culture and their relation to hermeneutic practices.  POWERS OF DIASPORA (2002) focuses on Jewish experience and forcefully argues that diasporic communities exercise a distinct form of cultural power in order to maintain themselves.  SOCRATES AND THE FAT RABBIS (2009) draws on the work of Mikhail Bakhtin to explore the dialogic structure in Plato and the Babylonian Talmud. \n\nAlso included in this collection are 28 miscellaneous articles and book reviews discussing a wide variety of topics, including circumcision, Freud, Foucault, Edward Said, biblical narratology, midrashic and talmudic hermeneutics, among many others.\n\n\nThe following books are in PDF format unless otherwise noted:\n\n* BORDER LINES: The Partition of Judaeo-Christianity (University of Pennsylvania Press, 2004)\n\n* DYING FOR GOD: Martyrdom and the Making of Christianity and Judaism (Stanford University Press, 1999)\n\n* THE JEWISH GOSPELS: The Story of the Jewish Christ (New Press, 2012) -- ePUB\n\n* POWERS OF DIASPORA: Two Essays on the Relevance of Jewish Culture [with Jonathan Boyarin] (University of Minnesota Press, 2002)\n\n* QUEER THEORY AND THE JEWISH QUESTION [edited with Daniel Itzkovitz and Ann Pellegrini] (Columbia University Press, 2003)\n\n* SOCRATES AND THE FAT RABBIS (University of Chicago Press, 2009)\n\n* SPARKS OF THE LOGOS: Essays in Rabbinic Hermeneutics (Brill, 2003)\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                  &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n\n","torrent":{"xt":"urn:btih:edbcd996c20cbd5833cd279cba1bf41659d0163b","amp;dn":"Daniel+Boyarin+-+Jewish+History+%26amp%3B+Rabbinic+Culture+%287+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edbcd996c20cbd5833cd279cba1bf41659d0163b","infoHashBuffer":{"type":"Buffer","data":[237,188,217,150,194,12,189,88,51,205,39,156,186,27,244,22,89,208,22,59]},"announce":[],"urlList":[]}}