{"title":"Headscarves and Hymens Why the Middle East Needs a Sexual Revol","uid":15719852,"size":163346086,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ee212ee74df742a54d8c896e00c17ef52e998d48&amp;dn=Headscarves+and+Hymens+Why+the+Middle+East+Needs+a+Sexual+Revol&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":9,"time":1472666401,"description":"The journalist Mona Eltahawy is no stranger to controversy. Through her articles and actions she has fought for the autonomy, security, and dignity of Muslim women, drawing vocal supporters and detractors. Now, in her first book, Headscarves and Hymens, Eltahawy has prepared a definitive condemnation of the repressive forces--political, cultural, and religious--that reduce millions of women to second-class citizens.\r\n\r\nDrawing on her years as a campaigner for and commentator on women's issues in the Middle East, she explains that since the Arab Spring began in 2010, women in the Arab world have had two revolutions to undertake: one fought alongside men against oppressive regimes, and another fought against an entire political and economic system that represses women in Egypt, Saudi Arabia, Tunisia, Libya, Yemen, and other nations.\r\n\r\nEltahawy has traveled across the Middle East and North Africa, meeting with women and listening to their stories. Her book is a plea for outrage and action on their behalf, confronting a &quot;toxic mix of culture and religion that few seem willing or able to disentangle lest they blaspheme or offend.&quot; A manifesto motivated by hope and fury in equal measure, Headscarves and Hymens is as illuminating as it is incendiary","torrent":{"xt":"urn:btih:ee212ee74df742a54d8c896e00c17ef52e998d48","amp;dn":"Headscarves+and+Hymens+Why+the+Middle+East+Needs+a+Sexual+Revol","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee212ee74df742a54d8c896e00c17ef52e998d48","infoHashBuffer":{"type":"Buffer","data":[238,33,46,231,77,247,66,165,77,140,137,110,0,193,126,245,46,153,141,72]},"announce":[],"urlList":[]}}