{"title":"Kopfstand (1981) starring Christoph Waltz","uid":15744664,"size":917912058,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ee2684005181393a2e8f875d69d06dd17b946c88&amp;dn=Kopfstand+%281981%29+starring+Christoph+Waltz&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"hyasynth","files":3,"time":1472956179,"description":"In one of his earliest film roles, Christoph Waltz plays the role of Markus Dorn, a young man who is clearly unhappy in his home life. \r\n\r\nHis mother has a boyfriend he does not like, and she has chosen her paramour over her son's happiness. Markus comes in late one evening, and in what is clearly one of many arguments, he antagonizes his mother who accuses him of being on drugs. She calls the police as the argument escalates, and they take him from his bed to the police station, where his refusal to cooperate ends up with him being sent to an asylum for being mentally unbalanced. \r\n\r\nMarkus has no mental disorder. Quite the contrary, he is acting out in an appropriate way for a young man of his age who had been neglected and lacked a nurturing mother and father figure. In the asylum, however, his attitude and refusals to 'go along' with the corrupt head doctor's evaluations, lands him undergoing brutal electroshock therapy repeatedly as a punishment. The descent into hell is furthered along by the other inmates, who befriend Markus and encourage him to stay strong and just go along with things so he will be released. \r\n\r\nIt is not until a new doctor comes to the asylum and determines Markus to be sane, and the head doctor corrupt, he is given his freedom. However, his time in the asylum has led him to become damaged in many physical and mental ways, and it is only through his friendship with an older widow that he begins the path to redemption.\r\n\r\n\r\n\r\n\r\n\r\nGerman language film with English subtitles","torrent":{"xt":"urn:btih:ee2684005181393a2e8f875d69d06dd17b946c88","amp;dn":"Kopfstand+%281981%29+starring+Christoph+Waltz","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee2684005181393a2e8f875d69d06dd17b946c88","infoHashBuffer":{"type":"Buffer","data":[238,38,132,0,81,129,57,58,46,143,135,93,105,208,109,209,123,148,108,136]},"announce":[],"urlList":[]}}