{"title":"A Digital Phase Locked Loop based Signal and Symbol Recovery","uid":11713443,"size":10931721,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eeeddabf6f84d885ba910836d86a69292899dbce&amp;dn=A+Digital+Phase+Locked+Loop+based+Signal+and+Symbol+Recovery&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"zombie_rox","files":1,"time":1424390896,"description":"The book reports two approaches of implementation of the essential components of a Digital Phase Locked Loop based system for dealing with wireless channels showing Nakagami-m fading. It is mostly observed in mobile communication. In the first approach, the structure of a Digital phase locked loop (DPLL) based on Zero Crossing (ZC) algorithm is proposed. In a modified form, the structure of a DPLL based systems for dealing with Nakagami-m fading based on Least Square Polynomial Fitting Filter is proposed, which operates at moderate sampling frequencies. A sixth order Least Square Polynomial Fitting (LSPF) block and Roots Approximator (RA) for better phase-frequency detection has been implemented as a replacement of Phase Frequency Detector (PFD) and Loop Filter (LF) of a traditional DPLL, which has helped to attain optimum performance of DPLL. The results of simulation of the proposed DPLL with Nakagami-m fading and QPSK modulation is discussed in detail which shows that the proposed method provides better performance than existing systems of similar type.\n\nProduct Description\nFrom the Back Cover\n\nThe book reports two approaches of implementation of the essential components of a Digital Phase Locked Loop based system for dealing with wireless channels showing Nakagami-m fading. It is mostly observed in mobile communication. In the first approach, the structure of a Digital phase locked loop (DPLL) based on Zero Crossing (ZC) algorithm is proposed. In a modified form, the structure of a DPLL based systems for dealing with Nakagami-m fading based on Least Square Polynomial Fitting Filter is proposed, which operates at moderate sampling frequencies. A sixth order Least Square Polynomial Fitting (LSPF) block and Roots Approximator (RA) for better phase-frequency detection has been implemented as a replacement of Phase Frequency Detector (PFD) and Loop Filter (LF) of a traditional DPLL, which has helped to attain optimum performance of DPLL. The results of simulation of the proposed DPLL with Nakagami-m fading and QPSK modulation is discussed in detail which shows that the proposed method provides better performance than existing systems of similar type.\nAbout the Author\nMr. Basab Bijoy Purkayastha is currently working as Technical Superintendent in the Department of Physics, Indian Institute of Technology Guwahati, India. He has completed MSc in Electronics Science from Gauhati University, India in 2002. He also completed M.Tech from the same institution in 2012 with specialization in Mobile Communication and DPLL based Design. He has around 10 research papers published in international conference proceedings and journals.\n\nDr. Kandarpa Kumar Sarma, currently Associate Professor in Department of Electronics and Communication Technology, Gauhati University, Guwahati, Assam, India, has over seventeen years of professional experience. He has covered all areas of UG/PG level electronics courses including soft computing, mobile communication, digital signal and image processing. He obtained MTech degree in Signal Processing from Indian Institute of Technology Guwahati in 2005 and subsequently completed PhD programme in the area of Soft-Computational Application in Mobile Communication. He has authored seven books, several book chapters, around three hundred peer reviewed research papers in international conference proceedings and journals. His areas of interest are Soft-Computation and its Applications, Mobile Communication, Antenna Design, Speech Processing, Document Image Analysis and Signal Processing Applications in High Energy Physics, Neuro-computing and Computational Models for Social-Science Applications. He is senior member IEEE (USA), Fellow IETE (India), Member International Neural Network Society (INNS, USA), Life Member ISTE (India) and Life Member CSI (India). He serves as an Editor-in-Chief of International Journal of Intelligent System Design and Computing (IJISDC, UK), guest editor of several international journals, reviewer of over thirty international journals and over hundred international conferences.\n\nPublisher: Springer; 2015 edition (17 February 2015)\nLanguage: English\nISBN-10: 8132220404\nISBN-13: 978-8132220404","torrent":{"xt":"urn:btih:eeeddabf6f84d885ba910836d86a69292899dbce","amp;dn":"A+Digital+Phase+Locked+Loop+based+Signal+and+Symbol+Recovery","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eeeddabf6f84d885ba910836d86a69292899dbce","infoHashBuffer":{"type":"Buffer","data":[238,237,218,191,111,132,216,133,186,145,8,54,216,106,105,41,40,153,219,206]},"announce":[],"urlList":[]}}