{"title":"Fastball - All the Pain Money Can Buy [1998]","uid":9640004,"size":304029073,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:efcda929da060d8b1c2c6c9ff960abbdab012f25&amp;dn=Fastball+-+All+the+Pain+Money+Can+Buy+%5B1998%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GenXRock","files":-1,"time":1392908752,"description":"Review by Greg Prato\nWhen compared to their previous album (the 1996 debut Make Your Mama Proud), Fastball's All the Pain Money Can Buy shows that the group was steadily improving and honing its AAA/roots rock sound. The biggest difference between All the Pain Money Can Buy and their debut is that by spicing up their songs with horns and classic synthesizer sounds, Fastball created an album with greater musical variety. Produced by Julian Raymond and the band, the disc recalls the sound and approach of classic '70s rock, with the group stressing feel over precision. That doesn't stop the band from updating its vintage rock with '90s technology and sounds, however, as proven by the presence of a beatbox in the album's opener, &quot;The Way.&quot; One of the best tracks, the laid-back and groovy &quot;Which Way to the Top?,&quot; is a duet between Fastball's Miles Zuniga and female solo artist Poe. The horn section featured on the upbeat &quot;G.O.D. (Good Old Days)&quot; recalls early-period Chicago, while the band tackles the singer/songwriter genre of days past on &quot;Out of My Head&quot; with a mellow organ sound and introspective lyrics. If you like your classic rock with a little more grit and experimentation, Fastball are wholeheartedly recommended. (3/5)","torrent":{"xt":"urn:btih:efcda929da060d8b1c2c6c9ff960abbdab012f25","amp;dn":"Fastball+-+All+the+Pain+Money+Can+Buy+%5B1998%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efcda929da060d8b1c2c6c9ff960abbdab012f25","infoHashBuffer":{"type":"Buffer","data":[239,205,169,41,218,6,13,139,28,44,108,159,249,96,171,189,171,1,47,37]},"announce":[],"urlList":[]}}