{"title":"The New Catholic Encyclopedia, 2nd Edition (15 Volume Set+Supple","uid":9911170,"size":272283626,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f0a2dfd17b2edb064dcbac0f0fbf0ef4e1bad4f0&amp;dn=The+New+Catholic+Encyclopedia%2C+2nd+Edition+%2815+Volume+Set%2BSupple&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Djofullinn","files":-1,"time":1396899949,"description":"From Library Journal\nPublished jointly by the Catholic University of America and the Gale Group, this 15-volume reference is a monumental success, destined to be the single comprehensive reference resource on Catholicism. The encyclopedia was first published in 1967 and updated with several supplemental volumes, but the current publishers have created a thoroughly new work by deleting, adding, expanding, and clarifying nearly 12,000 individual articles. Arranged alphabetically, the entries offer up-to-date commentary on the multifaceted religious body of one billion adherents, from its foundations in Judaism to the papacy of John Paul II. A retired professor of religion at Catholic University, Reverend Marthaler accepted the Herculean task of executive editor, working with 200 other distinguished faculty, experts, and religious practitioners worldwide. Their contributions in such fields as ethics, anthropology, spirituality, Scripture, civil law, and the social sciences bring balance and a healthy dose of passion to the text. Readers will find both statistical and cultural information about the Catholic Church in countries such as Afghanistan, Iraq, and Zimbabwe, as well as an entry for almost every Catholic diocese and religious organization in the United States. Exhaustive treatment is given to biblical studies, Christology, liturgical practice, and Byzantine Christianity, and ethical and moral issues of euthanasia, abortion, homosexuality, and the human genome are discussed. Also, since Catholicism doesn't exist in isolation, consideration is given to the world's leading religions of Buddhism, Judaism, Hinduism, and Islam, and ecumenical relations with Orthodoxy and Protestant traditions are treated with respect and sensitivity. The individual bibliographies have been expanded and updated for almost every article, and appropriately selected photographs, maps, and tables are included as well. With extensive cross references, a readable two-column layout, and a sturdy binding that will last another 40 years, the encyclopedia is recommended for all libraries. (Volume 15, the index, was not available at the time of this review.)-John-Leonard Berg, Univ. of Wisconsin Lib., Platteville\nCopyright 2002 Reed Business Information, Inc. ","torrent":{"xt":"urn:btih:f0a2dfd17b2edb064dcbac0f0fbf0ef4e1bad4f0","amp;dn":"The+New+Catholic+Encyclopedia%2C+2nd+Edition+%2815+Volume+Set%2BSupple","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0a2dfd17b2edb064dcbac0f0fbf0ef4e1bad4f0","infoHashBuffer":{"type":"Buffer","data":[240,162,223,209,123,46,219,6,77,203,172,15,15,191,14,244,225,186,212,240]},"announce":[],"urlList":[]}}