{"title":"Badfinger - Straight Up (1971) FLAC","uid":7294817,"size":421374086,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f0f17bcd486e4607f082e38e878f5e24b657785a&amp;dn=Badfinger+-+Straight+Up+%281971%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Let it rock","files":22,"time":1337851839,"description":"STRAIGHT UP is Badfinger's best-known album and perhaps the definitive example of their sparkling brand of Beatles-influenced pop. Expertly produced by George Harrison and Todd Rundgren, this 1972 album spawned two hit singles (both written by group leader Pete Ham): the romantic ballad &quot;Day After Day&quot; (Badfinger's only gold record) and &quot;Baby Blue,&quot; a soaring power pop classic that is still regularly played on rock radio. Most people remember Badfinger for those two songs, but the 10 other tracks on STRAIGHT UP are equally impressive.\n\nLess rock-oriented than their previous album NO DICE (although guitarist Joey Molland contributes several excellent high-energy rock songs like &quot;Sometimes&quot; and &quot;Suitcase&quot;), the majority of STRAIGHT UP consists of gentle, melodic songs like Molland's folkish &quot;Sweet Tuesday Morning&quot; and superb Pete Ham compositions like the epic existentialist ballad &quot;Name Of The Game.&quot; Now reissued with alternate versions of five of the album's songs and a rare single version of &quot;Baby Blue,&quot; STRAIGHT UP sounds better than ever and is an essential addition to any rock fan's music collection.\n\n\nReleased - Dec 13, 1971 on Apple Records. Produced by Todd Rundgren and George Harrison \n\nPete Ham - Lead and Backing Vocals, Vocal Harmonies, Electric, Acoustic &amp; Slide Guitars, Keyboards\nJoey Molland - Electric and Acoustic Guitars, Vocal Harmonies, Lead and Backing Vocals\nTom Evans - Bass, Vocal Harmonies, Lead and Backing Vocals, Rhythm Guitar\nMike Gibbins - Drums\n\nAdditional Personnel: \n\nGeorge Harrison - Slide Guitar on &quot;Day After Day&quot;\nLeon Russell - Piano on &quot;Day After Day&quot;\nAl Kooper - Piano on &quot;Name Of The Game&quot;\n","torrent":{"xt":"urn:btih:f0f17bcd486e4607f082e38e878f5e24b657785a","amp;dn":"Badfinger+-+Straight+Up+%281971%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0f17bcd486e4607f082e38e878f5e24b657785a","infoHashBuffer":{"type":"Buffer","data":[240,241,123,205,72,110,70,7,240,130,227,142,135,143,94,36,182,87,120,90]},"announce":[],"urlList":[]}}