{"title":"Why Size Matters: From Bacteria to Blue Whales","uid":8682359,"size":2479921,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f185d0dc5e36bc302088026fb19c3ed7d7cdad5f&amp;dn=Why+Size+Matters%3A+From+Bacteria+to+Blue+Whales&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1373730369,"description":"\nJohn Tyler Bonner, &quot;Why Size Matters: From Bacteria to Blue Whales&quot;\nISBN: 0691128502 | 2006 | EPUB\n\nJohn Tyler Bonner, one of our most distinguished and creative biologists, here offers a completely new perspective on the role of size in biology. In his hallmark friendly style, he explores the universal impact of being the right size. By examining stories ranging from Alice in Wonderland to Gulliver's Travels, he shows that humans have always been fascinated by things big and small. Why then does size always reside on the fringes of science and never on the center stage? Why do biologists and others ponder size only when studying something else--running speed, life span, or metabolism?\n\nWhy Size Matters, a pioneering book of big ideas in a compact size, gives size its due by presenting a profound yet lucid overview of what we know about its role in the living world. Bonner argues that size really does matter--that it is the supreme and universal determinant of what any organism can be and do. For example, because tiny creatures are subject primarily to forces of cohesion and larger beasts to gravity, a fly can easily walk up a wall, something we humans cannot even begin to imagine doing.\n","torrent":{"xt":"urn:btih:f185d0dc5e36bc302088026fb19c3ed7d7cdad5f","amp;dn":"Why+Size+Matters%3A+From+Bacteria+to+Blue+Whales","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f185d0dc5e36bc302088026fb19c3ed7d7cdad5f","infoHashBuffer":{"type":"Buffer","data":[241,133,208,220,94,54,188,48,32,136,2,111,177,156,62,215,215,205,173,95]},"announce":[],"urlList":[]}}