{"title":"Caesars Messiah-The Roman Conspiracy To Invent Jesus.pdf","uid":10154887,"size":2406127,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f1d88912858684f3c4bf3abb72a69daf8b7823e7&amp;dn=Caesars+Messiah-The+Roman+Conspiracy+To+Invent+Jesus.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Djofullinn","files":-1,"time":1400149081,"description":"Was Jesus the invention of a Roman emperor? The author of this ground-breaking book believes he was. &quot;Caesar's Messiah&quot; reveals the key to a new and revolutionary understanding of Christian origins.\n\nThe clues leading to its startling conclusions are found in the writings of the first-century historian Flavius Josephus, whose &quot;War of the Jews&quot; is one of the only historical chronicles of this period. Closely comparing the work of Josephus with the New Testament Gospels, &quot;Caesar's Messiah&quot; demonstrates that the Romans directed the writing of both. Their purpose: to offer a vision of a &quot;peaceful Messiah&quot; who would serve as an alternative to the revolutionary leaders who were rocking first-century Israel and threatening Rome.\n\nSimilarly, &quot;Caesar's Messiah&quot; will rock our understanding of Christian history as it reveals that Jesus was a fictional character portrayed in four Gospels written not by Christians but Romans.\n\nAbout the Author\nJoseph Atwill is the author of &quot;The Roman Origin of Christianity&quot; and &quot;Caesar's Messiah&quot;. A German edition of &quot;Caesar's Messiah&quot; has been published by Ullstein under the title: &quot;Das Messias Ratsel - (The Messiah Puzzle)&quot; and will be released in September, 2008. \n\n","torrent":{"xt":"urn:btih:f1d88912858684f3c4bf3abb72a69daf8b7823e7","amp;dn":"Caesars+Messiah-The+Roman+Conspiracy+To+Invent+Jesus.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1d88912858684f3c4bf3abb72a69daf8b7823e7","infoHashBuffer":{"type":"Buffer","data":[241,216,137,18,133,134,132,243,196,191,58,187,114,166,157,175,139,120,35,231]},"announce":[],"urlList":[]}}