{"title":"Philosophy Now - September.October 2012 (gnv64)","uid":7684456,"size":28628499,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f1f19295466d398e9c2c61dfe486f6ff3b4f8c32&amp;dn=Philosophy+Now+-+September.October+2012+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gnv65","files":-1,"time":1348910332,"description":"Philosophy Now - September/October 2012\nEnglish | 56 pages | PDF | 27.3 mb\n\nEDITORIAL &amp; NEWS\n4 All or Nothing Anja Steinbauer\n5 News In Brief\n\nPHILOSOPHERS ON PHILOSOPHY\n6 Philosophy and the Two-Sided Brain - Carol Nicholson an logic vs artistry in approaches to philosophy\n9 Philosophy Inc. - Christopher Morris laments the state of academic philosophy.\n13 Experimental Philosophy as an Elephant - Mark Phelan tackles some beastly myopic misconceptions\n17 The Journey - Emery Cournand tells us how he got into Western philosophy, and what he got out of it\n18 A Farewell Letter To My Students John Corcoran looks back on a life of logic\n\nOTHER ARTICLES\n19 John Rawls and Justice - Helen McCabe considers problems in Rawls' Utopia\n22 Is God Irish? - Roger McCann asks if logic can help us answer the God question\n26 Brief Lives: C.S. Peirce - Alistair MacFarlane on one of the greatest American philosophers\n28 The Limits of Authenticity - Ben G. Yacobi considers the difficulties of being true to yourself\n31 Authenticity: Keeping It Real And Then Some - Leigh Roche illustrates authenticity from a skateboard\n33 A Dialogue on Metaphysics - Dale Jacquette on the origin of the Universe\n\nREVIEWS\n42 Film: Let The Right One In\nColin Brookes has issues of blood with vampires\n44 Book: Language:The Cultural Tool by Daniel Everett reviewed by Antony Tomlinson\n45 Book: Ethics For A Broken World by Tim Mulgan reviewed by Alfred Archer\n46 Book: Philosophers by Steve Pyke reviewed by Constantine Sandis\n\nREGULARS\n33 Letters to the Editor\n37 Ethical Episodes: Forbidden Fruit - Joel Marks asks how far comedians can ethically go\n38 Question of the Month: What's the most important question? This issue, our readers get to ask their own questions\n48 Tallis in Wonderland: Did Time Begin With A Bang? Raymond Tallis finds the beginning of time doubly problematic\n\nFICTION &amp; POETRY\n52 Kugelman the Tumler A short stoiy by Ron Pies\n54 Giordano Bruno's Journey To London - Armando Halpern follows a philosophical martyr's path","torrent":{"xt":"urn:btih:f1f19295466d398e9c2c61dfe486f6ff3b4f8c32","amp;dn":"Philosophy+Now+-+September.October+2012+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1f19295466d398e9c2c61dfe486f6ff3b4f8c32","infoHashBuffer":{"type":"Buffer","data":[241,241,146,149,70,109,57,142,156,44,97,223,228,134,246,255,59,79,140,50]},"announce":[],"urlList":[]}}