{"title":"Bill Medley &amp; Jennifer Warnes-(I've Had) The Time Of My Life","uid":5151607,"size":175986692,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f206455036489dc6f520cdbd6b7f7fb0dc05383d&amp;dn=Bill+Medley+%26+Jennifer+Warnes-%28I%5C%27ve+Had%29+The+Time+Of+My+Life&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"2nafish","files":-1,"time":1257552481,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;(I've Had) The Time of My Life&quot; is a song composed by Franke Previte, John DeNicola, and Donald Markowitz. It was recorded by Bill Medley and Jennifer Warnes, after having been selected to be the finale song for the 1987 film Dirty Dancing by choreographer Kenny Ortega and his assistant Miranda Garrison (who also played Vivian in the film).\n\nDue to the massive success of Dirty Dancing, the single topped the Billboard Hot 100 chart in November for one week. In the United Kingdom the song had two chart outings. Firstly, in November 1987 after the film's initial release the song peaked at #6, and again when the film was shown on mainstream television the song reached as high as #8 (January 1991).\n\nWilliam Thomas &quot;Bill&quot; Medley (born September 19, 1940) is an American singer and songwriter, best known as one half of The Righteous Brothers singing duo.\n\nMedley was born Los Angeles, California. He met his singing partner Bobby Hatfield while attending California State University, Long Beach. The pair began singing as a duo in 1962. Their first single was &quot;Little Latin Lupe Lu&quot;; their first hit was &quot;You've Lost That Lovin' Feelin'&quot;, produced by Phil Spector in 1964. Follow-up hits included &quot;Ebb Tide&quot;, &quot;(You're My) Soul and Inspiration&quot; and &quot;Unchained Melody&quot;.\n\nThe duo broke up in 1968, but Bill's career didn't end. He continued singing his hit songs with Virgil Beckham singing Bobby Hatfield's part. Some fans of the Righteous Brother's liked this better because Virgil Beckham is more of an all out, soulful singer while also playing lead guitar for the band. Bill returned with another hit in 1974, &quot;Rock And Roll Heaven&quot;, and they continued to appear together until Hatfield's death in November 2003. The Righteous Brothers were inducted into the Rock and Roll Hall of Fame in March 2003 by one of their biggest fans, Billy Joel.\n\nJennifer Jean Warnes (born March 3, 1947) is a Grammy winning American singer, songwriter, arranger and record producer. She is known for her rich soprano/contralto voice, her interpretations of compositions written by herself and many others, as well as an extensive playlist as a vocalist on movie soundtracks.\n\nBetween 1979 and 1987 Warnes surpassed Frank Sinatra as the vocalist performing the most songs to be nominated for (4) and to win (3) the Academy Award for Best Original Song. Her biggest hits include two of these Billboard chart topping Oscar and Grammy winners - &quot;Up Where We Belong&quot; (duet with Joe Cocker, from the 1982 film An Officer and a Gentleman) and &quot;(I've Had) The Time of My Life&quot; (duet with Bill Medley from the 1987 film Dirty Dancing).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:f206455036489dc6f520cdbd6b7f7fb0dc05383d","amp;dn":"Bill+Medley+%26+Jennifer+Warnes-%28I%5C%27ve+Had%29+The+Time+Of+My+Life","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f206455036489dc6f520cdbd6b7f7fb0dc05383d","infoHashBuffer":{"type":"Buffer","data":[242,6,69,80,54,72,157,198,245,32,205,189,107,127,127,176,220,5,56,61]},"announce":[],"urlList":[]}}