{"title":"The Women of the Cousins' War - Philippa Gregory (2011)","uid":11399783,"size":136553556,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f2ec339d52a5c5a81b5df143ea8c66ec5f9e0a5c&amp;dn=The+Women+of+the+Cousins%27+War+-+Philippa+Gregory+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"davieboy1966","files":4,"time":1415409069,"description":"Audio Books : History : MP3/Variable : English\n\nThe Women of the Cousins' War: The Duchess, the Queen and the King's Mother [Audiobook] by Philippa Gregory, David Baldwin, Michael Jones\nEnglish | September 13, 2011 | ASIN: B005MM7HE8 | MP3@32 kbps | 9 hrs 28 mins | 130 MB\nNarrator: Bianca Amato | Genre: Nonfiction/Biography\n\nIn this unique illustrated presentation, Gregory and her fellow historians describe the extraordinary lives of the heroines of her Cousins' War books: Jacquetta, Duchess of Bedford; Elizabeth Woodville, Queen of England; and Margaret Beaufort, the founder of the Tudor dynasty.\n\nIn her essay on Jacquetta, Philippa Gregory uses original documents, archaeology and histories of myth and witchcraft to create the first-ever biography of the young duchess who was to survive two reigns and two wars to become the first lady at two rival courts. David Baldwin, established author on the Wars of the Roses, tells the story of Elizabeth Woodville, the first commoner to marry a king of England for love, and Michael Jones, fellow of the Royal Historical Society, writes of Margaret Beaufort, the almost-unknown matriarch of the House of Tudor.\n\nIn the Foreword Gregory writes revealingly about the differences between history and historical fiction. How much of a role does speculation play in writing each? How much fiction and how much fact should there be in a historical novel? How are female historians changing our view of women in history?\n\nThe Women of the Cousins' War is illustrated with rare portraits and source materials. As well as offering fascinating insights into the inspirations behind Philippa Gregory's fiction, it will appeal to all with an interest in this period.\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:f2ec339d52a5c5a81b5df143ea8c66ec5f9e0a5c","amp;dn":"The+Women+of+the+Cousins%27+War+-+Philippa+Gregory+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2ec339d52a5c5a81b5df143ea8c66ec5f9e0a5c","infoHashBuffer":{"type":"Buffer","data":[242,236,51,157,82,165,197,168,27,93,241,67,234,140,102,236,95,158,10,92]},"announce":[],"urlList":[]}}