{"title":"How to Say Anything to Anyone -  A Guide to Building Business Re","uid":7937360,"size":1762302,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f3123443be3cc5452df3a7baf53da77fc52e4d3a&amp;dn=How+to+Say+Anything+to+Anyone+-++A+Guide+to+Building+Business+Re&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"KatQwerty","files":3,"time":1355894960,"description":"\n \nTake charge of your career by taking charge of your business relationships.\nWe all know how it feels when our colleagues talk about us but not to us. It's frustrating, and it creates tension. When candor is missing in the workplace, employees feel like they're working in the dark. Leaders don't know what employees really think; managers are frustrated when outcomes are not what they expect; and employees often don't know where they stand performance-wise.\n \nMany of us remain passive against broken, indirect communication habits, hoping that things will miraculously improve--but they won't. Not without skills and effort.\n \nThe people you work with can work with you, around you, or against you. How people work with you depends on the relationships you cultivate. Do your colleagues trust you? Can they speak openly to you when projects and tasks go awry?\n \nTake charge of your career by taking charge of your business relationships. Make your work environment less tense and more productive by practicing direct communication. Set relationship expectations, work with people how they like to work, and give and receive regular feedback.\n \nIn How to Say Anything to Anyone, you'll learn how to:\n- ask for what you want at work\n- improve all types of working relationships \n- reduce the gossip and drama in your office \n- tell people when you re frustrated in a way that resonates \n- take action on your ideas and feelings\n- get honest feedback on your performance\n \nHarley shares the real-life stories of people who have struggled to get what they want at work. With her clear and specific roadmap in hand, Harley enables you to create the career and business relationships you really want--and keep them.\n \n \n \n  \n[","torrent":{"xt":"urn:btih:f3123443be3cc5452df3a7baf53da77fc52e4d3a","amp;dn":"How+to+Say+Anything+to+Anyone+-++A+Guide+to+Building+Business+Re","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3123443be3cc5452df3a7baf53da77fc52e4d3a","infoHashBuffer":{"type":"Buffer","data":[243,18,52,67,190,60,197,69,45,243,167,186,245,61,167,127,197,46,77,58]},"announce":[],"urlList":[]}}