{"title":"Godzilla Vs. Mechagodzilla (1974).avi","uid":9198707,"size":734035968,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f38d1e86a2c02996d080980dd303e5d630a81809&amp;dn=Godzilla+Vs.+Mechagodzilla+%281974%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"lonewolfmoon","files":1,"time":1384539948,"description":"Godzilla vs. Mechagodzilla (1974) \n&quot;Gojira tai Mekagojira&quot; (original title) \n\n  84 min   -  Action | Fantasy | Horror\n \nPlot:\n\nIn Okinawa an ancient statue is unearthed with a prophecy inscribed on it: &quot;When a black mountain appears in the sky and the sun rises in the West, a monster will arise to destroy the world. But when the red moon sets and the sun rises in the west, two monsters will arise to save the world.&quot; The statue of the mythical monster King Caesar, protector of Okinawa, is vital should the prophecy come true.\n\nBefore long, the signs appear: a giant black mountain shaped cloud is seen and a mirage creates the illusion of a Western sunrise. Godzilla (or so it seems) emerges from Mount Fuji and begins a destructive rampage. Anguirus confronts &quot;Godzilla&quot;, only to be violently defeated when Godzilla breaks Anguirus' jaw, and he retreats. But not before ripping Godzilla's skin of his arm and revealing shining metal.\n\nAnother Godzilla shows up to battle the rampaging Godzilla and reveals it to be an impostor. It is Mechagodzilla, a robot created by ape aliens of the Third Planet from the Black Hole to destroy the real Godzilla and conquer Earth. Mecha-Godzilla unleashes his full arsenal and a wounded Godzilla collapses into the sea. Too damaged to continue the attack, Mecha-Godzilla retreats for repairs. Returning to Monster Island, Godzilla is repeatedly energized by mysterious bolts of lightning.\n\nHis repairs completed, Mecha-Godzilla is unleashed to destroy King Caesar, but Godzilla comes to the rescue. After a bloody battle between the three titans, Godzilla generates a magnetic field against Mecha-Godzilla, dragging the metal robot within reach. Godzilla twists Mecha-Godzilla's head off and the robot's body explodes. The aliens' base explodes, and both King Caesar and Godzilla return home.\n\nDirector:\n Jun Fukuda \n\nWriters:\n Jun Fukuda, Masami Fukushima (story)\n\nStars:\n Masaaki Daimon, Kazuya Aoyama, Reiko Tajima \n\n The 14th film of the Godzilla series, it featured a slightly bigger budget with higher production values then the previous few films of the series. The film introduced a mechanical version of Godzilla called Mechagodzilla, and also introduced a character called King Caesar based on the legend of the Shisa.\n\nRes: 640x272\n29 f/sec","torrent":{"xt":"urn:btih:f38d1e86a2c02996d080980dd303e5d630a81809","amp;dn":"Godzilla+Vs.+Mechagodzilla+%281974%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f38d1e86a2c02996d080980dd303e5d630a81809","infoHashBuffer":{"type":"Buffer","data":[243,141,30,134,162,192,41,150,208,128,152,13,211,3,229,214,48,168,24,9]},"announce":[],"urlList":[]}}