{"title":"Suicide Squad v1 (1987) (Catseye2001) [h33t]","uid":4104814,"size":532857702,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f39c7aa3b8ec5e94963443d895e788051c1eb133&amp;dn=Suicide+Squad+v1+%281987%29+%28Catseye2001%29+%5Bh33t%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"Catseye2001","files":68,"time":1206748104,"description":"Here is some Suicide Squad. This is the 1987 series.\n\nClipped from Wikipedia: &lt;SPOILERS&gt;The Suicide Squad was revived in the mini-series Legends, and were created by John Ostrander. The renewed concept involved the government employing a group of super-villains to perform missions that were almost certainly suicide runs, a concept popular enough for an ongoing series titled simply Suicide Squad. They were often paired together with the government agency related series Checkmate, culminating in the &quot;Janus Directive&quot; crossover.\n\nThe concept self-consciously emulated the Second World War film, The Dirty Dozen and the television series Mission: Impossible. In addition, the existence of the squad was top secret, creating much tension within the group and leading the group to be targeted (unsuccessfully) by the likes of Lois Lane and Batman (who was forced to back off from investigating the group when Amanda Waller threatened to use the government&amp;#039;s resources to expose Batman&amp;#039;s secret identity.)\n\nWhile the team were successful on most of their missions, there were often failures (most notably the capture of Nemesis by Russian forces after a failed mission in Russia) or the death of one or more members. The use of minor villains and heroes added to the jeopardy, as it was not clear whether any given character would survive a mission, and the series did not shy away from killing off some of its principal characters, most notably Rick Flag Jr., who was killed at the end of the book&amp;#039;s second year. The series was also notable at the time for examining the lives, motivations and psychological makeup of its characters with one issue per year featuring the group&amp;#039;s psychologist interviewing each member.\n\nThe Suicide Squad lasted 66 issues.\n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:f39c7aa3b8ec5e94963443d895e788051c1eb133","amp;dn":"Suicide+Squad+v1+%281987%29+%28Catseye2001%29+%5Bh33t%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f39c7aa3b8ec5e94963443d895e788051c1eb133","infoHashBuffer":{"type":"Buffer","data":[243,156,122,163,184,236,94,148,150,52,67,216,149,231,136,5,28,30,177,51]},"announce":[],"urlList":[]}}