{"title":"Crazy Horse Production - Show in Paris [DVDrip]","uid":4509566,"size":732270574,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f39ee3ebd38333be75e01edb5c3261316e5add87&amp;dn=Crazy+Horse+Production+-+Show+in+Paris+%5BDVDrip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"LeoDH","files":-1,"time":1226722505,"description":"Le Crazy Horse Saloon or Le Crazy Horse de Paris is a Parisian cabaret known for its stage shows performed by nude female dancers. Its owners have helped to create related shows in other cities, and unrelated businesses have used the phrase &quot;Crazy Horse&quot; in their names.\n\nThe Paris Crazy Horse occupies a portion of an Haussmanian building at 12 avenue George V (Roman numeral five, or &quot;cinq&quot;. Alain Bernardin opened it in 1951 and personally operated it for decades until his death by suicide in 1994. The dancers are chosen to be indistinguishable on stage in height and in breast size and shape. As of 2008, the enterprise remains a family business in the hands of Bernardin&amp;#039;s three children, using the name &quot;Le Crazy Horse de Paris&quot; for the original, &quot;Le Crazy Horse de Singapore&quot; for a similar but now-defunct show in that city, and Crazy Horse Paris for one in Las Vegas at the MGM Grand.\n\nAlong with its dancers, the Crazy Horse has also been a popular venue for other artists, including magicians, jugglers, and mimes. Bernardin explained that he loved magic because it corresponded with his vision: &quot;[Magic] is a dream. There is no show that is more dreamlike than a magic show. And what we do with the girls is magic, too, because they aren&amp;#039;t as beautiful as you see them onstage. It&amp;#039;s the magic of lights and costumes. These are my dreams and fascinations that I put onstage.&quot;\n\nunder new management, Crazy Horse has recently started featuring famous or prestigious artists stripping for a limited number of shows, such as Dita Von Teese, Arielle Dombasle or Pamela Anderson.","torrent":{"xt":"urn:btih:f39ee3ebd38333be75e01edb5c3261316e5add87","amp;dn":"Crazy+Horse+Production+-+Show+in+Paris+%5BDVDrip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f39ee3ebd38333be75e01edb5c3261316e5add87","infoHashBuffer":{"type":"Buffer","data":[243,158,227,235,211,131,51,190,117,224,30,219,92,50,97,49,110,90,221,135]},"announce":[],"urlList":[]}}