{"title":"Automatic Call Recorder v1.5 [Premium].apk","uid":10042741,"size":6430150,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:f4c2802a1bf07a8606987ddc21c511e1196dc688&amp;dn=Automatic+Call+Recorder+v1.5+%5BPremium%5D.apk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ill420smoker","files":-1,"time":1398484478,"description":"Welcome to Automatic Call Recorder the #1 Call Recorder app on Google Play. \nHave you ever had an important phone call and needed to take a memo? Or you had to memorize a phone number or street address? You were in a traffic jam while receiving an important order from a client? Maybe you had to write down a shopping list and forgot something? Or simply wanted to hold on to some sweet memories and tender words from your soul mate? \nAutomatic Call Recorder offers unique set of features which will allow you to record any call automatically. In addition to that you can simply shake your device during the call to start recording instantly. You can listen to the recorded call at any time in MP3 High Audio Quality or sync it with linked Dropbox account automatically.\n*********************************************************\n\nImportant notice about Automatic Call Recorder features:\n- Due to hardware limitations recording function might not work properly on some devices. It is not malfunction of the application, please do not leave negative reviews and comments. You can also try to fine-tune audio-source on the Automatic Call Recording setup page.\n- App may not function if other call recording applications are in use. Please close or delete all other recording apps.\n*********************************************************\n\nAutomatic Call Recorder - Full list of Features:\n\n* Automatic phone call recording based on predefined rules. \n* Crystal Clear MP3 Audio Quality\n* Shake to record (Premium option). Start recording any call instantly by shaking\n  your device.\n* Recording Filter. You can choose between recording all calls, only calls made\n  with your contacts or calls from unknown numbers. It is even possible to choose\n  which contact from your contact list will be recorded or ignored.\n* Favorite calls list. Permanently stored calls that will not be deleted \n* Automatic Dropbox synchronization (Premium option). You can sync all calls or\n  favorite calls automatically.\n* Manual Dropbox synchronization. You can choose to sync each recorded file\n  separately.\n* Notifications. Once the recording has been started you can be notified either by\n  notification icon or a sound. You can even choose which sound will be played\n  (Premium).\n* After call action menu (Premium). This option is useful if you want to review\n  each call and instantly delete the recording, write additional note or add it to\n  favorites.\n* Advanced Memory Management. It is possible to limit the memory space occupied by\n  the recorded files. You can choose between file number limit, space usage in\n  Megabytes or Date of the recording (Premium).\n* Tested with major Samsung devices: Samsung Galaxy Series including Galaxy S Plus,\n  Galaxy S2, Galaxy S3 and Galaxy S4 and Android Jelly Bean.\n\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.smsrobot.callrecorder&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.smsrobot.callrecorder&lt;/a&gt;\n\n\n* Premium features unlocked\n\n\nEnjoy!","torrent":{"xt":"urn:btih:f4c2802a1bf07a8606987ddc21c511e1196dc688","amp;dn":"Automatic+Call+Recorder+v1.5+%5BPremium%5D.apk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4c2802a1bf07a8606987ddc21c511e1196dc688","infoHashBuffer":{"type":"Buffer","data":[244,194,128,42,27,240,122,134,6,152,125,220,33,197,17,225,25,109,198,136]},"announce":[],"urlList":[]}}