{"title":"The Complete Dark Season Collection by Amy Cross (AZW3, EPUB, MO","uid":10778517,"size":8548663,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5942a73532d242e74928a9f647a8ce588c57571&amp;dn=The+Complete+Dark+Season+Collection+by+Amy+Cross+%28AZW3%2C+EPUB%2C+MO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"gratefuldawg77","files":6,"time":1408138649,"description":"With the vampire civil war having ended on the fields of Gothos, only one survivor has escaped from the flames. Patrick is the last of his species, and he carries the guilt of having killed every other vampire. He should have died with them, but an ancient prophecy demands that he wait a little longer. Before the old vampire race dies out completely, a new one must be born.\n\nWalking home from a party late at night, Sophie Hart is set upon by a pair of muggers. Seconds from death, she's rescued by a mysterious figure who takes her home and nurses her back to full health. Soon, she finds herself at the heart of a deadly and ancient prophecy, and as the spiders begin to gather, she learns that no-one can hold back destiny.\n\nOriginally published in serial format between December 2011 and January 2013, Dark Season is a sprawling epic about fate, love, loss and guilt. It's the story of two very different people, bound together by a prophecy that was created before they were even born. It's also the story of Vincent, the old man forced to watch his son's mistakes. It's the story of Shelley, the waitress who's unwittingly given the greatest secret of all. It's the story of Benjamin and the Watchers, a shadowy group with dark plans. And it's the story of Abigail, the young girl born to tortured parents and forced to assume her position as the progenitor of a new race of vampires.\n\nThis box set contains the entire series. Total word count is approximately 500,000 words. Contains violence, swearing and sex scenes. For mature readers only.","torrent":{"xt":"urn:btih:f5942a73532d242e74928a9f647a8ce588c57571","amp;dn":"The+Complete+Dark+Season+Collection+by+Amy+Cross+%28AZW3%2C+EPUB%2C+MO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5942a73532d242e74928a9f647a8ce588c57571","infoHashBuffer":{"type":"Buffer","data":[245,148,42,115,83,45,36,46,116,146,138,159,100,122,140,229,136,197,117,113]},"announce":[],"urlList":[]}}