{"title":"Evasion (CrimethInc)","uid":6946425,"size":6002138,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f64cd0de2f863a8467eb4093ea060afaedd3e3c5&amp;dn=Evasion+%28CrimethInc%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"canthisreallybetheend","files":-1,"time":1326246925,"description":"Evasion is a book that spun off from a zine of the same name. It was published by CrimethInc. in 2003. The book comprises 108 pages of slightly revised text from the original zine (95% of which is retained) along with 162 pages of new material.[1] The author is not named in the book, but is referred to elsewhere as \\\\\\&quot;Mack\\\\\\&quot;, \\\\\\&quot;the Evasion Kid\\\\\\&quot;, or \\\\\\&quot;Mack Evasion.\\\\\\&quot; He later wrote a column in the zine heartattaCk .\n\nEvasion is a first person account of the author\\\\\\'s travels and means of survival. He survives by dumpster diving, shoplifting, return fraud, and various other \\\\\\&quot;scams\\\\\\&quot; he employs to get whatever money he needs. He travels by hitchhiking and train hopping, an relates adventures he has had such as gate crashing at music venues, attending hardcore punk concerts, and being employed as a professional shoplifter by a middle class family, among other things.\n\nEvasion expresses very few specific political statements, but the author frequently makes reference to his vegan and straight-edge lifestyle. The author expresses situationist and anti-work leanings, leaving some to label him a lifestylist. Being published by an anarchist collective and widely read and reviewed by anarchists, many considered Evasion to be an unquestionably anarchist work, even though the author never labeled himself as such in the book.\n\nThemes\n\nThe author criticizes the wastefulness of western society and frequently remarks on the ethics of work and industrial capitalism. He uses humor to make a mockery of what he believes is an unjust system, while at the same time relating his methods of survival and travel in enough detail to be useful to anyone attempting to replicate his schemes. The author chooses to find alternate means to support himself, rather than selling his time and labor to build profits for a corporation. Central to the book\\\\\\'s theme is that human life is too precious to be sold away by the hour, and wage labor is inherently immoral.\n\nCopyright status\n\nThe book is licensed under the following terms: \\\\\\&quot;Excluding all corporations, the text from this book may be reproduced without permission in any form and quantity, by any means necessary.\\\\\\&quot; Free PDF files of the book are available on the internet.\n\n----------------------------------------------------------------------------------\n\nIe. feel free to distribute the fuck out of it.","torrent":{"xt":"urn:btih:f64cd0de2f863a8467eb4093ea060afaedd3e3c5","amp;dn":"Evasion+%28CrimethInc%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f64cd0de2f863a8467eb4093ea060afaedd3e3c5","infoHashBuffer":{"type":"Buffer","data":[246,76,208,222,47,134,58,132,103,235,64,147,234,6,10,250,237,211,227,197]},"announce":[],"urlList":[]}}