{"title":"Keren Ann - 101 2011","uid":6522452,"size":264384236,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f74a550979f3e55a570ceb84906df6bfd8a53a4a&amp;dn=Keren+Ann+-+101+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"barber9","files":-1,"time":1309997219,"description":"Keren Ann Zeidel (born March 10, 1974) is a singer-songwriter-composer-producer and engineer based largely in Paris, Tel Aviv and New York City. She plays guitar, piano and clarinet, engineers and writes choir and musical arrangements.\n\nHer parents are Russian-Jewish and Dutch-Javanese. She lived in Israel and in the Netherlands until the age of 11, when her family moved to France. Though she lived and recorded mostly in France and New York, she retains her Dutch and Israeli citizenship.\n\nKeren Ann has released six solo albums; she is also a member of the band Lady and Bird with Bardi Johannsson. They released an eponymous album in 2003 and have worked on diverse composition projects, such as a show with the Icelandic Symphony Orchestra in ReykjavÃƒÂ­k (May 2008) with director Daniel Kawka. The live performance has been recorded and post-produced by the band and was released in September 2009. A second show for the Parisian hall Salle Pleyel was held in October 2009, this time with Orchestre Lamoureux directed by Christophe Mangou. Keren Ann and Bardi have also created the music for the TGV 2005-2006-2007 campaign.\n\nKeren Ann took part in many internationally acclaimed recordings such as Chambre Avec Vue written for Henri Salvador in 2000, and The Isis Project written with Guy Chambers in 2004. In 2008 Keren Ann composed, with Tibo Javoy, the entire sound design for the European TV Channel ARTE.\n\nHer music has been featured in many films and TV series - Grey's Anatomy, Six Feet Under, Big Love and Deux Jours A Tuer. Her song Beautiful Day has been the sound of the Skyteam campaign, and in 2008 her song Lay Your Head Down was the synch for the international H&amp;M Spring commercial.\n\nKeren Ann co-wrote and co-produced with Doriand the second album of singer/actress Emmanuelle Seigner, due for release in February 2010. She contributed an original score for a French feature by director Benoit Petre, starring Jane Birkin. The film was due to be released in March 2010.\n\nHer sixth solo album, 101, was issued in 2011. (wikipedia)\n\n- - -\n\nKeren Ann - 101  2011\n(Paris EMI)\n\n 1. My Name Is Trouble\n 2. Run With You\n 3. All The Beautiful Girls\n 4. Sugar Mama\n 5. She Won't Trade It For Nothing\n 6. You Were On Fire\n 7. Blood On My Hands\n 8. Song From A Tour Bus\n 9. Strange Weather\n10. 101\n","torrent":{"xt":"urn:btih:f74a550979f3e55a570ceb84906df6bfd8a53a4a","amp;dn":"Keren+Ann+-+101+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f74a550979f3e55a570ceb84906df6bfd8a53a4a","infoHashBuffer":{"type":"Buffer","data":[247,74,85,9,121,243,229,90,87,12,235,132,144,109,246,191,216,165,58,74]},"announce":[],"urlList":[]}}