{"title":"Blue Beetle (v1 - v8 + Extras) (1938 - 2013)","uid":10937733,"size":4184664664,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f7e9edf7298411fe6fa12f6bbc6b69957b055883&amp;dn=Blue+Beetle+%28v1+-+v8+%2B+Extras%29+%281938+-+2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"nemesis43","files":177,"time":1409450177,"description":"Blue Beetle (v1 - v8 + Extras) (1938 - 2013)\n\n\nAlso included is some Blue Beetle audio - Radio Shows and the seven issue run of Big 3 that started in 1940, this featured Blue Beetle, Samson and The Flame.\nHere - The Big 3 featured the biggest hero's in Fox Features Syndicate comic books 1940. The Blue Beetle, The Flame and Sampson were their biggest heroes and very popular until the company stopped production.\n\n\nCurrent (3rd) Blue Beetle -\n\nSome time before Ted Kord's death he left Dan Garrett's Scarab in the Rock of Eternity with the wizard Shazam. After the destruction of the rock by the Spectre, the Scarab landed in a vacant lot in El Paso, Texas. There it was found by a high school student, Jaime Reyes. The scarab bonded itself to Jaime's body, and entered into a far more interactive relationship with the boy than it had with Dan Garrett. The scarab now allows Jaime to cover himself in a kind of bio-mechanical armor, which can be modified to enhance his speed and strength, as well as to create weapons, wings and shields. Batman and his group tracked down Jaime because the Scarab was the only thing that could find Brother Eye and stop it. After Brother Eye's destruction Jaime was trapped between dimensions for a whole year and was forced to reveal his secret to his family and friends.\n\n","torrent":{"xt":"urn:btih:f7e9edf7298411fe6fa12f6bbc6b69957b055883","amp;dn":"Blue+Beetle+%28v1+-+v8+%2B+Extras%29+%281938+-+2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7e9edf7298411fe6fa12f6bbc6b69957b055883","infoHashBuffer":{"type":"Buffer","data":[247,233,237,247,41,132,17,254,111,161,47,107,188,107,105,149,123,5,88,131]},"announce":[],"urlList":[]}}