{"title":"Jayce And The Wheeled Warriors  Vol. 1  (1985)  DVD-R  NTSC","uid":4982438,"size":18723158016,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f7f76c939be1b53670d02f30498d2dd32f80dd50&amp;dn=Jayce+And+The+Wheeled+Warriors++Vol.+1++%281985%29++DVD-R++NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":10,"uploader":"Coolguy33","files":-1,"time":1246405556,"description":"Jayce and the Wheeled Warriors (The Complete Vol. 1) (1985) 4x DVD\n\n\n\nGenre Sci-fi / Animation \nCreated by Jean Chalopin\nJ. Michael Straczynski \nVoices of Darrin Baker\nLen Carlson\nLuba Goy\nCharles Jolliffe\nValerie Politis\nDan Hennessey\nGuilio Kukurugya \nCountry of origin  France Canada Japan \n\n\n\n\nJayce and the Wheeled Warriors is a French/North American animated TV show which first aired on September 16, 1985. It was produced by DiC Entertainment (originally distributed for syndication by SFM Entertainment), and animated by Japanese animation studios Sunrise, Shaft, Studio Giants, Studio Look and Swan Production. The show, which spawned 65 30-minute episodes, was created to support Mattel's toy line (which was called simply, &quot;Wheeled Warriors&quot;). The show features an ongoing plot, however like many shows made at the time, it does not have a series finale, and thus the plot was left unresolved.\n\nThe show featured two duelling forces. The &quot;good guys&quot; are humans, called the Lightning League. They drive white and silver vehicles with assorted weaponry, and are led by Jayce. The &quot;bad guys&quot; are organic green vegetable-based creatures called the Monster Minds, who tend to take the shape of black and green vehicles. They travel via large green organic vines which can grow in and across interstellar space, that sprout seeds that rapidly grow into further Monster Minds. They are led by Saw Boss.\n\n\nThe plot concerns Jayce, son of Audric, and his quest to rejoin him. The backstory is that Audric was a botanist who did several experiments with biotechnology, one of which blossomed and became a young humanoid girl named Flora. Audric had also created a miracle crop that could thrive in any environment and was intended to end galactic hunger. However, a burst of radiation generated by a sudden solar flare mutated his plant into an evil, sentient being, and changed other plants around Audric's laboratory into similar creatures, who collectively became known as the Monster Minds, and refer to their leader (the first mutant creature) as Saw Boss. Audric manages to create a magical root that can destroy the Monster Minds, but is forced to flee before he can complete the task, after which the Monster Minds turn Audric's laboratory into their headquarters (which can teleport to other places by means of a mysterious power source known as the &quot;the power of the black light&quot;). Audric keeps half of the root himself and gives the other half to his servant, Oon, whom he sends to serve Jayce. Thus, Jayce and his Lightning League friends are constantly on a quest to find Audric and combine the halves of the root.\n\n\nDisc 1\n\n1. Escape from the Garden of Evil \n2. The Vase of Xiang \n3. Steel Against Shadow \n4. Silver Crusaders \n5. Ghostship \n6. Flora, Fauna and the Monster Minds \n7. Fire and Ice \n8. Space Outlaws \n9. Future of the Future \n \nDisc 2\n\n10. Underwater \n11. Frostworld \n12. Critical Mess \n13. The Purple Tome \n14. Hook, Line and Silver \n15. Bloodstone \n16. The Slaves of Adelbaren \n17. The Hunt \n\nDisc 3\n\n18. Blockade Runners \n19. The Sleeping Princess \n20. Deadly Reunion \n21. Sky Kingdom \n22. Quest into Shadow \n23. Unexpected Trouble \n24. Bounty Hunters \n25. Double Deception \n\nDisc 4\n\n26. Gate World \n27. Space Thief \n28. Moon Magic \n29. Affair of Honor \n30. Doomed Flower \n31. The Stallions of Sandeen \n32. Brain Trust \n33. Lightning Strikes Twice \n\n\n\nLanguage: English\nAspect Ratio: 1.33:1 \nRunTime: 12hrs\nNTSC\n\n\n","torrent":{"xt":"urn:btih:f7f76c939be1b53670d02f30498d2dd32f80dd50","amp;dn":"Jayce+And+The+Wheeled+Warriors++Vol.+1++%281985%29++DVD-R++NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7f76c939be1b53670d02f30498d2dd32f80dd50","infoHashBuffer":{"type":"Buffer","data":[247,247,108,147,155,225,181,54,112,208,47,48,73,141,45,211,47,128,221,80]},"announce":[],"urlList":[]}}