{"title":"2011 Cable Modem Hack - Free Internet Service - Working","uid":6521187,"size":114006,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f802e8b62ec3cd0b7ca6be08a28bc6826be691b4&amp;dn=2011+Cable+Modem+Hack+-+Free+Internet+Service+-+Working&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"modotech","files":1,"time":1309997866,"description":"DISCLAIMER:\nUse at your own risk. Use this for the study of algorithim number creation. Check your local laws and service provider laws regaurding the possible illegal use of this software. If you find it is illegal, the dont use it. By using this program, you agree to take full responibility for your actions and release all other people from liability. You were warned.\n-----------------------------------------------------------------------------------This program will allow you to use a valid account number to generate more valid account numbers. You use a newly generated account number to activate your cable modem.\n\nIf you know someone that is paying for broadband internet service ask them for their account number printed on the monthly bill. You will not use their actual account number, but will use it to generate more. This program uses a special algorithim that makes valid account numbers. You must obtain an account number for each area, usually in 50 mile radiuses. In other words, if you had a cable modem in San Francisco that you want to activate, then you need to get an account number from someone that lives in the San Francisco area, where the cable modem will be used. This will work for ANY MODEL OF CABLE MODEM. ANY...YES!!!...ANY.\n\nDoes it work?\nYES..with some patience. 1 out of 10 new account numbers that you generate will activate your cable modem.\n\nINSTRUCTIONS\n-Double click on the &quot;RAMCWIN.EXE&quot; file to open it.\n-Click &quot;action mode&quot; on top of the menu bar.(The action mode window will open)\n-Click on the &quot;options&quot; button on the top of the window to open &quot;Action Mode Options&quot;.\n-Under Action Mode options, make sure all the boxes are checked, except the 2nd and 4th box. (Click save to save the new settings)\n\n*Once you have saved the new settings, continue following the instruction below.\n\n-Type or paste your valid account number in the &quot;Account&quot; box that is located below card type. (It is the bigger of the two boxes)\n-Once you type or paste the account number, you will click once inside the smaller box to the right of the account box that you just pasted your number in.\n*If the account number that you entered is valid, the word &quot;VALID&quot; will appear in the smaller box that you clicked in and the &quot;NEXT #&quot; button will un-gray.\n-To generate account numbers, simply click the &quot;NEXT #&quot; button. Write down all the numbers or copy and paste them in a text file.\n\nHOW TO USE THE ACCOUNT NUMBERS\n*Make sure you have cable service located at the address where you will use the cable modem. (Make sure the cable company has not installed blocking filters up on the service pole or pedestal) The cable company will sometimes block the internet frequency so it can only send packets. If there are no filters, then all the lights on the cable modem will eventually turn solid with the commumication led blinking. If there are filters on the line then the modem will try to get on line and keep re-setting. The &quot;ONLINE&quot; LED on your modem will never go solid. If there are filter on the line, then dont waste your time trying to activate the modem.\n\n-Hook your cable modem up..Yes the coax and the ethernet from the modem to the ethernet port on your computer.\n-Wait for the modem to connect to your ISP. (All the LED's will go solid)\n-Open your preffered browser.(It must go to your ISP's home page. Give it time because it takes longer to load)\n-Your ISP will recognize your modem as an un-registered modem and will prompt you to enter your account number.\n*The ISP may promped you to download and activation plug-in or software...Yes you must accept.\n-Enter the account number and make up al the info.\n-If you were sussefull, then it will say you were. If not then try and try again. This does work. Dont flame if your fucking lazy and give up. \n\nDo not PM me, because I will not respond.\n\nNjoy!","torrent":{"xt":"urn:btih:f802e8b62ec3cd0b7ca6be08a28bc6826be691b4","amp;dn":"2011+Cable+Modem+Hack+-+Free+Internet+Service+-+Working","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f802e8b62ec3cd0b7ca6be08a28bc6826be691b4","infoHashBuffer":{"type":"Buffer","data":[248,2,232,182,46,195,205,11,124,166,190,8,162,139,198,130,107,230,145,180]},"announce":[],"urlList":[]}}