{"title":"Built by Animals: The Natural History of Animal Architecture - H","uid":8902290,"size":3142516,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f821d5c219fb83d0cbbafaf4f12bdbf8dc081591&amp;dn=Built+by+Animals%3A+The+Natural+History+of+Animal+Architecture+-+H&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"K-Slender","files":3,"time":1378832153,"description":"ISBN-13: 9780199205578\n\nThe Minds of Animal Builders!\n\nThere is a whole chapter here on the webs of spiders, and once again, using simple materials (of their own secretion) and simple instructions, a spider can produce a wonder of complexity, a web for trapping insects. Astonishingly, not everything in a web may be behaviorally programmed as even spiders have the capacity to learn. It is easier for a spider to run downwards on a web to a caught insect rather than run upwards, but in a fascinating experiment on one particular species, some spiders weren't given the chance to run. The experimenter simply fed them flies as they were sitting in the middle of their webs. When they re-built their webs, they continued to make as much web above themselves as below. Spiders who did real catching, however, learned to build webs that had more catching-space down below, and spiders who were artificially fed insects that were inserted above them in the web built webs with a bigger topside. There are so many interesting experiments described here. In the final chapter on bowerbirds, Hansell winds up his discussion of how the female could show by posturing how interested she is in the male: &quot;This suggests that a male could infer whether or not a female is likely to make her escape from the avenue by the degree of crouching she shows. Cue an experiment with a robot female satin bowerbird!&quot; I thought Hansell was making a joke; he wasn't. The robot has been built, and when it assumes different positions, the male changed the intensity of his courtship dance. This is an engaging book summarizing an expert's view of the results from clever animals and clever researchers. ","torrent":{"xt":"urn:btih:f821d5c219fb83d0cbbafaf4f12bdbf8dc081591","amp;dn":"Built+by+Animals%3A+The+Natural+History+of+Animal+Architecture+-+H","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f821d5c219fb83d0cbbafaf4f12bdbf8dc081591","infoHashBuffer":{"type":"Buffer","data":[248,33,213,194,25,251,131,208,203,186,250,244,241,43,219,248,220,8,21,145]},"announce":[],"urlList":[]}}