{"title":"Daughn Gibson - Me Moan (2013) [FLAC]","uid":8696925,"size":277203237,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f842154e2780c36ba0729beec48fba001e1e546e&amp;dn=Daughn+Gibson+-+Me+Moan+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1373987873,"description":"\n  Daughn Gibson - Me Moan (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Style: Folk, Alternative, Singer/Songwriter, Alt-Country\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16 \n  Sampling Rate: 44,100 Hz\n \n  01 The Sound of Law\n  02 Phantom Rider\n  03 Mad Ocean\n  04 The Pisgee Nest\n  05 You Don't Fade\n  06 Franco\n  07 Won't You Climb\n  08 The Right Signs\n  09 Kissin on the Blacktop\n  10 All My Days Off\n  11 Into the Sea\n\n  All Hell, the auspicious indie solo album of singer and songwriter Daughn Gibson (formerly the drummer of knotty heavy rock unit Pearls and Brass), with its meld of old-school country &amp; western melodies with loops, samples, and ambient textures informed by acts from Burial to Demdike Stare to Vatican Shadow, caught listeners by surprise. Gibson's deep, resonant baritone singing voice crisscrosses the ages and suggests everyone from Lee Hazlewood and Johnny Cash to Dale Watson, early Scott Walker, and even Crash Test Dummies. More than his format and sound, however, Gibson proved he could write fine, well-crafted songs. He signed with Sub Pop shortly after the album was released and cut Me Moan. From the jump, it's easy to hear that the label provided him with a bigger budget -- he made the most of it. He enlisted guitarists John Baizley (Baroness) and Jim Elkington (Brokeback), both of whom understand the the tones, timbres, and licks of honky tonk and rock &amp; roll's rich history. \n\n  Gibson's sonic palette has expanded considerably and his songwriting has gotten tighter. The layered rhythms, ambient washes, and textural touches make this record sound almost lush, though it's still grounded in his Pennsylvania earth. Opener &quot;The Sound of Law&quot; places boogie, rock, and blues tropes, Alan Vega's mutant rockabilly, surf guitar licks, and a roiling snare against a vocal delivery reminiscent of Walker's on Scott 4. The carefully stacked electronic textures highlight Gibson's dark lyrics, which juxtapose the myth of the wide-open American highway and familial dysfunction. The broken love song &quot;Franco&quot; bears ghost traces of Doc Pomus' early heartbroken rock &amp; roll poetry and the country balladry of Porter Wagoner, all held up by loop-driven percussion, as well as Gibson's emotions-laid-bare singing, which crosses a vulnerable croon with implied menace. &quot;Mad Ocean,&quot; with its sampled female vocals, comes up against his drum kit, a chanted sample of his own vocal, and bagpipe sounds above a rumbling minor-key bass and guitar duel that becomes a nearly funky streetwise lullaby. &quot;The Pisgee Nest&quot; uses a dubwise bassline, pedal steel, and loopy snare to skeletally orchestrate a forlorn sexploitation tale. \n\n  An Eastern European female vocal sample introduces the dense, fragmented, darkly reverbed country of &quot;You Don't Fade.&quot; The tracks &quot;Won't You Climb&quot; and the swaggering barroom dancefloor stomp of &quot;Kissin' on the Blacktop&quot; are hooky storytelling numbers carrying within them enough of contemporary country's own hooks that some savvy Nash Vegas producer could try to copy enough of the sound to take them to radio and perhaps the charts. On paper, the sum total of Gibson's elements should be a gimmicky mess. Not even close. Gibson is such a deft craftsman as a songwriter, arranger, and producer -- as well as an arresting if unorthodox vocalist -- that his unabashed use of other musics, production techniques, and traditions just proves his mettle. Me Moan sounds like nothing else out there; it's completely original. How often can you say that?","torrent":{"xt":"urn:btih:f842154e2780c36ba0729beec48fba001e1e546e","amp;dn":"Daughn+Gibson+-+Me+Moan+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f842154e2780c36ba0729beec48fba001e1e546e","infoHashBuffer":{"type":"Buffer","data":[248,66,21,78,39,128,195,107,160,114,155,238,196,143,186,0,30,30,84,110]},"announce":[],"urlList":[]}}