{"title":"Northrop Frye - Anatomy of Criticism &amp; other works (3 books)","uid":9518739,"size":26970658,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f844bd57e0c84ba7f47bf0e4edab368f3e3af519&amp;dn=Northrop+Frye+-+Anatomy+of+Criticism+%26amp%3B+other+works+%283+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"workerbee","files":-1,"time":1390588460,"description":"\nNORTHROP FRYE (1912-1991) was a Canadian literary critic and literary theorist, considered one of the most influential of the 20th century.  His contributions to cultural and social criticism spanned a long career during which he earned widespread recognition and received many honours.\n\nHis lasting reputation rests principally on the theory of literary criticism that he developed in ANATOMY OF CRITICISM (1957), one of the most important works of literary theory published in the twentieth century.  The American critic Harold Bloom commented at the time of its publication that Anatomy established Frye as &quot;the foremost living student of Western literature.&quot;\n\nTHE DOUBLE VISION (1991) originated in lectures delivered at the University of Toronto, the texts of which were revised and augmented.  It will appeal to scholars, students, and general readers alike who enjoyed Frye's earlier works or who are interested in the Bible, literature, literary theory and criticism, and religion.\n\nFrye's lectures on the Bible make up the first half of BIBLICAL AND CLASSICAL MYTHS (2004), expounding on an array of topics, including translations of the Bible, sexual imagery, pastoral and agricultural imagery, and law and revolution in the bible.  In the second half, Jay Macpherson narrates the major classical myths from stories of creation to the myths' survival in later European traditions.\n\n\nThe following books are in PDF format:\n\n* ANATOMY OF CRITICISM: Four Essays (Princeton University Press, 1957 / 2000).  With a new Foreword by Harold Bloom.  \n\n* BIBLICAL AND CLASSICAL MYTHS: The Mythological Framework of Western Culture [with Jay Macpherson] (University of Toronto Press, 2004).\n\n* THE DOUBLE VISION: Language and Meaning in Religion (University of Toronto Press, 1991).\n","torrent":{"xt":"urn:btih:f844bd57e0c84ba7f47bf0e4edab368f3e3af519","amp;dn":"Northrop+Frye+-+Anatomy+of+Criticism+%26amp%3B+other+works+%283+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f844bd57e0c84ba7f47bf0e4edab368f3e3af519","infoHashBuffer":{"type":"Buffer","data":[248,68,189,87,224,200,75,167,244,123,240,228,237,171,54,143,62,58,245,25]},"announce":[],"urlList":[]}}