{"title":"Don Caballero  - Discography (1993-2008) [FLAC]","uid":8706443,"size":2068803518,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f86295be942013ae7f72d2c41c033c3aa2d19227&amp;dn=Don+Caballero++-+Discography+%281993-2008%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"politux","files":-1,"time":1374157155,"description":"  \n  Don Caballero  - Discography (1993-2008) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock, Instrumental, Math Rock, Post-Rock\n  Source: CD (mix of tracks and cue and image and cue)\n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  1993 For Respect\n  1995 Don Caballero 2\n  1998 What Burns Never Returns\n  2000 American Don\n  2006 World Class Listening Problem\n  2008 Punkgasm\n\n    Pittsburgh math rockers Don Caballero were one of the first bands to expand on the work of genre innovators like Bastro, Bitch Magnet, and (especially) Slint. Their music was entirely instrumental, and while their guitar interplay was as complex and dissonant as any of their peers, the real driving force behind their precisely calibrated attack was virtuosic drummer Damon Che. In essence, it was Che's manic explosions and stop-on-a-dime shifts in time signature that mapped out the trail his bandmates followed. His whirlwind of percussion helped pace the crashing din of the rest of the quartet, yet they also had a firm grasp of dynamics and often slowed things down into a heavy dirge. And despite the influence of jazz, there was no improvisation -- all the group's compositions were carefully structured, no matter how chaotic they seemed. Don Caballero recorded several albums for Touch &amp; Go over the '90s to generally positive critical response, before going their separate ways in 2001.\n\n  Don Caballero was formed in Pittsburgh in 1991 by drummerDamon Che (b. Damon Fitzgerald), guitarists Ian Williamsand Mike Banfield, and bassist Pat Morris. Individual veterans of the local scene, they had offers for gigs before they'd even found a lead singer, and simply wound up remaining instrumental. Their name was taken from an SCTV sketch in which the Joe Flaherty character Guy Caballero was made a Mafia don. Through some personal contacts, the band got a chance to enter the studio with producer Steve Albini, who recommended them to Touch &amp; Go Records. Don Caballero released several singles on Touch &amp; Go before completing their Steve Albini-produced debut, For Respect, in 1993.\n\n  Pat Morris departed following its release, and was replaced byMatt Jencik for Don Caballero 2, a loud, ugly, intricate album that was released to rapturous reviews in 1995. Hailed as a math rock landmark in some quarters, 2 expanded the group's audience by leaps and bounds. In its wake, several Caballeroside projects sprang up: Che played guitar in another Pittsburgh band called the(e) Speaking Canaries, who issued an album not long after; Williams, meanwhile, formed an experimental side project called Storm &amp; Stress, which was most often based in Chicago. Meanwhile, Matt Jencik left the band, and went on to play with Hurl and Taking Pictures; his spot was eventually filled by Storm &amp; Stress bassist Eric Emm (aka Erich Ehm, b. M. Eric Topolsky). This new lineup released What Burns Never Returns in 1998, after which Mike Banfield left the group, reducing them to a trio.\n\n  A compilation of Don Caballero's early formative singles appeared in 1999, under the title Singles Breaking Up, Vol. 1(a reference to the Buzzcocks' Singles Going Steady). In 2000, the group issued its fourth proper album, the cleaner-sounding and more subdued American Don, which again won complimentary reviews. However, intra-band tensions conspired to break up the group by 2001. Williams and Emmreturned to Storm &amp; Stress, and Williams also formed a new outfit called Battles with Helmet drummer John Stanier. Che, meanwhile, formed Bellini in 2002 with two members of Sicilian prog rockers Uzeda. However, he left after their first album to re-form Don Caballero with an entirely new lineup, merging himself into a Pittsburgh-basedDon Cab-influenced math rock outfit formerly known as Creta Bourzia. The group returned in 2006 withWorld Class Listening Problem on the Relapse label. After recording in Rust Belt Studios with producerAl Sutton, Punkgasm was released in August of 2008, followed by a tour with Ponytail in support of the album. In 2012 archival live recording Gang Banged with a Headache and Live surfaced, a fuzzy document of a show in Chicago recorded in 2003.\n","torrent":{"xt":"urn:btih:f86295be942013ae7f72d2c41c033c3aa2d19227","amp;dn":"Don+Caballero++-+Discography+%281993-2008%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f86295be942013ae7f72d2c41c033c3aa2d19227","infoHashBuffer":{"type":"Buffer","data":[248,98,149,190,148,32,19,174,127,114,210,196,28,3,60,58,162,209,146,39]},"announce":[],"urlList":[]}}