{"title":"Cooking the Cowboy Way: Recipes Inspired by Campfires,","uid":10803574,"size":26985460,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f87cf9ebfcc4fda1d49ac80dcf13733d01a795a3&amp;dn=Cooking+the+Cowboy+Way%3A+Recipes+Inspired+by+Campfires%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1408369521,"description":"Grady Spears, June Naylor, David Manning, &quot;Cooking the Cowboy Way: Recipes Inspired by Campfires, Chuck Wagons, and Ranch Kitchens&quot;\n\nISBN: 0740773925 | 2009 | EPUB | 240 pages | 26 MB\n\nLife in the saddle, on the trail, and in the outback has forged a style of living that cowboy-turned-chef Grady Spears calls the Cowboy Way. It's a life where boots and hats are much more about function than fashion. It means that when you eat, drink, and breathe the tending of cattle, raising beef is not just some exercise where loss is charted on a spreadsheet. When your days are filled with the smells of fresh-cut hay and the creaking of worn leather, when you wake up with the sun and to the smell of coffee on the boil and biscuits from the chuck wagon, you are living the Cowboy Way.\n\nBecause cowboys spend long days outdoors in every kind of weather, sometimes for weeks at a time, satiating a cowboy's hunger is a challenge for ranch cooks from Texas to Florida, north into Canada, and south of the border into Mexico. This collection of almost one hundred recipes is not only the result of Grady's journey across North America, but also the cowboy's journey through history.","torrent":{"xt":"urn:btih:f87cf9ebfcc4fda1d49ac80dcf13733d01a795a3","amp;dn":"Cooking+the+Cowboy+Way%3A+Recipes+Inspired+by+Campfires%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f87cf9ebfcc4fda1d49ac80dcf13733d01a795a3","infoHashBuffer":{"type":"Buffer","data":[248,124,249,235,252,196,253,161,212,154,200,13,207,19,115,61,1,167,149,163]},"announce":[],"urlList":[]}}