{"title":"WavePad_Audio_Editor_Masters_Edition_4.59_Portable","uid":6484872,"size":2631847,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f9316a06a653fbe2367a592bcde135dd94314705&amp;dn=WavePad_Audio_Editor_Masters_Edition_4.59_Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1308669809,"description":"WavePad Audio Editor Master's Edition 4.59 Portable\n\nThis audio editing software is a full featured professional audio and music editor for Windows and Mac OS X. It lets you record and edit music, voice and other audio recordings. When editing audio files you can cut, copy and paste parts of recordings then add effects like echo, amplification and noise reduction. WavePad works as a wav or mp3 editor but it also supports a number of other file formats including vox, gsm, wma, real audio, au, aif, flac, ogg and more.\n\nAudio Editor Features\nSound editing functions include cut, copy, paste, delete, insert, silence, autotrim and more\nAudio effects include, amplify, normalize, equaliser, envelope, reverb, echo, reverse and many more\nIntegrated VST plugin support gives professionals access to thousands of additional tools and effects\nRecommended Free VST Plugin Effects\nIncludes free sound effect and music library\nSupports almost all audio and music file formats including mp3, wav, vox, gsm, wma, au, aif, flac, real audio, ogg, aac, m4a, mid, amr and many more\nBatch processing allows you to apply effects and/or convert thousands of files as a single function\nTools include spectral analysis (FFT), speech synthesis (text-to-speech) and voice changer\nAudio restoration features including noise reduction and click pop removal\nSupports sample rates from 6 to 196kHz, stereo or mono, 8, 16, 24 or 32 bits\nIncludes its own CD ripper with 'ultrafast' rip mode and cddb music database lookup\nWorks directly with MixPad multi-track audio mixing, Zulu DJ software and Express Burn CD Recorder.\nEasy to use interface will have you editing in minutes\n\nTypical Audio Editing Applications\nSoftware audio editing for studios and professional journalists.\nEdit sound files to broadcast over the internet with the BroadWave Streaming Audio Server\nNormalizing the level of audio files during mastering before burning to CD.\nEditing mp3 files for your iPod, PSP or other portable device.\nAs a music editor (includes ringtones creator formats).\nMusic editing and recording to produce mp3 files.\nVoice editing for multimedia productions (use with our Video Editor).\nRestoration of audio files including removing excess noise such as hiss and hums.\n\nHome Page - http://www.nch.com.au/\n\n","torrent":{"xt":"urn:btih:f9316a06a653fbe2367a592bcde135dd94314705","amp;dn":"WavePad_Audio_Editor_Masters_Edition_4.59_Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9316a06a653fbe2367a592bcde135dd94314705","infoHashBuffer":{"type":"Buffer","data":[249,49,106,6,166,83,251,226,54,122,89,43,205,225,53,221,148,49,71,5]},"announce":[],"urlList":[]}}