{"title":"Richard Castle - Nikki Heat 02 - Naked Heat","uid":9998459,"size":636043054,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f9b1177199aeed9356a3d6b88fc5c8e54d5907fb&amp;dn=Richard+Castle+-+Nikki+Heat+02+-+Naked+Heat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"metheguy","files":-1,"time":1397950755,"description":"Richard Castle - Nikki Heat 02 - Naked Heat\n\nNikki Heat 02  \n2010\n\nRead by: Johnny Heller \nDuraton: 11h 02mn\n\nUnabridged: Yes\n\n\nAudio: MP3, 2-channel stereo, 128 Kbps @ 48000 Hz, CBR\n\n\n\nWhen New York's most vicious gossip columnist, Cassidy Towne, is found dead, Heat uncovers a gallery of high profile suspects, all with compelling motives for killing the most feared muckraker in Manhattan. \n\nHeat's murder investigation is complicated by her surprise reunion with superstar magazine journalist Jameson Rook. In the wake of their recent breakup, Nikki would rather not deal with their raw emotional baggage. Butt the handsome, wisecracking Pulitzer Prize winning writer's personal involvement in the case forces her to team up with Rook anyway. The residue of their unresolved romantic conflict and crackling sexual tension fills the air as Heat and Rook embark on a search for a killer among celebrities and mobsters, singers and hookers, pro athletes and shamed politicians. \n\nThis new, explosive case brings on the heat in the glittery world of secrets, cover-ups, and scandals. \n \nCastle is the title of a television cop show in which a mystery novelist, Richard Castle, teams up with a female NYPD detective (under the pretense of conducting research). In the show, Castle writes novels about a female New York cop, Nikki Heat, who reluctantly pairs up with a writer, Jameson Rook, who's a fictionalized version of Castle himself. Got all that? Anyway, Naked Heat is the second Nikki Heat novel, credited, like the first (Heat Wave, 2009) to 'Richard Castle'. Leaving aside the fiction-within-another-fiction conceit, it's a pretty fair mystery. Heat and Rook are written in the familiar 'contempt-breeds-familiarity' style: they start out antagonists and wind up partners (and more). We've seen them before, with other names in other stories, and we like them because they're comfortable. The story, which begins with a pair of murders that appear to be connected only by their MO, is slick and enjoyable without being too taxing on the reader's imagination. The book is exactly what it's supposed to be: an entertaining but undemanding mystery that should draw attention to the TV series from which it's spun off.\n\n\nHIGH-DEMAND BACKSTORY: The TV series Castle is a big hit, and many of its fans will be curious to read a 'real' book by their favorite fictional mystery writer.\n\n--David Pitt \n","torrent":{"xt":"urn:btih:f9b1177199aeed9356a3d6b88fc5c8e54d5907fb","amp;dn":"Richard+Castle+-+Nikki+Heat+02+-+Naked+Heat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9b1177199aeed9356a3d6b88fc5c8e54d5907fb","infoHashBuffer":{"type":"Buffer","data":[249,177,23,113,153,174,237,147,86,163,214,184,143,197,200,229,77,89,7,251]},"announce":[],"urlList":[]}}