{"title":"Hardtied--Spread and Exposed  Kristina Rose Elise Graves Cyd Bla","uid":9547413,"size":1256395362,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:f9bb2e3cecc296ea87fd7b3bc5a0fdc126f50f46&amp;dn=Hardtied--Spread+and+Exposed++Kristina+Rose+Elise+Graves+Cyd+Bla&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"merzedes","files":-1,"time":1391156581,"description":"Spread and Exposed | Kristina Rose | Elise Graves | Cyd Black\n\nJanuary 29, 2014\n\n\nMP4 only.\n\n\nCyd Black and Elise Graves got a pretty sweet deal. A pretty simple one, too. Deliver Kristina Rose, unmarked and unharmed, and there is a huge payday in it for them. The terms do not, however, say that they can't have some fun with her, especially if the client is late to the pick up. \n\nThey didn't need to strip her down to her underwear and tie her spread-eagle on the bed. That part is just a little bit of customer service that they like to include for free. Girls like Kristina get picked out for a reason. They fit the 3 P's: Pure, Pampered, and Pretentious. All it takes is a man with the right connections to make a few phone calls and the next thing she knows she is whisked from a world of spas, salons, and clubs to one of bondage, discipline, and sex. \n\nBeing stripped and exposed gets the girl into the right state of mind when her new owner comes to take possession of her. It's basic psychology that Cyd and Elise have exploited before. The less they're wearing, and the more vulnerable their position, the less likely they are to put up much of a fight. \n\nThis particular client was so vague with his directions. Don't leave a mark? That's an easy one. A flogger on Kristina's asshole and pussy might turn her bright red but they aren't going to leave her covered in bruises. Nipple clamps are going to give her a pinch she won't soon forget but there won't be a trace of them left by the time her owner arrives. \n\nKristina's captors are feeling pretty generous today. Or maybe they are just bored. Either way, once they get going they decide to give her a full lesson in what her new life is going to be like. They grab some toys and get to work. Kristina grits her teeth against the gag in her mouth and tries her best not to give them the satisfaction of hearing her scream. She doesn't understand that they aren't trying to get anything from her. She isn't the prize or the game. She's the toy. It doesn't matter to them how she reacts. It is the act of hurting her that they enjoy.  \n \nScreens &lt;a href=&quot;\nhttp://hardtied.com/hogtied/bondage/2014/01_29krose2/Hardtied-Kristina-Rose-Elise-Graves-Cyd-Black-Spread-and-Exposed.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hardtied.com/hogtied/bondage/2014/01_29krose2/Hardtied-Kristina-Rose-Elise-Graves-Cyd-Black-Spread-and-Exposed.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:f9bb2e3cecc296ea87fd7b3bc5a0fdc126f50f46","amp;dn":"Hardtied--Spread+and+Exposed++Kristina+Rose+Elise+Graves+Cyd+Bla","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9bb2e3cecc296ea87fd7b3bc5a0fdc126f50f46","infoHashBuffer":{"type":"Buffer","data":[249,187,46,60,236,194,150,234,135,253,123,59,197,160,253,193,38,245,15,70]},"announce":[],"urlList":[]}}