{"title":"Kurt Elling - Nightmoves [WRU] TQMP","uid":4646997,"size":420619636,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:faa75338e02bc7e81247e2fd822fa053e8450554&amp;dn=Kurt+Elling+-+Nightmoves+%5BWRU%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"DeathRay2K","files":22,"time":1231920141,"description":"Details:\nIncludes the highest quality FLAC rips of the entire album, Nightmoves by The Kurt Elling.\nAlso includes all the album art (There is a lot) in 300dpi PNG images, including the CD label.\nThis is basically a perfect rip. ;)\nI should note though, I did not include a cue, as it's split into songs and info is encoded in the metadata.\n\nTracks:\n   1. Nightmoves  (4:23)\n   2. Tight  (2:55)\n   3. Change Partners/If You Never Come To Me  (7:38)\n   4. Undun  (5:10)\n   5. Where Are You?  (5:27)\n   6. And We Will Fly  (4:23)\n   7. The Waking  (4:13)\n   8. The Sleepers  (5:31)\n   9. Leaving Again/In The Wee Small Hours  (5:04)\n  10. Body And Soul  (10:20)\n  11. I Like The Sunrise  (6:53)\n\nAmazon:\nChicago vocalist Kurt Elling's limber and deep tenor voice is at home in a myriad of idioms, from straight-ahead, Latin, and pop, to poetry, and his wide artistic range is fully reflected in his Concord debut. As in his six previous recordings, his longtime pianist-arranger Laurence Hobgood is at the helm of his trio, with special guests including bassist Christian McBride, Yellowjackets saxophonist Bob Mintzer, and the Escher String Quartet. Building on Jon Hendricks's and Eddie Jefferson's scat-vocalese styles, Elling lyrically caresses and melodically illuminates Michael Franks' title track, jazz diva Betty Carter's angular &quot;Tight,&quot; and the rarely-performed Duke Ellington number &quot;I Like the Sunrise.&quot; The Guess Who's 1969 rock cut &quot;Undun,&quot; surprisingly, comes off, as does the bossa nova &quot;Change Partners/If You Never Come to Me,&quot; with its reference to Antonio Carlos Jobim's &quot;Useless Landscape.&quot; The question is: what can't he sing?\n\nTQMP:\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se  (Simply use the TQMP searchtag :)","torrent":{"xt":"urn:btih:faa75338e02bc7e81247e2fd822fa053e8450554","amp;dn":"Kurt+Elling+-+Nightmoves+%5BWRU%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"faa75338e02bc7e81247e2fd822fa053e8450554","infoHashBuffer":{"type":"Buffer","data":[250,167,83,56,224,43,199,232,18,71,226,253,130,47,160,83,232,69,5,84]},"announce":[],"urlList":[]}}