{"title":"Pragmatism, An Introduction- Michael Bacon [PDF] [StormRG]","uid":10835327,"size":1274723,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fadb9aa76597bb6ab46cb3b4732036bda7a65993&amp;dn=Pragmatism%2C+An+Introduction-+Michael+Bacon+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"F1restorm","files":-1,"time":1408676997,"description":"Pragmatism: An Introduction\nAuthor: Michael Bacon\nPublished: 2013\nPublisher: Polity\nISBN: 9780745646657 \nFormat: Retail PDF\n_____________________________________________________________________________\n\nPragmatism: An Introduction provides an account of the arguments of the central figures of the most important philosophical tradition in the American history of ideas, pragmatism. This wide-ranging and accessible study explores the work of the classical pragmatists Charles Sanders Peirce, William James and John Dewey, as well as more recent philosophers including Richard Rorty, Richard J. Bernstein, Cheryl Misak, and Robert B. Brandom.\nMichael Bacon examines how pragmatists argue for the importance of connecting philosophy to practice. In so doing, they set themselves in opposition to many of the presumptions that have dominated philosophy since Descartes. The book demonstrates how pragmatists reject the Cartesian spectator theory of knowledge, in which the mind is viewed as seeking accurately to represent items in the world, and replace it with an understanding of truth and knowledge in terms of the roles they play within our social practices.\n\nThe book explores the diverse range of positions that have engendered marked and sometimes acrimonious disputes amongst pragmatists. Bacon identifies the themes underlying these differences, revealing a greater commonality than many commentators have recognized. The result is an illuminating narrative of a rich philosophical movement that will be of interest to students in philosophy, political theory, and the history of ideas.\n\n","torrent":{"xt":"urn:btih:fadb9aa76597bb6ab46cb3b4732036bda7a65993","amp;dn":"Pragmatism%2C+An+Introduction-+Michael+Bacon+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fadb9aa76597bb6ab46cb3b4732036bda7a65993","infoHashBuffer":{"type":"Buffer","data":[250,219,154,167,101,151,187,106,180,108,179,180,115,32,54,189,167,166,89,147]},"announce":[],"urlList":[]}}