{"title":"Robert Hughes - Nothing If Not Critical: Essays on Art and Artis","uid":11441837,"size":2433092,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb546ed8efefda10e75377baa5366d496aa6cc2a&amp;dn=Robert+Hughes+-+Nothing+If+Not+Critical%3A+Essays+on+Art+and+Artis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"workerbee","files":-1,"time":1415817005,"description":"\n* Robert Hughes - NOTHING IF NOT CRITICAL: Selected Essays on Art and Artists (Knopf, 1990).  429 pp. -- ePUB\n\n\nThe most controversial art critic in America -- author of the bestselling &quot;The Shock of the New&quot; -- looks with love and loathing, wit and authority, at art and artists from the past to the present.  This collection of over 90 essays spans four centuries of Western art -- from Caravaggio to Picasso to Schnabel -- and its reception and marketing by curators, dealers and collectors.  Most essays take the form of brief reviews, yet each is crammed with enough historical fact and anecdote to delight connoisseurs and inform novices.\n\nAlso by Robert Hughes:\n\n* THE SHOCK OF THE NEW: The Hundred-Year History of Modern Art (Knopf, 1991) &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/9201648/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/9201648/&lt;/a&gt;\n\n\nReviews\n\n&quot;Hughes's emphasis on social and political contexts and on artistic content balances the storehouse of provocative opinion he dispenses, which becomes increasingly caustic as he fixes his eye on the end of the 20th century.  His analysis of today's bull art market is insightful, as is his critique of the theoretical frameworks that disguise much bad art, but the critic's disgust at contemporary art hype sometimes overwhelms him.  The New York art world, he prophesies, is fast approaching apocalypse -- and its shamelessly go-getting members should be sent back to art school to learn how to draw.  When he is not blowing such conservative horns, Hughes provides multiple interesting ventures into the aesthetic and economic histories of Western visual culture.&quot; -- Publishers Weekly\n\n&quot;This collection brings together over 90 essays, many of which have already appeared in major journals. Hughes considers the Masters, 19th-century art and artists, the Modernist spirit, American and European painters, and contemporary artists in prose that is historically informative, understandable, witty, and often opinionated.  Perhaps most interesting is Hughes's introduction, a recognition and partial analysis of New York City's decline as the center of the art world.  This well-written, thought-provoking collection will appeal to most who find art and the art world important and entertaining.&quot; -- Library Journal\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                              &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!","torrent":{"xt":"urn:btih:fb546ed8efefda10e75377baa5366d496aa6cc2a","amp;dn":"Robert+Hughes+-+Nothing+If+Not+Critical%3A+Essays+on+Art+and+Artis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb546ed8efefda10e75377baa5366d496aa6cc2a","infoHashBuffer":{"type":"Buffer","data":[251,84,110,216,239,239,218,16,231,83,119,186,165,54,109,73,106,166,204,42]},"announce":[],"urlList":[]}}