{"title":"The Five People You Meet in Heaven by Mitch Albom [==HxH==]","uid":10766490,"size":762564,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fbbd366f7ae8585eff957b2f142b3c439b38aa46&amp;dn=The+Five+People+You+Meet+in+Heaven+by+Mitch+Albom+%5B%3D%3DHxH%3D%3D%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Sunghabib","files":-1,"time":1408035745,"description":"Book Description:\n\nA specially produced paperback edition--with flaps--of the phenomenal #1 New York Times bestseller, that has sold more than six million copies in hardcover\n\nEddie is a grizzled war veteran who feels trapped in a meaningless life of fixing rides at a seaside amusement park. His days are a dull routine of work, loneliness, and regret.\n\nThen, on his 83rd birthday, Eddie dies in a tragic accident, trying to save a little girl from a falling cart. He awakens in the afterlife, where he learns that heaven is not a lush Garden of Eden, but a place where your earthly life is explained to you by five people. These people may have been loved ones or distant strangers. Yet each of them changed your path forever.\n\nOne by one, Eddie's five people illuminate the unseen connections of his earthly life. As the story builds to its stunning conclusion, Eddie desperately seeks redemption in the still-unknown last act of his life: Was it a heroic success or a devastating failure The answer, which comes from the most unlikely of sources, is as inspirational as a glimpse of heaven itself.\n\nIn The Five People You Meet in Heaven, Mitch Albom gives us an astoundingly original story that will change everything you've ever thought about the afterlife--and the meaning of our lives here on earth. With a timeless tale, appealing to all, this is a book that readers of fine fiction, and those who loved Tuesdays with Morrie, will treasure.\n\nProduct Details:\n\nPaperback: 116 pages\nPublisher: Hachette Books; Reprint edition (March 1, 2006)\nLanguage: English\nISBN-10: 1401308589\nISBN-13: 978-1401308582\nAmazon Link:\n\n\n-------\nSeed - Share - Enjoy - Give me Thumbs Up\n-------","torrent":{"xt":"urn:btih:fbbd366f7ae8585eff957b2f142b3c439b38aa46","amp;dn":"The+Five+People+You+Meet+in+Heaven+by+Mitch+Albom+%5B%3D%3DHxH%3D%3D%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbbd366f7ae8585eff957b2f142b3c439b38aa46","infoHashBuffer":{"type":"Buffer","data":[251,189,54,111,122,232,88,94,255,149,123,47,20,43,60,67,155,56,170,70]},"announce":[],"urlList":[]}}