{"title":"Neil Gaiman - Trigger Warning - Short Fictions and Disturbances","uid":15485800,"size":318807877,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fbf27f7e678e28f24471692f882499d979c19167&amp;dn=Neil+Gaiman+-+Trigger+Warning+-+Short+Fictions+and+Disturbances&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Laverna","files":27,"time":1470319989,"description":"Neil Gaiman returns to dazzle, captivate, haunt, and entertain with this third collection of short fiction following Smoke and Mirrors and Fragile Things--which includes a never-before-published American Gods story, &quot;Black Dog&quot;, written exclusively for this volume.\r\n\r\nIn this new anthology, Neil Gaiman pierces the veil of reality to reveal the enigmatic, shadowy world that lies beneath. Trigger Warning includes previously published pieces of short fiction--stories, verse, and a very special Doctor Who story that was written for the fiftieth anniversary of the beloved series in 2013--as well as &quot;Black Dog&quot;, a new tale that revisits the world of American Gods, exclusive to this collection.\r\n\r\nTrigger Warning explores the masks we all wear and the people we are beneath them to reveal our vulnerabilities and our truest selves. Here is a rich cornucopia of horror and ghost stories, science fiction and fairy tales, fabulism and poetry that explore the realm of experience and emotion. In &quot;Adventure Story&quot;--a thematic companion to The Ocean at the End of the Lane--Gaiman ponders death and the way people take their stories with them when they die. His social media experience &quot;A Calendar of Tales&quot; are short takes inspired by replies to fan tweets about the months of the year--stories of pirates and the March winds, an igloo made of books, and a Mother's Day card that portends disturbances in the universe. Gaiman offers his own ingenious spin on Sherlock Holmes in his award-nominated mystery tale &quot;The Case of Death and Honey&quot;. And &quot;Click-Clack the Rattlebag&quot; explains the creaks and clatter we hear when we're all alone in the darkness.\r\n\r\nFull of wonder and terror, surprises and amusements, Trigger Warning is a treasury of delights that engage the mind, stir the heart, and shake the soul from one of the most unique and popular literary artists of our day. \r\n\r\nRead by Neil Gaiman\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:fbf27f7e678e28f24471692f882499d979c19167","amp;dn":"Neil+Gaiman+-+Trigger+Warning+-+Short+Fictions+and+Disturbances","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbf27f7e678e28f24471692f882499d979c19167","infoHashBuffer":{"type":"Buffer","data":[251,242,127,126,103,142,40,242,68,113,105,47,136,36,153,217,121,193,145,103]},"announce":[],"urlList":[]}}