{"title":"Top 100 Best Techno, Trance Dance Songs, Vol. 7","uid":6073677,"size":959590608,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fc0a368b49c13e69ef27f6d4f67ae1520e9ec54f&amp;dn=Top+100+Best+Techno%2C+Trance+Dance+Songs%2C+Vol.+7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"SweetTechno90","files":104,"time":1293734033,"description":"Best Of Techno, Hands Up &amp; Dance, Vol.7!!\n\nTorrent dedicated to all my youtube subscribers ^^\n\n\nTracklist:\n\n\nAlex M. - I Believe (DJ Tht &amp; Ced Tecknoboy Extended Mix)  \nAlex M. vs Marc Van Damme - Children Of The Night (Original Mix)  \nAndrew Spencer And The Vamprockerz - Zombie (Ray Knox Remix) \nAyhouse &amp; Tomkay feat. Tommy Clint - Still Believe (Dan Winter's Trance In The Air Remix)    \nBasslovers United  - Ghetto Supastar (Dj Gollum Remix)   \nBasslovers United  - We Love Bass Vol. 6\nBuzzy - We Are Alive (DJ Novus ft Grooveriders Remix Edit)  \nClubgroovers - Warriors of Love (Rob Mayth Remix)   \nCommercial Club Crew - Everytime I Try (DJ THT Remix)  \nCrystal Lake - Your Style (Radio Edit) \nCulcha Candela - Monsta (Raindropz Bootleg Mix)  \nDanielle Paris - I Can't Stand It (Cascada Mix Edit)   \nDanny-E &amp; Setze - Anytime (MaLu Project Remix)  \nDavid Guetta - Gettin Over You (G4bby&amp;Fab Bootleg \nDennis Christopher - Set it off (Ti-Mo Remix)   \nDJ Alexkea - Ramalama Ding Dong 2K10 (Phillerz Remix)  \nDJ Gollum - Get On The Floor (Original Mix)  \nDJ Gollum Feat. Scarlet - All The Things She Said \nDJ MNS vs E-MaxX - Solo Por Ti (Megastylez Remix)\nDJ Ostkurve vs. Sin with Sebastian - Shut Up (And Sleep With Me) (The Hitmen Single Edit) \nDJ Sequenza - Lost In Dreams (Ti-Mo Remix)  \nDJ THT and Ced Tecknoboy - Carnaval de Paris (Bootleg Mix) \nDJ's @ Work - Someday (Empyre One Bootleg Mix) \nEkowraith - Waiting For Tonight (Ti-Mo Remix)  \nEminem feat. Rihanna - Love The Way You Lie (Sun Kidz Electrocore Bootleg Mix)  \nEmporio feat. Penelope - September Rain (Sun Kidz RMX)   \nEmpyre One - Moonlight Shadow (Original Club Mix) \nEmpyre One feat. Scarlet - I Turn To You (Original Radio Mix) \nEnerg!zer - Alone (G4bby feat Bazz Boyz Remix)  \nFar East Movement feat. The Cataracs - Like A G6 (Bootleg Mix)  \nFlip &amp; Fill ft. Mr Vegas - Kokaine (The Real Booty Babes Remix)   \nFridge vs The Hitmen - Angel 2.8 ( The Hitmen Club Mix)\nG! - 8 (Giorno Bootleg Mix) \nG.K. Project &amp; Lance - Cold As Ice (Monday 2 Friday Remix) \nGiorno - Pretending Happiness (Ti-Mo Edit) \nGroove Chasers - Airplanes (Kris McTwain Mix) \nGroove Chasers - DJ Got Us Falling In Love (Kris McTwain Mix) \nGroove Coverage - Innocent (Cc.K Remix) \nGuenta K - The Phantom (Club Rockerz Remix)  \nGuru Josh Vs Rocco Bass-T - I Can't Take Infinity (Dj Analyzer Bootleg Mix) \nHunter &amp; Dragon - What Can I Say (Lanai RMX) \nIcon - Dangerous (Giorno's Jump &amp; Run Remix) \nIllbe4t - Jambao (Cc.K Remix)  \nInara - Don't Believe (DJ THT Remix) \nInna - Amazing (Frisco Mix) \nIntusgate &amp; Nika - Fliegen (Cc.K Remix)  \nJan Van Bass-10 - Behind Blue Eyes (Megastylez ReMix) \nJan Wayne Pres. Gorgeous X - Black Velvet (Gollum  vs. Jan Wayne Remix)   \nJason Born - Hey Soul Sister (Kris Mctwain Radio Mix)  \nJayden Felder - When Will Love (Ced Tecknoboy Bootleg Mix)  \nJenny Drew meets Cc.K - This Is The Life (Cc.K Remix) \nJens O. - Hands Up! (Megastylez ReMix Edit) \nJens O Vs Ti-Mo - The Power Of Love\nJens O vs Ti-Mo - We All Like Dick (Club Mix) \nJessy Matador - Allez Ola Ole (PJ-Project Bootleg Remix)   \nKaoma - Lambada (Plac!d Bootleg Mix) \nKaty Perry ft. Snoop Dog - California Gurls (Cueboy Tribune Remix) \nKeri Hilson - I Like (Dee Doubleyou aka Dan Winter Bootleg) \nKesha - Tik Tok (Ti-Mo Bootleg Mix) \nLa Roux - Bulletproof (Breakdawner vs Chris Wittig Bootleg Mix) \nLara McAllen - Won't Get Another Night (Blunatix vs B-Tastic Remix) \nLena Meyer Landrut - Satellite (Jens O. Vs Ti-Mo Extended_Bootleg)  \nLevel 4 vs DJ Deamon - Still Loving You (Sun Kidz Extended)   \nLiz Kay - To France (Dj Tht Remix)   \nLolita - Joli garcon (Ron Bon Beat Project Remix Edit)  \nLoona - Vamos A La Playa (Dan Winter Edit)  \nLove Unit - Jessie's Song (Klubbingman Vs. Clubbticket Remix Edit) \nMarc Korn - Touch The Sky (The Hitmen Remix)   \nMedina - Kun For Mig (Raindropz! Booty Mix)   \nMegastylez - The Ketchup Song (Asereje) (Radio Mix)   \nMG Traxx - I Like (Extended Mix)  \nMiradey - Sayonara (Cc.k Remix) \nMoney-G - Schwerelos (Empyre One Remix Edit)    \nMonkey Business - One More Try (Empyre One edit)\nNina - No More Tears (Cc. K Meets Klischee Remix) \nNoemi - Ti Sento (Bastiano Breeze and Gino M Remix) \nN-Trance - Set You Free 2k9 (Rocco &amp; Bass-T Remix)  \nOrangez - Meet Me Halfway (B Tastic Remix) \nPartycheckerz - Baby I Love Your Way (Flashrider Remix)\nPete Sheppibone - The Highjacker (Justin Corza Meets Greg Blast Remix Edit)  \nPH Electro - Englishman In New York (Ti-Mo Remix)  \nPi - 3 Words (B-Tastic Mix)  \nPi - One Love (B-Tastic Remix Edit)  \nPicco - Yeke Yeke (The Real Booty Babes Remix) \nRainDropz! Vs. Le Click - Tonight is the Night (Phillerz Bootleg Mix)\nRay Knox - Corcovado (Ti-Mo Remix)   \nRivendell - Club Can't Handle Me (Hands Up Mix)  \nRivendell Feat. Cruncher - Sexy Bitch\nSam A. Music - Jungrunn\nSasha Dith - I Love Dance (Crystal Lake Remix)  \nScarlet - Blah Blah Blah (Cueboy Vs Tribune Remix)  \nScarlet - Your Love Is My Drug (Kris Mctain &amp; B-Tastic Remix)   \nSeven Oh - Never Let You Go (DJ Gollum Remix)  \nStromae - Alors On Danse (Dan Winter Bootleg)   \nStuff &amp; Floor - Up To The Beat (Marco Van Bassken vs Hide &amp; Seek Remix)  \nSun Kidz Feat Sandra - Forever (Original Radio Edit)  \nSunset Project Meets Steve Stio -  Fay (Giorno Remix)  \nThe Real Booty Babes - Like A Lady\nThe Real Booty Babes - Rock (Club Mix) \nTimbaland feat. Katy Perry - If We Ever Meet Again (B-Tastic &amp; Deltaforcez Bootleg Mix)  \nVenus Jones - Alejandro (Short Mix) \nVenus Jones - I Got You (E-Nergy Remix)  \nVerde Feat Siobhan - Forever (De-Grees Remix)  \nYolanda Be Cool &amp; DCUP - We No Speak Americano (Energ!zer vs RainDropz! Booty Mix)  ","torrent":{"xt":"urn:btih:fc0a368b49c13e69ef27f6d4f67ae1520e9ec54f","amp;dn":"Top+100+Best+Techno%2C+Trance+Dance+Songs%2C+Vol.+7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc0a368b49c13e69ef27f6d4f67ae1520e9ec54f","infoHashBuffer":{"type":"Buffer","data":[252,10,54,139,73,193,62,105,239,39,246,212,246,122,225,82,14,158,197,79]},"announce":[],"urlList":[]}}