{"title":"[PS3] Star Wars: The Force Unleashed II","uid":9472661,"size":10840357006,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:fc44b4aabf2759546295a7f94d2a33639c40d8fa&amp;dn=%5BPS3%5D+Star+Wars%3A+The+Force+Unleashed+II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"fuckface69","files":-1,"time":1389618261,"description":" &lt;a href=&quot;http://lucasarts.com/games/theforceunleashed2/game/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://lucasarts.com/games/theforceunleashed2/game/index.html&lt;/a&gt;\n\nContinue the galaxy-altering journey of Starkiller, Darth Vader's fugitive apprentice, that shapes the key events between Star Wars: Episode III and Episode IV.\nUnleash the Force with more power and precision through improved controls and new powers, such as the deceptive Mind Trick, which turns enemies against their allies.\nDiscover the true power of Starkiller with Force Fury, where his attacks and Force powers are exponentially increased.\nImproved targeting system enhances precision use of Force powers and greater interaction with puzzles and the environment.\nTake combat to the next level with the ability to wield dual lightsabers and punish enemies with all-new combo attacks.\nExperience the most life-like interactions with Pixelux Entertainment's Digital Molecular Matter (DMM) coupled with euphoria from Natural Motion Ltd and the powerful Havok Physics system.\nExpanded customization options such as new costumes and power-enhancing lightsaber crystals.\nFight through all-new challenge levels designed to test and hone your fighting and Force power skills.\nSkillfully manage your combat techniques to defeat a variety of brand-new enemies, which will culminate in epic boss battles.\nImmerse yourself once again in the story that was honored with awards from the Writer's Guild of America and the Academy of Interactive Arts and Sciences.\nChallenge your friends to a 4-player Force showdown on Wii in chaotic fighting game-style combat.","torrent":{"xt":"urn:btih:fc44b4aabf2759546295a7f94d2a33639c40d8fa","amp;dn":"%5BPS3%5D+Star+Wars%3A+The+Force+Unleashed+II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc44b4aabf2759546295a7f94d2a33639c40d8fa","infoHashBuffer":{"type":"Buffer","data":[252,68,180,170,191,39,89,84,98,149,167,249,77,42,51,99,156,64,216,250]},"announce":[],"urlList":[]}}