{"title":"Springy 1.5+License.zip","uid":4822418,"size":10986063,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:fc52e9467e906f8d55f10ea7893bc4d5ef2b3c0e&amp;dn=Springy+1.5%2BLicense.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Traavis","files":1,"time":1238814945,"description":" &lt;a href=&quot;http://www.springyarchiver.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.springyarchiver.com/&lt;/a&gt;\n\n\nSpringy is a simple to use, yet powerful archiving and compression utility for Mac OS X. Springy integrates seamlessly with the Finder and includes some very useful features. All archiving tasks can be done via Drag and Drop or through Springy's Finder contextual menu.\n\nWHAT'S NEW\nVersion 1.5:\n\nNo Panther support. Starting with version 1.5, first release of Tiger (10.4) or above is required.\nSpringy contextual menu is shown in the root of Finder contextual menu even in Leopard, diving into More submenu is not needed any more (contextual menu plug-in only).\nComplete support for archiving and extraction of files containing extended attributes, ACL lists and quarantine data, in accordance with AppleDouble standard.\nRedesigned and enhanced handling and processing of RAR archives, bringing faster operation, less memory and disk I/O usage and better error handling.\nImproved processing of DMG and ISO disk images.\nMuch better treatment of non-ASCII characters in file names inside TAR, PAX and CPIO archives.\nUTI are now used to distinguish recognisable file types application can handle (application only).\nSpringy now tries to open every file handed to it, even if UTI suggests non-recognisable file type. If a file is any of archive type Springy can handle, it is successfully open regardless of UTIs. Otherwise, Springy will report that the file is not recognisable archive.\nAdded option to either quickly archive/add files into an archive using default archiving parameters, or to choose particular parameters just prior start of archiving.\nAdded option to either quickly extract files to the archive's enclosing folder, or to choose particular extraction location (application only).\nArchive and compressed file operations can be paused and continued at any time.\nModified archive processing so that files partially processed due to an error are preserved and the operation is continued, with option to abort it completely.\nComplete redesign of view preferences panes (application only).\nAdded option to show real file contents as file icons in addition to standard file type icons (application only).\nRedesigned and enhanced preview column in column view (application only).\nAdded option to show real file contents in a preview column in addition to standard file type icon (application only).\nSorting of listed files in all three view types (icons, list, columns) using all available file attributes (name, dates, comment, etc...) for sorting criteria (application only).\nAdded option to show list of files in list view and search view using alternate row colours (application only).\nAdded path text field, which enables easy positioning to particular folder in an archive just by typing folder full path into it (application only).\nAdded option to show real characters in password secure text fields in addition to masking them with bullets.\nNew application icon (includes 512x512px version for Leopard).\nNew document icons for all supported file types (include 512x512px version for Leopard).\nRedesigned alarm panels and sheets, removing all possible incorrect rendering and quirks.\nNew licensing system.\nSparkle framework code directly included into contextual menu plug-in, not as a framework as before, thus eliminating occasional crashes which some users experienced (contextual menu plug-in only).\nRedesigned preference panel.\nRedesigned About Panel, which now includes licensing information.\nMaximal number of recent extraction locations increased to 20.\nMaximal number of favourite extraction locations increased to 40.\nMany changes in UI in order to unify experience in both Tiger and Leopard and to make it even more Finder-alike (application only).\nMenu items for archive creation moved one level up in the hierarchy (contextual menu plug-in only).\nFixed bug which sometimes caused setting of wrong permissions of files extracted from ZIP archives.\nFixed bug which enabled renaming a file to a same name as some other file in the same archive (application only).\n\nREQUIREMENTS\nMac OS X 10.4 or later.","torrent":{"xt":"urn:btih:fc52e9467e906f8d55f10ea7893bc4d5ef2b3c0e","amp;dn":"Springy+1.5%2BLicense.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc52e9467e906f8d55f10ea7893bc4d5ef2b3c0e","infoHashBuffer":{"type":"Buffer","data":[252,82,233,70,126,144,111,141,85,241,14,167,137,59,196,213,239,43,60,14]},"announce":[],"urlList":[]}}