{"title":"I soliti ignoti, [DVD9 - Ita] Commedia [Tntvillage]","uid":5407843,"size":5250107392,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fe45b8181528b063ea502a7bec9b4056dfecec6b&amp;dn=I+soliti+ignoti%2C+%5BDVD9+-+Ita%5D+Commedia+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"year2012","files":14,"time":1267655813,"description":"I soliti ignoti, [DVD9 - Ita] Commedia [Tntvillage]\n\n\nI soliti ignoti\n by anno2036\n\nLocandina del film\n Visit this link: http://www.antoniodecurtis.com/loc81.jpg\n\nSCHEDA DEL FILM\nRegia :  Mario Monicelli\nSoggetto : Age,Scarpelli\nSceneggiatura : Age,Scarpelli,Cecchi d'Amico,Monicelli\nFotografia : Gianni Di Vinanzo\nScenografia : Piero Gherardi\nMusica : Piero Umiliani\nMontaggio : Adriana Novelli\nAiuto regia : Mario Maffei\nDirettore produzione : NicolÃƒÂ² Pomilia\nProduzione : Franco Cristaldi per Vides,Lux Film,Roma\nDurata: 102 minuti\n\nInterpreti e personaggi:\nTotÃƒÂ² ( Dante Cruciani )\nVittorio Gassman( Peppe )\nMarcello Mastroianni( Tiberio,il fotografo )\nRenato Salvatori( Mario )\nCarla Gravina( Nicoletta )\nClaudia Cardinale( Carmelina )\nTiberio Murgia( Michele,detto Ferribotte )\nMemmo Carotenuto( Cosimo )\nRosanna Rory( Norma )\nCarlo Pisacane( Capannelle )\nGina Rovere( Teresa,moglie di Tiberio )\nGina Amendola( la &quot;mamma&quot; di Mario )\nLella Fabrizi( Ada )\nElvira Tonelli( Assunta )\nMario Feliciani( il commissario )\nMimmo Poli( un carcerato )\nMario De Simone( il ricettatore )\nNino Marchetti( l'impiegato del banco dei pegni )\nAldo Trifiletti( Fernando,il portiere )\n\nAltri interpreti :\nPasquale Misiano, Gustavo Serena, Ida Masetti,\nAmerigo Santarelli, Edith Bruck, Lisa Romey,\nRoberto Spiombi, Franco Carli \n\nTRAMA\nCinque ladruncoli della periferia romana pianificano un colpo ai danni di una agenzia del Monte dei pegni. Inesperti, si rivolgono a Dante Cruciani (TotÃƒÂ²), un criminale incallito in libertÃƒÂ  vigilata, che li istruisce nell'arte dello scassinare le casseforti. La preparazione del colpo va avanti tra diverse peripezie e ripensamenti sino alla sua conclusione comica e fallimentare\n\nRECENSIONE\nfonte:  Visit this link: http://trovacinema.repubblica.it/film/i-soliti-ignoti/118608\nUno dei pilastri della nascente commedia italiana: la sua eccezionale riuscita nasce da una scelta azzeccata degli interpreti (con la scoperta di V. Gassman comico, gli esordi di C. Cardinale e T. Murgia, un mirabile intervento di TotÃƒÂ²) e una sceneggiatura perfetta (Age, Scarpelli, Suso Cecchi d'Amico), senza contare il bianconero di G. Di Venanzo e le musiche di P. Umiliani. ÃƒË† il primo film comico italiano dove compare la morte, con personaggi invece di macchiette, una comicitÃƒÂ  venata di dramma e il tema dell'amicizia virile, raro nella cultura e nello spettacolo italiano. Vela d'oro al Festival di Locarno, 2 Nastri d'argento (sceneggiatura, Gassman), nomination all'Oscar, grande successo di pubblico. Seguito da &quot;Audace colpo dei soliti ignoti&quot;.\n\nCURIOSITA'\nfonte:  Visit this link: http://it.wikipedia.org/wiki/I_soliti_ignoti\nCon questa pellicola del regista toscano si usa generalmente sancire l'esordio ufficiale di un nuovo genere cinematografico che solo successivamente verrÃƒÂ  definito come commedia all'italiana e che con il neorealismo, il peplum (i &quot;sandaloni&quot; come dicevano a CinecittÃƒÂ ) e lo spaghetti-western rappresenterÃƒÂ  uno dei generi piÃƒÂ¹ prolifici del cinema italiano del dopoguerra, e certamente uno dei piÃƒÂ¹ importanti dal punto di vista artistico.\nCon I soliti ignoti nasce in Italia un nuovo tipo di commedia comica che abbandona i canoni praticati nel cinema sino a quel momento, che risalivano sostanzialmente alla florida tradizione dell'avanspettacolo, del varietÃƒÂ  o del CafÃƒÂ¨ Chantant, e che ereditando il testimone del neorealismo si apre alla quotidianitÃƒÂ , alla realtÃƒÂ  e innesta i suoi caratteri su precisi riferimenti sociali, chiari al pubblico che li vive spesso in prima persona.\nI comici de I soliti ignoti cessano per la prima volta di essere delle marionette, delle maschere che giocano la comicitÃƒÂ  esclusivamente in chiave di gag, giochi di parole, gesti buffi o nonsense, e articolano i dialoghi e le trovate umoristiche su prove definite, a volte anche macchiettistiche e caricaturali, ma riferite sempre ad una sceneggiatura chiara.\nMolti critici vedono nel personaggio di Dante Cruciani, interpretato da TotÃƒÂ², sulla famosa terrazza del film, un ipotetico passaggio di consegna della comicitÃƒÂ : dalle mani del geniale attore napoletano, principe della risata e dell'improvvisazione, a quelle di un gruppo agguerrito di sapienti sceneggiatori (Sergio Amidei, Rodolfo Sonego, Age e Scarpelli, Ettore Scola, Ruggero Maccari), che la utilizzeranno per raccontare la realtÃƒÂ  in un momento di passaggio importante per la storia nazionale, ricco di contraddizioni, di incompatibilitÃƒÂ  tra vecchio e nuovo, di identitÃƒÂ  fallaci e passeggere, costruite spesso su condizionamenti sociali e culturali provenienti da oltreoceano o da oltralpe.\nL'ideazione de I soliti ignoti nasce in chiave caricaturale. Come lo stesso Monicelli ammette, si voleva in principio parodiare un certo genere di film noir francese o di gangster americano, particolarmente in voga nelle sale cinematografiche italiane di quegli anni, e apprezzato dal pubblico che frequentava le terze visioni. Il riferimento ÃƒÂ¨ senz'altro a Rififi di Jules Dassin del 1955, dove una banda di quattro criminali professionisti progetta un colpo perfetto che si rivelerÃƒÂ  un fallimento. A riprova di ciÃƒÂ² lo stesso regista ci informa che uno dei titoli provvisori del film, in fase di produzione, doveva essere Rifufu, una evidente storpiatura del titolo francese.\nMa sarebbe un grave errore credere che I soliti ignoti esaurisca i suoi contenuti nella parodia di un genere. Il film si arricchisce di novitÃƒÂ  importanti e di contesti originali nel corso della sua produzione, tanto da lasciare in secondo piano la sua genesi parodistica. ÃƒË† di nuovo lo stesso regista che ci informa come il film fosse stato concepito anche in chiave drammatica e fortemente tragica.\nI soliti ignoti, come afferma Carlo Lizzani, porta il comico fuori dei confini consueti della farsa, e acquisisce una propria consistenza cinematografica. Per la prima volta in un film comico italiano si assiste alla morte tragica di uno dei protagonisti (Carlo Lizzani, &quot;Il cinema italiano&quot;, Parenti, 1961). La morte o comunque il fallimento di un'impresa ÃƒÂ¨ una tematica fondamentale nella cinematografia di Monicelli. Il regista la spiega con le radici stesse della commedia. La storia della commedia, della commedia dell'arte, ÃƒÂ¨ popolata dalla morte, da presenze sinistre e maligne, da fallimenti di imprese maldestre, da miserabili morti di fame che nella imitazione di Arlecchino e Pulcinella, si arrabattano tutto il giorno in cerca di un espediente definitivo, di una trovata finale. Il cinema di Monicelli rispecchia in pieno questa vena tragica della nostra commedia, e si inserisce nel solco della sua tradizione.\nMa non ÃƒÂ¨ solo questo elemento tradizionale-narrativo che si esaurisce la vena drammatica della pellicola. ÃƒË† la Roma che viene descritta, quella dei quartieri popolari, dei grandi &quot;casermoni&quot; della periferia degradata, la Roma del sotto-proletariato urbano estraneo ai processi economici del boom, che fa da sfondo tragico alle gesta della miserabile banda del buco rappresentata dai vari Pantera, Capannelle, Tiberio, Ferribotte. ÃƒË† la stessa Roma che descrive Pier Paolo Pasolini in Ragazzi di vita, intesa anche in senso topografico. ÃƒË† significativo a riguardo il dialogo breve che Capannelle sostiene con un ragazzino incontrato per caso e al quale si rivolge per chiedere informazioni su un certo Mario. Il dialogo potrebbe avere perfettamente luogo in una delle pagine del romanzo pasoliniano.\nLa fotografia fu particolarmente curata da questo ultimo punto di vista. Le immagini dovevano restituire l'idea di una Roma drammatica, per cui furono evitati volutamente i toni eccessivamente luminosi, si preferirono i contrasti e i tagli decisi e nei costumi si evitarono le concessioni al vezzo e alla comoditÃƒÂ , curando invece quello che doveva fornire l'estemporaneitÃƒÂ  di un abbigliamento dettato solo dallo stato di indigenza (vedansi i pantaloni da cavallerizzo che Capannelle indossa per tutto il film).\nIl film per la sua novitÃƒÂ  non fu accolto favorevolmente dalla critica ufficiale, che aveva ben chiari i riferimenti. Da principio non fu apprezzata la scelta di sostituire i comici d'arte con degli attori seri giÃƒÂ  affermati in contesti drammatici (Vittorio Gassman); TotÃƒÂ², notoriamente non amato dalla critica colta ma fortemente caldeggiato dai produttori, fu giudicato eccessivo nonostante la sua interpretazione limitata. In sostanza, l'ambiente ufficiale non era pronto ad accogliere quella che si rivelerÃƒÂ  la trovata ad effetto del film, la trasformazione di attori seri in &quot;caratteri&quot; della commedia, dotati di una grande vis comica. La scena del set comico, nella opinione dei critici piÃƒÂ¹ severi, avrebbe dovuto somigliare ancora al palcoscenico di un varietÃƒÂ  dove i maestri solitari, coadiuvati da abili spalle, si avvicendavano nell'intrattenimento del pubblico.\nGli stessi produttori contrastarono a lungo la scelta di Vittorio Gassman (La produzione pensÃƒÂ² ad Alberto Sordi). La sua aria intellettuale e soprattutto il suo repertorio teatrale drammatico unito ai ruoli &quot;cattivi&quot; che aveva interpretato in precedenza non davano nessuna garanzia di successo. Ma regista e sceneggiatori seppero resistere alle richieste dei produttori. Avevano modellato tutti i personaggi intorno ad un baricentro realistico e li avevano poi corredati di un patrimonio farsesco sul quale si sarebbe dovuta giocare tutta la comicitÃƒÂ . Per il &quot;Pantera&quot; si ricorse ad un trucco pesantissimo che abbassÃƒÂ² l'attaccatura dei capelli, ridusse la fronte spaziosa accentuando il naso e rendendo cadenti le labbra in quell'aria da ebete caratteristica di un pugile suonato di periferia. Fu studiata l'andatura e infine concepita la balbuzie, con effetti comici esilaranti.\nAl di lÃƒÂ  delle caratterizzazioni dei personaggi ÃƒÂ¨ importante definire quello che sarÃƒÂ  un tema importante e ricorrente del genere, una costante che seppur trasformata rimarrÃƒÂ  centrale nel corso della storia decennale della commedia all'italiana, dal suo nascere, alla fine degli anni cinquanta, sino al suo tramonto, alle metÃƒÂ  degli anni settanta: la rappresentazione del sistema sociale attraverso le classi e la critica dura alla societÃƒÂ  del benessere, colta nei suoi scompensi e nelle sue contraddizioni.\nI soliti ignoti da questo punto di vista ÃƒÂ¨ un grande mosaico storico che ci restituisce con leggerezza l'immagine complessa di un' epoca. Un mondo di povertÃƒÂ  urbana che resiste nei suoi valori tradizionali all'attacco della nuova societÃƒÂ  di massa della quale perÃƒÂ² sente un'attrazione sempre piÃƒÂ¹ forte. SocietÃƒÂ  che viene nel film rappresentata esclusivamente dai miti di importazione americana: facile benessere economico, liberalizzazione dei costumi sessuali, comfort abitativi. La connotazione farsesca nasce sul modo di rapportarsi che i protagonisti hanno con questa doppia identitÃƒÂ , divisi tra tradizione e innovazione. I valori tradizionali di riferimento rimangono sempre benevoli ed evidenti sullo sfondo della vicenda e sono rappresentati via via da quasi tutti i personaggi: da Carmelina Claudia Cardinale (la sicurezza del vero legame affettivo), dalla dolcissima Nicoletta Carla Gravina (l'innocenza) e dallo stesso Cruciani TotÃƒÂ² (la saggezza della vecchiaia). Il gruppo rimane titubante per tutta la durata del film, nessuno riesce con convinzione ad abbracciare quello spirito nuovo che viene riflesso dalla societÃƒÂ  del benessere, nemmeno il protagonista, &quot;Er Pantera&quot;, che solitario in una opera di autoconvincimento continua a ripetere: &quot;ÃƒË† sc-sc-scientifico!&quot;, quindi moderno, quindi giusto, legale, morale.\n\nCARATTERISTICHE DEL DVD\nDurata: 102 min.\nLingue: Italiano\nFormato Video: 1,33:1 4/3\nFormato Audio: Mono 1.0\nMenÃƒÂ¹: si\nContenuti extra: Seleziona scene\nCompressione: no\n\nVisit","torrent":{"xt":"urn:btih:fe45b8181528b063ea502a7bec9b4056dfecec6b","amp;dn":"I+soliti+ignoti%2C+%5BDVD9+-+Ita%5D+Commedia+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe45b8181528b063ea502a7bec9b4056dfecec6b","infoHashBuffer":{"type":"Buffer","data":[254,69,184,24,21,40,176,99,234,80,42,123,236,155,64,86,223,236,236,107]},"announce":[],"urlList":[]}}