{"title":"(PSX-PSP) Resident Evil: Survivor converted properly [ResourceRG","uid":5046438,"size":208208033,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:fece5bc92c09cc3b0aa60e419c4397e178ed9380&amp;dn=%28PSX-PSP%29+Resident+Evil%3A+Survivor+converted+properly+%5BResourceRG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"toxicjuggalo","files":2,"time":1249661401,"description":"You MUST use 3.40 pops for this game to run\n\nRESIDENT EVIL - SURVIVOR:\n\nRESIDENT EVIL: Survivor starts with the horrific crash of your helicopter. You don't remember anything, and the gun in your hand is all you have in your possession. You soon discover that the small town in which you crashed has become the latest lab in the Umbrella Corporation's experiments with the dreaded T-Virus. Can you figure out what Umbrella is up to and get out of town alive? Choose one of three alternate paths before you, but beware: not all paths lead to safety, and the story branches and changes as you progress through the game. Any path chosen is going to require strong puzzle-solving skills and lots of exploration. Getting out of town safely will keep a RESIDENT EVIL fan busy for days. So lock the doors, check under the bed, and get ready for RESIDENT EVIL: Survivor.\n\n\n\nHave you been looking for that classic PSX game but just can't seem to find it anywhere? How about those &quot;rare&quot; titles that were only released in certain regions? Better yet, would you like to be able to have those games playable on your PSP so you can play them anywhere you want? Want to get those conversions directly from the source instead of through &quot;unsafe&quot; torrent browsers? Come and request them at\n\n                         www.reputation-resource.com","torrent":{"xt":"urn:btih:fece5bc92c09cc3b0aa60e419c4397e178ed9380","amp;dn":"%28PSX-PSP%29+Resident+Evil%3A+Survivor+converted+properly+%5BResourceRG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fece5bc92c09cc3b0aa60e419c4397e178ed9380","infoHashBuffer":{"type":"Buffer","data":[254,206,91,201,44,9,204,59,10,166,14,65,156,67,151,225,120,237,147,128]},"announce":[],"urlList":[]}}