{"title":"Frank Zappa - Civilization Phaze III","uid":10052743,"size":109472997,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:feee662a96365c30e4ec2bbdf325dcb87c6b67d2&amp;dn=Frank+Zappa+-+Civilization+Phaze+III&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"DeadMusic","files":-1,"time":1398626893,"description":"Civilization Phaze III was the first posthumous album of Frank Zappa, released in 1995. It is very much related to his earlier albums, We're Only in it for the Money, Lumpy Gravy, and Uncle Meat but also serves as the logical conclusion of his later, more serious-minded orchestral work. Meaning this album is both an early 1968 musique concrete and sound collage experiment while also being the work of a lifelong composer. The juxtaposition is unsettling. Hearing the dense cacophony of the notes following the inane ramblings about the pigs' music and how dense the smoke molecules are is one of the more absurd scenes in Zappa's already bizarre repertoire. \n\nNote: These files are taken and modified from a FLAC format. They are mp3s, I just want to mention I converted the files for this torrent because FLAC is yet a niche file type. The FLAC-based album is also the site. \n\nAlso, using the shuffle feature in a music player and playing songs from this album, We're Only in it for the Money, and Lumpy Gravy, is an interesting way to pass some time. ","torrent":{"xt":"urn:btih:feee662a96365c30e4ec2bbdf325dcb87c6b67d2","amp;dn":"Frank+Zappa+-+Civilization+Phaze+III","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"feee662a96365c30e4ec2bbdf325dcb87c6b67d2","infoHashBuffer":{"type":"Buffer","data":[254,238,102,42,150,54,92,48,228,236,43,189,243,37,220,184,124,107,103,210]},"announce":[],"urlList":[]}}