{"title":"THE DARKNESS (Complete) 001-110 (1994 20XX) Up to date Jan. 2013","uid":8109422,"size":1787832468,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ffba7e1475db76cc9e50d933c5c87a3cff0db081&amp;dn=THE+DARKNESS+%28Complete%29+001-110+%281994+20XX%29+Up+to+date+Jan.+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"STFmaryville","files":-1,"time":1360157485,"description":"It has been just over 16 years since The Darkness -- a character that debuted in Witchblade #10 -- became a monthly series from Top Cow Productions and Image Comics, featuring the all-star creative team of writer Garth Ennis and artists Marc Silvestri and Batt. Their work on the opening storyline &quot;Coming of Age&quot; set the tone for the title.\n\nFrom Wikipedia:\n\nThe Darkness is the story of Mafia hitman Jackie Estacado who, on his 21st birthday, became the bearer of the Darkness, an ancient elemental force of nearly limitless power that allows those who wield it access to an otherworldly dimension and control over the demons who dwell there ...\n\n------\n\nThis torrent updates the torrent &quot;The Darkness (Complete)&quot; from October 2011, posted here on TPB by my friend GunningHawk90, and originally by the uploader Rickradchak. All credit must go to the original scanners!\n\nI have chosen to include here the core monthly series, #001-110. (Although it has sometimes been published much more infrequently -- I'm lookin' at you, Dale Keown!!)\n\nYou may already know that Top Cow re-numbered The Darkness -- starting again with #1 -- twice, only to revert to the original numbering in 2009. I chose to organize all issues as one series, but the file names also reflect the alternate numbering.\n\nIn a follow-up torrent (coming soon), I will post all the crossovers, miniseries and one-shot specials that I've compiled from GunningHawk90's torrent and others. Please seed them both and enjoy! Share with our friends here at TPB whenever you can.  --STFmaryville\n","torrent":{"xt":"urn:btih:ffba7e1475db76cc9e50d933c5c87a3cff0db081","amp;dn":"THE+DARKNESS+%28Complete%29+001-110+%281994+20XX%29+Up+to+date+Jan.+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffba7e1475db76cc9e50d933c5c87a3cff0db081","infoHashBuffer":{"type":"Buffer","data":[255,186,126,20,117,219,118,204,158,80,217,51,197,200,122,60,255,13,176,129]},"announce":[],"urlList":[]}}