{"title":"Railworks TS2016 DTG South Wales Coastal Route Add-On","uid":14288471,"size":1162776630,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ffc382fb1cce5f91135194dbf2c95c7b3cc7080d&amp;dn=Railworks+TS2016+DTG+South+Wales+Coastal+Route+Add-On&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TS2015","files":1,"time":1460417329,"description":"Directly connecting England and Wales, running underneath the longest river in the United Kingdom, the South Wales Main Line is one of the most important cross border routes in the country, as featured in the beautiful new South Wales Coastal route for Train Simulator. \r\n\r\nThe South Wales Main Line branches off from the Great Western Main Line to allow a direct connection between London and the South of Wales. The line was opened in two stages - the first exclusively in Wales, running from Swansea to Chepstow in 1850; the second section was in England, branching off from Royal Wootton Bassett towards Patchway in 1903. \r\n\r\nCrossing the River Severn was always an engineering challenge, with trains initially heading north from Swindon to traverse into Wales, joining the South Wales Main Line at Chepstow. Construction of the four-mile Severn Tunnel began in 1873, and by 1886 it became the fastest route between the two countries, making the ‘Great Way Round’ only a backup way of crossing the Severn, for example when the tunnel was closed. \r\n\r\nWith the Welsh coal mines running at their peak, the line became an important trunk for freight traffic, which is still the case today. Connection to various docks on both sides of the Severn meant there were always heavy coal trains running to Portishead Docks from around the south of Wales. The SWML is also credited with a major role in the expansion of Fishguard Docks, the Great Western Railway’s main connection to the USA. \r\n\r\nToday, the line is operated by Arriva Trains Wales and also sees First Great Western services originating from London Paddington into Cardiff, and beyond. Freight remains a key part of the route, be it imported coal or steel works movements. The line is also one of the last major inter-city routes in Great Britain to remain un-electrified, although there are plans to electrify the line by 2018 to allow the new Hitachi Super Express Electro-Diesel and Electric Multiple Units (Class 800 and 801) to replace ageing HST units on London to Cardiff services. \r\n\r\nThe South Wales Coastal – Bristol to Cardiff route for Train Simulator recreates the 39 mile section of main line from Bristol Temple Meads and Bristol Parkway to Cardiff Central, via the Severn Tunnel. Also included are a number of locomotives and freight wagons to replicate services on the line as seen today, including the Arriva Trains Wales Class 175 ‘Coradia’ DMU, Freightliner Class 70 and Great Western Railways Class 43 HST.\r\n\r\n\r\nTHIS ADDON WILL NOT WORK ON LEGIT TRAIN SIMUALTOR 2016!!!","torrent":{"xt":"urn:btih:ffc382fb1cce5f91135194dbf2c95c7b3cc7080d","amp;dn":"Railworks+TS2016+DTG+South+Wales+Coastal+Route+Add-On","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffc382fb1cce5f91135194dbf2c95c7b3cc7080d","infoHashBuffer":{"type":"Buffer","data":[255,195,130,251,28,206,95,145,19,81,148,219,242,201,92,123,60,199,8,13]},"announce":[],"urlList":[]}}