{"title":"Arnaud Desplechin - Kings and Queen (2004) - Freakyflicks","uid":4317009,"size":1358486840,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ffd2c059c4dc3d8f99b9e5bf1772f9bc6f501523&amp;dn=Arnaud+Desplechin+-+Kings+and+Queen+%282004%29+-+Freakyflicks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clownmonkey","files":4,"time":1217149926,"description":"AKA &quot;Rois et reine&quot; (2004)\nhttp://www.imdb.com/title/tt0344273/\n\n\n\nFor screenshots, please visit the NEW RELEASES thread in the Freakyflicks forum.\n\n\n\nFrom the Village Voice:\nRich and strange, Arnaud Desplechin's Kings and Queen is a movie of large gestures and outsize performances. This extravagant family melodrama, one of the highlights of last year's New York Film Festival, runs two and a half hours and never lags, so moment-to-moment enthralling are Desplechin's narrative gambits, as well as his reckless eccentricity.\n\nAt 44, Desplechin has established himself as the least predictable, most interesting of younger French directors?and certainly the most film-intoxicated. His movies are remarkably generous; his interviews give evidence of considerable enthusiasm, for the process even more than the history of cinema: &quot;I love to make films like roller coasters,&quot; he told Cineaste, explaining that while shooting Kings and Queen he nailed a Truffaut maxim to the wall: Every minute, four ideas.\n\nOn one hand, Desplechin is a devoted director of actors and even, as demonstrated by his last two features, the daringly preposterous Esther Kahn and jittery Playing &quot;In the Company of Men,&quot; something of a performance theorist. No less than those of John Cassavetes or Mike Leigh, Desplechin's movies are all about actors. But he's also a montage-mad experimentalist who cannot help but cubistically de- and reconstruct their performances once he gets the material back in his lab.\n\nKings and Queen does not lack for conventional histrionics. As a single mother lumbered by a complicated past, as well as her weathered stick of a father (Maurice Garrel), Emmanuelle Devos gets to express every emotion; her all-out performance in the role of Nora does everything but upstage co-star Mathieu Amalric's manic turn as her flamboyant ex-husband Isma (Both are veterans of Desplechin's 1992 first feature, La Sentinelle, and his 1996 breakthrough My Sex Life . . . or How I Got Into an Argument.) Cast as a prodigy of determination, Devos can shape (or perhaps will) her doughy features into a sort of incandescent beauty. She's a wonderful actress and, because this is a Desplechin film, she plays a character who is also &quot;acting.&quot;\n\nAs befits a soap opera, fully half of Kings and Queen takes place in the hospital. Just as Nora learns that her father is suffering from advanced cancer, two men in white coats arrive at Isma door. (His sister, even nuttier, has agreed to have him committed, apparently because on his last manic jag he lavished her with Christmas presents, in July.) Isma's capture is total slapstick. Desplechin stages mental illness for comedy?or rather, excessive theatricality. There's plenty of drinking and drug-doing at the hospital, as well as entertainment?as when Isma performs the moonwalk for the other denizens of the dayroom.\n\nNothing is straightforward. Narrative is akin to conspiracy?and not just because Nora turns out to be a not altogether reliable narrator. One of the odder aspects of this madcap ensemble piece is the mysterious smiles with which the actors regard each other, most disconcertingly Nora's wide-eyed first husband and the waif-like inmate (Magali Woch) Isma befriends in the mental hospital when he's not kibitzing with his lawyer (Hippolyte Girardot), the most substance-abusing counselor since Benicio Del Toro stole Fear and Loathing in Las Vegas. This puppet-show effect packs the movie with sacred monsters, not the least of whom is Catherine Deneuve's regally hyper-sensitive and disapproving hospital shrink.\n\nKings and Queen is also filled with free-floating symbols. The names &quot;Nora&quot; and &quot;Isma&quot; come with ready-made literary associations. The Greek myth of Leda and the Swan is strategically referenced?perhaps to elevate the drama; perhaps to suggest an unhealthy relationship between Nora and her father; perhaps, as this divine rape resulted in the birth of the beautiful Helen, to provide a never explained backstory for the emotional Trojan War waged between the impossibly poised Nora and the four men in her life: one old, one young, one living, and one dead. (Devos has described Nora as &quot;monstrous and grandiose like Antigone.&quot;)\n\nFor much of the movie, plot is trumped by texture. Desplechin typically cuts from one chaotic scene to another. Highly original in his flashbacks and dream sequences, he organizes almost free-associational mood shifts and uses musicMark Fiore Corporation for Politicized Broadcasting: Tune In, Turn On, Turn Rightranging from Mancini's &quot;Moon River&quot; (Nora's theme) to mad klezmer tootling?to keep things off balance. The unstable continuity is further fissured by vÃƒÂ©ritÃƒÂ© jump cuts, swish pans, and unmotivated repetitions. Relationships are only gradually revealed; things are always more complicated than they initially seemed. The narrative takes a few hairpin turns, sometimes on two wheels. Kings and Queen's second half, titled &quot;Cruel Releases,&quot; shuttles back and forth between Isma madhouse and Nora's death watch, providing a series of terrible confrontations and revelations?one of which spins the whole crazy whirli-gig in an entirely unexpected direction.\n\nIsma is fond of the word impedi menta ?meaning the psychological baggage that keeps people from functioning as they would wish?but Desplechin appears to thrive on the structures that impede narrative progress. Kings and Queen just picks up the baggage and runs?it's terrific filmmaking. - J. HOBERMAN\n\nIn French with English hardsubs.\nMy rip.\n\n--- File Information ---                                                        \nFile Size (in bytes):                           1,358,483,456                     \n                                                                                \n--- Container Information ---                                                   \nBase Type (e.g &quot;AVI&quot;):                          AVI(.AVI)                 \nSubtype (e.g &quot;OpenDML&quot;):                        OpenDML (AVI v2.0),                   \nInterleave (in ms):                             42          \nPreload (in ms):                                504       \nAudio alignment(&quot;split across interleaves&quot;):    Aligned         \nTotal System Bitrate (kbps):                    0            \nBytes Missing (if any):                         0            \nNumber of Audio Streams:                        1       \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Type(e.g. &quot;DIV3&quot;):                  xvid      \nDuration (hh:mm:ss):                            02:32:39                \nFrame Count:                                    219605             \nFrame Width (pixels):                           720                  \nFrame Height (pixels):                          320                  \nFrame Aspect Ratio (e.g &quot;1.3333&quot;):                        \nFrame Aspect Ratio (e.g. &quot;4:3&quot;):                             \nPixel Aspect Ratio (&quot;SAR&quot;):                                          \nDisplay Aspect Ratio (&quot;DAR&quot;):                   2.250                     \nFrames Per Second:                             23.96           \nVideo Bitrate (kbps):                           1072                 \nMPEG-4 (&quot;MPEG-4&quot; or &quot;&quot;):                        MPEG-4                   \nB-VOP (&quot;B-VOP&quot; or &quot;&quot;):                          B-VOP           \n                                                                                \n--- Audio Information ---          \nAudio Codec (e.g. &quot;AC3&quot;):                       0x0055(MP3, ISO) MPEG-1 Layer 3                   \nAudio Sample Rate (Hz):                         48000             \nAudio Bitrate(kbps):                            106                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):            VBR            \nAudio Channel Count (e.g. &quot;2&quot; for stereo):      2           \n*********************************** FREAKYFLICKS ************************************\n\nFreakyFlicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n   &lt;a href=&quot; http://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com/&lt;/a&gt;\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:ffd2c059c4dc3d8f99b9e5bf1772f9bc6f501523","amp;dn":"Arnaud+Desplechin+-+Kings+and+Queen+%282004%29+-+Freakyflicks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffd2c059c4dc3d8f99b9e5bf1772f9bc6f501523","infoHashBuffer":{"type":"Buffer","data":[255,210,192,89,196,220,61,143,153,185,229,191,23,114,249,188,111,80,21,35]},"announce":[],"urlList":[]}}